Repository: GDQuest/learn-gdscript
Catalog: i18n/*/application.po
Languages: cs, da, de, es, fr, it, ja, pt, ru, ta, tr, uk

source: If you face an issue in the app, please click the link below to report it on GitHub: [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] On that page, you can report any issues, whether something's not working or there's an error in a lesson. You can generate a log to help us identify the problem. To do so, click here: [b][url=download]generate error log[/url][/b]. Please drag and drop the generated file onto your issue on GitHub to attach it. [font=res://ui/theme/fonts/font_title.tres]What's GitHub[/font] GitHub is an online platform to host and manage open-source projects like the GDScript Learn app. It helps developers organize their work and collaborate online. You can use GitHub to study the source code of many open projects, report issues, or even contribute code yourself. [font=res://ui/theme/fonts/font_title.tres]How to report an issue[/font] 1. Click the link above to get to the [i]GitHub Issues[/i] page. 2. Click on the [i]New Issue[/i] button. 3. Fill out the form to tell us more about your problem. You will need a GitHub account to do so. Please add as much relevant information as possible, such as the kind of device you're using to access the app, and maybe attach a screenshot or video clip showcasing the issue. [center]Thank you for contributing to open source![/center]
cs: Pokud v aplikaci narazíte na problém, klikněte na níže uvedený odkaz a nahlaste ho na GitHubu: [center] [b] [url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] Na této stránce můžete nahlásit jakékoli problémy, ať už něco nefunguje nebo je v lekci chyba. Můžete vygenerovat protokol, který nám pomůže identifikovat problém. Chcete-li tak učinit, klikněte sem: [b][url=download]generate error log[/url][/b]. Přetáhněte vygenerovaný soubor na problém na GitHubu a připojte ho. [font=res://ui/theme/fonts/font_title.tres] Co je GitHub[/font] GitHub je online platforma pro hostování a správu opensourcových projektů, jako je aplikace GDScript Learn. Pomáhá vývojářům organizovat jejich práci a spolupracovat online. GitHub můžete použít ke studiu zdrojového kódu mnoha otevřených projektů, hlášení problémů nebo dokonce k přispívání kódu sami. [font=res://ui/theme/fonts/font_title.tres] Jak nahlásit problém[/font] 1. Kliknutím na výše uvedený odkaz se dostanete na stránku [i]GitHub Issues[/i]. 2. Klikněte na tlačítko [i]New Issue[/i]. 3. Vyplňte formulář a řekněte nám více o vašem problému. K tomu budete potřebovat účet GitHub. Přidejte co nejvíce relevantních informací, například typ zařízení, které používáte pro přístup k aplikaci, a možná připojte snímek obrazovky nebo videoklip představující problém. [center] Děkujeme, že jste přispěli k open source! [/center]
de: Wenn Du ein Problem in der App hast, klicke bitte auf den folgenden Link, um es auf GitHub zu melden: [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] Auf dieser Seite kannst du alle Probleme melden, unabhängig davon, ob etwas nicht funktioniert oder ein Fehler in einer Lektion vorliegt. Du kannst ein Protokoll generieren, um das Problem zu identifizieren. Klicke dazu hier: [b][url=download]fehlerprotokoll generieren[/url][/b]. Bitte ziehe dazu die generierte Datei per Drag & Drop auf dein Problem auf GitHub, um sie anzuhängen. [font=res://ui/theme/fonts/font_title.tres] Was ist GitHub[/font] GitHub ist eine Online-Plattform zum Hosten und Verwalten von Open-Source-Projekten wie der GDScript Learn-App. Es hilft Entwicklern, ihre Arbeit zu organisieren und online zusammenzuarbeiten. Du kannstGitHub verwenden, um den Quellcode vieler offener Projekte zu studieren, Probleme zu melden oder sogar selbst Code beizutragen. [font=res://ui/theme/fonts/font_title.tres] So meldest Du ein Problem[/font] 1. Klicke auf den obigen Link, um zur Seite [i]GitHub Issues[/i] zu gelangen. 2. Klicke auf die Schaltfläche [i]New Issue[/i]. 3. Fülle das Formular aus, um uns mehr über Dein Problem zu erzählen. Dazu benötigst Du ein GitHub-Konto. Bitte füge so viele relevante Informationen wie möglich hinzu, z. B. die Art des Geräts, mit dem Du auf die App zugreifst, und hänge wenn möglich einen Screenshot oder Videoclip an, der das Problem zeigt. [center] Vielen Dank, dass Du zu Open Source beiträgst! [/center]
es: Si te encuentras con algún problema en la aplicación, haz clic en el siguiente enlace para reportarlo en GitHub: [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/b][/center] En esa página puedes informarnos de cualquier problema, ya sea que algo no funcione o que haya un error en una lección. Puedes generar un registro para ayudarnos a identificar el problema. Para hacerlo, haz clic aquí: [b][url=download]Generar registro de errores[/b]. Por favor, arrastra y suelta el archivo generado en tu problema en GitHub para adjuntarlo. [font=res://ui/theme/fonts/font_title.tres]Qué es GitHub[/font] GitHub es una plataforma en línea para alojar y gestionar proyectos de código abierto como la aplicación GDScript Learn. Ayuda a los desarrolladores a organizar su trabajo y a colaborar en línea. Puedes utilizar GitHub para estudiar el código fuente de muchos proyectos abiertos, reportar problemas o incluso contribuir tú mismo con el código. [font=res://ui/theme/fonts/font_title.tres]Cómo informar de un problema[/font] 1. Haz clic en el enlace anterior para acceder a la página de [i]GitHub Issues[/i]. 2. Haz clic en el botón [i]New Issue[/i]. 3. Completa el formulario para contarnos más sobre tu problema. Necesitarás una cuenta de GitHub para hacerlo. Por favor, agrega toda la información relevante que sea posible, como el tipo de dispositivo que estás utilizando para acceder a la aplicación, y tal vez adjunta una captura de pantalla o un video que muestre el problema. [center]¡Gracias por contribuir al código abierto![/center]
fr: Si vous rencontrez un problème dans l'application, veuillez cliquer sur le lien ci-dessous pour le signaler sur GitHub : [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] Sur cette page, vous pouvez signaler tout problème, que ce soit un dysfonctionnement ou une erreur dans une leçon. Vous pouvez générer un journal pour nous aider à identifier le problème. Pour ce faire, cliquez ici : [b][url=download]générer un journal d'erreurs[/url][/b]. Veuillez glisser et déposer le fichier généré dans votre ticket sur GitHub pour le joindre. [font=res://ui/theme/fonts/font_title.tres]Qu'est-ce que GitHub ?[/font] GitHub est une plateforme en ligne permettant d'héberger et de gérer des projets à code ouvert comme l'application Apprendre GDScript. Elle aide les développeurs à organiser leur travail et à collaborer en ligne. Vous pouvez utiliser GitHub pour consulter le code source de nombreux projets open-source, signaler des problèmes ou même contribuer vous-même au code. [font=res://ui/theme/fonts/font_title.tres]Comment signaler un problème ?[/font] 1. Cliquez sur le lien ci-dessus pour accéder à la page [i]GitHub Issues[/i]. 2. Cliquez sur le bouton [i]New Issue[/i]. 3. Remplissez le formulaire pour nous en dire plus sur votre problème. Vous aurez besoin d'un compte GitHub. Veuillez ajouter autant d'informations pertinentes que possible, telles que le type d'appareil que vous utilisez pour accéder à l'application, et si possible joindre une capture d'écran ou un clip vidéo illustrant le problème. [center]Merci de contribuer à l'open source ![/center]
it: Se riscontri un problema nell'applicazione, per favore clicca il link qui sotto per segnalarlo su GitHub: [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues(Problemi)[/url][/b][/center] Su quella pagina, puoi segnalare ogni problema, se qualcosa non funziona o c'è un errore in una lezione. Puoi generare un log per aiutarci ad identificare il problema. Per fare ciò, clicca qui: [b][url=download]genera log errore[/url][/b]. Prendi e inserisci il file generato nel tuo issue su GitHub per allegarlo. [font=res://ui/theme/fonts/font_title.tres]Cos'è GitHub[/font] GitHub è una piattaforma online per mantenere e gestire progetti open-source come l'applicazione GDScript Learn. Aiuta gli sviluppatori ad organizzare il loro lavoro e per collaborare online. Puoi usare GitHub per studiare il codice sorgente di molti progetti pubblici, segnalare problemi, o anche contribuire codice. [font=res://ui/theme/fonts/font_title.tres]Come segnalare un problema[/font] 1. Clicca il collegamento di sopra per andare alla pagina di [i]GitHub Issues[/i] . 2. Clicca sul tasto [i]Nuovo Issue[/i]. 3. Compila il modulo per spiegarci il tuo problema. Necessiterai un account GitHub per farlo. Aggiungi quante più informazioni possibili, come il tipo di dispositivo con cui stai usando l'applicazione e magari anche allegare uno screenshot o una clip video per farci vedere il problema. [center]Grazie per contribuire ai progetti open source![/center]
ja: アプリで問題が発生した場合は、以下のリンクをクリックしてGitHubで報告してください。 [center] [b] [url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com> GDQuest> learn-gdscript> Issues[/url] [/b] [/center] そのページでは不具合またはレッスンでエラーが発生したかどうかにかかわらず問題を報告できます。 問題の特定に役立つログを生成できます。これを行うにはここをクリックしてください：[b][url=download]エラーログの生成[/url][/b]。 生成されたファイルをGitHubのIssueにドラッグアンドドロップして添付してください。 [font=res://ui/theme/fonts/font_title.tres]GitHubとは[/font] GitHubはGDScript Learn Appなどのオープンソースプロジェクトをホストおよび管理するためのオンラインプラットフォームです。これは、開発者が作業を整理しオンラインで共同作業するのに役立ちます。 GitHubを使用して多くのオープンプロジェクトのソースコードを調べたり、問題を報告したり自分でコードを提供したりすることができます。 [font=res://ui/theme/fonts/font_title.tres]問題を報告する方法[/ font] 1. 上のリンクをクリックして、[i]GitHubのIssues[/i]ページにアクセスします。 2. [i]New Issue[/i]ボタンをクリックします。 3. フォームに記入して問題について詳しく書いてください。 報告するにはGitHubアカウントが必要です。 アプリへのアクセスに使用しているデバイスの種類など、できるだけ多くの情報を追加してください。問題を紹介するスクリーンショットやビデオクリップを添付してください。 [center]オープンソースに貢献していただきありがとうございます！[/center]
ru: Если вы столкнулись с проблемой в приложении, нажмите на ссылку ниже, чтобы сообщить о ней на GitHub: [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] На этой странице вы можете сообщить о любых проблемах, если что-то не работает, либо есть ошибка в уроке. Вы можете сгенерировать журнал (log-файл), чтобы помочь нам определить проблему. Для этого нажмите здесь: [b][url=download]Создать журнал ошибок[/url][/b]. Перетащите сгенерированный журнал в свою проблему (issue) на GitHub, чтобы прикрепить его. [font=res://ui/theme/fonts/font_title.tres]Что такое GitHub[/font] GitHub — это онлайн-платформа для размещения и управления проектами с открытым исходным кодом, такими как приложение GDScript Learn. Она помогает разработчикам организовывать свою работу и сотрудничать онлайн. Вы можете использовать GitHub для изучения исходного кода многих открытых проектов, сообщать о проблемах или даже вносить правки в код самостоятельно. [font=res://ui/theme/fonts/font_title.tres]Как сообщить о проблеме[/font] 1. Нажмите на ссылку выше, чтобы перейти на страницу [i]GitHub Issues[/i]. 2. Нажмите кнопку [i]New Issue[/i]. 3. Заполните форму, чтобы рассказать нам больше о своей проблеме. Для этого вам понадобится учетная запись GitHub. Пожалуйста, добавьте к описанию проблемы как можно больше полезной информации, например, укажите тип устройства, которое вы используете для доступа к приложению, и, если возможно, прикрепите снимок экрана или видеоклип, демонстрирующий проблему. [center]Спасибо за ваше участие в улучшении проекта![/center]
ta: பயன்பாட்டில் நீங்கள் ஒரு சிக்கலை எதிர்கொண்டால், அதை கிட்அப்பில் புகாரளிக்க கீழே உள்ள இணைப்பைக் சொடுக்கு செய்க: . அந்தப் பக்கத்தில், ஏதேனும் வேலை செய்யவில்லையா அல்லது ஒரு பாடத்தில் பிழை இருக்கிறதா என்று நீங்கள் புகாரளிக்கலாம். சிக்கலை அடையாளம் காண எங்களுக்கு உதவ நீங்கள் ஒரு பதிவை உருவாக்கலாம். அவ்வாறு செய்ய, இங்கே சொடுக்கு செய்க: [b] [url = download] பிழை பதிவை உருவாக்கவும் [/url] [/b]. உருவாக்கப்பட்ட கோப்பை கிதுபில் உங்கள் பிரச்சினையில் இழுத்து விடுங்கள். . GTSCRIPT LEARN பயன்பாடு போன்ற திறந்த மூல திட்டங்களை புரவலன் செய்வதற்கும் நிர்வகிப்பதற்கும் அறிவிலிமையம் ஒரு நிகழ்நிலை தளமாகும். இது உருவாக்குபவர்கள் தங்கள் வேலையை ஒழுங்கமைக்கவும் ஆன்லைனில் ஒத்துழைக்கவும் உதவுகிறது. பல திறந்த திட்டங்களின் மூலக் குறியீட்டைப் படிக்க, சிக்கல்களைப் புகாரளிக்க அல்லது குறியீட்டை நீங்களே பங்களிக்க கிதுபைப் பயன்படுத்தலாம். . 1. [I] அறிவிலிமையம் சிக்கல்கள் [/i] பக்கத்தைப் பெற மேலே உள்ள இணைப்பைக் சொடுக்கு செய்க. 2. [i] புதிய சிக்கல் [/i] பொத்தானைக் சொடுக்கு செய்க. 3. உங்கள் பிரச்சினையைப் பற்றி மேலும் சொல்ல படிவத்தை நிரப்பவும். அவ்வாறு செய்ய உங்களுக்கு ஒரு அறிவிலிமையம் கணக்கு தேவைப்படும். பயன்பாட்டை அணுக நீங்கள் பயன்படுத்தும் சாதனம் போன்ற முடிந்தவரை பொருத்தமான தகவல்களைச் சேர்க்கவும், மேலும் திரை காட்சி அல்லது வீடியோ கிளிப்பை சிக்கலைக் காண்பிக்கும். [மையம்] திறந்த மூலத்திற்கு பங்களித்ததற்கு நன்றி! [/மையம்]
tr: Uygulamada bir sorunla karşılaşırsanız, lütfen GitHub üzerinden bildirmek için aşağıdaki bağlantıya tıklayın: [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] Bu sayfada, bir şeyin çalışmaması veya bir derste hatalar olması gibi her türlü sorunu bildirebilirsiniz. Sorunu tanımlamamıza yardımcı olmak için burada bir günlük kaydı oluşturabilirsiniz. Bunu yapmak için buraya tıklayın: [b][url=download]hata günlüğü oluştur[/url][/b]. Oluşturulan dosyayı eklemek için lütfen GitHub'taki sorun gönderisine sürükleyip bırakın. [font=res://ui/theme/fonts/font_title.tres]GitHub nedir?[/font] GitHub, GDScript Learn uygulaması gibi açık kaynaklı projeleri barındırmak ve yönetmek için kullanılan çevrimiçi bir platformdur. Geliştiricilerin çalışmalarını düzenlemelerine ve çevrimiçi iş birliği yapmalarına yardımcı olur. GitHub'ı birçok açık kaynaklı projenin kaynak kodlarını incelemek, sorunları bildirmek ve hatta koda kendiniz katkıda bulunmak için kullanabilirsiniz. [font=res://ui/theme/fonts/font_title.tres]Bir sorun nasıl bildirilir?[/font] 1. [i]GitHub Sorunları (issues)[/i] sayfasına gitmek için yukarıdaki bağlantıya tıklayın. 2. [i]Yeni Sorun (new issue)[/i] düğmesine tıklayın. 3. Bize sorununuz hakkında daha fazla bilgi vermek için formu doldurun. Bunu yapmak için bir GitHub hesabına ihtiyacınız olacak. Eğer yoksa, ücretsiz bir GitHub hesabı oluşturabilirsiniz. Lütfen uygulamaya erişmek için kullandığınız cihazın türü gibi mümkün olduğunca çok ilgili bilgiyi ekleyin ve mümkünse sorunu gösteren bir ekran görüntüsü veya video klip ekleyin. [center]Açık kaynağa katkıda bulunduğunuz için teşekkür ederiz![/center]
uk: Якщо ви зіткнулися з проблемою в застосунку, натисніть посилання нижче, щоб повідомити про неї на GitHub: [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] На цій сторінці ви можете повідомити про будь-які проблеми, якщо щось не працює, або є помилка в уроці. Ви можете згенерувати звіт (log-файл), щоб допомогти нам визначити проблему. Для цього натисніть тут: [b][url=download]Створити звіт про помилку[/url][/b]. Перетягніть згенерований звіт у свою проблему (issue) на GitHub, щоб прикріпити його. [font=res://ui/theme/fonts/font_title.tres]Що таке GitHub[/font] GitHub — це онлайнова платформа для розміщення й керування проєктами з відкритим сирцевим кодом, таким як застосунок GDScript Learn. Вона дає змогу розробникам організовувати свою роботу та співпрацювати онлайн. Вы можете використовувати GitHub для вивчення сирцевого коду багатьох відкритих проєктів, повідомляти про проблеми або навіть самостійно вносити виправлення до коду. [font=res://ui/theme/fonts/font_title.tres]Як повідомити про проблему[/font] 1. Натисніть посилання вище, щоб перейти на сторінку [i]GitHub Issues[/i]. 2. Натисніть кнопку [i]New Issue[/i]. 3. Заповніть форму, щоб розповісти нам більше про свою проблему. Для цього вам знадобиться обліковий запис GitHub. Будь ласка, додайте до опису проблеми якомога більше корисної інформації, наприклад, зазначте тип пристрою, який ви використовуєте для доступу до програми, і, якщо можливо, прикріпіть знімок екрану або відеокліп, що демонструє проблему. [center]Дякуємо за участь у покращенні проєкту![/center]

source: OK
ta: சரி
tr: TAMAM
uk: Гаразд

source: At GDQuest, we’re educators at heart. We believe in applied study and we believe it doesn’t have to be boring. When teaching is done correctly, most people highly enjoy the sensation of leveling up! That’s the reason we made this app. It is in fact part of our beginner course [b][color=#ebc3ff][url=https://school.gdquest.com/products/bundle_learn_gamedev_godot_4]Learn Gamedev From Zero with Godot[/url][/color][/b].
cs: Ve společnosti GDQuest jsme srdcem pedagogové. Věříme v aplikované studium a věříme, že nemusí být nudné. Když je výuka prováděna správně, většina lidí si pocit zvyšování úrovně velmi užívá! To je důvod, proč jsme vytvořili tuto aplikaci. Ve skutečnosti je součástí našeho kurzu pro začátečníky [b][color=#ebc3ff][url=https://school.gdquest.com/products/bundle_learn_gamedev_godot_4]Naučte se Gamedev od nuly s Godotem[/url][/color][/b].
es: En GDQuest somos educadores de corazón. Creemos en el estudio aplicado y creemos que no tiene por qué ser aburrido. Cuando la enseñanza se hace correctamente, ¡la mayoría de la gente disfruta enormemente de la sensación de subir de nivel! Por eso hemos creado esta aplicación. De hecho, forma parte de nuestro curso para principiantes [b][color=#ebc3ff][url=https://school.gdquest.com/products/bundle_learn_gamedev_godot_4]Learn Gamedev From Zero with Godot[/color][/b].
ja: GDQuest では、私たちは本質的に教育者です。 私たちは応用学習を信じており、それが退屈である必要はないと信じています。 正しく教えれば、ほとんどの人はレベルアップする感覚を非常に楽しみます。 それが私たちがこのアプリを作った理由です。 実際、これは初心者コース [b][color=#ebc3ff][url=https://school.gdquest.com/products/bundle_learn_gamedev_godot_4]Godot でゼロからゲーム開発を学ぶ[/url][/color][/b]。
ru: В GDQuest мы в душе́ любим преподавание. Мы верим в прикладное обучение и в то, что оно не должно быть скучным. Когда правильно чему-то учишь, большинству людей начинает нравится ощущение совершенствования! По этой причине мы сделали это приложение. Кстати, этот курс является частью нашего курса для начинающих [b][color=#ebc3ff][url=https://school.gdquest.com/products/bundle_learn_gamedev_godot_4]Learn Gamedev From Zero with Godot[/url][/color][/b].
ta: Gdquest இல், நாங்கள் கல்வியாளர்களாக இருக்கிறோம். பயன்பாட்டு ஆய்வில் நாங்கள் நம்புகிறோம், அது சலிப்படைய வேண்டியதில்லை என்று நாங்கள் நம்புகிறோம். கற்பித்தல் சரியாக செய்யப்படும்போது, பெரும்பாலான மக்கள் சமன் செய்வதற்கான உணர்வை மிகவும் அனுபவிக்கிறார்கள்! இந்த பயன்பாட்டை நாங்கள் உருவாக்கிய காரணம் இதுதான். இது உண்மையில் எங்கள் தொடக்க பாடத்தின் ஒரு பகுதியாகும் [b] [வண்ணம் =#EBC3FF] [url = https: //school.gdquest.com/products/bundle_learn_gamedev_godot_4] கோடோட் [/url] [/வண்ணம்] உடன் பூச்சியத்திலிருந்து கேமடேவை கற்றுக்கொள்ளுங்கள் [ /b].
tr: GDQuest'te bizler, özümüzde eğitimciyiz. Uygulamalı çalışmaya inanıyoruz ve bunun sıkıcı olmak zorunda olmadığına inanıyoruz. Öğretim doğru yapıldığında, çoğu insan seviye atlamanın hissinden büyük keyif alır! Bu uygulamayı yapmamızın nedeni de bu. Aslında başlangıç kursumuz olan [b][color=#ebc3ff][url=https://school.gdquest.com/products/bundle_learn_gamedev_godot_4]Learn Gamedev From Zero with Godot[/url][/color][/b] 'nun bir parçası (Godot ile Oyun Geliştirmeyi Sıfırdan Öğrenin).
uk: В GDQuest ми любимо навчати. Ми віримо в прикладне навчання і в те, що воно не має бути нудним. Коли правильно чомусь навчаєш, більшості людей починає подобається відчуття вдосконалення! Тому ми зробили цей застосунок. До речі, цей курс є частиною нашого курсу для початківців [b][color=#ebc3ff][url=https://school.gdquest.com/products/bundle_learn_gamedev_godot_4]Learn Gamedev From Zero with Godot[/url][/color][/b].

source: You completed Learn GDScript From Zero. You now have the basics you need to make games with the Godot game engine. You can keep learning with the free series [url=https://docs.godotengine.org/en/stable/getting_started/step_by_step/index.html]Getting Started with Godot[/url].
cs: Dokončili jste kurz GDScript od nuly. Nyní máte základy, které potřebujete k vytváření her s herním enginem Godot. Ve výuce můžete pokračovat pomocí bezplatného seriálu [url=https://docs.godotengine.org/en/stable/getting_started/step_by_step/index.html]Začínáme s Godotem[/url].
de: Du hast Learn GDScript From Zero abgeschlossen. Du verfügst nun über die grundlegenden Fähigkeiten, um Videospiele mit der Godot Game-Engine zu erstellen. Mit der kostenlosen Video-Serie [url=https://docs.godotengine.org/en/stable/getting_started/step_by_step/index.html]Getting Started with Godot[/url] kannst du weiter lernen.
es: Ha completado Learn GDScript From Zero. Ahora tienes los conceptos básicos que necesitas para sumergirte en la creación de juegos con el motor de juegos Godot. Si estás buscando una serie gratuita para seguir aprendiendo los conceptos básicos con nosotros, puede pasar a [url=https://www.gdquest.com/tutorial/godot/learning-paths/getting-started-in-2021 /]Empezando con Godot[/url] (curso en inglés).
fr: Vous avez terminé Learn GDScript From Zero. Vous avez maintenant les bases nécessaires pour créer des jeux avec le moteur de jeu Godot. Vous pouvez continuer à apprendre avec la série gratuite [url=https://docs.godotengine.org/en/stable/getting_started/step_by_step/index.html]Getting Started with Godot[/url].
it: Hai completato Learn GDScript From Zero. Ora possiedi le basi per immergerti nella creazione di giochi con il Godot game engine. Se stai cercando una serie gratuita per continuare ad imparare le basi con noi, puoi continuare su [url=https://www.gdquest.com/tutorial/godot/learning-paths/getting-started-in-2021/]Getting Started with Godot[/url].
ja: ゼロから学ぶGDScriptを修了しました。あなたはいま、Godotゲームエンジンを使ったゲーム制作に飛び込むために必要な基礎知識を持っています。 もし、私たちと一緒にもっとGodotを学びたいと思ったら、[url=https://docs.godotengine.org/en/stable/getting_started/step_by_step/index.html]Godot入門[/url]へと進んでください。
ru: Вы завершили курс Learn GDScript From Zero. Теперь у вас есть необходимые базовые знания, чтобы с головой погрузиться в разработку игр с помощью игрового движка Godot. Если вы ищите бесплатные уроки чтобы продолжить получать знания, вы можете перейти на [url=https://docs.godotengine.org/ru/stable/getting_started/step_by_step/index.html]Введение в Godot[/url].
ta: நீங்கள் பூச்சியத்திலிருந்து gdscript ஐ கற்றுக் கொண்டீர்கள். கோடோட் கேம் எஞ்சினுடன் நீங்கள் விளையாட்டுகளை உருவாக்க வேண்டிய அடிப்படைகள் இப்போது உங்களிடம் உள்ளன. இலவச தொடருடன் நீங்கள் தொடர்ந்து கற்றுக் கொள்ளலாம் [url = https: //docs.godotengine.org/en/stable/getting_started/step_by_step/index.html] கோடோட் [/url] உடன் தொடங்குதல்.
tr: Learn GDScript From Zero (Sıfırdan GDScript Öğrenin) kursunu tamamladınız. Godot oyun motoru ile oyunlar yapmak için gereken temel bilgilere artık sahipsiniz. Ücretsiz [url=https://docs.godotengine.org/en/stable/getting_started/step_by_step/index.html]Getting Started with Godot[/url] (Godot ile Başlangıç) serileri ile öğrenmeye devam edebilirsiniz (Bu sayfanın çevirileri devam ediyor. Sayfanın sol altında dil değiştirme düğmesinden "tr" kodunu görürseniz, en azından temel başlangıç bölümleri bitmiş demektir).
uk: Ви завершили курс Learn GDScript From Zero. Тепер ви маєте необхідні базові знання, щоб із головою поринути в розробку ігор за допомогою ігрового рушія Godot. Якщо ви шукаєте безплатні уроки щоб продовжити здобувати знання, ви можете перейти на [url=https://docs.godotengine.org/uk/stable/getting_started/step_by_step/index.html]Вступ до Godot[/url].
