Repository: GDQuest/learn-gdscript
Catalog: i18n/*/application.po
Languages: cs, da, de, es, fr, it, ja, pt, ru, ta, tr, uk

source: You need to type a whole number for this answer. Example: 42
cs: Pro tuto odpověď musíte zadat celé číslo. Například: 42
da: Du skal skrive et helt tal for dette svar. Eksempel: 42
de: Du musst eine ganze Zahl für diese Antwort eingeben. Beispiel: 42
es: Debes escribir un número entero para esta respuesta. Ejemplo: 42
fr: Vous devez saisir un nombre entier pour cette réponse. Exemple : 42
it: Devi inserire un numero intero per questa risposta. Esempio:42
ja: この答えには整数を入力する必要があります。例: 42
pt: Precisa digitar um número inteiro para esta resposta. Exemplo: 42
ru: Для ответа вам нужно ввести целое число. Пример: 42
ta: இந்த பதிலுக்கு நீங்கள் முழு எண்ணையும் தட்டச்சு செய்ய வேண்டும். எடுத்துக்காட்டு: 42
tr: Bu cevap için bir tam sayı yazmanız gerekiyor. Örnek: 42
uk: Для відповіді потрібно ввести ціле число. Приклад: 42

source: You need to type a decimal for this answer. Use a "." to separate the decimal part. Example: 3.14
cs: Pro tuto odpověď musíte zadat desetinné číslo. Použijte "." k oddělení desetinné části. Například: 3.14
da: Du skal skrive et decimal tal til dette svar. Brug et "." til at adskille decimaldelen. Eksempel: 3.14
de: Du musst für diese Antwort eine Dezimalstelle eingeben. Verwende ein ".", um den Dezimalteil zu trennen. Beispiel: 3.14
es: Debes escribir un decimal para esta respuesta. Utiliza un "." para separar la parte decimal. Ejemplo: 3.14
fr: Vous devez saisir un nombre décimal pour cette réponse. Utilisez un « . » pour délimiter la partie décimale. Exemple : 3.14
it: Devi inserire un numero decimale per questa risposta. Usa "." per separare la parte decimale. Esempio: 3.14
ja: この答えには実数を入力する必要があります。小数点以下は「.」で区切ってください。例: 3.14
pt: Precisa digitar um número real para esta resposta. Use um "." para separar a parte decimal. Exemplo: 3.14
ru: Для ответа вам нужно ввести десятичную дробь. Используйте "." для отделения десятичной части. Пример: 3.14
ta: இந்த பதிலுக்கு நீங்கள் ஒரு தசமத்தைத் தட்டச்சு செய்ய வேண்டும். ஒரு "." தசம பகுதியை பிரிக்க. எடுத்துக்காட்டு: 3.14
tr: Bu cevap için bir ondalık sayı yazmanız gerekiyor. Ondalık kısmı ayırmak için nokta, ".", kullanmalısınız. Örnek: 3.14
uk: Для відповіді вам потрібно ввести десятковий дріб. Дробову частину відокремлюйте крапкою ".". Приклад: 3.14

source: Title
cs: Nadpis
da: Titel
de: Titel
es: Título
fr: Titre
it: Titolo
ja: タイトル
pt: Título
ru: Заголовок
ta: தலைப்பு
tr: Başlık
uk: Заголовок

source: Practices
cs: Cvičení
da: Øvelser
de: Übungen
es: Prácticas
fr: Exercices pratiques
it: Pratiche
ja: 演習
pt: Práticas
ru: Упражнения
ta: நடைமுறைகள்
tr: Alıştırmalar
uk: Вправи

source: Go back in your navigation history
cs: Návrat do historie navigace
da: Gå tilbage i navigationshistorikken
de: Zurück zu deinem Navigationsverlauf
es: Vuelve al historial de navegación
fr: Revenir en arrière dans votre historique de navigation
it: Ritorna alla tua cronologia di navigazione
ja: ページを戻ります
pt: Volte no seu histórico de navegação
ru: Вернуться к предыдущему окну
ta: உங்கள் வழிசெலுத்தல் வரலாற்றில் திரும்பிச் செல்லுங்கள்
tr: Gezinme geçmişinizde geri gidin
uk: Повернутися до попереднього вікна

source: (no previous history)
cs: (žádná předchozí historie)
da: (ingen tidligere historik)
de: (kein Verlauf)
es: (sin historial previo)
fr: (aucun historique)
it: (nessuna cronologia)
ja: (戻るページがありません)
pt: (sem histórico anterior)
ru: (предыдущее окно не найдено)
ta: (முந்தைய வரலாறு இல்லை)
tr: (geçmiş kayıt bulunamadı)
uk: (попереднього вікна не знайдено)

source: CHRISTMAS SALE - 50% OFF
cs: VÁNOČNÍ PRODEJ - 50% SLEVA
da: JULEUDSALG - 50% NEDSAT
de: WEIHNACHTSAKTION - 50% RABATT
es: REBAJAS DE NAVIDAD - 50% DE DESCUENTO
fr: SOLDES DE NOËL - 50% DE RÉDUCTION
it: SCONTO NATALIZIO - 50% OFF
ja: クリスマス セール - 50% オフ
ru: РОЖДЕСТВЕНСКАЯ РАСПРОДАЖА – СКИДКА 50%
ta: கிறிச்துமச் விற்பனை - 50% தள்ளுபடி
tr: YENİ YIL SATIŞI - 50% İNDİRİM
uk: РІЗДВЯНИЙ РОЗПРОДАЖ – ЗНИЖКА 50%

source: CHRISTMAS SALE
cs: VÁNOČNÍ PRODEJ
da: JULEUDSALG
de: WEIHNACHTSAKTION
es: REBAJAS DE NAVIDAD
fr: SOLDES DE NOËL
it: SALDI NATALIZI
ja: クリスマスセール
ru: РОЖДЕСТВЕНСКАЯ РАСПРОДАЖА
ta: கிறிச்துமச் விற்பனை
tr: YENİ YIL SATIŞI
uk: РІЗДВЯНИЙ РОЗПРОДАЖ

source: Validating Your Code...
cs: Ověřování kódu...
da: Validering af din kode...
de: Code wird validiert...
es: Validando tu código...
fr: Validation de votre code…
it: Verificando Il Tuo Codice...
ja: コードを検証しています...
pt: Validando seu código...
ru: Проверяем ваш код...
ta: உங்கள் குறியீட்டை சரிபார்க்கிறது ...
tr: Kodunuz Doğrulanıyor...
uk: Перевіряємо ваш код...

source: The function `%s` calls itself, this creates an infinite loop
cs: Funkce `%s` volá sama sebe, což vytváří nekonečnou smyčku
da: Funktionen `%s ` kalder sig selv, det skaber en uendelig løkke
de: Die Funktion `%s`ruft sich selbst auf, dadurch entsteht eine Endlosschleife
es: La función `%s` se llama a sí misma, esto crea un bucle infinito
fr: La fonction `%s` s’appelle elle-même, cela crée une boucle infinie
it: La funzione `%s` chiama se stessa, creando un ciclo infinito
ja: 関数 `%s` がそれ自体を呼び出します。これにより無限ループが作成されます
ru: Функция `%s` вызывает сама себя, впадая в бесконечный цикл
ta: `%s` செயல்பாடு தன்னை அழைக்கிறது, இது எல்லையற்ற வளையத்தை உருவாக்குகிறது
tr: `%s` fonksiyonu kendisini çağırıyor, bu da sonsuz döngü oluşturuyor
uk: Функція `%s` викликає сама себе, виникає нескінченний цикл

source: Running Your Code...
cs: Probíhá spouštění kódu...
da: Kør din kode...
de: Code wird ausgeführt...
es: Ejecutando tu código...
fr: Exécution de votre code…
it: Eseguendo Il Tuo Codice...
ja: コードを実行しています...
pt: A executar o seu código...
ru: Выполняем ваш код...
ta: உங்கள் குறியீட்டை இயக்குகிறது ...
tr: Kodunuz Çalıştırılıyor...
uk: Виконуємо ваш код...

source: There is a division by zero in your code. You cannot divide by zero in code. Please ensure you have no "/ 0" or "% 0" in your code.
cs: Ve vašem kódu je dělení nulou. V kódu nelze dělit nulou. Ujistěte se, že v kódu nemáte znaky "/ 0" nebo "% 0".
da: Der er en division med nul i din kode. Du kan ikke dele med nul i kode. Sørg for, at du ikke har "/ 0" eller "% 0" i din kode.
de: In deinem Code, teilst du durch null. Du kannst in deinem Code nicht durch null teilen. Bitte stelle sicher das du kein "/0" oder "%0" in deinem Code stehen hast.
es: Hay una división por cero en tu código. No se puede dividir por cero en código. Por favor, asegúrete de que no tiene "/ 0" o "% 0" en su código.
fr: Il y a une division par zéro dans votre code. Il n'est pas possible de diviser par zéro dans un code. Assurez-vous qu'il n'y a pas de "/ 0" ou de "% 0" dans votre code.
it: Nel codice è presente una divisione per zero. Nel codice non è possibile dividere per zero. Assicurati di non avere "/ 0" o "% 0" nel tuo codice.
ja: コード内にゼロ除算があります。 コード内ではゼロで除算することはできません。 コードに"/ 0"または"% 0"が含まれていないことを確認してください。
ru: В вашем коде есть деление на ноль. Вы не можете делить на ноль в коде. Убедитесь, что в вашем коде нет «/ 0» или «% 0».
ta: உங்கள் குறியீட்டில் பூச்சியத்தால் ஒரு பிரிவு உள்ளது. குறியீட்டில் பூச்சியத்தால் நீங்கள் பிரிக்க முடியாது. உங்கள் குறியீட்டில் "/ 0" அல்லது "% 0" இல்லை என்பதை உறுதிப்படுத்தவும்.
tr: Kodunuzda bir yerde sıfıra bölme durumu var. Kodunuzda sıfıra bölme yapamazsınız. Lütfen, kodunuzun içinde "/ 0" ya da "% 0" ifadelerinin veya değeri sıfır olan bölen bir değişkenin olmadığından emin olun.
uk: У вашому коді є ділення на нуль. Не можна ділити на нуль у коді. Переконайтеся, що в коді немає «/ 0» або «% 0».

source: Oh no! The script has an error, but the Script Verifier did not catch it
cs: Ale ne! Tento skript má chybu, ale ověřovač skriptů ji nezachytil
da: Åh nej! Scriptet har en fejl, men script verifikatoren fangede det ikke
de: Oh nein! Das Script hat einen Fehler, aber der Script Verifizierer hat diesen nicht abgefangen
es: ¡Oh, no! El script tiene un error, pero el verificador de script no lo ha detectado.
fr: Oh non ! Le script contient une erreur, mais le vérificateur de script ne l’a pas détectée
it: Oh no! Lo script ha un errore, ma lo Script Verifier non l'ha rilevato
ja: なんてこった！ スクリプトにエラーがありますが、検証機がエラーを検出できませんでした
ru: О, нет! В скрипте есть ошибка, но средство проверки скриптов ее не обнаружило
ta: ஓ! ச்கிரிப்டில் பிழை உள்ளது, ஆனால் ச்கிரிப்ட் சரிபார்ப்பு அதைப் பிடிக்கவில்லை
tr: Hadi be! Betikte bir hata var, ama Betik Doğrulayıcı'mız bunu yakalayamadı
uk: Ой! У скрипті є помилка, але засіб перевірки скриптів її не виявив

source: Running Tests...
cs: Probíhají testy...
da: Kør tests...
de: Tests werden ausgeführt...
es: Ejecutando pruebas...
fr: Exécution des tests…
it: Svolgendo Prove...
ja: テストを実行中...
pt: A executar testes...
ru: Проводим тесты...
ta: இயங்கும் சோதனைகள் ...
tr: Testler Çalıştırılıyor...
uk: Проводимо тести...

source: Suggested Solution
cs: Navrhované řešení
da: Forslået løsning
de: Lösungsvorschlag
es: Solución sugerida
fr: Solution suggérée
it: Soluzioni Consigliate
ja: 推奨される答え
pt: Solução Sugerida
ru: Предлагаемое решение
ta: பரிந்துரைக்கப்பட்ட தீர்வு
tr: Önerilen Çözüm
uk: Пропоноване рішення

source: Use Solution
cs: Použít řešení
da: Brug løsning
de: Lösung verwenden
es: Utilizar la solución
fr: Utiliser la solution
it: Usa Soluzione
ja: この答えを使う
pt: Use a Solução
ru: Использовать решение
ta: தீர்வைப் பயன்படுத்துங்கள்
tr: Çözümü Kullan
uk: Використати рішення

source: Leave unfinished practice?
cs: Opustit nedokončené cvičení?
da: Forlad ufærdig øvelse?
de: Unvollendete Übung verlassen?
es: ¿Dejar la práctica sin terminar?
fr: Quitter l'exercice pratique non terminé ?
it: Lasciare prova incompleta?
ja: 未完了の演習を中断しますか？
pt: Deixar prática não finalizada?
ru: Оставить незаконченное упражнение?
ta: முடிக்கப்படாத பயிற்சியை விடவா?
tr: Tamamlanmamış alıştırma kapatılsın mı?
uk: Залишити незакінчену вправу?

source: Button
cs: Tlačítko
da: Knap
de: Schaltfläche
es: Botón
fr: Bouton
it: Tasto
ja: ボタン
pt: Botão
ru: Кнопка
ta: பொத்தான்
tr: Düğme
uk: Кнопка

source: Run
cs: Spustit
da: Kør
de: Ausführen
es: Ejecutar
fr: Exécuter
it: Esegui
ja: 実行
pt: Executar
ru: Выполнить
ta: ஓடு
tr: Çalıştır
uk: Виконати

source: Reset
cs: Resetovat
da: Nulstil
de: Zurücksetzen
es: Reiniciar
fr: Réinitialiser
it: Resetta
ja: リセット
pt: Resetar
ru: Сбросить
ta: மீட்டமை
tr: Sıfırla
uk: Скинути

source: Solution
cs: Řešení
da: Løsning
de: Lösung
es: Solución
it: Soluzione
ja: 答えを見る
pt: Solução
ru: Решение
ta: நீர்மக்கூழ்
tr: Çözüm
uk: Рішення

source: Output
cs: Výstup
da: Uddata
de: Ausgabe
es: Salida
fr: Sortie
it: Risultato
ja: 出力
pt: Saída
ru: Вывод
ta: வெளியீடு
tr: Çıktı
uk: Вивід

source: Continue
cs: Pokračovat
da: Fortsæt
de: Weiter
es: Continuar
fr: Continuer
it: Continua
ja: 進む
pt: Continuar
ru: Продолжить
ta: தொடரவும்
tr: Devam et
uk: Продовжити

source: Value
cs: Hodnota
da: Værdi
de: Wert
es: Valor
fr: Valeur
it: Valore
ja: 値
pt: Valor
ru: Значение
ta: மதிப்பு
tr: Değer
uk: Значення

source: Learn GDScript From Zero is an open source project by [color=#FFD500][url=https://www.gdquest.com/]GDQUEST.COM[/url][/color]
da: Lær GDScript From Zero er et open source projekt af [farve=#FFD500][url= https://www.gdquest.com/]GDQUEST.COM[/url][/farve]
es: Learn GDScript From Zero es un proyecto de código abierto de [color=#FFD500][url=https://www.gdquest.com/]GDQUEST.COM[/url][/color]
ta: சுழிமம் இலிருந்து GDSCRIPT ஐக் கற்றுக்கொள்ளுங்கள் [வண்ணம் =#FFD500] [url = https: //www.gdquest.com/] gdquest.com [/url] [/color]
tr: Learn GDScript From Zero (Sıfırdan GDScript Öğrenin), [color=#FFD500][url=https://www.gdquest.com/]GDQUEST.COM[/url][/color] tarafından hazırlanmış açık kaynaklı bir projedir
uk: Learn GDScript From Zero – це проєкт з відкритим кодом від [color=#FFD500][url=https://www.gdquest.com/]GDQUEST.COM[/url][/color]

source: Paused
cs: Pozastaveno
da: På pause
de: Angehalten
es: En pausa
fr: Mis en pause
it: In Pausa
ja: ポーズ中
pt: Pausado
ru: На паузе
ta: இடைநிறுத்தப்பட்டது
tr: Duraklatıldı
uk: На паузі

source: Our error explanation.
cs: Naše vysvětlení chyby.
da: Vores fejl forklaring.
de: Unsere Fehlererklärung.
es: Nuestra explicación del error.
fr: Notre explication de l'erreur.
it: Nostra spiegazione dell'errore.
ja: エラーの説明。
pt: Nossa explicação do erro.
ru: Наше объяснение ошибки.
ta: எங்கள் பிழை விளக்கம்.
tr: Bizim hata açıklamamız.
uk: Наше пояснення помилки.

source: ERROR:
cs: CHYBA:
da: FEJL:
de: FEHLER:
fr: ERREUR :
it: ERRORE:
ja: エラー：
pt: ERRO:
ru: ОШИБКА:
ta: பிழை:
tr: HATA:
uk: ПОМИЛКА:

source: Placeholder text
cs: Zástupný text
da: Indsæt tekst
de: Platzhalter-Text
es: ﻿Texto de relleno
fr: Texte en placeholder
it: Testo tappabuchi
ja: プレースホルダーテキスト
pt: Texto de dica
ru: Текст-заполнитель
ta: ஒதுக்கிட உரை
tr: Yer tutucu metin
uk: Текст-заповнювач

source: in
cs: v
da: i
es: en
fr: dans
pt: em
ru: в
ta: இல்
tr: şunun içinde
uk: в

source: FileName
cs: Název souboru
da: Filnavn
de: Dateiname
es: Nombre del archivo
fr: Nom du fichier
it: NomeFile
ja: ファイル名
pt: Nome do Ficheiro
ru: Имя файла
ta: கோப்புப்பெயர்
tr: DosyaAdı
uk: Назва файлу

source: at
cs: na
da: på
de: bei
es: en
fr: à
pt: no
ru: в
tr: şurada
uk: в

source: Sometimes errors are reported outside of your code. Why does that happen?
cs: Někdy jsou chyby hlášeny mimo váš kód. Proč se to děje?
da: Nogle gange rapporteres fejl uden for din kode. Hvorfor sker det?
de: Manchmal werden Fehler außerhalb deines Codes gemeldet. Warum passiert das?
es: A veces los errores se reportan fuera de tu código. ¿Por qué ocurre esto?
fr: Parfois, des erreurs sont signalées en dehors de votre code. Pourquoi cela se produit ?
it: Certe volte gli errori sono segnalati al di fuori del tuo codice. Perché succede questo?
ja: コード外でエラーが報告されることがあります。 なぜそのようなことが起こるのですか？
pt: Às vezes, erros são reportados fora do seu código. Por que isso acontece?
ru: Иногда ошибки возникают за пределами вашего кода. Почему так происходит?
ta: சில நேரங்களில் உங்கள் குறியீட்டிற்கு வெளியே பிழைகள் தெரிவிக்கப்படுகின்றன. அது ஏன் நடக்கும்?
tr: Bazen hatalar kodunuzun dışında olarak rapor edilir. Bu neden oluyor?
uk: Іноді помилки виникають за межами вашого коду. Чому так буває?

source: Explain
cs: Vysvětlit
da: Forklar
de: Erklären
es: Explicar
fr: Expliquer
it: Spiega
ja: 説明を見る
pt: Explique
ru: Пояснение
ta: விளக்குங்கள்
tr: Açıkla
uk: Пояснення

source: Expand
cs: Rozbalit
da: Udvid
de: Erweitern
es: Expandir
fr: Étendre
it: Espandi
ja: 拡張
pt: Expandir
ru: Развернуть
ta: விரிவாக்கு
tr: Genişlet
uk: Розгорнути

source: run()
da: kør()
ja: 実行
pt: Executar()
ta: ஓடு ()

source: step
cs: krok
da: trin
de: Schritt
es: paso
fr: étape
it: passo
ja: ステップ
ru: шаг
ta: படி
tr: adım
uk: крок

source: Debugger
cs: Ladící program
da: Fejlfinder
es: Depurador
fr: Débogueur
ja: デバッガ
ru: Отладчик
ta: பிழைத்திருத்தம்
tr: Hata ayıklayıcı
uk: Зневаджувач

source: [center]Get [b]50% off[/b] on all our Godot courses with the coupon code [b]DISCOUNT50[/b][/center]
cs: [center]Získejte [b]50% off[/b] na všech našich kurzech Godot. kuponem [b]SLEVA50[/b][/center]
da: [center][b]50%[/b] på alle vores Godot kurser med kupon kode [b]DISCOUNT50[/b][/center]
de: [center]Erhalte [b]50% Rabatt[/b] auf alle unsere Godot Kurse mit dem Coupon Code [b]DISCOUNT50[/b][/center]
es: [center]Consigue un [b]50% de descuento[/b] en todos nuestros cursos de Godot con el código [b]DESCUENTO50[/b][/center]
fr: [center]Obtenez [b]50% off[/b] sur tous nos cours Godot avec le code promo [b]DISCOUNT50[/b][/center]
it: [center]Ottieni il [b]50% di sconto[/b] su tutti i nostri corsi Godot con il codice coupon [b]SCONTO50[/b][/center]
ja: [center]クーポン コード [b]DISCOUNT50[/b]を使用すると、 すべての Godot コースが [b]50％ オフ[/b]になります[/center]
ru: [center]Получите [b]50% скидку[/b] на все наши курсы Godot по купону с кодом [b]DISCOUNT50[/b][/center]
ta: [மையம்] எங்கள் எல்லா கோடோட் படிப்புகளிலும் 50% தள்ளுபடி [/b] ஐப் பெறுங்கள் கூப்பன் குறியீடு [b] தள்ளுபடி 50 [/b] [/மையம்]
tr: [center] Tüm Godot kurslarımızda, [b]DISCOUNT50[/b] kupon kodunu kullanarak [b]%50 indirim[/b] alın[/center]
uk: [center]Отримайте [b]50% знижку[/b] на всі наші курси Godot за купоном із кодом [b]DISCOUNT50[/b][/center]

source: Only until
cs: Pouze dokud
da: Kun indtil
de: Nur bis
es: Solamente hasta
fr: Seulement jusqu’au
it: Solo finché
ja: 終了
ru: Предложение действует до
ta: வரை மட்டுமே
tr: geçerlilik süresi
uk: Пропозиція діє до

source: CHECK OUT OUR COURSES
cs: PODÍVEJTE SE NA NAŠE KURZY
da: TJEK VORES KURSER
de: SIEH DIR UNSERE KURSE AN
es: DESCUBRA NUESTROS CURSOS
fr: CONSULTEZ NOS COURS
it: SCOPRI I NOSTRI CORSI
ja: 私たちのコースをチェックしてください
ru: ПОСМОТРЕТЬ НАШИ КУРСЫ
ta: எங்கள் படிப்புகளைப் பாருங்கள்
tr: KURSLARIMIZA GÖZ ATIN
uk: ПЕРЕГЛЯНУТИ НАШІ КУРСИ

source: Confirm
cs: Potvrdit
da: Bekræft
de: Bestätigen
es: Confirmar
fr: Confirmer
it: Conferma
ja: 確認
pt: Confirmar
ru: Подтвердить
ta: உறுதிப்படுத்தவும்
tr: Onayla
uk: Підтвердити

source: Cancel
cs: Zrušit
da: Annuller
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
pt: Cancelar
ru: Отменить
ta: ரத்துசெய்
tr: İptal
uk: Скасувати

source: Original error message
cs: Původní chybová zpráva
da: Original fejlmeddelelse
de: Ursprüngliche Fehlermeldung
es: Mensaje de error original
fr: Message d'erreur d'origine
it: Messaggio di errore originario
ja: 元のエラーメッセージ
pt: Mensagem de erro original
ru: Исходное сообщение об ошибке
ta: அசல் பிழை செய்தி
tr: Orijinal hata mesajı
uk: Початкове повідомлення про помилку

source: Why this happens
cs: Proč k tomu dochází
da: Hvorfor sker dette
de: Warum das passiert
es: Por qué ocurre esto
fr: Pourquoi ceci se produit
it: Perché succede questo
ja: エラーが発生している理由
pt: Por que isso acontece
ru: Почему так происходит
ta: இது ஏன் நடக்கிறது
tr: Bu neden oluyor
uk: Чому це відбувається

source: How to fix this
cs: Jak to opravit
da: Hvordan man løser dette
de: So behebst du dieses Problem
es: Cómo solucionarlo
fr: Comment corriger ceci
it: Come sistemarlo
ja: 修正する方法
pt: Como corrigir isso
ru: Как это исправить
ta: இதை எவ்வாறு சரிசெய்வது
tr: Bu nasıl düzeltilir
uk: Як це виправити

source: Our suggestion on how to fix it.
cs: Náš návrh, jak to opravit.
da: Vores forslag til hvordan man løser det.
de: Unser Vorschlag, wie man es beheben kann.
es: Nuestra sugerencia sobre cómo solucionarlo.
fr: Notre suggestion sur la façon de la corriger.
it: Il nostro suggerimento su come sistemarlo.
ja: オススメの修正方法。
pt: Nossa sugestão de como corrigir.
ru: Наш вариант исправления.
ta: அதை எவ்வாறு சரிசெய்வது என்பது குறித்த எங்கள் பரிந்துரை.
tr: Nasıl düzeltileceğinize dair bizim önerimiz.
uk: Наш варіант виправлення.

source: Sorry, we don't have this particular error message covered yet!
da: Beklager, vi har ikke dækket denne specifikke fejlmeddelelse endnu!
pt: Desculpe, não cobrimos ainda essa mensagem de erro em particular!

source: Please, use the [b]Report[/b] button in the top-right corner to tell us more about how you've got it, and we will try to improve our knowledge base for the next version of the application.
da: Brug [b]Rapport[/b] knappen i øverste højre hjørne for at fortælle os mere om hvordan du fik den, og vi vil forsøge at forbedre vores vidensbase til den næste version af aplikationen.
pt: Por favor, use o botão [b]Report[/b] no canto superior direito para nos dizer como conseguiu esse erro e vamos tentar aumentar nossa base de conhecimento para a próxima versão da aplicação.

source: [center]Thank you![/center]
da: [center]Tak![/center]
pt: [center]Obrigado![/center]

source: Hide
cs: Skrýt
da: Skjul
de: Verstecken
es: Ocultar
fr: Masquer
it: Nascondi
ja: 隠す
pt: Esconder
ru: Скрыть
ta: மறை
tr: Gizle
uk: Приховати

source: Where do external errors come from?
cs: Odkud se berou externí chyby?
da: Hvor kommer eksterne fejl fra?
de: Woher kommen externe Fehler?
es: ¿De dónde vienen los errores externos?
fr: D'où viennent les erreurs externes ?
it: Da dove arrivano gli errori esterni?
ja: 外部エラーはどこから発生しますか？
pt: De onde vem os erros externos?
ru: Откуда берутся внешние ошибки?
ta: வெளிப்புற பிழைகள் எங்கிருந்து வருகின்றன?
tr: Harici hatalar nereden geliyor?
uk: Звідки беруться зовнішні помилки?

source: Lessons in this course are designed so you only need to edit the [b]important bits[/b]. But there is much more code outside of what you see that makes the project run.
da: Lektioner i dette kursus er designet, så du kun skal redigere de [b]væsentlige dele[/b]. Men der er meget mere kode uden for, hvad du ser, der gør at projektet kan køre.

source: This means that sometimes changes you make can affect code you have no control over. But don't worry, you can still fix all the issues yourself with the code you [b]can[/b] edit!
da: Det betyder, at ændringer, du foretager, nogle gange kan påvirke kode, du ikke har kontrol over. Men bare rolig, du kan stadig selv løse alle problemerne med den kode, du [b]kan[/b] redigere!

source: [i]This is like how game engines work too.[/i] There is a lot of hidden code that they execute to ensure your project runs smoothly. And yet, an error in your scripts can break them. We'll try to explain how to address each individual error that you face. Quick, click the [b]Explain[/b] button next to the error message!
da: [i]Dette er også ligesom, hvordan spilmotorer fungerer.[/i] Der er en masse skjult kode, som de udfører for at sikre, at dit projekt kører glat. Og dog, kan en fejl i dine scripts ødelægge dem. Vi vil forsøge at forklare, hvordan du adresserer hver enkelt fejl, du står over for. Hurtigt, klik på knappen [b]Forklar[/b] ved siden af fejlmeddelelsen!

source: Got it!
cs: Mám to!
da: Jeg forstår!
de: Verstanden!
es: ¡Entendido!
fr: J'ai compris !
it: Fatto!
ja: 了解！
pt: Acertou!
ru: Понятно!
ta: கிடைத்தது!
tr: Anladım!
uk: Зрозуміло!

source: Lesson complete!
cs: Lekce dokončena!
da: Lektion fuldført!
de: Lektion abgeschlossen!
es: ¡Lección completa!
fr: Leçon terminée !
it: Lezione completata!
ja: レッスンコンプリート！
pt: Lição completa!
ru: Урок пройден!
ta: பாடம் முடிந்தது!
tr: Ders tamamlandı!
uk: Урок пройдено!

source: But there are still some practices that you've skipped.
cs: Stále však existují některé postupy, které jste přeskočili.
da: Men der er stadig nogle øvelser det du har sprunget over.
de: Aber es gibt immer noch einige Übungen die du übersprungen hast.
es: Pero todavía hay algunas prácticas que te has saltado.
fr: Mais il y a encore des exercices pratiques que vous n'avez pas effectués.
it: Ma ci sono ancora alcune pratiche che hai saltato.
ja: まだいくつかの演習があります あなたがスキップしたこと。
pt: Mas ainda há algumas práticas que pulou.
ru: Но есть еще упражнения которые вы пропустили.
ta: ஆனால் இன்னும் சில நடைமுறைகள் உள்ளன நீங்கள் தவிர்த்துவிட்டீர்கள்.
tr: Ancak hala arada atladığınız alıştırmalar var. .
uk: Але є ще вправи які ви пропустили.

source: [center][b]Stay[/b] and revisit the study material, or [b]continue[/b] the course.[/center]
cs: [center][b]Zůstaňte[/b] a zopakujte si studijní materiál, nebo [b]pokračovat[/b] v kurzu.[/center]
da: [center][b]Bliv[/b] og genbesøg studiematerialet, eller [b]fortsæt[/b] kurset.[/center]
de: [center][b]Bleiben[/b] und das gelernte nochmal anzuschauen, oder [b]den Kurs fortsetzen[/b]. [/center]
es: [center][b]Quédate[/b] y revisa el material de estudio, o [b]continúa[/b] el curso.[/center]
fr: [center][b]Rester[/b] et relire la leçon, ou [b]continuer[/b] le cours.[/center]
it: [center][b]Rimani[/b] e rivisita il materiale da studiare, o [b]continua[/b] il corso.[/center]
ja: [center][b]留まる[/b] を押すとここのコースに留まり、 [b]次へ[/b] を押すと次のコースに進みます。[/center]
pt: [center][b]Permaneça[/b] e revisite o material de estudo, ou [b]continue[/b] o curso.[/center]
ru: [center]Вы можете [b]остаться[/b] и повторить учебный материал или [b]продолжить[/b] курс.[/center]
ta: [மையம்] [b] தங்கியிருங்கள் [/b] மற்றும் ஆய்வுப் பொருள்களை மீண்டும் பார்வையிடவும் அல்லது [b] தொடரவும் [/b] பாடநெறி. [/மையம்]
tr: [center]Burada [b]kalın[/b] ve çalışma notlarınızı tekrar gözden geçirin, ya da kursa [b]devam[/b] edin.[/center]
uk: [center]Ви можете [b]залишитись[/b] і повторити навчальний матеріал або [b]продовжити[/b] курс.[/center]
