Repository: GDQuest/learn-gdscript
Catalog: i18n/*/application.po
Languages: cs, da, de, es, fr, it, ja, pt, ru, ta, tr, uk

source: Like Godot, this app and course is free and open-source. You can find the app's source code and contribute translations here: [url=https://github.com/GDQuest/learn-gdscript]Learn GDScript From Zero (Github repository)[/url].
cs: Stejně jako Godot je i tato aplikace a kurz zdarma a s otevřeným zdrojovým kódem. Zdrojový kód aplikace a překlady můžete najít zde: [url="https://github.com/GDQuest/learn-gdscript"]Learn GDScript From Zero (Github repository)[/url].
es: Como Godot, esta aplicación y este curso son gratuitos y de código abierto. Puedes encontrar el código fuente de la aplicación y contribuir con traducciones aquí: [url=https://github.com/GDQuest/learn-gdscript]Learn GDScript From Zero (repositorio Github, en inglés)[/url].
fr: Comme Godot, cette application et ce cours sont gratuits et open-source. Vous pouvez trouver le code source de l'application et contribuer aux traductions ici : [url=https://github.com/GDQuest/learn-gdscript]Learn GDScript From Zero (Github repository)[/url].
ta: கோடோட்டைப் போலவே, இந்த பயன்பாடும் பாடமும் இலவசமாகவும் திறந்த மூலமாகவும் இருக்கும். பயன்பாட்டின் மூலக் குறியீட்டைக் கண்டுபிடித்து மொழிபெயர்ப்புகளை இங்கே பங்களிக்கலாம்: [url = https: //github.com/gdquest/learn-gdscript] பூச்சியத்திலிருந்து (கிதுப் களஞ்சியம்) [/url] gdscript ஐக் கற்றுக்கொள்ளுங்கள்.
tr: Godot gibi, bu uygulama ve kurs da ücretsiz ve açık-kaynak'tır. Uygulamanın kaynak koduna erişmek ve çevirilere katkıda bulunmak için: [url=https://github.com/GDQuest/learn-gdscript]Learn GDScript From Zero (Github deposu)[/url].
uk: Як і Godot, цей застосунок і курс безплатні і мають відкритий сирцевий код. Ви можете знайти сирцевий код програми та покращити переклад тут: [url="https://github.com/GDQuest/learn-gdscript"]Learn GDScript From Zero (репозиторій на Github)[/url].

source: Hints
cs: Rady
de: Hinweise
es: Pistas
fr: Indices
it: Suggerimenti
ja: ヒント
pt: Dicas
ru: Подсказки
ta: குறிப்புகள்
tr: İpuçları
uk: Підказки

source: Checks
cs: Kontroly
de: Aufgaben
es: Comprobaciones
fr: Vérifications
it: Controlli
ja: チェック
pt: Verificações
ru: Проверки
ta: காசோலைகள்
tr: Kontroller
uk: Перевірки

source: START
es: COMENZAR
fr: COMMENCER
it: INZIA
ja: 開始
pt: INICIAR
ru: НАЧАТЬ
ta: தொடங்கு
tr: BAŞLA
uk: ПОЧАТИ

source: Lessons in this course are constructed in such a way that you only need to edit the [b]important bits[/b]. But there is much more code outside of what you see that makes the project run.
pt: As lições nesse curso são construídas de tal forma que só precisa editar as [b]partes importantes[/b]. Mas há muito mais código fora do que vê que faz o projeto ser executado.

source: This means that sometimes changes that you make can affect code that you have no control over. But don't worry, you can still fix all the issues yourself with the code you [b]can[/b] edit!
pt: Isso significa que, às vezes, as alterações feitas podem afetar o código sobre o qual não tem controle. Mas não se preocupe, ainda pode corrigir todos os problemas com o código que [b]pode[/b] editar!

source: [i]This is kind of like game engines work too.[/i] There is a lot of hidden code that they execute to make sure your projects runs smoothly. And yet, an error in your scripts can break them. We'll try to explain how to address each individual error that you face. Quick, click the [b]Explain[/b] button next to the error message!
pt: [i]É assim que os motores de jogos (engines) funcionam também .[/i] Há muito código oculto que eles executam para garantir que os seus projetos funcionem sem problemas. E, no entanto, um erro em os seus códigos podem quebrá-los. Vamos tentar explicar como resolver cada erro que encontrar. Rápido, clique no botão [b]Explicar[/b] ao lado da mensagem de erro!

source: You completed Learn GDScript From Zero. You now have the basics you need to dive into game creation with the Godot game engine.
pt: Você completou Aprenda GDScript Do Zero. Agora sabe o básico que precisa para mergulhar na criação de jogos com a game engine Godot.

source: If you're looking for a free series to keep learning the basics with us, you can move on to [url=https://www.gdquest.com/tutorial/godot/learning-paths/getting-started-in-2021/]Getting Started with Godot[/url].
pt: Se procurar uma série gratuita para continuar a aprender o básico connosco, pode ir a [url=https://www.gdquest.com/tutorial/godot/learning-paths/getting-started-in-2021/]Iniciando com Godot[/url].

source: Or level up faster by taking this shortcut
pt: Ou suba de nível mais rápido tomando esse atalho

source: There are loads of free game creation tutorials, but they don't form a clear path.
pt: Existem muitos tutoriais gratuitos de criação de jogos, mas eles não formam um caminho claro.

source: Worse, most of them are like step-by-step recipes. But as you learned, you can't become a developer by just following recipes.
pt: Ou pior, a maioria deles são como receitas de passo a passo. Mas como aprendeu, não se pode fazer um programador apenas seguindo receitas.

source: Every project has unique challenges and requires [i]creative problem solving[/i]. You need to [i]think like a programmer[/i].
pt: Cada projeto tem desafios únicos e requer [i]resolução criativa de problemas[/i]. Precisa [i]pensar como um programador[/i].

source: Learning that on your own can take years.
pt: Aprender isso sozinho pode levar anos.

source: Learn to Code From Zero, with Godot
pt: Aprenda A Programar Do Zero, com Godot

source: This app is the free part of our in-depth course, [url=https://gdquest.mavenseed.com/courses/learn-to-code-from-zero-with-godot][b]Learn to Code From Zero, with Godot[/b][/url].
pt: Esta app é a parte gratuita do nosso curso aprofundado, [url=https://gdquest.mavenseed.com/courses/learn-to-code-from-zero-with-godot][b]Aprenda A Programar Do Zero , com Godot[/b][/url].

source: The course picks up right where this app ends to take you to the point where you can make [i]your[/i] game.
pt: O curso começa exatamente onde esta app termina a levá-lo ao ponto onde possa fazer o [i]seu[/i] jogo.

source: It's the only course that'll truly teach you [i]how to become a game developer[/i] with Godot.
pt: É o único curso que realmente vai te ensinar [i]como se tornar um desenvolvedor de jogos[/i] com Godot.
