Repository: GDQuest/learn-gdscript
Catalog: i18n/*/application.po
Languages: cs, da, de, es, fr, it, ja, pt, ru, ta, tr, uk

source: Stay
cs: Zůstat
da: Bliv
de: Bleiben
es: Quedarse
fr: Rester
it: Rimani
ja: 留まる
pt: Permaneça
ru: Остаться
ta: தங்க
tr: Kal
uk: Залишитися

source: Well done!
cs: Skvělá práce!
da: Flot klaret!
de: Gut gemacht!
es: ¡Bien hecho!
fr: Bien joué !
it: Ben fatto!
ja: よくできました！
pt: Muito bem!
ru: Отличная работа!
ta: நல்லது!
tr: Bu iyiydi!
uk: Молодець!

source: You completed the practice.
cs: Cvičení jste dokončili.
da: Du gennemførte øvelsen.
de: Du hast die Übung abgeschlossen.
es: Has completado la práctica.
fr: Vous avez complété l'exercice pratique.
it: Hai completato la pratica.
ja: 演習をクリアしました。
pt: Você completou a prática.
ru: Вы выполнили упражнение.
ta: நீங்கள் பயிற்சியை முடித்தீர்கள்.
tr: Alıştırmayı tamamladınız.
uk: Ви виконали вправу.

source: [center][b]Stay[/b] and play around, or [b]continue[/b] the course.[/center]
cs: [center][b]Zůstaňte[/b] a hrajte si, nebo [b]pokračujte[/b] v kurzu.[/center]
da: [center][b]Bliv[/b] og leg rundt, eller [b]fortsæt[/b] kurset.[/center]
de: [center][b]Bleib[/b] und spiele herum, oder [b]setze den Kurs fort[/b].[/center]
es: [center][b]Quédate[/b] y experimenta un poco más, o [b]continúa[/b] el curso.[/center]
fr: [center][b]Rester[/b] et pratiquer, ou [b]continuer[/b] le cours.[/center]
it: [center][b]Rimani[/b] e sperimenta, o [b]continua[/b] il corso.[/center]
ja: [center][b]留まる[/b] を押すとここに留まり、 [b]進む[/b] を押すと次のコースに進みます。[/center]
pt: [center][b]Permaneça[/b] e teste a vontade, ou [b]continue[/b] o curso.[/center]
ru: [center]Вы можете [b]остаться[/b] и поэкспериментировать или [b]продолжить[/b] курс.[/center]
ta: [மையம்] [b] தங்கியிருங்கள் [/b] சுற்றி விளையாடுங்கள், அல்லது [b] தொடரவும் [/b] பாடநெறி. [/மையம்]
tr: [center]Burada [b]kalın[/b] ve etrafta vakit geçirin, ya da kursa [b]devam[/b] edin.[/center]
uk: [center]Ви можете [b]залишитись[/b] і поекспериментувати або [b]продовжити[/b] курс.[/center]

source: Practice List
cs: Seznam cvičení
da: Øvelsesliste
de: Übungsliste
es: Lista de prácticas
fr: Liste des exercices pratiques
it: Lista Pratiche
ja: 演習リスト
pt: Lista de Prática
ru: Список упражнений
ta: பயிற்சி பட்டியல்
tr: Alıştırma Listesi
uk: Список вправ

source: Close
cs: Zavřít
da: Luk
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
pt: Fechar
ru: Закрыть
ta: மூடு
tr: Kapat
uk: Закрити

source: Report an issue
cs: Nahlásit problém
da: Rapporter et problem
de: Erstelle eine Problemmeldung
es: Reportar un problema
fr: Signaler un problème
it: Segnala un problema
ja: 問題を報告する
pt: Informe um problema
ru: Сообщить о проблеме
ta: ஒரு சிக்கலைப் புகாரளிக்கவும்
tr: Bir sorun bildirin
uk: Повідомити про проблему

source: If you face an issue in the app, please click the link below to report it on GitHub:
da: Hvis du oplever et problem i appen, skal du klikke på linket nedenfor for at rapportere det på GitHub:
pt: Se encontrar um erro na app, por favor clique na ligação abaixo para informar o erro no GitHub:

source: On that page, you can report any issues, whether something's not working or there's an error in a lesson.
da: På denne side kan du rapportere eventuelle problemer, uanset om noget ikke fungerer, eller der er en fejl i en lektion.
pt: Nessa página pode informar qualquer erro, se tem algo que não está funcionando ou se tiver algum erros em uma lição.

source: You can generate a log to help us identify the problem. To do so, click here: [b][url=download]generate error log[/url][/b].
da: Du kan generere en log, der hjælper os med at identificere problemet. For at gøre det skal du klikke her: [b][url=download]generer fejllog[/url][/b].
pt: Pode gerar um log de informação para nos ajudar a identificar o problema. Para isso, clique aqui: [b][url=download]generate error log[/url][/b].

source: Please drag and drop the generated file onto your issue on GitHub to attach it.
da: Træk og slip den genererede fil til dit problem på GitHub for at vedhæfte den.
pt: Arraste e solte o arquivo gerado do seu problema no GitHub para anexá-lo.

source: [font=res://ui/theme/fonts/font_title.tres]What's GitHub[/font]
da: [font=res://ui/theme/fonts/font_title.tres]Hvad er GitHub[/font]

source: GitHub is an online platform to host and manage open-source projects like the GDScript Learn app. It helps developers organize their work and collaborate online.
da: GitHub er en online platform til at hoste og administrere open source-projekter som GDScript Learn-appen. Den hjælper udviklere med at organisere deres arbejde og samarbejde online.
pt: O GitHub é uma plataforma online para hospedar e gerenciar projetos de código aberto, como a app GDScript Learn. Ele ajuda os desenvolvedores a organizar os seus trabalhos e colaborar online.

source: You can use GitHub to study the source code of many open projects, report issues, or even contribute code yourself.
da: Du kan bruge GitHub til at studere kildekoden til mange åbne projekter, rapportere problemer eller endda selv bidrage med kode.
pt: Pode usar o GitHub para estudar o código-fonte de muitos projetos de código aberto, relatar problemas ou até mesmo contribuir com códigos.

source: [font=res://ui/theme/fonts/font_title.tres]How to report an issue[/font]
da: [font=res://ui/theme/fonts/font_title.tres]Sådan rapporterer du et problem[/font]

source: 1. Click the link above to get to the [i]GitHub Issues[/i] page. 2. Click on the [i]New Issue[/i] button. 3. Fill out the form to tell us more about your problem.
da: 1. Klik på linket ovenfor for at komme til siden [i]GitHub-problemer[/i]. 2. Klik på knappen [i]New Issue[/i]. 3. Udfyld formularen for at fortælle os mere om dit problem.
pt: 1. Clique na ligação acima para acessar a página de [i]Problemas do GitHub[/i]. 2. Clique no botão [i]New Issue[/i]. 3. Preencha o formulário para nos contar mais sobre o seu problema.

source: You will need a GitHub account to do so.
da: Du skal bruge en GitHub-konto for at gøre det.
pt: Vai precisar de uma conta no GitHub para fazer isso.

source: Please add as much relevant information as possible, such as the kind of device you're using to access the app, and maybe attach a screenshot or video clip showcasing the issue.
da: Tilføj venligst så mange relevante oplysninger som muligt, f.eks. hvilken type enhed du bruger til at få adgang til appen, og vedhæft eventuelt et skærmbillede eller videoklip, der viser problemet.
pt: Adicione o máximo de informações relevantes possível, como o tipo de dispositivo que usa para aceder a app e se possível anexe uma captura de tela ou videoclipe mostrando o problema.

source: [center]Thank you for contributing to open source![/center]
da: [center]Tak for dit bidrag til open source![/center]
pt: [center]Obrigado por contribuir com o código aberto![/center]

source: Configure the App
cs: Nakonfigurujte aplikaci
da: Konfigurer App'en
de: Konfigurieren der App
es: Configurar la aplicación
fr: Configurer l'application
it: Configura l'Applicazione
ja: アプリの設定
pt: Configure a App
ru: Настроить приложение
ta: பயன்பாட்டை உள்ளமைக்கவும்
tr: Uygulamayı Yapılandır
uk: Налаштувати застосунок

source: Language
cs: Jazyk
da: Sprog
de: Sprache
es: Idioma
fr: Langue
it: Lingua
ja: 言語
pt: Língua
ru: Язык
ta: மொழி
tr: Dil
uk: Мова

source: Text Size
cs: Velikost textu
da: Tekststørrelse
de: Schriftgröße
es: Tamaño del texto
fr: Taille du texte
it: Grandezza Testo
ja: テキストサイズ
pt: Tamanho do Texto
ru: Размер текста
ta: உரை அளவு
tr: Metin Boyutu
uk: Розмір тексту

source: Sample text
cs: Ukázka textu
da: Eksempeltekst
de: Mustertext
es: Texto de muestra
fr: Texte d'exemple
it: Testo esempio
ja: サンプルテキスト
pt: Texto de Exemplo
ru: Пример текста
ta: மாதிரி உரை
tr: Örnek metin
uk: Приклад тексту

source: Scroll sensitivity
cs: Citlivost rolování
da: Rulle følsomhed
de: Scroll-Empfindlichkeit
es: Sensibilidad de desplazamiento
fr: Sensibilité du défilement
it: Sensitività di scorrimento
ja: スクロール感度
pt: Sensibilidade de rolagem
ru: Чувствительность прокрутки
ta: உருள் உணர்திறன்
tr: Kaydırma hassasiyeti
uk: Чутливість прокручування

source: Framerate cap
cs: Omezení snímkové frekvence
da: Billedopdateringsgrænse
de: Framerate-Obergrenze
es: Límite de velocidad de fotogramas
fr: Limite d'images par seconde
it: Limite di framerate
ja: フレームレート制限
pt: Limite de taxa de quadros
ru: Ограничение частоты кадров
ta: கேப்
tr: Kare hızı sınırı
uk: Обмеження частоти кадрів

source: Lower contrast
cs: Nižší kontrast
da: Sænk kontrast
de: Weniger Kontrast
es: Bajar el contraste
fr: Contraste plus faible
it: Contrasto inferiore
ja: コントラストが低い
ru: Понизить контрастность
ta: குறைந்த மாறுபாடு
tr: Düşük zıtlık
uk: Знизити контрастність

source: Dyslexia Font
da: Ordblinde Skrifttype

source: Apply
cs: Použít
da: Accepter
de: Übernehmen
es: Aplicar
fr: Appliquer
it: Applica
ja: 適用
pt: Aplicar
ru: Применить
ta: இடு
tr: Uygula
uk: Застосувати

source: Open Lesson
cs: Otevřít lekci
da: Åben Lektion
de: Lektion öffnen
es: Abrir lección
fr: Ouvrir la leçon
it: Apri Lezione
ja: レッスンを開始する
pt: Lição Aberta
ru: Открыть урок
ta: திறந்த பாடம்
tr: Dersi Aç
uk: Відкрити урок

source: Continue Lesson
cs: Pokračovat v lekci
da: Fortsæt Lektion
de: Lektion fortsetzen
es: Continuar con la lección
fr: Continuer la leçon
it: Continua Lezione
ja: 次のレッスンに進む
pt: Continue a Lição
ru: Продолжить урок
ta: பாடத்தைத் தொடரவும்
tr: Derse Devam Et
uk: Продовжити урок

source: Start Lesson
cs: Spustit lekci
da: Begynd Lektion
de: Lektion starten
es: Iniciar lección
fr: Commencer la leçon
it: Inizia Lezione
ja: レッスン開始
pt: Inicie a Lição
ru: Начать урок
ta: பாடத்தைத் தொடங்கவும்
tr: Dersi Başlat
uk: Почати урок

source: Lesson Title Goes Here
cs: Název lekce patří sem
da: Lektionstitel kommer her
de: Der Titel der Lektion steht hier
es: El título de la lección va aquí
fr: Le titre de la leçon apparaît ici
it: Il Titolo Della Lezione Va Qui
ja: レッスンの表紙はこちら
pt: O Título da Lição Vai Aqui
ru: Название урока находится здесь
ta: பாடம் தலைப்பு இங்கே செல்கிறது
tr: Ders Başlığı Buraya Gelecek
uk: Тут зазначено назву уроку

source: Lesson read
cs: Lekce přečtena
da: Lektion læst
de: Lektion gelesen
es: Lectura de la lección
fr: Leçon lue
it: Leggi lezione
ja: レッスンを読む
pt: Leitura da lição
ru: Прогресс чтения
ta: பாடம் படித்தது
tr: Okunan Ders Metni
uk: Поступ читання

source: Quizzes completed
cs: Kvízy dokončeny
da: Quizzer afsluttet
de: Abgeschlossene Quizze
es: Quices completados
fr: Quiz complétés
it: Quiz completati
ja: クイズをクリア
pt: Testes concluídos
ru: Тестов пройдено
ta: நொடி வினாக்கள் முடிந்தது
tr: Tamamlanan Kısa Sınavlar
uk: Пройдено тестів

source: Practices completed
cs: Cvičení dokončena
da: Øvelser afsluttet
de: Abgeschlossene Übungen
es: Prácticas completadas
fr: Exercices pratiques complétés
it: Pratiche completate
ja: 演習をクリア
pt: Práticas concluídas
ru: Упражнений выполнено
ta: நடைமுறைகள் முடிந்தது
tr: Tamamlanan Alıştırmalar
uk: Виконано вправ

source: Lesson 0
cs: Lekce 0
da: Lektion 0
de: Lektion 0
es: Lección 0
fr: Leçon 0
it: Lezione 0
ja: レッスン 0
pt: Lição 0
ru: Урок 0
ta: பாடம் 0
tr: Ders 0
uk: Урок 0

source: Lesson Title
cs: Název lekce
da: Lektionstitel
de: Lektion Titel
es: Título de la Lección
fr: Titre de la leçon
it: Titolo Lezione
ja: レッスン表紙
pt: Título da Lição
ru: Название урока
ta: பாடம் தலைப்பு
tr: Ders Başlığı
uk: Тема уроку

source: Course Index -
cs: Index kurzu -
da: Kursusindeks -
de: Kurs-Index -
es: Índice del curso -
fr: Index du cours -
it: Indice Corso -
ja: コース番号 -
pt: Índice do Curso -
ru: Содержание курса -
ta: பாடநெறி அட்டவணை -
tr: Ders Listesi -
uk: Зміст курсу -

source: Course Title Goes Here
cs: Název kurzu patří sem
da: Kursustitel Kommer Her
de: Kurstitel steht hier
es: El título del curso va aquí
fr: Le titre du cours apparaît ici
it: Il Titolo Del Corso Va Qui
ja: コース表紙はこちら
pt: Título do Curso Vai Aqui
ru: Название курса находится здесь
ta: பாடநெறி தலைப்பு இங்கே செல்கிறது
tr: Ders Adı Buraya Gelecek
uk: Тут зазначено назву курсу

source: Reset Progress
cs: Resetovat průběh
da: Nulstil Fremskridt
de: Fortschritt zurücksetzen
es: Reiniciar progreso
fr: Réinitialiser la progression
it: Azzera Progresso
ja: 進捗をリセットする
pt: Redefinir Progresso
ru: Сбросить прогресс
ta: முன்னேற்றத்தை மீட்டமை
tr: İlerlemeyi Sıfırla
uk: Скинути поступ

source: Confirm Resetting Progress
cs: Potvrďte Resetování Průběhu
da: Bekræft Nulstilling af fremskridt
de: Zurücksetzen bestätigen
es: Confirmar reiniciar el progreso
fr: Confirmer la réinitialisation de la progression
it: Conferma Azzeramento Progresso
ja: 進捗リセットの確認
pt: Confirme a Redefinição do Progresso
ru: Подтвердите сброс прогресса
ta: முன்னேற்றத்தை மீட்டமைப்பதை உறுதிப்படுத்தவும்
tr: Sıfırlama İşlemini Onayla
uk: Підтвердьте скидання поступу

source: YOU MADE IT!
cs: DOKÁZALI JSTE TO!
da: DU GJORDE DET!
de: DU HAST ES GESCHAFFT!
es: ¡LO LOGRASTE!
fr: VOUS AVEZ RÉUSSI !
ja: 作成完了！
ru: ВЫ СДЕЛАЛИ ЭТО!
ta: நீங்கள் அதை செய்தீர்கள்!
tr: BAŞARDIN!
uk: ВИ ЦЕ ЗРОБИЛИ!

source: Not only did you learn the foundations of coding, you’re a big step closer to making your own games.
cs: Nejen, že jste se naučili základy kódování, ale také jste o velký krok blíž k výrobě vlastních her.
da: Ikke alene lærte du det grundlæggende i kodning, du er også et stort skridt tættere på at lave dine egne spil.
de: Du hast nicht nur die Grundlagen des Programmierens gelernt, sondern bist auch einen großen Schritt näher an der Entwicklung deiner eigenen Spiele.
es: No sólo has aprendido los fundamentos de la programación, sino que estás un paso más cerca de crear tus propios juegos.
ja: コーディングの基礎を学んだだけでなく、独自のゲームの作成に大きく一歩近づきました。
ru: Вы не только изучили основы программирования, так ещё и приблизились на шаг ближе к созданию своих игр.
ta: குறியீட்டின் அச்திவாரங்களை நீங்கள் கற்றுக்கொண்டது மட்டுமல்லாமல், உங்கள் சொந்த விளையாட்டுகளை உருவாக்குவதற்கு நீங்கள் ஒரு பெரிய படியாகும்.
tr: Sadece kodlamanın temellerini öğrenmediniz, kendi oyununuzu yapmaya doğru büyük bir adım daha attınız.
uk: Ви не лише вивчили основи програмування, але й наблизилися на крок до створення власних ігор.

source: Don't stop here...
cs: Nezastavujte se zde...
da: Stop ikke her...
de: Hör hier nicht auf...
es: No te pares aquí...
fr: Ne vous arrêtez pas là...
ja: ここで止まらないでください...
ru: Не останавливайтесь здесь...
ta: இங்கே நிறுத்த வேண்டாம் ...
tr: Burada bırakmayın...
uk: Не зупиняйтеся тут...

source: The fun stuff starts now!
cs: Zábava začíná právě teď!
da: De sjove ting starter nu!
de: Der Spaß beginnt gerade erst!
es: ¡Lo divertido empieza ahora!
ja: 楽しいことが今始まります！
ru: Всё самое интересное только начинается!
ta: வேடிக்கையான விசயங்கள் இப்போது தொடங்குகின்றன!
tr: Eğlence daha yeni başlıyor!
uk: Все найцікавіше лише починається!

source: There are 2 pathways learners traditionally take from here:
cs: Odtud se studenti tradičně vydávají dvěma cestami:
da: Der er 2 veje, som elever traditionelt tager herfra:
de: Es gibt 2 Wege, die Lernende von hier aus üblicherweise einschlagen:
es: A partir de aquí, los alumnos tradicionalmente siguen dos caminos:
ja: ここから学習者が伝統的にたどる経路は 2 つあります。
ru: Чаще всего, здесь учащиеся выбирают один из двух путей:
ta: பாரம்பரியமாக இங்கிருந்து 2 பாதைகள் கற்பவர்கள் உள்ளனர்:
tr: Bir öğrenici olarak, buradan itibaren takip edebileceğiniz 2 geleneksel yol var:
uk: Найчастіше тут учні обирають один із двох шляхів:

source: Following video tutorials
cs: Sledování videonávodů
da: Følgende videovejledninger
de: Videoanleitungen anschauen
es: Seguir tutoriales en vídeo
ja: ビデオチュートリアルに従ってください
ru: Следовать видеоурокам
ta: வீடியோ டுடோரியல்களைத் தொடர்ந்து
tr: Video öğreticileri takip etmek
uk: Дотримуватися відеоуроків

source: They’re a great way to pick up specific game mechanics but they’re not as effective when you’re trying to learn new skills from the ground up.
cs: Jsou skvělým způsobem, jak si osvojit konkrétní herní mechanismy, ale nejsou tak efektivní, když se snažíte naučit nové dovednosti od základů.
da: De er en fantastisk måde at lære specifikke spilmekanikker på, men de er ikke lige så effektive, når du prøver at lære nye færdigheder fra bunden.
de: Die sind sehr hilfreich, wenn du unterschiedliche Gamemechaniken kennenlernen willst aber nicht so effektiv wenn du etwas neues von Grund auf lernen möchtest.
es: Son una buena forma de aprender mecánicas de juego específicas, pero no son tan eficaces cuando tratas de aprender nuevas habilidades desde cero.
ja: これらは特定のゲームの仕組みを理解するのに最適な方法ですが、新しいスキルを一から学ぼうとする場合にはそれほど効果的ではありません。
ru: Они являются отличным способом понять конкретные игровые механики, но не так эффективны, когда пытаешься выучить новые навыки с нуля.
ta: குறிப்பிட்ட விளையாட்டு இயக்கவியலை எடுக்க அவை ஒரு சிறந்த வழியாகும், ஆனால் நீங்கள் புதிய திறன்களை தரையில் இருந்து கற்றுக்கொள்ள முயற்சிக்கும்போது அவை பயனுள்ளதாக இல்லை.
tr: Bunlar belirli bir oyun mekaniğini seçip öğrenmek için harika yollardır, ama sıfırdan yeni bir yetenek kazanmaya çalışırken o kadar da etkili değillerdir.
uk: Вони - це чудовий спосіб зрозуміти конкретні ігрові механіки, але не такі ефективні, коли намагаєшся вивчити нові навички з нуля.

source: • There’s no clear learning path.
cs: • Neexistuje žádný jasný způsob učení.
da: • Der er ingen klar læringsvej.
de: • Es gibt nicht die einzig richtige Lernmethode.
es: • No hay una ruta de aprendizaje clara.
ja: • 明確な学習経路はありません。
ru: • Нет четкого и ясного пути изучения.
ta: • தெளிவான கற்றல் பாதை இல்லை.
tr: • belirgin bir öğrenme çizgileri yoktur.
uk: • Немає чіткого шляху вивчення.

source: • Retention and skill acquisition is slow and limited.
cs: • Udržování a získávání dovedností je pomalé a omezené.
da: • Fastholdelse og tilegnelse af færdigheder er langsom og begrænset.
de: • Langfristiges Merken und Fähigkeitsgewinn ist langsam und limitiert.
es: • La retención y la adquisición de competencias son lentas y limitadas.
ja: • スキルの保持と習得は遅く、限られています。
ru: • Запоминание и приобретение навыков медленно и ограниченно.
ta: • தக்கவைத்தல் மற்றும் திறன் கையகப்படுத்தல் மெதுவாகவும் குறைவாகவும் உள்ளது.
tr: - Konu hakimiyeti ve beceri kazanımı yavaş ve sınırlıdır.
uk: • Запам'ятовування та набуття навичок повільне та обмежене.

source: We make our fair share of [b][color=#ebc3ff][url=https://www.youtube.com/@Gdquest/videos]free tutorials[/url][/color][/b]. They will come in very handy once you start making games on your own. But to get started, we really recommend you learn how to think like a game developer using [b][color=#ebc3ff][url=https://school.gdquest.com/godot-4-early-access]courses[/url][/color][/b].
cs: Na [b][color=#ebc3ff][url=https://www.youtube.com/@Gdquest/videos]bezplatných výukových programů[/url][/color][/b]. Budou se vám velmi hodit, až začnete hry vytvářet sami. Pro začátek vám ale opravdu doporučujeme naučit se myslet jako herní vývojář pomocí [b][color=#ebc3ff][url=https://school.gdquest.com/godot-4-early-access]kurzů[/url][/color][/b].
da: Vi sørger for vores andel af [b][color=#ebc3ff][url=https://www.youtube.com/@Gdquest/videos]gratis vejledninger[/url][/color][/b]. De vil være meget nyttige, når du begynder at lave spil på egen hånd. Men for at komme i gang anbefaler vi virkelig, at du lærer at tænke som en spiludvikler ved hjælp af [b][color=#ebc3ff][url=https://school.gdquest.com/godot-4-early-access]kurser[/url][/color][/b].
es: Hacemos muchos [b][color=#ebc3ff][url=https://www.youtube.com/@Gdquest/videos]tutoriales gratuitos[/url][/color][/b]. Te serán muy útiles cuando empieces a crear juegos solo. Pero para empezar, te recomendamos que aprendas a pensar como un desarrollador de juegos mediante [b][color=#ebc3ff][url=https://school.gdquest.com/godot-4-early-access]cursos[/url][/color][/b].
ja: [b][color=#ebc3ff][url=https://www.youtube.com/@Gdquest/videos]無料チュートリアル[/url][/color][/b]を公平に提供しています。 自分でゲームを作り始めると非常に便利になります。 ただし、始めるには、[b][color=#ebc3ff][url=https://school.gdquest.com/godot-4-early-access]コースを使用してゲーム開発者のように考える方法を学ぶことを強くお勧めします。 [/url][/color][/b]。
ru: Мы сами делаем большое количество [b][color=#ebc3ff][url=https://www.youtube.com/@Gdquest/videos]бесплатных видеоуроков[/url][/color][/b]. Они вам очень пригодятся, когда вы начнете делать собственные игры. Но для начала, мы очень рекомендуем вам научиться думать как разработчик игр, следуя [b][color=#ebc3ff][url=https://school.gdquest.com/godot-4-early-access]курсам[/url][/color][/b].
ta: [B] [color =#ebc3ff] [url = https: //www.youtube.com/@gdquest/videos] இலவச பயிற்சிகள் [/url] [/வண்ணம்] [/b] ஆகியவற்றின் நியாயமான பங்கை நாங்கள் செய்கிறோம். நீங்கள் சொந்தமாக விளையாட்டுகளை உருவாக்கத் தொடங்கியவுடன் அவை மிகவும் எளிது. ஆனால் தொடங்குவதற்கு, [b] [color =#ebc3ff] [url = https: //school.gdquest.com/godot-4-early-access] படிப்புகளைப் பயன்படுத்தி ஒரு விளையாட்டு உருவாக்குநரைப் போல எப்படி சிந்திக்க வேண்டும் என்பதை அறிய நாங்கள் பரிந்துரைக்கிறோம் [ /url] [/color] [/b].
tr: Biz de [b][color=#ebc3ff][url=https://www.youtube.com/@Gdquest/videos]ücretsiz öğreticiler[/url][/color][/b] konusunda kendi payımıza düşeni yapıyoruz.Bunlar, kendi başınıza oyun yapmaya başladığınızda çok kullanışlı olacaklar. Ancak başlangıç için, bir oyun geliştiricisi gibi düşünmeyi öğrenmenizi amaçlayan [b][color=#ebc3ff][url=https://school.gdquest.com/godot-4-early-access]buradaki kursları[/url][/color][/b] kullanmanızı gerçekten tavsiye ederiz.
uk: Ми самі робимо багато [b][color=#ebc3ff][url=https://www.youtube.com/@Gdquest/videos]безплатних відеоуроків[/url][/color][/b]. Вони вам дуже згодяться, коли ви почнете робити власні ігри. Але для початку, ми дуже радимо вам навчитися думати як розробник ігор, пройшовши [b][color=#ebc3ff][url=https://school.gdquest.com/godot-4-early-access]курси[/url][/color][/b].

source: Learning with courses
cs: Učení se pomocí kurzů
da: Læring ved kurser
de: Lernen mit Kursen
es: Aprender con cursos
ja: コースで学ぶ
ru: Обучение с курсами
ta: படிப்புகளுடன் கற்றல்
tr: Kurslarla öğrenme
uk: Навчання за курсами

source: Note that most available courses online are actually premium series of video tutorials. The problem of retaining information and acquiring real skills unfortunately still applies to them.
cs: Všimněte si, že většina dostupných online kurzů jsou ve skutečnosti prémiové série videokurzů. Problém s udržením informací a získáním skutečných dovedností se jich bohužel stále týká.
da: Bemærk, at de fleste tilgængelige kurser online faktisk er førsteklasses video serie vejledninger. Problemet med at huske information og tilegne sig reelle færdigheder gælder desværre stadig for dem.
de: Dabei musst du dir bewusst sein, dass die meisten Online Kurse Premiumversionen von Videotutorials sind. Das Problem des Merkens und Fähigkeiten aufnehmen besteht auch hier.
es: Tenga en cuenta que la mayoría de los cursos disponibles en línea son en realidad series premium de tutoriales en vídeo. Lamentablemente, el problema de la retención de información y la adquisición de habilidades reales sigue siendo válido para ellos.
ja: オンラインで利用できるほとんどのコースは、実際にはビデオ チュートリアルのプレミアム シリーズであることに注意してください。 情報を保持し、実際のスキルを習得するという問題は、残念なことに依然として彼らに当てはまります。
ru: Обратите внимание, что большинство доступных онлайн курсов на самом деле являются просто премиум сериями видеоуроков. Проблема запоминания информации и получения реальных умений к сожалению всё еще стоит.
ta: ஆன்லைனில் கிடைக்கக்கூடிய பெரும்பாலான படிப்புகள் உண்மையில் வீடியோ டுடோரியல்களின் காப்பீடு தொடர் என்பதை நினைவில் கொள்க. தகவல்களைத் தக்கவைத்துக்கொள்வது மற்றும் உண்மையான திறன்களைப் பெறுவதில் சிக்கல் துரதிர்ச்டவசமாக அவர்களுக்கு இன்னும் பொருந்தும்.
tr: İnternette mevcut kursların çoğunun aslında premium video eğitim serileri olduğuna dikkat edin. Bilgiyi akılda tutma ve gerçek beceriler edinme sorunu ne yazık ki onlar için de geçerlidir.
uk: Зверніть увагу, що більшість доступних онлайнових курсів насправді є просто преміум-серіями відеоуроків. Проблема запам'ятовування інформації та отримання реальних умінь, на жаль, залишається.
