Repository: GDQuest/learn-gdscript
Catalog: i18n/*/application.po
Languages: cs, da, de, es, fr, it, ja, pt, ru, ta, tr, uk

source: At GDQuest, we’re educators at heart. We believe in applied study and we believe it doesn’t have to be boring. When teaching is done correctly, most people highly enjoy the sensation of leveling up!
da: Hos GDQuest er vi undervisere i hjertet. Vi tror på anvendt studie, og vi mener, at det ikke behøver at være kedeligt. Når undervisningen udføres korrekt, nyder de fleste mennesker følelsen af at stige i niveau!

source: That’s the reason we made this app. It is in fact part of our beginner course [b][color=#ebc3ff][url=https://school.gdquest.com/products/bundle_learn_gamedev_godot_4]Learn Gamedev From Zero with Godot[/url][/color][/b].
da: Det er grunden til, at vi lavede denne app. Det er faktisk en del af vores begynderkursus [b][farve=#ebc3ff][url=https://school.gdquest.com/products/bundle_learn_gamedev_godot_4]Lær Gamedev From Zero med Godot[/url][/farve][/b].

source: LEARN GAMEDEV WITH GODOT
cs: NAUČTE SE GAMEDEV S GODOTEM
da: LÆR GAMEDEV MED GODOT
de: SPIELEENTWICKLUNG LERNEN MIT GODOT
es: APRENDA GAMEDEV CON GODOT
ja: GODOT で ゲーム開発を学ぶ
ru: НАУЧИТЕСЬ СОЗДАВАТЬ ИГРЫ С GODOT
ta: கோடோட்டுடன் கேமடேவ் கற்றுக்கொள்ளுங்கள்
uk: НАВЧИТЬСЯ СТВОРЮВАТИ ІГРИ З GODOT

source: Now available
cs: Nyní k dispozici
da: Tilgængelig nu
de: Jetzt verfügbar
es: Ya disponible
ja: 現在利用可能です
ru: Теперь доступно
ta: இப்போது கிடைக்கிறது
tr: Artık kullanımda
uk: Тепер доступно

source: for preorders
cs: pro předobjednávky
da: for forudbestillinger
de: zum vorbestellen
es: para pedidos anticipados
ja: 予約注文用
ru: для предзаказов
ta: முன்பதிவுகளுக்கு
tr: ön siparişler için
uk: для передзамовлень

source: Godot 4 courses!!
cs: Godot 4 kurzy!!
da: Godot 4 kurser!!
de: Godot 4 Kurse!!
es: ¡Cursos de Godot 4!
ja: Godot 4コース!!
ru: Курсы по Godot 4!!
ta: கோடோட் 4 படிப்புகள் !!
tr: Godot 4 kursları!!
uk: Курси з Godot 4!!

source: Teaching gamedev in the classroom?
cs: Výuka vývoje her ve třídě?
da: Undervisning i spiludvikling i klasseværelset?
de: Videospielentwicklung im Klassenzimmer beibringen?
es: ¿Enseñas videojuegos en clase?
ja: 教室でゲーム開発者を教えていますか?
ru: Преподаёте геймдев в школе?
ta: வகுப்பறையில் கேமேடேவ் கற்பிக்கிறீர்களா?
tr: Oyun geliştirmeyi sınıfta mı öğretmek?
uk: Викладаєте геймдев у школі?

source: Get in touch
cs: Spojte se s námi
da: Kom i kontakt
de: Kontaktiere uns
es: Ponte en contacto
ja: 連絡する
ru: Связаться
ta: தொடர்பு கொள்ளுங்கள்
tr: İletişime geçin
uk: Зв'язатися

source: Congratulations!
cs: Gratulujeme!
da: Tillykke!
de: Glückwunsch!
es: Felicitaciones!
fr: Félicitations !
it: Congratulazioni!
ja: おめでとうございます！
pt: Parabéns!
ru: Поздравляем!
ta: வாழ்த்துக்கள்!
tr: Tebrikler!
uk: Вітаємо!

source: You completed Learn GDScript From Zero. You now have the basics you need to make games with the Godot game engine.
da: Du har gennemført Learn GDScript From Zero. Du har nu det grundlæggende, du skal bruge for at lave spil med Godot-spilmotoren.

source: You can keep learning with the free series [url=https://docs.godotengine.org/en/stable/getting_started/step_by_step/index.html]Getting Started with Godot[/url].
da: Du kan fortsætte med at lære med den gratis serie [url=https://docs.godotengine.org/en/table/getting_started/step_by_step/index.html] Kom i gang med Godot[/url].

source: This is an Open-Source project!
cs: Jedná se o Open-Source projekt!
da: Dette er et Open-Source projekt!
de: Das ist ein Open-Source Projekt!
es: Este proyecto es de código abierto.
fr: Il s'agit d'un projet Open-Source !
it: Questo è un progetto Open-Source!
ja: これはオープンソース プロジェクトです！
ru: Это проект с открытым исходным кодом!
ta: இது ஒரு திறந்த மூல திட்டம்!
tr: Bu bir Açık-Kaynak projedir!
uk: Це проєкт із відкритим сирцевим кодом!

source: Like Godot, this app and course is free and open-source.
da: Ligesom Godot er denne app og dette kursus gratis og open source.

source: You can find the app's source code and contribute translations here: [url=https://github.com/GDQuest/learn-gdscript]Learn GDScript From Zero (Github repository)[/url].
da: Du kan finde appens kildekode og bidrage til oversættelser her: [url=https://github.com/GDQuest/learn-gdscript]Lær GDScript From Zero (Github-lager)[/url].

source: Early Access release: 2024/01/30
cs: Vydání v režimu předběžného přístupu: 2024/01/30
da: Tidlig adgangsudgivelse: 2024/01/30
de: Frühe Beta-Version: 30.01.2024
es: Versión beta temprana
ja: 早期アクセスリリース: 2024/01/30
ru: Релиз Раннего Доступа: 30.01.2024
ta: ஆரம்ப அணுகல் வெளியீடு: 2024/01/30
tr: Erken Erişim sürümü: 2024/01/30
uk: Випуск раннього доступу: 30.01.2024

source: [b]Question[/b]
cs: [b]Dotaz[/b]
da: [b]Spørgsmål[/b]
de: [b]Frage[/b]
es: [b]Pregunta[/b]
it: [b]Domanda[/b]
ja: [b]質問[/b]
pt: [b]Perguntas[/b]
ru: [b]Вопрос[/b]
ta: [b] கேள்வி [/b]
tr: [b]Soru[/b]
uk: [b]Питання[/b]

source: Explanation
cs: Vysvětlení
da: Forklaring
de: Erklärung
es: Explicación
fr: Explication
it: Spiegazione
ja: 説明
pt: Explicações
ru: Объяснение
ta: விளக்கம்
tr: Açıklama
uk: Пояснення

source: Skip
cs: Přeskočit
da: Spring
de: Überspringen
es: Saltar
fr: Passer
it: Salta
ja: スキップ
pt: Pular
ru: Пропустить
ta: தவிர்
tr: Atla
uk: Пропустити

source: Submit
cs: Odeslat
da: Indsend
de: Senden
es: Enviar
fr: Envoyer
it: Invia
ja: 提出
pt: Enviar
ru: Принять
ta: சமர்ப்பிக்கவும்
tr: Gönder
uk: Надіслати

source: You're right!
cs: Máš pravdu!
da: Du har ret!
de: Richtig!
es: ¡Estás en lo cierto!
fr: C'est juste !
it: Ben fatto!
ja: 正解！
pt: Tem razão!
ru: Все верно!
ta: நீங்கள் சொல்வது சரிதான்!
tr: Doğru bildiniz!
uk: Все правильно!

source: Answers here
cs: Odpovědi zde
da: Svar her
de: Antworten hier
es: Respuestas aquí
fr: Répondez ici
it: Le risposte qui
ja: 答えはこちら
pt: Respostas vão aqui
ru: Ответы здесь
ta: இங்கே பதில்கள்
tr: Cevabınızı buraya yazın
uk: Відповіді тут

source: Learn More
cs: Dozvědět se více
da: Lær mere
de: Mehr erfahren
es: Aprende más
fr: En savoir plus
it: Impara Di Più
ja: もっと学ぶ
pt: Aprenda Mais
ru: Узнать больше
ta: மேலும் அறிக
tr: Daha Fazlasını Öğrenin
uk: Дізнатись більше

source: Placeholder heading
cs: Zástupný nadpis
da: Midlertidig overskrift
de: Platzhalter-Überschrift
es: Título de relleno
fr: Titre temporaire
it: Intestazione tappabuchi
ja: プレースホルダーの見出し
pt: Título das dicas de texto
ru: Заполнитель заголовка
ta: ஒதுக்கிட தலைப்பு
tr: Yer tutucu başlık
uk: Заповнювач заголовка

source: Practice title
cs: Název cvičení
da: Øvelsestitel
de: Übungstitel
es: Título de la práctica
fr: Titre de l'exercice pratique
it: Titolo pratica
ja: 演習タイトル
pt: Título da prática
ru: Название упражнения
ta: பயிற்சி தலைப்பு
tr: Alıştırma başlığı
uk: Назва вправи

source: next
cs: další
da: næste
de: als nächstes
es: siguiente
fr: suivant
it: prossimo
ja: 次
pt: próximo
ru: далее
ta: அடுத்தது
tr: sonraki
uk: далі

source: Practice
cs: Cvičení
da: Øvelse
de: Üben
es: Práctica
fr: Exercice pratique
it: Pratica
ja: 演習
pt: Prática
ru: Упражнение
ta: பயிற்சி
tr: Alıştırma
uk: Вправа

source: You are here
cs: Nacházíte se zde
da: Du er her
de: Du bist hier
es: Estás aquí
fr: Vous êtes ici
it: Tu sei qui
ja: あなたはこちら
pt: Você está aqui
ru: Вы здесь
ta: நீங்கள் இங்கே இருக்கிறீர்கள்
tr: Buradasınız
uk: Ви тут

source: Answer label
cs: Štítek odpovědi
da: Svaretiket
de: Anzeigefläche der Antwort
es: Etiqueta de respuesta
fr: Étiquette de la réponse
it: Nome della risposta
ja: 答えのラベル
pt: Texto de Resposta
ru: Поле ответа
ta: பதில் சிட்டை
tr: Cevap etiketi
uk: Поле відповіді

source: (select all that apply)
cs: (vyberte vše, co platí)
da: (vælg alle relevante)
de: (wähle alle zutreffenden Antworten aus)
es: (selecciona todas las que correspondan)
fr: (sélectionnez toutes les réponses qui s'appliquent)
it: (seleziona tutto ciò che è pertinente)
ja: (該当するものをすべて選択)
pt: (selecione todos que se aplicam)
ru: (выберите все правильные ответы)
ta: (பொருந்தும் அனைத்தையும் தேர்ந்தெடுக்கவும்)
tr: (geçerli olanların tümünü seç)
uk: (виберіть усі правильні відповіді)

source: Show Hint
cs: Zobrazit Tip
da: Vis Hint
de: Hinweis anzeigen
es: Mostrar pista
fr: Afficher l'indice
it: Mostra Suggerimento
ja: ヒントを表示
pt: Mostrar Dicas
ru: Показать подсказку
ta: குறிப்பைக் காட்டு
tr: İpucu Göster
uk: Показати підказку

source: Method descriptions
cs: Popisy metod
da: Metodebeskrivelse
de: Methodenbeschreibungen
es: Descripciones de los métodos
fr: Descriptions des méthodes
it: Descrizioni delle funzioni
ja: メソッドの説明
pt: Descrições do método
ru: Описания методов
ta: முறை விளக்கங்கள்
tr: Yöntem açıklamaları
uk: Описи методів

source: Property descriptions
cs: Popisy Vlastností
da: Egenskabsbeskrivelse
de: Objektbeschreibungen
es: Descripciones de las propiedades
fr: Descriptions des propriétés
it: Descrizioni delle proprietà
ja: プロパティの説明
pt: Descrições de propriedades
ru: Описания свойств
ta: சொத்து விளக்கங்கள்
tr: Özellik açıklamaları
uk: Описи властивостей

source: Summary - Lesson Name
cs: Shrnutí - Název lekce
da: Resumé - Lektions Navn
de: Zusammenfassung - Name der Lektion
es: Resumen - Nombre de la lección
fr: Résumé - Nom de la leçon
it: Sommario - Nome Lezione
ja: まとめ - レッスン名
pt: Sumário - Nome da Lição
ru: Краткий обзор - Название урока
ta: சுருக்கம் - பாடம் பெயர்
tr: Özet - Ders Adı
uk: Огляд - Назва уроку

source: Goals
cs: Cíle
da: Mål
de: Ziele
es: Objetivos
fr: Objectifs
it: Obiettivi
ja: 目標
pt: Objetivos
ru: Цели
ta: இலக்குகள்
tr: Hedefler
uk: Цілі

source: Documentation
cs: Dokumentace
da: Dokumentation
de: Dokumentation
es: Documentación
it: Documentazione
ja: ドキュメント化
pt: Documentação
ru: Документация
ta: ஆவணப்படுத்துதல்
tr: Belgeler
uk: Документація

source: Open Practice List
cs: Otevřít seznam cvičení
da: Åben Øvelsesliste
de: Öffne Übungsliste
es: Abrir lista de prácticas
fr: Ouvrir la liste des exercices pratiques
it: Apri Lista Pratiche
ja: 演習リストを開く
pt: Abrir a Lista de Prática
ru: Открыть список упражнений
ta: திறந்திருக்கும் பயிற்சி பட்டியல்
tr: Alıştırma Listesini Aç
uk: Відкрити список вправ

source: Test text
cs: Zkušební text
da: Test tekst
es: Texto de prueba
fr: Texte du test
it: Testo di prova
ja: テストテキスト
pt: Texto de teste
ru: Тестовый текст
ta: சோதனை உரை
tr: Test yazısı
uk: Тестовий текст

source: CONTINUE
cs: POKRAČOVAT
da: FORTSÆT
de: FORTSETZEN
es: CONTINUAR
fr: CONTINUER
it: CONTINUA
ja: 続ける
pt: CONTINUAR
ru: ПРОДОЛЖИТЬ
ta: தொடரவும்
tr: DEVAM ET
uk: ПРОДОВЖИТИ

source: SELECT LESSON
cs: VYBERTE LEKCI
da: VÆLG LEKTION
de: LEKTION AUSWÄHLEN
es: SELECCIONAR LECCIÓN
fr: SÉLECTIONNER LA LEÇON
it: SELEZIONA LEZIONE
ja: レッスンを選択
pt: SELECIONE A LIÇÃO
ru: ВЫБРАТЬ УРОК
ta: பாடத்தைத் தேர்ந்தெடுக்கவும்
tr: DERS SEÇ
uk: ВИБРАТИ УРОК

source: OPTIONS
cs: NASTAVENÍ
da: INDSTILLINGER
de: OPTIONEN
es: OPCIONES
it: OPZIONI
ja: オプション
pt: OPÇÕES
ru: ОПЦИИ
ta: விருப்பங்கள்
tr: SEÇENEKLER
uk: ОПЦІЇ

source: QUIT
cs: KONEC
da: AFSLUT
de: BEENDEN
es: CERRAR
fr: QUITTER
it: ESCI
ja: やめる
pt: SAIR
ru: ВЫХОД
ta: வெளியேறு
tr: ÇIKIŞ
uk: ВИХІД

source: An open source project by [url=https://www.gdquest.com/]GDQuest.com[/url]
da: Et open source projekt af [url=https://www.gdquest.com/]GDQuest.com[/url]
es: Un proyecto open source por [url=https://www.gdquest.com/]GDQuest.com[/url]
fr: Un projet open source par [url=https://www.gdquest.com/]GDQuest.com[/url]
ta: [Url = https: //www.gdquest.com/] gdquest.com [/url] ஆல் திறந்த மூல திட்டம்.
tr: [url=https://www.gdquest.com/]GDQuest.com[/url] tarafından hazırlanmış açık kaynaklı bir proje
uk: Проєкт з відкритим кодом від [url=https://www.gdquest.com/]GDQuest.com[/url]

source: Hint %s
cs: Tip %s
de: Hinweis %s
es: Pista %s
fr: Indice %s
it: Suggerimento %s
ja: ヒント: %s
pt: Dica %s
ru: Подсказка %s
ta: குறிப்பு %s
tr: İpucu %s
uk: Підказка %s

source: Pause
cs: Pauza
es: Pausa
fr: Mettre en pause
it: Pausa
ja: ポーズ
pt: Pausar
ru: Пауза
ta: இடைநிறுத்தம்
tr: Duraklat
uk: Пауза

source: Term
cs: Termín
de: Begriff
es: Término
fr: Terme
it: Termine
ja: 用語
pt: Termo
ru: Элемент
ta: கால
tr: Terim
uk: Елемент

source: X
ta: ஃச்

source: Sorry, we don't have this particular error message covered yet! Please, use the [b]Report[/b] button in the top-right corner to tell us more about how you've got it, and we will try to improve our knowledge base for the next version of the application. [center]Thank you![/center]
cs: Omlouváme se, ale tuto konkrétní chybovou zprávu zatím neznáme! Použijte prosím tlačítko [b]Report[/b] v pravém horním rohu, abyste nám sdělili více informací o tom, jak se vám to stalo, a my se pokusíme vylepšit naši znalostní databázi pro příští verzi aplikace. [center]Děkujeme vám![/center]
de: Leider haben wir diese spezielle Fehlermeldung noch nicht abgedeckt! Bitte verwende die Schaltfläche [b]Bericht[/b] in der oberen rechten Ecke, um uns mehr darüber zu erzählen, wie es dazu kam, und wir werden versuchen, unsere Wissensdatenbank für die nächste Version der Anwendung zu verbessern. [center] Vielen Dank! [/center]
es: Lo sentimos, ¡todavía no tenemos cubierto este mensaje de error en particular! Por favor, utiliza el botón [b]Reportar[/b] en la esquina superior derecha para contarnos más sobre cómo lo obtuviste e intentaremos mejorar nuestra base de conocimientos para la próxima versión de la aplicación. [center]¡Gracias![/center]
fr: Désolé, ce message d'erreur en particulier n'est pas encore couvert ! Veuillez utiliser le bouton [b]Signaler[/b] dans le coin supérieur droit pour nous en dire plus sur la façon dont vous l'avez obtenu, et nous essaierons d'améliorer notre base de connaissances pour la prochaine version de l'application. [center]Merci ![/center]
it: Ci dispiace, non abbiamo ancora trattato questo particolare messaggio di errore! Per piacere, usa il tasto [b]Segnala[/b] nell'angolo in alto a destra per dirci di più su come l'hai ottenuto, così da poterlo implementare nella prossima versione dell'applicazione. [center]Grazie![/center]
ja: 申し訳ありませんが、このエラーメッセージはまだカバーされていません！ 右上にある[b]レポート[/b]ボタンを使用して、このエラーの出し方について詳しく教えてください。次のバージョンのアプリに向けて、ナレッジベースの改善に努めます。 [center]ご協力いただきありがとうございます！[/center]
ru: Извините, мы ещё не написали пояснение к этой ошибке! Пожалуйста, используйте кнопку [b]Сообщить о проблеме[/b] в правом верхнем углу, чтобы рассказать нам больше о том, как вы её получили, и мы постараемся улучшить нашу базу знаний к следующей версии приложения. [center]Спасибо![/center]
ta: மன்னிக்கவும், இந்த குறிப்பிட்ட பிழை செய்தி எங்களிடம் இன்னும் இல்லை! தயவுசெய்து, நீங்கள் அதை எவ்வாறு பெற்றுள்ளீர்கள் என்பதைப் பற்றி மேலும் சொல்ல, மேல்-வலது மூலையில் உள்ள [b] அறிக்கை [/b] பொத்தானைப் பயன்படுத்தவும், மேலும் பயன்பாட்டின் அடுத்த பதிப்பிற்கான எங்கள் அறிவுத் தளத்தை மேம்படுத்த முயற்சிப்போம். [மையம்] நன்றி! [/மையம்]
tr: Üzgünüz, henüz bu özel hata mesajını ele almadık! Lütfen sağ üst köşedeki [b]Bildir[/b] düğmesini kullanarak bize bu hataya nasıl ulaştığınız hakkında daha fazla bilgi veriz; uygulamanın bir sonraki sürümü için bilgi tabanımızı geliştirmeye çalışacağız. [center]Teşekkürler![/center]
uk: Вибачте, ми ще не написали пояснення щодо цієї помилки! Скористайтеся кнопкою [b]Повідомити про проблему[/b] в правому верхньому куті, щоб розповісти нам більше про те, як ви на неї натрапили, і до наступної версії програми ми постараємося покращити нашу базу знань. [center]Дякуємо![/center]

source: Lessons in this course are designed so you only need to edit the [b]important bits[/b]. But there is much more code outside of what you see that makes the project run. This means that sometimes changes you make can affect code you have no control over. But don't worry, you can still fix all the issues yourself with the code you [b]can[/b] edit! [i]This is like how game engines work too.[/i] There is a lot of hidden code that they execute to ensure your project runs smoothly. And yet, an error in your scripts can break them. We'll try to explain how to address each individual error that you face. Quick, click the [b]Explain[/b] button next to the error message!
cs: Lekce v tomto kurzu jsou sestaveny tak, abyste museli upravovat pouze [b]důležité části[/b]. Mimo to, co vidíte, však existuje mnohem více kódu, který zajišťuje běh projektu. To znamená, že změny, které provedete, mohou někdy ovlivnit kód nad kterým nemáte kontrolu. Ale nemějte obavy, všechny problémy můžete stále opravit sami pomocí kódu, který [b]můžete[/b] upravovat! [i]Tak nějak fungují i herní enginy.[/i] Existuje spousta skrytého kódu, který zajišťuje hladký chod vašich projektů. A přesto je chyba ve vašich skriptech může rozbít. Pokusíme se vám vysvětlit, jak řešit jednotlivé chyby, se kterými se setkáte. Rychle klikněte na tlačítko [b]Vysvětlení[/b] vedle chybové zprávy!
de: Die Lektionen in diesem Kurs sind so aufgebaut, dass Du nur die [b]wichtigen Teile[/b] des Codes bearbeiten musst. Aber es gibt viel mehr Code außerhalb dessen, was Du sehen kannst, der das Projekt zum Laufen bringt. Dies bedeutet, dass sich Änderungen, die du vornimmst, manchmal auf Code auswirken können, über den du keine Kontrolle hast. Aber keine Sorge, du kannst in diesem Kurs immer alle Probleme mit dem Code beheben, den du bearbeiten [b]kannst![/b] [i] So ähnlich funktionieren andere Game-Engines auch. [/i] Es gibt eine Menge versteckter Code, der ausgeführt wird, um sicherzustellen, dass Deine Projekte reibungslos laufen. Dennoch kann ein Fehler in deinen Skripten sie zum Absturz bringen. Wir werden versuchen zu erklären, wie du jeden einzelnen Fehler beheben kannst, mit dem du konfrontiert wirst. Probieren wir das gleich mal aus, klicke auf die Schaltfläche [b]Erklären[/b] neben der Fehlermeldung!
es: Las lecciones de este curso están construidas de tal manera que sólo tienes que editar las [b]partes importantes[/b]. Pero hay mucho más código fuera de lo que ves que hace que el proyecto se ejecute. Esto significa que, a veces, los cambios que hagas pueden afectar al código sobre el que no tienes control. Pero no te preocupes, ¡aún puedes solucionar todos los problemas tú mismo con el código que [b]puedes[/b] editar! [i]Esto también es similar al funcionamiento de los motores de los juegos[/i] Hay una gran cantidad de código oculto que ejecutan para asegurarse de que tus proyectos se ejecuten sin problemas. Y sin embargo, un error en tus scripts puede romperlos. Intentaremos explicar cómo abordar cada uno de los errores a los que te enfrentes. Rápido, ¡haz clic en el botón [b]Explicar[/b] junto al mensaje de error!
fr: Les leçons de ce cours sont conçues de manière à ce que vous n'ayez à modifier que les [b]parties importantes[/b]. Mais il y a beaucoup plus de code en dehors de ce que vous voyez qui fait fonctionner le projet. Ceci signifie que, parfois, les modifications que vous apportez peuvent affecter le code sur lequel vous n'avez aucun contrôle. Mais ne vous inquiétez pas, vous pouvez toujours résoudre tous les problèmes vous-même avec le code que vous [b]pouvez[/b] modifier ! [i]C'est un peu comme le fonctionnement des moteurs de jeu[/i] : il y a beaucoup de code caché qu'ils exécutent pour s'assurer que vos projets fonctionnent correctement. Et pourtant, une erreur dans vos scripts peut les briser. Nous allons essayer d'expliquer comment traiter chaque erreur à laquelle vous êtes confronté(e). Cliquez simplement sur le bouton [b]Explication[/b] à côté du message d'erreur !
it: Le lezioni di questo corso sono costruite in modo tale che hai solo bisogno di modificare le [b]parti importanti[/b]. Ma c'è molto più codice nascosto alla tua vista che fa eseguire il progetto. Ciò significa che certe volte, i cambiamenti che fai possono incidere su parti del codice su cui non hai alcun controllo. Ma non ti preoccupare, puoi sistemare i problemi da te con il codice che tu [b]puoi[/b] modificare! [i]I motori di gioco funzionano un po' allo stesso modo.[/i] C'è un sacco di codice nascosto che viene eseguito in modo tale che il tuo codice venga eseguito senza intoppi. Eppure, un errore nei tuoi codici lo può bloccare. Cercheremo di spiegare come risolvere ogni singolo errore che incontri. Presto, clicca il tasto [b]Spiega[/b] vicino al messaggio di errore!
ja: このコースのレッスンは[b]重要な部分[/b]を編集するだけで済むように構成されています。 しかし、表示されているもの以外にも、プロジェクトを実行するためのコードがさらにたくさんあります。 これは行った変更が制御できないコードに影響を与える場合があることを意味します。 ただし心配しないでください。編集[b]できる[/b]コードを使用して、すべての問題を自分で修正できます。 [i]これはゲームエンジンの動作にも似ています。[/i] プロジェクトをスムーズに実行するために実行される隠しコードがたくさんあります。 それでもスクリプトにエラーがあると、システムが壊れてしまう可能性があります。 私たちはあなたが直面する個々のエラーに対処する方法を説明していきます。 エラーメッセージの横にある[b]説明を見る[/b]ボタンをクリックしてください！
ru: Уроки этого курса построены так, что вам потребуется редактировать только [b]важные фрагменты кода[/b]. Но кроме того кода, который вы видите, существует ещё очень много кода заставляющего этот проект работать. Это означает, что иногда вносимые вами изменения могут повлиять на код, который вам недоступен. Но не волнуйтесь, вы всё ещё можете решить все возникающие проблемы самостоятельно, с помощью кода, который вы [b]можете[/b] редактировать! [i]Это похоже на то, как работают игровые движки.[/i] Существует много скрытого кода, который они выполняют, чтобы обеспечить бесперебойную работу ваших проектов. И все же ошибка в ваших скриптах может их сломать. Мы постараемся объяснить, как устранить каждую отдельную ошибку, с которой вы сталкиваетесь. Просто нажмите кнопку [b]Пояснение[/b] рядом с сообщением об ошибке!
ta: இந்த பாடத்திட்டத்தில் பாடங்கள் வடிவமைக்கப்பட்டுள்ளன, எனவே நீங்கள் [b] முக்கியமான பிட்களை மட்டுமே திருத்த வேண்டும் [/b]. ஆனால் நீங்கள் பார்க்கும் விசயங்களுக்கு வெளியே இன்னும் அதிகமான குறியீடு உள்ளது, அது திட்டத்தை இயக்குகிறது. இதன் பொருள் சில நேரங்களில் நீங்கள் செய்யும் மாற்றங்கள் உங்களுக்கு எந்த கட்டுப்பாடும் இல்லாத குறியீட்டை பாதிக்கும். ஆனால் கவலைப்பட வேண்டாம், நீங்கள் [b] திருத்தக்கூடிய குறியீட்டைக் கொண்டு எல்லா சிக்கல்களையும் நீங்களே சரிசெய்யலாம்! [நான்] இது விளையாட்டு என்சின்கள் எவ்வாறு செயல்படுகின்றன என்பது போன்றது. [/i] உங்கள் திட்டம் சீராக இயங்குவதை உறுதிசெய்ய அவை இயக்கும் மறைக்கப்பட்ட குறியீடு நிறைய உள்ளது. இன்னும், உங்கள் ச்கிரிப்ட்களில் பிழை அவற்றை உடைக்கக்கூடும். நீங்கள் எதிர்கொள்ளும் ஒவ்வொரு பிழையையும் எவ்வாறு எதிர்கொள்வது என்பதை விளக்க முயற்சிப்போம். விரைவாக, பிழை செய்திக்கு அடுத்த [/b] பொத்தானை விளக்குங்கள் என்பதைக் சொடுக்கு செய்க!
tr: Bu kurstaki dersler, yalnızca [b]önemli kısımları[/b] düzenlemeniz gerekecek şekilde oluşturulmuştur. Ancak gördüğünüzün dışında projenin çalışmasını sağlayan çok daha fazla kod var. Bunun anlamı, yaptığınız değişikliklerin, ara sıra, üzerinde kontrolünüzün olmadığı kodları etkileyebileceğidir. Ama hemen endişe etmeyin; düzenlemeye açık olan kodlar ile tüm bu sorunları kendi başınıza [b]düzeltebilirsiniz[/b]! [i]Bu, oyun motorlarının da çalışması gibidir.[/i] Projelerinizin sorunsuz çalıştığından emin olmak için motorların yürüttükleri çok sayıda gizli kodlar vardır. Yine de betik dosyalarında yapılacak bir hata onları bozabilir. Karşılaştığınız her bir hatayı nasıl ele alacağınızı açıklamaya çalışacağız. Hadi durmayın, hata mesajının yanındaki [b]Açıkla[/b] düğmesine tıklayın!
uk: Уроки цього курсу побудовано так, що вам потрібно редагувати лише [b]важливі фрагменти коду[/b]. Але крім того коду, який ви бачите, є ще дуже багато коду, який змушує цей проєкт працювати. Це означає, що зміни, які робите ви, можуть вплинути на код, який вам недоступний. Але не хвилюйтеся, ви все ще можете розв'язати всі проблеми, що виникають, самостійно, за допомогою коду, який ви [b]можете[/b] редагувати! [i]Це нагадує те, як працюють ігрові рушії.[/i] Існує багато прихованого коду, який вони виконують, щоб забезпечити безперебійну роботу вашого проєкту. І все ж помилка у ваших скриптах може їх зламати. Ми намагатимемося пояснити, як усунути кожну окрему помилку, з якою ви зіткнетеся. Просто натисніть кнопку [b]Пояснення[/b] поруч із повідомленням про помилку!
