Repository: GDQuest/learn-gdscript
Catalog: i18n/*/classref_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, ru, ta, tr, uk, zh_hans, zh_hant

source: Returns the argument converted into an [code]int[/code] (whole number) [i]if possible[/i]. Supports converting decimal numbers, strings, and booleans. Useful to convert player text input into numbers.
cs: Vrátí argument převedený na [code]int[/code] (celé číslo) [i]pokud je to možné[/i]. Podporuje převod desetinných čísel, řetězců a booleanů. Užitečné pro převod textového vstupu hráče na čísla.
da: Returnerer argumentet konverteret til en [code]int[/code] (heltal) [i]hvis muligt[/i]. Understøtter konvertering af decimaltal, strenge og booleske værdier. Nyttig til at konvertere spillerens tekstinput til tal.
de: Gibt, [i] wenn möglich[/i], das Argument zurück, das in ein [code]int[/code] (ganze Zahl) konvertiert wurde. Unterstützt das Konvertieren von Dezimalzahlen, Zeichenfolgen und booleschen Werten. Nützlich, um Spielertexteingaben in Zahlen umzuwandeln.
es: Devuelve el argumento convertido en un [code]int[/code] (número entero) [i]si es posible[/i]. Admite la conversión de números decimales, cadenas y booleanos. Es útil para convertir la entrada de texto del jugador en números.
fr: Retourne l'argument converti en [code]int[/code] (nombre entier) [i]si possible[/i]. Prend en charge la conversion des nombres décimaux, des chaînes de caractères et des booléens. Utile pour convertir la saisie de texte du joueur en nombres.
it: Riporta l'argomento convertito in un [code]int[/code] (numero intero) [i]se possibile[/i]. Può convertire numeri decimali, stringhe e valori booleani. Utile per convertire parti del testo del giocatore in numeri.
ja: 引数を[i]可能なら[/i][code]int[/code]（整数）に変換して返します。小数、文字列、真偽値をサポートしています。プレイヤーのテキスト入力を数値に変換するのに便利です。
nl: Geeft als resultaat het argument omgezet in een [code]int[/code] (geheel getal), [i]indien mogelijk[/i]. Biedt de mogelijkheid om kommagetallen, strings en booleans om te zetten. Nuttig om tekstinvoer van spelers om te zetten in getallen.
pt: Retorna o argumento convertido num [code]int[/code] (número inteiro) [i]se possível[/i]. Suporta conversões de números decimais, textos e boleanos. Útil para converter textos inseridos pelo(a) jogador(a) em números.
ru: Возвращает аргумент, преобразованный в [code]int[/code] (целое число) [i]если такое преобразование возможно[/i]. Поддерживает преобразование десятичных дробей, строк и логических значений. Полезно для преобразования вводимого игроком текста в числа.
ta: முடிந்தால் [/i] [/i] ஆக மாற்றப்பட்ட வாதத்தை ஒரு [குறியீடு] int [/code] (முழு எண்) ஆக மாற்றுகிறது. தசம எண்கள், சரங்கள் மற்றும் பூலியர்களை மாற்றுவதை ஆதரிக்கிறது. பிளேயர் உரை உள்ளீட்டை எண்களாக மாற்ற பயனுள்ளதாக இருக்கும்.
tr: Girdi değişkenini, [i]eğer mümkünse[/i], bir [code]int[/code] (tam sayı) olarak dönüştürüp geri döndürür. Ondalık sayıları, dizeleri, ve mantıksalları dönüştürmeyi destekler. Oyuncudan gelen yazı girdilerini sayılara dönüştürmek için kullanışlıdır.
uk: Повертає аргумент, перетворений на [code]int[/code] (ціле число) [i]якщо таке перетворення можливе[/i]. Підтримує перетворення десяткових дробів, рядків та логічних значень. Корисно для перетворення тексту, введеного гравцем, на числа.
zh_hans: [i]如果可能[/i]，返回转换为 [code]int[/code]（整数）后的参数。支持转换小数、字符串、布尔值。可用于将玩家输入的文本转换为数字。
zh_hant: [b]如果可能[/b]，返回轉換為 [code]int[/code]（整數）後的參數。支援轉換小數、字串、布林值。可用於將玩家輸入的文字轉換為數位。

source: Creates a new unit matching the type parameter and places it at the desired cell position on the game grid.
cs: Vytvoří novou jednotku odpovídající parametru type a umístí ji na požadovanou pozici buňky v herní mřížce.
da: Opretter en ny enhed, der matcher typeparameteren, og placerer den på den ønskede celleposition i spillets gitter.
de: Erstellt eine neue Einheit, die dem Typparameter entspricht, und platziert sie an der gewünschten Zellenposition im Spielfeld.
es: Crea una nueva unidad que coincida con el parámetro de tipo y la coloca en la posición de celda deseada en la cuadrícula del juego.
fr: Crée une nouvelle unité correspondant au paramètre de type et la place à la position de cellule souhaitée sur la grille de jeu.
it: Crea una nuova unità che corrisponde al tipo di parametro e la piazza alla posizione desiderata nelle celle della griglia di gioco.
ja: 型パラメーターにマッチする新しい単位を作成し、それをゲームグリッドの望んだセルの位置に配置にします。
nl: Creëert een nieuw spelstuk dat overeenkomt met de typeparameter en plaatst deze op de gewenste celpositie op het spelraster.
pt: Cria uma nova unidade correspondente ao parâmetro type e a coloca no quadrado desejado do tabuleiro do jogo.
ru: Создает новый юнит, соответствующий параметру типа, и помещает его в нужную ячейку игровой сетки.
ta: வகை அளவுருவுடன் பொருந்தக்கூடிய புதிய அலகு உருவாக்கி, அதை விளையாட்டு கட்டத்தில் விரும்பிய செல் நிலையில் வைக்கிறது.
tr: Girilen birim tipine uygun yeni bir birim oluşturur ve bunu oyun ızgarası (grid) üzerinde istenilen hücre konumuna yerleştirir.
uk: Створює новий юніт, відповідний параметру типу, і поміщає його в потрібну комірку ігрової сітки.
zh_hans: 新建一个单位，与类型参数相匹配，放置于游戏网格内所需的单元格位置上。
zh_hant: 新建一個單位，與類型參數相匹配，放置於遊戲網格內所需的儲存格位置上。

source: Creates a new item and displays it in the inventory.
cs: Vytvoří novou položku a zobrazí ji v inventáři.
da: Opretter en nyt genstand og viser det i lagerbeholdningen.
de: Erstellt einen neuen Gegenstand und zeigt ihn im Inventar an.
es: Crea un nuevo objeto y lo muestra en el inventario.
fr: Crée un nouvel objet et l'affiche dans l'inventaire.
it: Crea un nuovo oggetto e lo mostra nell'inventario.
ja: 新しいアイテムを作成し、それをインベントリに表示します。
nl: Maakt een nieuw voorwerp aan en geeft het weer in de inventaris.
pt: Cria um novo item e o exibe dentro do inventário.
ru: Создает новый предмет и отображает его в инвентаре.
ta: ஒரு புதிய உருப்படியை உருவாக்கி அதை சரக்குகளில் காண்பிக்கும்.
tr: Yeni bir öğe oluşturur ve bunu envanter içinde gösterir.
uk: Створює новий предмет та показує його в інвентарі.
zh_hans: 新建一个道具并在背包中显示。
zh_hant: 新建一個道具並在背包中顯示。

source: Increases the item count by amount.
cs: Zvýší počet položek o množství.
da: Øger antallet af genstande med mængde.
de: Erhöht die Anzahl der Elemente um den Betrag.
es: Aumenta el número de elementos por cantidad.
fr: Augmente le nombre d'objets par "amount".
it: Aumenta il numero di oggetti per la quantità.
ja: アイテムの個数を増やします。
nl: Verhoogt het aantal voorwerpen met een aantal.
pt: Aumenta a contagem de itens por quantidade.
ru: Увеличивает количество предметов на amount.
ta: உருப்படி எண்ணிக்கையை அளவு அதிகரிக்கிறது.
tr: Öğe sayısını girilen değer kadar arttırır.
uk: Збільшує кількість предметів на amount.
zh_hans: 增加指定数量的道具。
zh_hant: 增加指定數量的道具。

source: Realigns the train track with the path. Select a train track in the tracks array by index to pass it as an argument.
da: Justerer togsporet i forhold til stien. Vælg et togspor i spor arrayet med indeks for at benytte det som et argument.
ru: Выровняйте железнодорожные пути относительно траектории. Выберите железнодорожный путь в массиве путей по индексу, чтобы передать его в качестве аргумента.
uk: Вирівнює залізничну колію зі шляхом. Виберіть залізничну колію в масиві tracks за індексом, щоб передати її як аргумент.
