Repository: GDQuest/learn-gdscript
Catalog: i18n/*/classref_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, ru, ta, tr, uk, zh_hans, zh_hant

source: shows the current scene
cs: zobrazí aktuální scénu
da: viser den aktuelle scene
de: Zeigt die aktuelle Szene
es: muestra la escena actual
fr: montre la scène actuelle
it: mostra la scena corrente
ja: 現在のシーンを表示します
nl: toont de huidige scène
pt: mostra a cena atual
ru: показывает текущую сцену
ta: தற்போதைய காட்சியைக் காட்டுகிறது
tr: geçerli sahneyi gösterir
uk: показує поточну сцену
zh_hans: 现实当前场景
zh_hant: 顯示目前場景

source: hides the current scene
cs: skryje aktuální scénu
da: skjuler den nuværende scene
de: Versteckt die aktuelle Szene
es: oculta la escena actual
fr: cache la scène actuelle
it: nascondi la scena corrente
ja: 現在のシーンを非表示にします
nl: verbergt de huidige scène
pt: oculta a cena atual
ru: скрывает текущую сцену
ta: தற்போதைய காட்சியை மறைக்கிறது
tr: geçerli sahneyi gizler
uk: приховує поточну сцену
zh_hans: 隐藏当前场景
zh_hant: 隱藏目前場景

source: Applies a rotation to the node, in radians, starting from its current rotation.
cs: Aplikuje rotaci na uzel v radiánech počínaje jeho aktuální rotací.
da: Gælder en rotation af noden, i radianer, startende fra dens nuværende rotation.
de: Wendet ausgehend von seiner aktuellen Drehung eine Drehung im Bogenmaß auf den Node an.
es: Aplica una rotación al nodo, en radianes, a partir de su rotación actual.
fr: Applique une rotation au nœud, en radians, en partant de sa rotation actuelle.
it: Applica una rotazione in radianti al nodo, a partire dalla corrente rotazione.
ja: ノードに現在の回転角度を起点とする回転角度をラジアン単位で適用します。
nl: Past een draaiing toe op het knooppunt, in radialen, beginnend vanuit de huidige draaiing.
pt: Aplica uma rotação ao nó, em radianos, começando pela rotação atual.
ru: Поворачивает узел на указанное количество радианов.
ta: அதன் தற்போதைய சுழற்சியில் இருந்து தொடங்கி, ரேடியன்களில் முனைக்கு ஒரு சுழற்சியைப் பயன்படுத்துகிறது.
tr: Düğüme, geçerli dönüşünden başlayarak, radyan cinsinden bir dönüş uygular.
uk: Повертає вузол на заданий кут у радіанах, починаючи з його поточного положення.
zh_hans: 在该节点上应用旋转，单位为弧度，从当前角度开始旋转。
zh_hant: 在該節點上套用旋轉，單位為弧度，從目前角度開始旋轉。

source: Moves the turtle in the direction it's facing by some pixels.
cs: Posune želvu o několik pixelů ve směru, ke kterému je otočena.
da: Flytter skildpadden i den retning, den vender, med nogle pixels.
de: Bewegt die Schildkröte um die angegebene Anzahl an Pixeln vorwärts.
es: Mueve la tortuga en la dirección a la que está orientada por unos pixeles.
fr: Déplace la tortue dans la direction à laquelle elle fait face de quelques pixels.
it: Muove la tartaruga nella direzione verso cui è rivolto di qualche pixel.
ja: カメが向いている方向に何ピクセルか移動します。
nl: Verplaatst de schildpad met enkele pixels in de richting waarin hij kijkt.
pt: Move a tartaruga na direção que está a olhar a alguns pixels.
ru: Перемещает черепашку на несколько пикселей вперёд (туда, куда она смотрит).
ta: சில பிக்சல்களால் எதிர்கொள்ளும் திசையில் ஆமை நகர்த்துகிறது.
tr: Kaplumbağayı, verilen sayıda piksel kadar, baktığı yönde hareket ettirir.
uk: Переміщає черепашку на кілька пікселів уперед.
zh_hans: 将海龟沿着它面朝的方向移动若干像素。
zh_hant: 將海龜沿著它面朝的方向移動一些像素。

source: Rotates the turtle to the right by some degrees.
cs: Otočí želvu o několik stupňů doprava.
da: Roterer skildpadden til højre med nogle grader.
de: Dreht die Schildkröte um die angegebene Gradzahl nach rechts.
es: Gira la tortuga algunos grados hacia la derecha.
fr: Fait pivoter la tortue vers la droite de quelques degrés.
it: Ruota la tartaruga verso destra di qualche grado.
ja: カメを右に何度回転させるか。
nl: Draait de schildpad enkele graden naar rechts.
pt: Rotaciona a tartaruga para a direita em alguns graus.
ru: Поворачивает черепашку вправо на несколько градусов.
ta: ஆமை வலதுபுறமாக சில டிகிரிகளால் சுழல்கிறது.
tr: Kaplumbağayı, verilen sayı kadar derece sağa döndürür.
uk: Повертає черепашку на кілька градусів праворуч.
zh_hans: 将海龟向右旋转若干角度。
zh_hant: 將海龜向右旋轉一些角度。

source: Rotates the turtle to the left by some degrees.
cs: Otočí želvu o několik stupňů doleva.
da: Roterer skildpadden til venstre med nogle grader.
de: Dreht die Schildkröte um die angegebene Gradzahl nach links.
es: Gira la tortuga algunos grados hacia la izquierda.
fr: Fait pivoter la tortue vers la gauche de quelques degrés.
it: Ruota la tartaruga a sinistra di qualche grado.
ja: カメを左に何度回転させるか。
nl: Draait de schildpad enkele graden naar links.
pt: Rotaciona a tartaruga para a esquerda em alguns graus.
ru: Поворачивает черепашку влево на несколько градусов.
ta: ஆமை இடதுபுறத்தில் சில டிகிரிகளால் சுழல்கிறது.
tr: Kaplumbağayı, verilen sayı kadar derece sola döndürür.
uk: Повертає черепашку на кілька градусів ліворуч.
zh_hans: 将海龟向左旋转若干角度。
zh_hant: 將海龜向左旋轉一些角度。

source: Offsets the turtle's position by the given x and y amounts of pixels.
cs: Odsadí polohu želvy o zadaný počet x a y pixelů.
da: Forskyder skildpaddens position med de givne x- og y-mængder af pixels.
de: Versetzt die Position der Schildkröte um die angegebenen x- und y-Werte in Pixeln.
es: Desplaza la posición de la tortuga por las cantidades de pixeles x e y dadas.
fr: Décale la position de la tortue par les quantités de pixels x et y données.
it: Sfalsa la posizione della tartaruga dalla data quantità di x e y pixel.
ja: カメの位置を与えられたxとyのピクセル数だけオフセット移動します。
nl: Verschuift de positie van de schildpad met het opgegeven aantal x- en y-pixels.
pt: Desloca a posição da tartaruga pelas quantidades x e y de pixels fornecidas.
ru: Смещает положение черепашки на заданное x и y количество пикселей.
ta: கொடுக்கப்பட்ட ஃச் மற்றும் ஒய் அளவு பிக்சல்களால் ஆமையின் நிலையை ஈடுசெய்கிறது.
tr: Kaplumbağanın konumunu, verilen x ve y piksel miktarları kadar değiştirir.
uk: Зміщує черепашку на задану x і y кількість пікселів.
zh_hans: 将海龟的位置偏移给定的 X 和 Y 像素。
zh_hant: 將海龜的位置一定指定的 X 和 Y 像素。

source: Makes the turtle draw a rectangle starting at its current position.
cs: Způsobí, že želva nakreslí obdélník začínající na své aktuální pozici.
da: Får skildpadden til at tegne et rektangel startende fra dens nuværende position.
de: Lässt die Schildkröte ein Rechteck zeichnen, beginnend an ihrer aktuellen Position.
es: Hace que la tortuga dibuje un rectángulo a partir de su posición actual.
fr: Fait dessiner à la tortue un rectangle à partir de sa position actuelle.
it: Fa disegnare alla tartaruga un rettangolo che inizia dalla posizione corrente.
ja: カメが現在の位置から始まる矩形を描画します。
nl: Zorgt ervoor dat de schildpad een rechthoek tekent beginnend op zijn huidige positie.
pt: Faz a tartaruga desenhar um retângulo começando na sua posição atual.
ru: Заставляет черепашку рисовать прямоугольник, начиная с текущей позиции.
ta: ஆமை அதன் தற்போதைய நிலையில் தொடங்கி ஒரு செவ்வகத்தை வரைய வைக்கிறது.
tr: Kaplumbağanın, geçerli konumundan başlayarak, bir dikdörtgen çizmesini sağlar.
uk: Спонукає черепашку намалювати прямокутник, починаючи з поточної позиції.
zh_hans: 让海龟以它的当前位置为起点绘制一个矩形。
zh_hant: 讓海龜以它的目前位置為起點繪製一個矩形。

source: The position of the entity on the horizontal axis.
cs: Poloha entity na vodorovné ose.
da: Enhedens position på den vandrette akse.
de: Die Position der Entität auf der horizontalen Achse.
es: La posición de la entidad en el eje horizontal.
fr: La position de l'entité sur l'axe horizontal.
it: La posizione dell'elemento sull'asse orizzontale.
ja: 横軸のエンティティの位置。
nl: De positie van het object langs de horizontale as.
pt: A posição da entidade no eixo horizontal.
ru: Положение объекта на горизонтальной оси.
ta: கிடைமட்ட அச்சில் நிறுவனத்தின் நிலை.
tr: Varlığın yatay eksendeki konumu.
uk: Положення об'єкта на горизонтальній осі.
zh_hans: 该实体在横轴上的位置。
zh_hant: 該實體在橫軸上的位置。

source: The position of the entity on the vertical axis.
cs: Poloha entity na svislé ose.
da: Enhedens position på den lodrette akse.
de: Die Position der Entität auf der vertikalen Achse.
es: La posición de la entidad en el eje vertical.
fr: La position de l'entité sur l'axe vertical.
it: La posizione dell'elemento sull'asse verticale.
ja: 縦軸のエンティティの位置。
nl: De positie van het object langs de verticale as.
pt: A posição da entidade no eixo vertical.
ru: Положение объекта на вертикальной оси.
ta: செங்குத்து அச்சில் நிறுவனத்தின் நிலை.
tr: Varlığın dikey eksen üzerindeki konumu.
uk: Положення об'єкта на вертикальній осі.
zh_hans: 该实体在纵轴上的位置。
zh_hant: 該實體在縱軸上的位置。

source: Applies a local translation on the node's X axis based on the [code]Node._process[/code]'s [code]delta[/code]. If [code]scaled[/code] is false, normalizes the movement.
cs: Aplikuje lokální translaci na ose X uzlu na základě [code]Node._process[/code]'s [code]delta[/code]. Pokud [code]scaled[/code] je false, normalizuje pohyb.
da: Anvender en lokal translation på nodens X-akse baseret på [code]Node._process[/code]'s [code]delta[/code]. Hvis [code]scaled[/code] er falsk, normaliseres bevægelsen.
de: Wendet eine lokale Übersetzung auf der X-Achse des Nodes an, basierend auf dem [code]delta[/code] von [code]Node._process[/code]. Wenn [code]scaled[/code] falsch ist, wird die Bewegung normalisiert.
es: Aplica una traslación local en el eje X del nodo basada en el [code]delta[/code] del [code]Node._process[/code]. Si [code]scaled[/code] es falso, normaliza el movimiento.
fr: Applique une translation locale sur l'axe X du nœud en fonction du [code]delta[/code] du [code]Node._process[/code]. Si [code]scaled[/code] est faux, il normalise le mouvement.
it: Applica una traslazione locale sull'asse X del nodo, in base al [code]delta[/code] di [code]Node._process[/code]. Se [code]scaled[/code] è falso, normalizza il movimento.
ja: ノードの X 座標を [code]Node._process[/code] の [code]delta[/code] にもとづいて局所変換します。もし [code]scaled[/code] が false なら、移動量を正規化します。
nl: Past een lokale verplaatsing toe langs de X-as van de knoop gebaseerd op de [code]delta[/code] van Node._process[/code]. Als [code]scaled[/code] [code]false[/code] is, wordt de beweging genormaliseerd.
pt: Aplica uma translação local no eixo X do nó baseado no [code]delta[/code] de [code]Node._process[/code]. Se [code]scaled[/code] é [code]false[/code], normaliza o movimento.
ru: Перемещает узел по оси X с учётом значения [code]delta[/code] в [code]Node._process[/code]. Если [code]scaled[/code] имеет значение false, нормализует движение.
ta: [குறியீடு] முனையின் அடிப்படையில் முனையின் ஃச் அச்சில் உள்ளக மொழிபெயர்ப்பைப் பயன்படுத்துகிறது. [குறியீடு] அளவிடப்பட்ட [/குறியீடு] தவறானது என்றால், இயக்கத்தை இயல்பாக்குகிறது.
tr: [code]Node._process[/code]'in [code]delta[/code]'sını temel alarak, düğümün X eksenine yerel bir yer değiştirme uygular. [code]scaled[/code] (ölçekli) değeri false ise, hareketi normalize eder.
uk: Переміщує вузол уздовж осі X з урахуванням значення [code]delta[/code] в [code]Node._process[/code]. Якщо [code]scaled[/code] має значення false, нормалізує рух.
zh_hans: 根据 [code]Node._process[/code] 的 [code]delta[/code]，在该节点的 X 轴上应用本地平移。如果 [code]scaled[/code] 为假，那么移动会进行归一化。
zh_hant: 根據 [code]Node._process[/code] 的 [code]delta[/code]，在該節點的 X 軸上套用本地平移。如果 [code]scaled[/code] 為假，那麼移動會進行正規化。

source: Stores how many cells make up the width ([code]board_size.x[/code]) and height ([code]board_size.y[/code]) of the board.
cs: Ukládá kolik buněk tvoří šířku ([code]board_size.x[/code]) a výšku ([code]board_size.y[/code]) pracovní desky.
da: Gemmer hvor mange celler der udgør bredden ([code]board_size.x[/code]) og højden ([code]board_size.y[/code]) af brættet.
de: Speichert, aus wie vielen Zellen die Breite ([code]board_size.x[/code]) und Höhe ([code]board_size.y[/code]) des Boards bestehen.
es: Almacena cuántas celdas componen el ancho ([code]board_size.x[/code]) y el alto ([code]board_size.y[/code]) del tablero.
fr: Enregistre le nombre de cellules composant la largeur ([code]board_size.x[/code]) et la hauteur ([code]board_size.y[/code]) du tableau.
it: Memorizza quante celle costituiscono lo spessore ([code]board_size.x[/code]) e l'altezza ([code]board_size.y[/code]) della tavola.
ja: ボードの幅 [code]board_size.x[/code]) と高さ ([code]board_size.y[/code]) をどれくらい多くのセルで埋めるかを格納します。
nl: Beschrijft hoeveel cellen het bord breed ([code]board_size.x[/code]) en hoog ([code]board_size.y[/code]) is.
pt: Armazena quantos quadrados compõe a largura ([code]board_size.x[/code]) e a altura ([code]board_size.y[/code]) do tabuleiro.
ru: Хранит размер доски в ячейках по ширине ([code]board_size.x[/code]) и высоте ([code]board_size.y[/code]).
ta: பலகையின் அகலம் ([குறியீடு] BOARD_SIZE.x [/code]) மற்றும் வாரியத்தின் உயரம் ([குறியீடு] BOARD_SIZE.Y [/குறியீடு]) ஆகியவற்றை எத்தனை கலங்கள் உருவாக்குகின்றன என்பதை சேமிக்கிறது.
tr: Tahtanın genişliğini ([code]board_size.x[/code]) ve yüksekliğini ([code]board_size.y[/code]) oluşturan hücrelerin kaç tane olduğunu depolar.
uk: Зберігає розміри дошки в комірках за шириною ([code]board_size.x[/code]) і висотою ([code]board_size.y[/code]).
zh_hans: 存储构成棋盘宽度（[code]board_size.x[/code]）和高度（[code]board_size.y[/code]）的单元格数量。
zh_hant: 儲存構成棋盤寬度（[code]board_size.x[/code]）和高度（[code]board_size.y[/code]）的儲存格數量。

source: The cell position of the robot on the board. [code]Vector2(0, 0)[/code] is the square cell in the top left of the board.
cs: Poloha buňky robota na desce. [code] Vector2(0, 0)[/code] je čtvercová buňka v levém horním rohu desky.
da: Robottens celleposition på spillepladen. [code]Vector2(0, 0)[/code] er den firkantede celle øverst til venstre på spillepladen.
de: Die Zellposition des Roboters auf dem Brett. [code]Vector2(0, 0)[/code] ist die quadratische Zelle oben links auf der Tafel.
es: La posición de la celda del robot en el tablero. [code]Vector2(0, 0)[/code] es la celda cuadrada de la parte superior izquierda del tablero.
fr: La position de la cellule du robot sur le tableau. [code]Vector2(0, 0)[/code] est la cellule carrée en haut à gauche du tableau.
it: La posizione della cella del robot sulla tavola. [code]Vector2(0, 0)[/code] è la cella quadrata in alto a sinistra sulla tavola.
ja: ボード上のロボットのセル位置。[code]Vector2(0, 0)[/code] はボードの左上の四角形セル。
nl: De celpositie van de robot op het bord. [code]Vector2(0, 0)[/code] is de vierkante cel linksboven op het bord.
pt: A posição do robô no tabuleiro. [code]Vector2(0, 0)[/code] é o quadrado no canto superior esquerdo do tabuleiro.
ru: Положение ячейки с роботом на доске. [code]Vector2(0, 0)[/code] — это квадратная ячейка в левом верхнем углу доски.
ta: போர்டில் ரோபோவின் செல் நிலை. [குறியீடு] வெக்டர் 2 (0, 0) [/குறியீடு] என்பது பலகையின் மேல் இடதுபுறத்தில் உள்ள சதுர கலமாகும்.
tr: Robotun tahta üzerindeki hücre konumu. [code]Vector2(0, 0)[/code], tahtanın sol üst köşesindeki kare hücredir.
uk: Положення комірки з роботом на дошці. [code]Vector2(0, 0)[/code] — це квадратна комірка в лівому верхньому кутку дошки.
zh_hans: 机器人在棋盘上所在的单元格位置。[code]Vector2(0, 0)[/code] 为棋盘左上角的正方形单元格。
zh_hant: 機器人在棋盤上所在的儲存格位置。[code]Vector2(0, 0)[/code] 為棋盤左上角的正方形儲存格。

source: Creates a list of numbers from [code]0[/code] to [code]length - 1[/code].
cs: Vytvoří seznam čísel od [code]0[/code] do [code]length - 1[/code].
da: Opretter en liste med tal fra [code]0[/code] til [code]length - 1[/code].
de: Erstellt eine Liste mit Zahlen von [code]0[/code] bis [code]Länge - 1[/code].
es: Crea una lista de números desde [code]0[/code] hasta [code]longitud - 1[/code].
fr: Crée une liste de nombres de [code]0[/code] à [code]length - 1[/code].
it: Crea una lista di numeri da [code]0[/code] a [code]length - 1[/code].
ja: [code]0[/code] から [code]length - 1[/code] までの数のリストを作ります。
nl: Maakt een lijst met getallen van [code]0[/code] tot en met [code]length- 1[/code].
pt: Cria uma lista de números de [code]0[/code] a [code]length - 1[/code].
ru: Создает список чисел от [code]0[/code] до [code]length - 1[/code].
ta: [குறியீடு] 0 [/குறியீடு] முதல் [குறியீடு] நீளம் - 1 [/குறியீடு] வரை எண்களின் பட்டியலை உருவாக்குகிறது.
tr: [code]0[/code] ile [code]length- 1[/code] (uzunluk - 1) arasında bir sayı listesi oluşturur.
uk: Створює список чисел від [code]0[/code] до [code]length - 1[/code].
zh_hans: 创建从 [code]0[/code] 到 [code]length - 1[/code] 之间的数字列表。
zh_hant: 創建從 [code]0[/code] 到 [code]length - 1[/code] 之間的數字清單。

source: Orders the robot to play an animation.
cs: Přikáže robotovi přehrát animaci.
da: Beordrer robotten til at afspille en animation.
de: Befiehlt dem Roboter, eine Animation abzuspielen.
es: Ordena al robot que reproduzca una animación.
fr: Ordonne au robot de jouer une animation.
it: Ordina al robot di riprodurre un'animazione.
ja: ロボットにアニメーションを再生するよう命令します。
nl: Geeft de robot de opdracht om een animatie af te spelen.
pt: Ordena que o robô reproduza uma animação.
ru: Приказывает роботу воспроизвести анимацию.
ta: அனிமேசன் விளையாட ரோபோவை ஆர்டர் செய்கிறது.
tr: Robota bir animasyon oynatmasını emreder.
uk: Наказує роботу відтворити анімацію.
zh_hans: 命令机器人播放动画。
zh_hant: 命令機器人播放動畫。

source: Selects units in the cell coordinates passed as the function's argument.
cs: Vybere jednotky v souřadnicích buňky předaných jako argument funkce.
da: Vælger enheder i cellekoordinaterne, der leveres som funktionens argument.
de: Wählt Einheiten in den Zellkoordinaten aus, die als Parameter der Funktion übergeben werden.
es: Selecciona las unidades en las coordenadas de la celda pasadas como argumento de la función.
fr: Sélectionne les unités dans les coordonnées de cellule passées en argument de la fonction.
it: Seleziona unità nelle coordinate di cella passate nell'argomento della funzione.
ja: 関数の引数として与えられるセル座標の単位を選びます。
nl: Selecteert spelstukken in de celcoördinaten die als argument aan de functie zijn doorgegeven.
pt: Seleciona unidades nas coordenadas (em quadrados) passadas como argumento da função.
ru: Выбирает юнитов в ячейке, координаты которой равны координатам принятым в аргументах функции.
ta: செயல்பாட்டின் வாதமாக நிறைவேற்றப்பட்ட செல் ஒருங்கிணைப்புகளில் உள்ள அலகுகளைத் தேர்ந்தெடுக்கிறது.
tr: Fonksiyona girdi değişkeni olarak gönderilen hücre koordinatlarındaki birimleri seçer.
uk: Вибирає юнітів у комірці, координати якої дорівнюють аргументам функції.
zh_hans: 选择作为函数参数传入的单元格坐标上的单位。
zh_hant: 選擇作為函式參數傳入的儲存格座標上的單位。

source: Queues a move animation towards the target cell.
cs: Zařadí do fronty animaci pohybu směrem k cílové buňce.
da: Sætter en bevægelsesanimation i kø, mod målcellen.
de: Stellt eine Bewegung in Richtung der Zielzelle in die Warteschlange.
es: Pone en cola una animación de movimiento hacia la celda de destino.
fr: Met en file d'attente une animation de déplacement vers la cellule cible.
it: Mette in attesa di riproduzione un'animazione di movimento verso la cella obiettivo.
ja: 目標セルへの動作アニメーションをキューに入れます。
nl: Zet een bewegingsanimatie naar de doelcel in de wachtrij.
pt: Enfileira uma animação de movimento em direção ao quadrado de destino.
ru: Ставит в очередь анимацию движения к целевой ячейке.
ta: இலக்கு கலத்தை நோக்கி ஒரு நகர்வு அனிமேசனை வரிசைப்படுத்துகிறது.
tr: Hedef hücreye doğru bir hareket animasyonunu sıraya ekler.
uk: Ставить у чергу анімацію руху до цільової комірки.
zh_hans: 将移动到目标单元格的动画加入队列。
zh_hant: 將移動到目標儲存格的動畫加入佇列。

source: Adds the value passed as an argument at the back of the array.
cs: Přidá hodnotu předanou jako argument na konec pole.
da: Tilføjer værdien givet som et argument til enden af arrayet.
de: Addiert den als Argument übergebenen Wert am Ende des Arrays.
es: Añade el valor pasado como argumento en la parte posterior de la matriz.
fr: Ajoute la valeur passée en argument à la fin du tableau.
it: Aggiunge il valore passato nell'argomento alla fine dell'array.
ja: 引数として与えられた値を配列の最後に追加します。
nl: Voegt de waarde die als argument is meegegeven toe aan de achterkant van de array.
pt: Adiciona o valor passado como argumento no final da matriz.
ru: Добавляет значение, переданное в качестве аргумента, в конец массива.
ta: வரிசையின் பின்புறத்தில் ஒரு வாதமாக அனுப்பப்பட்ட மதிப்பை சேர்க்கிறது.
tr: Girdi değişkeni olarak gönderilen değeri, dizinin (array) sonuna ekler.
uk: Додає значення, передане як аргумент, наприкінці масиву.
zh_hans: 将作为参数传入的值添加到该数组的末尾。
zh_hant: 將作為參數傳入的值新增到該陣列的末尾。

source: Removes the first value from the array and returns it.
cs: Odebere první hodnotu z pole a vrátí ji.
da: Fjerner den første værdi fra arrayet og returnerer den.
de: Entfernt den ersten Wert aus dem Array und gibt ihn zurück.
es: Elimina el primer valor de la matriz y lo devuelve.
fr: Retire la première valeur du tableau et la retourne.
it: Rimuove il primo valore dall'array e lo riporta.
ja: 配列から最初の値を取り除き、それを返します。
nl: Verwijdert de eerste waarde uit de array en geeft deze terug.
pt: Remove o primeiro valor da matriz e o retorna.
ru: Удаляет первое значение из массива и возвращает его.
ta: வரிசையிலிருந்து முதல் மதிப்பை நீக்கி அதைத் தருகிறது.
tr: Dizideki ilk değeri diziden çıkarır ve bu değeri geri döndürür.
uk: Вилучає перше значення з масиву та повертає його.
zh_hans: 删除该数组中的第一个值，并将其返回。
zh_hant: 刪除該陣列中的第一個值，並將其返回。

source: Removes the last value from the array and returns it.
cs: Odebere poslední hodnotu z pole a vrátí ji.
da: Fjerner den sidste værdi fra arrayet og returnerer den.
de: Entfernt den letzten Wert aus dem Array und gibt ihn zurück.
es: Elimina el último valor de la matriz y lo devuelve.
fr: Retire la dernière valeur du tableau et la retourne.
it: Rimuove l'ultimo valore dall'array e lo riporta.
ja: 配列から最後の値を取り除き、それを返します。
nl: Verwijdert de laatste waarde uit de array en geeft deze terug.
pt: Remove o último valor da matriz e o retorna.
ru: Удаляет последнее значение из массива и возвращает его.
ta: வரிசையிலிருந்து கடைசி மதிப்பை நீக்கி அதைத் தருகிறது.
tr: Dizideki son değeri diziden çıkarır ve bu değeri geri döndürür.
uk: Вилучає останнє значення з масиву та повертає його.
zh_hans: 删除该数组中的最后一个值，并将其返回。
zh_hant: 刪除該陣列中的最後一個值，並將其返回。

source: Returns the argument converted into a [code]String[/code]. Works with the majority of value types.
cs: Vrátí argument převedený na [code]String[/code]. Pracuje s hodnotami většiny typů.
da: Returnerer argumentet konverteret til en [code]String[/code]. Fungerer med de fleste værdityper.
de: Gibt das in einen [code]String[/code] konvertierte Argument zurück. Funktioniert mit den meisten Werttypen.
es: Devuelve el argumento convertido en una [code]String[/code]. Funciona con la mayoría de los tipos de valores.
fr: Retourne l'argument converti en [code]String[/code]. Fonctionne avec la majorité des types de valeurs.
it: Riporta l'argomento convertito in una [code]String[/code]. Funziona con la maggior parte delle tipologie di valori.
ja: 引数を[code]String[/code]に変換して返します。大部分の値型で動きます。
nl: Geeft als resultaat het argument omgezet in een [code]String[/code]. Werkt met de meeste waardentypes.
pt: Retorna o argumento convertido em [code]String[/code] (texto). Funciona com a maioria dos tipos de valor.
ru: Возвращает аргумент, преобразованный в строку [code]String[/code]. Работает с большинством типов значений.
ta: [குறியீடு] சரம் [/குறியீடு] ஆக மாற்றப்பட்ட வாதத்தை வழங்குகிறது. பெரும்பாலான மதிப்பு வகைகளுடன் வேலை செய்கிறது.
tr: Girdi değişkenini [code]String[/code] (dize) haline dönüştürüp geri döndürür. Değer tiplerinin çoğunluğunda işe yarar.
uk: Повертає аргумент, перетворений на рядок [code]String[/code]. Працює зі значеннями більшості типів.
zh_hans: 返回转换为 [code]String[/code] 后的参数。支持大部分值类型。
zh_hant: 返回轉換為 [code]String[/code] 後的參數。支援大部分數值型別。
