Repository: GDQuest/learn-gdscript
Catalog: i18n/*/error_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: If the error mentions the assigned value type not matching the variable, the problem is on the right side of the equal sign (=).
da: Hvis fejlen nævner, at den tildelte værditype ikke matcher variablen, ligger problemet på højre side af lighedstegnet (=).
pt: Se o erro mencionar que o tipo do valor não é compatível com a variável, o problema está no lado direito do sinal de igual (=).

source: If the error talks about the return type not matching the function, then it is the value after the return keyword that is problematic.
da: Hvis fejlen angiver, at returtypen ikke matcher funktionen, er det værdien efter return nøgleordet, der er problematisk.
pt: Se o erro disser que o tipo de retorno não é compatível com a função, então é o valor depois da palavra-chave 'return' que causa o problema.

source: If the computer talks about an invalid operand, then the issue is that the operation does not exist for the type you're trying to use. For example, while you can add two 2D vectors, you can't add a whole number or text to a 2D vector.
da: Hvis computeren angiver en ugyldig operand, er problemet, at operationen ikke findes for den type, du forsøger at bruge. For eksempel, selvom du kan addere to 2D-vektorer, kan du ikke addere et helt tal eller tekst til en 2D-vektor.
pt: Se o computador disser sobre um operador inválido, então o problema é que a operação para aquele tipo que tenta usar não existe. Por exemplo, pode somar dois vetores 2D, mas não pode somar um número inteiro ou um texto e um vetor 2D.

source: GDScript supports type inference. The computer will automatically recognize the type of value you are working with. In some cases, though, it can't figure it out.
da: GDScript understøtter typeinferens. Computeren genkender automatisk den type værdi, du arbejder med. I nogle tilfælde kan den dog ikke finde ud af det.
pt: GDScript suporta inferência de tipo. O computador vai reconhecer automaticamente o tipo de valor que usa. Porém, em alguns casos ele não vai conseguir descobrir o tipo.

source: When that happens, you need to specify the type yourself or remove type inference altogether for this variable.
da: Når det sker, skal du selv angive typen eller helt fjerne typeinferens for denne variabel.
pt: Quando isso acontecer, mesmo precisa especificar o tipo ou remover completamente a inferência de tipo para essa variável.

source: The simplest way to solve this error is to remove types for this variable or this function's arguments. Otherwise, you can manually specify the value type after the colon.
da: Den enkleste måde at løse denne fejl på er at fjerne typer for denne variabel eller denne funktions argumenter. Ellers kan du manuelt angive værditypen efter kolon.
pt: A maneira mais simples de resolver esse erro é remover os tipos dessa variável ou os argumentos dessa função. Caso contrário, pode especificar manualmente o tipo do valor depois do sinal de dois pontos.

source: We recommend specifying the type whenever possible to reap the typing system's benefits.
da: Vi anbefaler at angive typen, når det er muligt, for at høste fordelene ved maskinskrivningssystemet.
pt: Recomendamos especificar o tipo sempre que for possível para colher os benefícios do sistema de digitação.

source: There is an issue with the return value of your function. There are two main cases here:
da: Der er et problem med returværdien af din funktion. Der er to hovedtilfælde her:
pt: Tem um problema com o valor de retorno da sua função. Há dois casos principais aqui:

source: 1. Your function is a void function, thus it should not return a value. This includes functions with the '-> void' syntax and class constructors ('_init()'). 2. You specified a return type for your function, but you are not returning a value in all possible branches (if, elif, and else blocks) or at the end.
da: 1. Din funktion er en void-funktion, og derfor bør den ikke returnere en værdi. Dette inkluderer funktioner med syntaksen '-> void' og klassekonstruktører ('_init()'). 2. Du har angivet en returtype for din funktion, men du returnerer ikke en værdi i alle mulige grene (if, elif og else-blokke) eller i slutningen.
pt: 1. A sua função é uma função vazia, logo não deve retornar um valor. Isso inclui funções com a sintaxe '-> void' e construtores de classe ('_init()'). 2. Especificou um tipo de retorno na sua função, mas não retorna nenhum valor em todas as ramificações possíveis (blocos if, elif, e else) ou no final.

source: When your function is 'void', you should never return a value. You can use the 'return' keyword to end the function early, but you should never write anything after that.
da: Når din funktion er 'void', bør du aldrig returnere en værdi. Du kan bruge nøgleordet 'return' til at afslutte funktionen tidligt, men du bør aldrig skrive noget efter det.
pt: Quando a sua função está vazia (void), nunca deve retornar um valor. Pode usar a palavra-chave 'return' para encerrar a função mais cedo, mas nunca deve escrever nada depois disso.

source: When you use a return type, you must always return something at the end of the function or in every branch (if, elif, and else block) of the function.
da: Når du bruger en returtype, skal du altid returnere noget i slutningen af funktionen eller i hver gren (if, elif og else-blok) af funktionen.
pt: Quando usa um tipo de retorno, precisa sempre retornar algo no final da função ou em toda ramificação (blocos if, elif, e else) da função.

source: Godot was unable to load your script, yet the language checker found nothing wrong.
cs: Godot nebyl schopen načíst váš skript, ale kontrola jazyka nenašla nic špatného.
da: Godot kunne ikke indlæse dit script, men sprogkontrollen fandt ikke noget galt.
de: Godot konnte dein Skript nicht laden, trotzdem hat der Sprachprüfungsserver keinen Fehler erkannt.
es: Godot no pudo cargar tu script, aunque el comprobador de lenguajes de programación no encontró nada incorrecto.
fr: Godot n'a pas pu charger votre script, pourtant le vérificateur de langage n'a rien trouvé d'anormal.
it: Godot non è riuscito a caricare il tuo script, ma il tuo correttore di codice non ha trovato nulla di sbagliato.
ja: Godotはあなたのスクリプトを読み込めませんでしたが、言語チェッカーは何も問題を発見しませんでした。
nl: Godot heeft je script niet kunnen laden, maar de taalcontrole heeft niets verkeerds gevonden.
pt: Godot foi incapaz de carregar o seu script, porém o verificador da linguagem não encontrou nada de errado.
pt_br: Godot foi incapaz de carregar o seu script, porém o checador da linguagem não encontrou nada de errado.
ru: Godot не удалось загрузить ваш скрипт, однако инструмент проверки кода проблем не обнаружил.
ta: கோடோட் உங்கள் ச்கிரிப்டை ஏற்ற முடியவில்லை, ஆனால் மொழி சரிபார்ப்புக்கு எந்த தவறும் கிடைக்கவில்லை.
tr: Godot, betik dosyanızı yüklemeyi başaramadı, ama yine de dil kontrolcüsü herhangi bir sorun tespit edemedi.
uk: Godot не вдалося завантажити ваш скрипт, проте інструмент перевірки коду проблем не виявив.
zh_hans: Godot 无法加载您的脚本，但语言检查器服务器没有发现任何错误。 你可能不在线。
zh_hant: Godot 無法載入你的腳本，但語言檢查器並未發現任何問題。

source: Please click on the "report" button at the top and please let us know.
cs: Klikněte prosím na tlačítko „nahlásit“ v horní části a dejte nám vědět.
da: Klik venligst på knappen "anmeld" øverst, og giv os besked.
de: Bitte klicke oben auf den Button "Melden" und lasse es uns wissen.
es: Por favor, haz clic en el botón "informar" de la parte superior y háznoslo saber.
fr: Veuillez cliquer sur le bouton « signaler » en haut et nous en informer.
it: Per favore clicca sul pulsante "report" in alto e facci sapere.
ja: 上部の "報告 "ボタンをクリックして、お知らせください。
nl: Klik op de knop "Meld" bovenaan en laat het ons weten.
pt: Por favor, clique no botão "reportar" no topo e nos avise.
pt_br: Por favor, clique no botão "reportar" no topo e nos avise.
ru: Пожалуйста, нажмите на кнопку «сообщить об ошибке» вверху, чтобы оповестить нас о наличии проблемы.
ta: மேலே உள்ள "அறிக்கை" பொத்தானைக் சொடுக்கு செய்து, எங்களுக்குத் தெரியப்படுத்துங்கள்.
tr: Lütfen yukarıdaki "bildir" düğmesine tıklayın ve bunu bize haber verin.
uk: Будь ласка, натисніть кнопку «Повідомити про помилку» вгорі, щоб сповістити нас про наявність проблеми.
zh_hans: 如果您处于离线状态，则会出现此错误。 否则，请点击顶部的“举报”按钮，并告知我们。
zh_hant: 請點擊上方的「回報」按鈕並告訴我們。

source: You called a function inside itself. This will loop forever.
cs: Zavolali jste funkci uvnitř sebe sama(rekurzivně). Rekurze se bude opakovat věčně (infinite loop).
da: Du kaldte en funktion i sig selv. Dette vil køre i en løkke for evigt.
de: Du hast eine Funktion in sich selbst aufgerufen. Dies wird sich für immer wiederholen.
es: Llamaste a una función dentro de sí misma. Esto hará un bucle eterno.
fr: Vous avez appelé une fonction à l'intérieur d'elle-même. Cela tournera en boucle à l'infini.
it: Hai chiamato una funzione dentro se stessa. Questo ciclerà all'infinito.
ja: あなたは自分自身の中に関数を呼び出した。これは永遠にループする。
nl: Je hebt een functie binnen zichzelf aangeroepen. Dit zal eindeloos blijven herhalen.
pt: Chamou um função dentro dela mesma. Isso vai se repetir para sempre.
pt_br: Você chamou um função dentro dela mesma. Isso vai se repetir para sempre.
ru: Вы вызвали функцию внутри самой себя. Вызов зациклится и будет повторяться вечно.
ta: நீங்கள் ஒரு செயல்பாட்டை அழைத்தீர்கள். இது எப்போதும் சுழலும்.
tr: Bir fonksiyonu kendi içerisinde çağırdınız. Bu sonsuz döngüye sebep olacaktır.
uk: Ви викликали функцію всередині себе. Виклик зациклиться і повторюватиметься вічно.
zh_hans: 您在其内部调用了一个函数。 这将永远循环。
zh_hant: 你在函式內部呼叫了自己，這會導致無限迴圈。

source: There are valid reasons for using recursive functions, but none of them are part of this course, so this cannot be a valid solution.
cs: Existují oprávněné důvody pro použití rekurzivních funkcí, ale žádný z nich není součástí tohoto kurzu, takže toto nemůže být fungující řešení.
da: Der er gyldige grunde til at bruge rekursive funktioner, men ingen af dem er en del af dette kursus, så dette kan ikke være en gyldig løsning.
de: Es gibt gute Gründe für die Verwendung rekursiver Funktionen, aber keiner von ihnen ist Teil dieses Kurses, so dass dies keine gültige Lösung sein kann.
es: Hay razones válidas para utilizar funciones recursivas, pero ninguna de ellas forma parte de este curso, por lo que esta no puede ser una solución válida.
fr: Il existe des raisons valables pour utiliser des fonctions récursives, mais aucune d'entre elles ne fait partie de ce cours, donc cela ne peut pas être une solution valable.
it: Ci sono motivi validi per usare funzioni recursive, ma nessuna di queste è parte di questo corso, quindi questa non può essere una soluzione valida.
ja: 再帰関数を使用する正当な理由はありますが、それらはいずれもこのコースの一部ではないため、これは有効な解決策とはなりません。
nl: Er zijn geldige redenen om recursieve functies te gebruiken, maar geen daarvan maakt deel uit van deze cursus, dus dit kan geen geldige oplossing zijn.
pt: Há razões válidas para usar funções recursivas, mas nenhuma delas fazem parte desse curso, então isso não pode ser uma solução válida.
pt_br: Há razões válidas para usar funções recursivas, mas nenhuma delas fazem parte desse curso, então isso não pode ser uma solução válida.
ru: Существуют веские причины для использования рекурсивных функций, но ни одна из них не является частью этого курса, поэтому использование рекурсии не может быть правильным решением.
ta: சுழல்நிலை செயல்பாடுகளைப் பயன்படுத்துவதற்கு சரியான காரணங்கள் உள்ளன, ஆனால் அவை எதுவும் இந்த பாடத்தின் ஒரு பகுதியாக இல்லை, எனவே இது சரியான தீர்வாக இருக்க முடியாது.
tr: Öz çağrılı (recursive) fonksiyonlar kullanmak için geçerli pek çok sebep var, ama bunların hiçbiri bu kursun parçası değil, bu nedenle çözümünüz geçerli bir çözüm değildir.
uk: Існують вагомі причини використання рекурсивних функцій, але жодна з них не є частиною цього курсу, тому використання рекурсії не може бути правильним рішенням.
zh_hans: 使用递归函数有正当理由，但它们都不是本课程的一部分，因此这不是一个有效的解决方案。
zh_hant: 使用遞迴函式是有正當理由的，但這些理由並不包含在本課程中，因此這不是一個有效的解決方案。

source: The computer reached the end of the line of code, but the line had a syntax error. The most common case is when you forget to close a string: you have opening quotes, but you forget to add a matching closing quote.
cs: Počítač došel na konec řádku kódu, ale řádek obsahoval syntaktickou chybu. Nejčastějším případem je, když zapomenete uzavřít řetězec: máte otevírací uvozovky, ale zapomenete přidat odpovídající uzavírací uvozovky.
da: Computeren nåede slutningen af kodelinjen, men linjen havde en syntaksfejl. Det mest almindelige tilfælde er, når man glemmer at afslutte en streng: man har indledende anførselstegn, men man glemmer at tilføje et matchende afsluttende anførselstegn.
de: Der Computer hat das Ende der Codezeile erreicht, aber die Zeile hatte einen Syntaxfehler. Der häufigste Fall ist, dass du vergessen hast, eine Zeichenfolge zu schließen: Du hast öffnende Anführungszeichen, aber vergessen, ein passendes schließendes Anführungszeichen hinzuzufügen.
es: El ordenador llegó al final de la línea de código, pero la línea tenía un error de sintaxis. El caso más común es cuando te olvidas de cerrar una cadena: tienes comillas de apertura, pero te olvidas de añadir las comillas de cierre correspondientes.
fr: L'ordinateur a atteint la fin de la ligne de code, mais celle-ci comportait une erreur de syntaxe. Le cas le plus courant est l'oubli de fermer une chaîne de caractères : vous avez des guillemets ouvrants, mais vous oubliez d'ajouter un guillemet fermant correspondant.
it: Il computer ha raggiunto la fine della riga di codice, ma la riga presenta un errore di sintassi. Il caso più comune è quando si dimentica di chiudere una stringa: si hanno le virgolette di apertura, ma si dimentica di aggiungere le virgolette di chiusura corrispondenti.
ja: コンピューターはコード行の終わりに到達しましたが、その行に構文エラーがありました。 最も一般的なケースは、文字列を閉じるのを忘れた場合です。開始引用符はあるものの、対応する終了引用符を追加するのを忘れています。
nl: De computer heeft het einde van de regel code bereikt, maar de regel had een vormfout. Het meest voorkomende geval is wanneer je vergeet een string te sluiten: je hebt openende aanhalingstekens, maar je vergeet de bijpassende sluitende aanhalingstekens toe te voegen.
pt_br: O computador chegou ao fim da linha do código, mas a linha tem um erro de sintaxe. O caso mais comum é quando você se esquece de fechar uma string: você tem aspas de abertura, mas esqueceu de adicionar aspas no final para fechar.
ru: Компьютер достиг конца строки кода, но в этой строке была синтаксическая ошибка. Наиболее распространенный случай — когда вы забыли закрыть строку: у вас есть открывающие кавычки, но вы забыли добавить соответствующую закрывающую кавычку.
ta: கணினி குறியீட்டின் முடிவை அடைந்தது, ஆனால் வரியில் ஒரு தொடரியல் பிழை இருந்தது. நீங்கள் ஒரு சரத்தை மூட மறந்துவிடும்போது மிகவும் பொதுவான வழக்கு: நீங்கள் தொடக்க மேற்கோள்களைக் கொண்டிருக்கிறீர்கள், ஆனால் பொருந்தக்கூடிய இறுதி மேற்கோளைச் சேர்க்க மறந்துவிட்டீர்கள்.
tr: Bilgisayar, kodun son satırına ulaştı, ama bu satırda bir yazım hatası var. En yaygın durum, yukarıda bir yerlerde bir dizeyi kapatmayı unutmanızdır: başlangıç tırnak işaretini koyarsınız, ama karşılık gelen kapanış tırnağını unutursunuz.
uk: Комп'ютер досяг кінця рядка коду, але в цьому рядку була синтаксична помилка. Найпоширеніший випадок — коли ви забули закрити рядок: у вас є відкривні лапки, але ви забули додати відповідні закривні лапки.
zh_hans: 计算机运行到代码行的末尾，但该行出现了语法错误。 最常见的情况是忘记关闭字符串：有了开头引号，却忘记添加结尾引号。
zh_hant: 系統已經到達程式碼的結尾，但該行存在語法錯誤。 最常見的情況是你忘記閉合字串：你有開啟的引號，但忘記加上匹配的閉合引號。

source: Double-check that you are not missing a quote character or that the quote character you used to start the string is the same as the one you used to close the string.
cs: Překontrolujte, zda nechybí znak uvozovky nebo zda znak uvozovky, který jste použili na začátku řetězce, je stejný jako znak uvozovky, který jste použili na konci řetězce.
da: Dobbelttjek, at du ikke mangler et anførselstegn, eller at det anførselstegn, du brugte til at starte strengen, er det samme som det, du brugte til at afslutte strengen.
de: Vergewissere dich, dass kein Anführungszeichen fehlt oder dass das Anführungszeichen, mit dem du die Zeichenfolge begonnen hast, mit dem übereinstimmt, das du zum Schließen der Zeichenfolge verwendet hast.
es: Comprueba que no te falta ninguna comilla o que la comilla con la que empiezas la cadena es la misma que utilizas para cerrarla.
fr: Vérifiez à nouveau qu'il ne vous manque pas de guillemet ou que le guillemet que vous avez utilisé pour démarrer la chaîne est le même que celui que vous avez utilisé pour fermer la chaîne.
it: Verificate che non manchi un carattere di virgolette o che il carattere di virgolette usato per iniziare la stringa sia lo stesso usato per chiuderla.
ja: 引用符が抜けていないか、文字列の開始に使用した引用文字が文字列の終了に使用したものと同じであることを再確認してください。
nl: Controleer of je geen aanhalingsteken mist of dat het aanhalingsteken dat je hebt gebruikt om de string te beginnen hetzelfde is als het teken dat je hebt gebruikt om de string te sluiten.
pt_br: Certifique-se que não está faltando aspas ou que as aspas que você usou para iniciar a string é a mesma que usou para fechá-la.
ru: Дважды проверьте, не пропущен ли символ кавычки или что символ кавычки, который вы использовали для начала строки, совпадает с тем, который вы использовали для закрытия строки.
ta: நீங்கள் ஒரு மேற்கோள் எழுத்தை காணவில்லை அல்லது சரத்தைத் தொடங்க நீங்கள் பயன்படுத்திய மேற்கோள் எழுத்து நீங்கள் சரத்தை மூடுவதற்கு பயன்படுத்தியதைப் போன்றது என்பதை இருமுறை சரிபார்க்கவும்.
tr: Tırnak işareti karakterini unutmadığınızı, ya da başlayan ve kapatanın tırnakların aynı olduğunu iki defa kontrol edin. (tek, çift ve ters tırnak işaretleri).
uk: Двічі перевірте, чи не пропущено символ лапок або що символ лапок, використаний на початку рядка, збігається з використаним для закриття рядка.
zh_hans: 仔细检查是否缺少一个引号字符，或者用于开始字符串的引号字符与用于结束字符串的引号字符是否相同（译者注：单双引号要匹配）。
zh_hant: 仔細檢查是否漏掉了引號字元，或是你用來開啟字串的引號與用來閉合字串的引號是否相同。

source: The sub-variable you are trying to access does not exist.
cs: Dílčí proměnná, ke které se snažíte získat přístup, neexistuje.
da: Den undervariabel, du forsøger at tilgå, findes ikke.
de: Die Untervariable, auf die du zuzugreifen versuchst, existiert nicht.
es: La subvariable a la que intentas acceder no existe.
fr: La sous-variable à laquelle vous essayez d'accéder n'existe pas.
it: La sotto variabile a cui si sta cercando di accedere non esiste.
ja: アクセスしようとしているサブ変数は存在しません。
nl: De deelvariabele die je probeert te gebruiken bestaat niet.
pt_br: A sub-variável que você está tentando acessar não existe.
ru: Подпеременная, к которой вы пытаетесь получить доступ, не существует.
ta: நீங்கள் அணுக முயற்சிக்கும் துணை மாறுபாடு இல்லை.
tr: Kullanmaya çalıştığınız alt-değişken tanımlı değil.
uk: Підзмінна, до якої ви намагаєтеся отримати доступ, не існує.
zh_hans: 您试图访问的子变量不存在。
zh_hant: 你嘗試存取的子變數並不存在。

source: You probably have a typo in the name of the sub-variable that you are trying to access.
da: Du har sandsynligvis en tastefejl i navnet på den undervariabel, du prøver at tilgå.

source: Ensure that you don't have a capital letter where you should have a lowercase letter and vice versa.
da: Sørg for, at du ikke har et stort bogstav, hvor du burde have et lille bogstav, og omvendt.

source: This error tells you you are missing some parenthesis, a comma, or some value in your export hint.
es: Este error te indica que te falta algún paréntesis, una coma o algún valor en tu sugerencia de exportación.
fr: Cette erreur vous indique qu'il vous manque une parenthèse, une virgule ou une valeur dans votre indice d'exportation.
it: Questo errore ti dice che ti mancano delle parentesi, una virgola o qualche valore nel tuo suggerimento di export.
ja: このエラーは、エクスポート ヒントに括弧、カンマ、または値が欠落していることを示します。
nl: Deze foutmelding vertelt je dat er haakjes, komma's of andere waarden ontbreken in je exporthint.
pt: Esse erro diz-lhe que falta algum parêntese, uma vírgula ou algum valor na sua dica de exportação.
ru: Данная ошибка говорит вам о том, что в вашем описании параметров экспорта переменной отсутствуют какие-то круглые скобки, запятая или какое-то значение.
zh_hans: 此错误告诉您在导出提示中缺少某些括号、逗号或某些值。
