Repository: GDQuest/learn-gdscript
Catalog: i18n/*/error_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: When defining a new class, you need to follow a specific pattern. You must write the name in plain text, starting with a letter. We typically write class names in PascalCase: with a capital letter at the start of every word that composes the class name.
cs: Při definování nové třídy se musíte řídit konkrétním vzorem. Jméno musíte napsat jako prostý text, počínaje písmenem. Názvy tříd obvykle píšeme v PascalCase: s velkým písmenem na začátku každého slova, které tvoří název třídy.
de: Beim Definieren einer neuen Klasse musst Du einem bestimmten Muster folgen. Du musst den Namen im Klartext schreiben, beginnend mit einem Buchstaben. Normalerweise schreiben wir Klassennamen in PascalCase: mit einem Großbuchstaben am Anfang jedes Wortes, aus dem sich der Klassenname zusammensetzt.
es: Al definir una nueva clase, debes seguir un patrón específico. Debes escribir el nombre en texto simple, el cual debe comenzar con una letra. Normalmente escribimos los nombres de las clases en PascalCase: con una letra mayúscula al principio de cada palabra que compone el nombre de la clase.
fr: Lors de la définition d'une nouvelle classe, vous devez suivre un modèle spécifique. Vous devez écrire le nom en texte brut, en commençant par une lettre. Nous écrivons généralement les noms de classe en PascalCase : avec une lettre majuscule au début de chaque mot qui compose le nom de la classe.
it: Quando definisci una nuova classe, devi seguire uno schema specifico. Devi scrivere il nome in testo semplice, che inizi con una lettera. Tipicamente scriviamo il nome di una classe in PascalCase: con una lettera maiuscola all'inizio di ogni parola che compone il nome della classe.
ja: 新しいクラスを定義するときは、特定のパターンに従わなければならない。クラス名は文字で始まるプレーンテキストで書かなければなりません。 通常、クラス名はPascalCaseで書きます。クラス名を構成するすべての単語の先頭に大文字をつけます。
nl: Wanneer je een nieuwe klasse definieert, moet je een specifiek patroon volgen. Je moet de naam in normale tekst schrijven, beginnend met een letter. We schrijven klassenamen meestal in PascalCase: met een hoofdletter aan het begin van elk woord waaruit de klassenaam bestaat.
pt_br: Quando definir uma nova classe, você precisa seguir um padrão específico. Você precisa escrever o nome dela com texto puro, começando com uma letra. Nós tipicamente escrevemos nome de classes em PascalCase: Com uma letra em maiúscula no começo de cada palavra que compõe o nome da classe.
ru: При определении нового класса вам необходимо следовать определенному шаблону. Вы должны написать имя обычным текстом, начиная с буквы. Обычно мы пишем имена классов в стиле PascalCase: с заглавной буквы в начале каждого слова, составляющего имя класса.
ta: ஒரு புதிய வகுப்பை வரையறுக்கும் போது, நீங்கள் ஒரு குறிப்பிட்ட முறையைப் பின்பற்ற வேண்டும். ஒரு கடிதத்துடன் தொடங்கி நீங்கள் பெயரை எளிய உரையில் எழுத வேண்டும். நாங்கள் பொதுவாக பாச்கால்கேசில் வகுப்பு பெயர்களை எழுதுகிறோம்: வர்க்கப் பெயரை உருவாக்கும் ஒவ்வொரு வார்த்தையின் தொடக்கத்திலும் ஒரு மூலதன எழுத்துடன்.
tr: Yeni bir sınıf tanımlarken, belirli bir kalıbı takip etmelisiniz. Bir harf ile başlayan düz yazı bir isim yazmalısınız (genelde İngilizce harflerle) Sınıf isimlerinde, özgün olarak PascalCase kullanırız: sınıf ismini oluşturan her kelime, ilk harfi büyük olacak şekilde birleşir.
uk: Визначаючи новий клас вам слід дотримуватися певного шаблону. Назву слід писати звичайним текстом, починаючи з літери. Зазвичай ми пишемо назви класів у стилі PascalCase: з великої букви на початку кожного слова, з яких складено назву класу.
zh_hans: 定义新类时，您需要遵循特定模式。 您必须以纯文本形式书写名称，以字母开头。 我们通常用 PascalCase 写类名：在组成类名的每个单词的开头都有一个大写字母。
zh_hant: 當定義一個新類別時，您需要遵循特定的模式。類別名稱必須以字母開頭，並且使用純文字編寫。 我們通常使用 PascalCase 來書寫類別名稱：每個單字的首字母皆大寫。

source: To fix this error, replace whatever you put after the 'extends' or 'class_name' keyword by a name without spaces and starting with a capital letter. You can optionally use numbers in the name, but not in the first position.
cs: Chcete-li tuto chybu opravit, nahraďte vše, co jste vložili za klíčové slovo 'extends' nebo 'class_name', názvem bez mezer a s počátečním velkým písmenem. Volitelně můžete v názvu použít čísla, ale ne na první pozici.
de: Um diesen Fehler zu beheben, ersetze alles, was Du nach dem Schlüsselwort "extends" oder "class_name" eingeben hast, durch einen Namen ohne Leerzeichen und beginnend mit einem Großbuchstaben. Du kannst optional Zahlen im Namen verwenden, jedoch nicht an der ersten Position.
es: Para solucionar este error, reemplaza lo que hayas puesto después de la palabra clave "extends" o "class_name" por un nombre sin espacios y que empiece con una letra mayúscula. Puedes utilizar opcionalmente números en el nombre, pero no en la primera posición.
fr: Pour corriger cette erreur, remplacez ce que vous avez mis après le mot-clé 'extends' ou 'class_name' par un nom sans espace et commençant par une majuscule. Vous pouvez éventuellement utiliser des chiffres dans le nom, mais pas en première position.
it: Per risolvere questo errore, rimpiazza qualsiasi cosa tu abbia messo dopo le parole chiave "extends" o "class_name" con un nome senza spazi e che inizi con una lettera maiuscola. Volendo puoi inserire i numeri nel nome, ma non nella prima posizione.
ja: このエラーを修正するには、'extends'または'class_name'キーワードの後に付ける名前を、スペースを含まず大文字で始まる名前に置き換えてください。 名前に数字を使用することもできますが、最初の位置には使用しないでください。
nl: Om deze fout op te lossen, vervangt je het sleutelwoord 'extends' of 'class_name' door een naam zonder spaties en beginnend met een hoofdletter. Je kunt optioneel getallen gebruiken in de naam, maar niet meteen aan het begin.
pt_br: Para resolver esse erro, substitua tudo aquilo que você colocou depois das palavras-chave 'extends' ou 'class_name' por um nome sem espaços entre eles e começando com uma letra em maiúscula. Você tem a opção de usar números no nome, mas não na primeira posição (não pode começar com números).
ru: Чтобы исправить эту ошибку, замените всё, что вы поместили после ключевых слов «extends» или «class_name» именем без пробелов, начинающимся с заглавной буквы. По желанию вы можете использовать цифры в имени, но не в качестве первого символа.
ta: இந்த பிழையை சரிசெய்ய, 'நீட்டிக்கப்பட்டவை' அல்லது 'வகுப்பு_பெயர்' முக்கிய சொல்லை இடைவெளிகள் இல்லாமல் ஒரு பெயரால் மற்றும் மூலதன கடிதத்துடன் தொடங்கிய பிறகு நீங்கள் வைத்திருக்கும் எதையும் மாற்றவும். நீங்கள் விருப்பமாக பெயரில் எண்களைப் பயன்படுத்தலாம், ஆனால் முதல் நிலையில் இல்லை.
tr: Bu hatayı düzeltmek için, 'extends' ya da 'class_name' anahtar kelimelerinden sonra her ne yazdıysanız, ilk harfi büyük olan ve boşluk içermeyen bir isimle değiştirmelisiniz. İsteğe bağlı olarak ismin içinde numaralar kullanabilirsiniz, ama kesinlikle ilk başta olmasınlar (bir harf ile başlamalı).
uk: Щоб виправити цю помилку, замініть все, що ви помістили після ключових слів «extends» або «class_name» назвою без пропусків, що починається з великої літери. За бажанням ви можете використовувати в назві цифри, але не як перший символ.
zh_hans: 要修复此错误，请将您在 'extends' 或 'class_name' 关键字之后放置的任何内容替换为不带空格且以大写字母开头的名称。 您可以选择在名称中使用数字，但不能在第一个位置使用。
zh_hant: 要修正這個錯誤，請將 'extends' 或 'class_name' 關鍵字後面所寫的名稱，替換為不包含空格並且以大寫字母開頭的名稱。 您可以選擇在名稱中使用數字，但不能將數字放在名稱的第一個位置。

source: You are trying to define a function or variable that already exists; You can't do that. Perhaps the function or variable already exists in the current code file, but it may also be in a parent class that this GDScript code extends.
cs: Pokoušíte se definovat funkci nebo proměnnou, která již existuje; To nemůžeš. Možná funkce nebo proměnná již existuje v aktuálním souboru kódu, ale může být také v nadřazené třídě, kterou tento kód GDScript rozšiřuje.
de: Du versuchst, eine Funktion oder Variable zu definieren, die bereits vorhanden ist. Das geht nicht. Möglicherweise ist die Funktion oder Variable bereits in der aktuellen Codedatei vorhanden, aber es kann sich auch in einer übergeordneten Klasse befinden, die dieser GDScript-Code erweitert.
es: Estás intentando definir una función o variable que ya existe; no es posible hacer esto. Quizás la función o variable ya existe en el archivo de código actual, pero también puede estar en una clase padre que extiende este código GDScript.
fr: Vous essayez de définir une fonction ou une variable qui existe déjà ; vous ne pouvez pas faire cela. Peut-être que la fonction ou la variable existe déjà dans le fichier de code actuel, mais elle pourrait aussi se trouver dans une classe parent que ce code GDScript étend.
it: Stai cercando di definire una funzione o una variabile che già esiste; Non lo puoi fare. Forse la funzione o la variabile già esiste nel corrente file di codice, ma potrebbe pure essere in una classe genitore che questo codice GDScript estende.
ja: 既に存在する関数や変数を定義しようとしています。 おそらく、その関数や変数は現在のコードファイルに既に存在していますが、この GDScript コードが継承している親クラスにも存在している可能性があります。
nl: Je probeert een functie of variabele te definiëren die al bestaat; dat kan niet. Misschien bestaat de functie of variabele al in het huidige codebestand, maar het kan ook zijn dat deze in een bovenliggende klasse zit waar deze GDScript-code een uitbreiding van is.
pt_br: Você está tentando definir uma função ou variável que já existe. Você não pode fazer isso. Talvez a função ou variável já exista no arquivo de código atual, mas também pode estar na classe pai que esse código de GDScript estende.
ru: Вы пытаетесь определить функцию или переменную, которая уже существует. Этого делать нельзя. Возможно, функция или переменная уже существует в текущем файле кода, либо в родительском классе, от которого унаследован текущий файл.
ta: ஏற்கனவே இருக்கும் ஒரு செயல்பாடு அல்லது மாறியை நீங்கள் வரையறுக்க முயற்சிக்கிறீர்கள்; நீங்கள் அதை செய்ய முடியாது. தற்போதைய குறியீடு கோப்பில் ஏற்கனவே செயல்பாடு அல்லது மாறி இருக்கலாம், ஆனால் இந்த GDSCRIPT குறியீடு நீட்டிக்கும் பெற்றோர் வகுப்பிலும் இருக்கலாம்.
tr: Zaten var olan bir fonksiyon ya da değişkeni tanımlamaya çalışıyorsunuz. Bunu yapamazsınız. Bu aktif kod dosyasında bulunan bir fonksiyon ya da değişken, belki de bu GDScript kodunun içe aktarıp genişlettiği (extends) ana sınıfın içerisinde de tanımlanmıştır.
uk: Ви намагаєтесь визначити функцію або змінну, яка вже існує. Цього робити не можна. Можливо, функція або змінна вже існує в поточному файлі коду, або в батьківському класі, від якого успадковано поточний файл.
zh_hans: 您正在尝试定义一个已经存在的函数或变量； 你不能那样做。 可能函数或变量已经存在于当前代码文件中，但它也可能位于此 GDScript 代码扩展的父类中。
zh_hant: 您正嘗試定義一個已經存在的函式或變數；這樣是不可行的。 這個函式或變數可能已經存在於當前的程式碼檔案中，也有可能是存在於此 GDScript 程式碼所繼承的父類別中。

source: In the app, your code extends some built-in Godot code that's not visible to you. When that happens, you need to either rename your function or variable to one that will not collide with an existing one or remove this line of code.
cs: Váš kód v aplikaci rozšiřuje vestavěný kód Godotu, který není viditelný. Když se to stane, musíte buď přejmenovat svou funkci nebo proměnnou na takovou, která nebude kolidovat s již existující funkcí nebo tento řádek kódu odstranit.
de: In der App erweitert Dein Code einen integrierten Godot-Code, der für Dich nicht sichtbar ist. Wenn das passiert, musst Du entweder deine Funktion oder Variable in eines umbenennen, das nicht mit einem vorhandenen kollidiert, oder diese Codezeile entfernen.
es: En la aplicación, tu código extiende un código incorporado de Godot que no es visible para ti. Cuando esto ocurra, deberás cambiar el nombre de tu función o variable por uno que no colisione con un nombre ya existente o eliminar esta línea de código.
fr: Dans l'application, votre code étend du code de Godot intégré qui n'est pas visible pour vous. Lorsque cela se produit, vous devez soit remplacer le nom de votre fonction ou variable par un qui n'entrera pas en collision avec un nom existant, soit supprimer cette ligne de code.
it: Nell'applicazione, il tuo codice estende alcuni codici integrati di Godot a cui tu non puoi accedere. Quando questo succede, devi o rinominare la tua funzione o la variabile con un nome che non entri in conflitto con uno già esistente o rimuovi questa riga di codice.
ja: アプリの中で、あなたのコードが、あなたには見えない組み込みのGodotコードを拡張しています。 そのような場合は、関数名や変数名を既存のものと衝突しないものに変更するか、このコード行を削除する必要があります。
nl: In de app breidt je code wat ingebouwde Godot-code uit die niet zichtbaar is voor jou. Wanneer dat gebeurt, moet je je functie of variabele een andere naam geven die niet botst met een bestaande functie, of deze regel code verwijderen.
pt_br: No app, seu código estende alguns códigos que já vêm integrado na Godot que não visíveis para você. Quando isso acontece, você precisa: ou renomear sua função ou variável que não seja igual a um nome que já exista nesses códigos integrados ou remover essa linha de código.
ru: В приложении ваш код наследует некоторый встроенный код Godot, который вам не виден. Для исправления ошибки вам нужно либо переименовать свою функцию или переменную так, чтобы она не конфликтовала с уже существующей, либо удалить эту строку кода.
ta: பயன்பாட்டில், உங்கள் குறியீடு உங்களுக்குத் தெரியாத சில உள்ளமைக்கப்பட்ட கோடோட் குறியீட்டை விரிவுபடுத்துகிறது. அது நிகழும்போது, உங்கள் செயல்பாடு அல்லது மாறியை ஏற்கனவே இருக்கும் ஒன்றோடு மோதாத அல்லது இந்த குறியீட்டின் வரியை அகற்ற வேண்டும்.
tr: Uygulama içinde yazdığınız kodlar, sizin göremediğiniz ama Godot içinde gömülü gelen bazı kodları içe aktarıp genişletir (extends). Bu olduğunda, yazdığınız fonksiyon ya da değişken ismini, var olanlarla çakışmayacak şekilde değiştirmeli veya bu kod satırını tamamen silmelisiniz.
uk: У застосунку ваш код успадковує деякий вбудований код Godot, якого вам не видно. Для виправлення помилки вам потрібно або перейменувати свою функцію чи змінну так, щоб вона не конфліктувала з наявною, або видалити цей рядок коду.
zh_hans: 在应用程序中，您的代码扩展了一些您看不到的内置 Godot 代码。 发生这种情况时，您需要将函数或变量重命名为不会与现有函数或变量发生冲突的函数或变量，或者删除这行代码。
zh_hant: 在應用程式中，您的程式碼擴展了某些內建的 Godot 程式碼，而這些程式碼對您是不可見的。 當發生這種情況時，您需要將您的函式或變數重新命名為不會與現有名稱衝突的名稱，或者移除這行程式碼。

source: You are trying to define a signal that already exists; You can't do that. Perhaps the signal already exists in the current code file, but it may also be in a parent class that this GDScript code extends.
cs: Snažíte se definovat signál, který již existuje; To nelze. Možná, že signál již existuje v aktuálním souboru kódu, ale může být také v nadřazené třídě, kterou tento kód GDScript rozšiřuje.
de: Du versuchst, ein Signal zu definieren, das bereits vorhanden ist. Das geht nicht. Möglicherweise ist das Signal bereits in der aktuellen Codedatei vorhanden, aber es kann sich auch in einer übergeordneten Klasse befinden, die dieser GDScript-Code erweitert.
es: Estás tratando de definir una señal que ya existe; no es posible hacer esto. Quizás la señal ya existe en el archivo de código actual, pero también puede estar en una clase padre que extiende este código GDScript.
fr: Vous essayez de définir un signal qui existe déjà ; vous ne pouvez pas faire cela. Peut-être que le signal existe déjà dans le fichier de code actuel, mais il pourrait aussi se trouver dans une classe parent que ce code GDScript étend.
it: Stai cercando di definire un segnale che già esiste; Non puoi farlo. Forse il segnale già esiste nel seguente file di codice, ma potrebbe pure essere in una classe genitore che questo codice GDScript estende.
ja: すでに存在するシグナルを定義しようとしています。 おそらく、そのシグナルは現在のコードファイルに既に存在していますが、このGDScriptコードが継承している親クラスにも存在している可能性があります。
nl: Je probeert een signaal te definiëren dat al bestaat; dat kan niet. Misschien bestaat het signaal al in het huidige codebestand, maar het kan ook in een bovenliggende klasse zitten die deze GDScript-code uitbreidt.
pt_br: Você está tentando definir um sinal que já existe; Você não pode fazer isso. Talvez esse sinal já exista no arquivo do código atual, mas também pode estar na classe pai que esse código de GDScript estende.
ru: Вы пытаетесь определить сигнал, который уже существует; Этого делать нельзя. Возможно, сигнал уже существует в текущем файле кода, либо в родительском классе, от которого унаследован текущий файл.
ta: ஏற்கனவே இருக்கும் ஒரு சமிக்ஞையை நீங்கள் வரையறுக்க முயற்சிக்கிறீர்கள்; நீங்கள் அதை செய்ய முடியாது. தற்போதைய குறியீடு கோப்பில் சமிக்ஞை ஏற்கனவே இருக்கலாம், ஆனால் இந்த GDSCRIPT குறியீடு நீட்டிக்கும் பெற்றோர் வகுப்பிலும் இருக்கலாம்.
tr: Zaten var olan bir sinyali (signal) yeniden tanımlamaya çalışıyorsunuz. Bunu yapamazsınız. Yazdığınız kod dosyasındaki bu sinyal, belki de bu GDScript kodunun içe aktarıp genişlettiği (extends) ana sınıfta da vardır.
uk: Ви намагаєтесь визначити сигнал, який вже існує. Цього робити не можна. Можливо, сигнал вже існує в поточному файлі коду, або у батьківському класі, від якого успадковано поточний файл.
zh_hans: 您正在尝试定义一个已经存在的信号； 你不能那样做。 可能信号已经存在于当前代码文件中，但它也可能位于此 GDScript 代码扩展的父类中。
zh_hant: 您正嘗試定義一個已經存在的訊號；這樣是不可行的。 這個訊號可能已經存在於當前的程式碼檔案中，也有可能是存在於此 GDScript 程式碼所繼承的父類別中。

source: In the app, your code extends some built-in Godot code that's not visible to you. When that happens, you need to either rename your signal to one that will not collide with an existing one or remove this line of code.
cs: Váš kód v aplikaci rozšiřuje integrovaný kód Godotu, který není viditelný. Když se to stane, musíte buď přejmenovat svůj signál na takový, který nebude kolidovat s existujícím, nebo tento řádek kódu odstranit.
de: In der App erweitert Dein Code einen integrierten Godot-Code, der für Dich nicht sichtbar ist. Wenn das passiert, musst Du entweder dein Signal in eines umbenennen, das nicht mit einem vorhandenen kollidiert, oder diese Codezeile entfernen.
es: En la aplicación, tu código extiende un código incorporado de Godot que no es visible para ti. Cuando esto ocurra, deberás cambiar el nombre de tu señal por otro que no colisione con uno ya existente o eliminar esta línea de código.
fr: Dans l'application, votre code étend du code de Godot intégré qui n'est pas visible pour vous. Lorsque cela se produit, vous devez soit remplacer le nom de votre signal par un qui n'entrera pas en collision avec un nom existant, soit supprimer cette ligne de code.
it: Nell'applicazione, il tuo codice estende alcuni codici integrati di Godot a cui tu non puoi accedere. Quando questo succede, devi o rinominare il tuo segnale con un nome che non entri in conflitto con uno già esistente o rimuovi questa riga di codice.
ja: アプリの中で、あなたのコードが、あなたには見えない組み込みのGodotコードを拡張しています。 そのような場合は、既存のシグナルと衝突しないようにシグナル名を変更するか、このコード行を削除する必要があります。
nl: In de app breidt je code wat ingebouwde Godot-code uit die niet zichtbaar is voor jou. Wanneer dat gebeurt, moet je ofwel je signaal een andere naam geven zodat het niet botst met een bestaand signaal, ofwel deze coderegel verwijderen.
pt_br: No app, seu código estende alguns códigos que já vêm integrado na Godot que não visíveis para você. Quando isso acontece, você precisa: ou renomear seu sinal que não seja igual a um nome que já exista nesses códigos integrados ou remover essa linha de código.
ru: В приложении ваш код расширяет некоторый встроенный код Godot, который вам не виден. Для исправления ошибки вам нужно либо переименовать свой сигнал так, чтобы он не конфликтовал с уже существующим, либо удалить эту строку кода.
ta: பயன்பாட்டில், உங்கள் குறியீடு உங்களுக்குத் தெரியாத சில உள்ளமைக்கப்பட்ட கோடோட் குறியீட்டை விரிவுபடுத்துகிறது. அது நிகழும்போது, உங்கள் சமிக்ஞையை ஏற்கனவே இருக்கும் ஒன்றோடு மோதாத ஒன்றுக்கு மறுபெயரிட வேண்டும் அல்லது இந்த குறியீட்டின் வரியை அகற்ற வேண்டும்.
tr: Uygulama içinde yazdığınız kodlar, sizin göremediğiniz ama Godot içinde gömülü gelen bazı kodları içe aktarıp genişletir (extends). Bu olduğunda, yazdığınız fonksiyon ya da değişken ismini, var olanlarla çakışmayacak şekilde değiştirmeli ya da bu kod satırını tamamen silmelisiniz.
uk: У застосунку ваш код розширює деякий вбудований код Godot, якого вам не видно. Для виправлення помилки потрібно або перейменувати свій сигнал так, щоб він не конфліктував з наявним, або видалити цей рядок коду.
zh_hans: 在应用程序中，您的代码扩展了一些您看不到的内置 Godot 代码。 发生这种情况时，您需要将信号重命名为不会与现有信号冲突的信号，或者删除这行代码。
zh_hant: 在應用程式中，您的程式碼擴展了某些內建的 Godot 程式碼，而這些程式碼對您來說是不可見的。 當發生這種情況時，您需要將訊號重新命名為不會與現有名稱衝突的名稱，或是移除這行程式碼。
