Repository: GDQuest/learn-gdscript
Catalog: i18n/*/error_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: A cyclic reference is when a class references itself, directly or indirectly. It has two possible causes: 1. You used the class name in the class itself. 2. Your code refers to another class that refers to this class, causing an endless reference cycle. Either way, due to how GDScript works in Godot 3, unfortunately,you cannot do this. Godot 4 should solve this problem, but you need to work around it in the meantime.
cs: Cyklický odkaz je, když se třída přímo nebo nepřímo odkazuje sama na sebe. Má dvě možné příčiny: 1. Název třídy jste použili v samotné třídě. 2. Váš kód odkazuje na jinou třídu, která odkazuje na tuto třídu, což způsobuje nekonečný referenční cyklus. Ať tak či onak, vzhledem k tomu, jak GDScript v Godotu 3 funguje, to bohužel nelze. Godot 4 by měl tento problém vyřešit, ale do té doby jej musíte obejít.
de: Eine zyklische Referenz liegt vor, wenn eine Klasse direkt oder indirekt auf sich selbst verweist. Es gibt zwei mögliche Ursachen: 1. Du hast den Klassennamen in der Klasse selbst verwendet. 2. Dein Code verweist auf eine andere Klasse, die auf diese Klasse verweist, was zu einem endlosen Referenzzyklus führt. So oder so, aufgrund der Funktionsweise von GDScript in Godot 3 kansnt du dies leider nicht tun. Godot 4 sollte dieses Problem lösen, aber Du musst es in der Zwischenzeit umgehen.
es: Una referencia cíclica es cuando una clase se referencia a sí misma, directa o indirectamente. Tiene dos posibles causas: 1. Utilizaste el nombre de la clase en la propia clase. 2. Tu código hace referencia a otra clase que hace referencia a esta clase, lo que provoca un ciclo de referencias interminable. De cualquier manera, debido a cómo funciona GDScript en Godot 3, lamentablemente, no puedes hacer esto. Godot 4 debería resolver este problema, pero mientras tanto tienes que lidiar con él usando soluciones alternas.
fr: Une référence cyclique, c'est lorsqu'une classe se référence elle-même, directement ou indirectement. Elle a deux causes possibles : 1. Vous avez utilisé le nom de la classe dans la classe elle-même. 2. Votre code fait référence à une autre classe qui fait référence à cette classe, ce qui provoque un cycle de référence sans fin. Quoi qu'il en soit, en raison de la façon dont GDScript fonctionne dans Godot 3, vous ne pouvez malheureusement pas faire cela. Godot 4 devrait résoudre ce problème, mais vous devez le contourner en attendant.
it: Una referenza ciclica avviene quando una classe si riferisce a se stessa, direttamente o indirettamente. Questo può avere due possibili cause: 1. Ha usato il nome della classe all'interno di essa. 2. Il tuo codice fa riferimento ad un'altra classe che fa riferimento a questa classe, causando una referenza ciclica senza fine. In ogni modo, a causa di come GDScript funziona in Godot 3, sfortunatamente, non lo puoi fare. Godot 4 dovrebbe risolvere questo problema, ma per ora avrai bisogno di un metodo alternativo.
ja: 循環参照とは、クラスが直接的または間接的にそれ自体を参照することです。 考えられる原因は次の 2 つです。 1. クラス自体でクラス名を使用しました。 2. コードがこのクラスを参照する別のクラスを参照しているため、無限の参照サイクルが発生します。 いずれにせよ、Godot 3 での GDScript の動作方法により、残念ながらこれを行うことはできません。 Godot 4 ではこの問題は解決されるはずですが、それまでの間は回避する必要があります。
nl: Er is sprake van een cyclische verwijzing als een klasse direct of indirect naar zichzelf verwijst. Het heeft twee mogelijke oorzaken: 1. Je hebt de klassenaam gebruikt in de klasse zelf. 2. Je code verwijst naar een andere klasse die naar deze klasse verwijst, wat een eindeloze verwijzingscyclus veroorzaakt. Hoe dan ook, door de manier waarop GDScript werkt in Godot 3, kan je dit helaas niet doen. Godot 4 zou dit probleem moeten oplossen, maar in de tussentijd moet je er omheen werken.
pt_br: Uma referência cíclica é quando uma classe referencia ela mesma, direta ou indiretamente. Possui duas causas possíveis: 1. Você usou o nome da classe na própria classe. 2. Seu código se refere a outra classe que se refere para esta classe, causando um ciclo de referência infinito. De qualquer jeito, devido ao jeito que o GDScript funciona no Godot 3, infelizmente, você não pode fazer isso. Godot 4 poderá resolver esse problema, mas você precisa contornar isso nesse meio tempo.
ru: Циклическая ссылка — это когда класс прямо или косвенно ссылается сам на себя. У циклической ссылки есть две возможные причины: 1. Вы использовали имя класса в самом классе. 2. Ваш код ссылается на другой класс, который ссылается на этот класс, вызывая бесконечный цикл ссылок. В любом случае, по внутренним правилам GDScript в Godot 3, использовать циклические ссылки нельзя. Godot 4 должен решить эту проблему, но пока вам нужно её обойти.
ta: ஒரு வகை நேரடியாகவோ அல்லது மறைமுகமாகவோ குறிப்பிடும்போது ஒரு சுழற்சி குறிப்பு. இதற்கு இரண்டு சாத்தியமான காரணங்கள் உள்ளன: 1. நீங்கள் வகுப்பில் வகுப்பு பெயரைப் பயன்படுத்தினீர்கள். 2. உங்கள் குறியீடு இந்த வகுப்பைக் குறிக்கும் மற்றொரு வகுப்பைக் குறிக்கிறது, இது முடிவற்ற குறிப்பு சுழற்சியை ஏற்படுத்துகிறது. எந்த வகையிலும், கோடோட் 3 இல் சி.டி.எச்ச்கிரிப்ட் எவ்வாறு செயல்படுகிறது என்பதன் காரணமாக, துரதிர்ச்டவசமாக, இதை நீங்கள் செய்ய முடியாது. கோடோட் 4 இந்த சிக்கலை தீர்க்க வேண்டும், ஆனால் இதற்கிடையில் நீங்கள் அதைச் சுற்றி வேலை செய்ய வேண்டும்.
tr: Dönüşsel bir başvuru, bir sınıfın doğrudan ya da dolaylı bir şekilde kendisine başvuru yapmasıdır. İki olası sebebi vardır: 1. Sınıfın ismini, sınıfın kendi içinde kullanmışsınızdır. 2. Sınıfın içinde kullandığınız başka bir sınıf, tekrardan bu sınıfa başvuru yapıyordur, bu şekilde sonu olmayan bir başvuru döngüsüne sebep oluyordur. Her iki durumda da GDScript'in Godot 3 içinde çalışma şeklinden dolayı, bunu yapamazsınız. Godot 4 bunu belki çözecektir, ama şimdilik sorunu başka şekilde çözmeye çalışmalısınız.
uk: Циклічне посилання — це коли клас прямо чи опосередковано посилається сам на себе. Воно має дві можливі причини: 1. Ви використали назву класу в самому класі. 2. Ваш код посилається на інший клас, який посилається на цей клас, викликаючи нескінченний цикл посилань. У будь-якому разі, за внутрішніми правилами GDScript у Godot 3, використовувати циклічні посилання не можна. Godot 4 має розв'язати цю проблему, але поки що вам слід її обійти.
zh_hans: 循环引用指的是某个类引用自己，无论是直接引用还是间接引用。 有两种可能的原因： 1. 你在类里面用了自己的类名。 2. 你的代码引用了另一个类，而该类又引用了这个类，造成了无限循环引用。 无论是哪一种原因，由于 Godot 3 中 GDScript 的内部原因，很遗憾，你都是不能这么做的。Godot 4 应该会解决这个问题，但你目前需要寻找替代方案。
zh_hant: 循環引用是指一個類別直接或間接地引用自身。 這可能有兩個原因： 1. 你在類別內部使用了類別自己。 2. 你的程式碼引用了另一個類別，而該類別又引用了這個類別，造成無限循環引用。 無論哪種情況，由於 GDScript 在 Godot 3 的運作方式，不幸的是，這是無法實現的。Godot 4 應該能解決這個問題，但目前你需要找到替代方法。

source: Erase the type hint in the error line, and the problem should disappear. At GDQuest, when we face this error, we remove the type hints on lines causing cyclic references. It solves the problem in the vast majority of cases.
cs: Vymažte návrh typu hodnoty v řádku s chybou a problém by měl zmizet. V GDQuestu, když čelíme této chybě, odstraníme nápovědy typu na řádcích způsobujících cyklické odkazy. Řeší problém v naprosté většině případů.
de: Lösch den Typhinweis in der Fehlerzeile, und das Problem sollte verschwinden. Wenn wir bei GDQuest mit diesem Fehler konfrontiert sind, entfernen wir die Typhinweise in Zeilen, die zyklische Verweise verursachen. Es löst das Problem in den allermeisten Fällen.
es: Borra la sugerencia de tipo en la línea de error y el problema debería desaparecer. En GDQuest, cuando nos enfrentamos a este error, eliminamos las sugerencias de tipo en las líneas que causan referencias cíclicas. Esto resuelve el problema en la gran mayoría de los casos.
fr: Effacez la suggestion de type dans la ligne d'erreur et le problème devrait disparaître. Dans GDQuest, lorsque nous sommes confrontés à cette erreur, nous supprimons les suggestions de type sur les lignes provoquant des références cycliques. Cela résout le problème dans la grande majorité des cas.
it: Elimina il suggerimento di tipo nella riga di errore e il problema dovrebbe scomparire. A GDQuest, quando incontriamo questo errore, rimuoviamo i suggerimenti di tipo sulle righe che causano le referenze cicliche. Questo risolve il problema nella maggior parte dei casi.
ja: エラー行のタイプヒントを消去すると、問題は解消されるはずです。 GDQuest では、このエラーが発生した場合、循環参照を引き起こしている行の型ヒントを削除します。 ほとんどの場合、これで問題は解決します。
nl: Verwijder de typehint in de foute regel en het probleem zou moeten verdwijnen. Wanneer we bij GDQuest met deze fout worden geconfronteerd, verwijderen we de type-aanwijzingen op regels die cyclische verwijzingen veroorzaken. Dit lost het probleem in de meeste gevallen op.
pt_br: Apague a dica de tipo na linha de erro, e o problema deve desaparecer. No GDQuest, quando encontramos esse erro, nós removemos as dicas de tipo nas linhas que causam referências cíclicas. Isso resolve o problema na grande maioria dos casos.
ru: Сотрите обозначение типа переменной в строке с ошибкой, и проблема должна исчезнуть. В GDQuest, когда мы сталкиваемся с этой ошибкой, мы удаляем обозначения типов переменных в строках, вызывающих циклические ссылки. Это решает проблему в подавляющем большинстве случаев.
ta: பிழை வரியில் வகை குறிப்பை அழிக்கவும், சிக்கல் மறைந்துவிடும். GDQuest இல், இந்த பிழையை நாம் எதிர்கொள்ளும்போது, சுழற்சி குறிப்புகளை ஏற்படுத்தும் வரிகளின் வகை குறிப்புகளை அகற்றுகிறோம். இது பெரும்பாலான நிகழ்வுகளில் உள்ள சிக்கலை தீர்க்கிறது.
tr: Hatada belirtilen satırdaki tipi silerseniz, sorunun düzelmesi gerekir. GDQuest'te, bir sorunla karşılaştığımızda, dönüşsel başvuruya sebep olan tip tanımlarını sileriz. Sorunlarımızın büyük çoğunluğu bu şekilde çözülüyor.
uk: Зітріть позначку типу змінної у рядку з помилкою, і проблема має зникнути. В GDQuest, коли ми стикаємося з цією помилкою, ми видаляємо позначення типів змінних у рядках, що спричиняють циклічні посилання. Це розв'язує проблему в переважній більшості випадків.
zh_hans: 将报错行的类型提示清除，问题应该就会消失。 在 GDQuest，我们遇到这个错误时，就会将造成循环引用的行上的类型提示移除。在绝大多数情况下都能解决问题。
zh_hant: 刪除錯誤行中的類型提示，問題應該就會消失。 在 GDQuest，當我們遇到這個錯誤時，我們會刪除導致循環引用的行上的類型提示。這樣做在大多數情況下能解決問題。

source: The indentation of your code (the number of tab characters at the start of the line) is incorrect. You are missing one or more tabs, or you inserted too many. The computer uses those leading tab characters on code lines to know which lines of code are part of a code block, like a function.
cs: Odsazení vašeho kódu (počet znaků tabulátoru na začátku řádku) je nesprávné. Chybí jeden nebo více tabulátorů nebo jste jich vložili příliš mnoho. Počítač používá tyto úvodní znaky tabulátoru na řádcích kódu k tomu, aby poznal, které řádky kódu jsou součástí bloku kódu, například funkce.
de: Der Einzug des Codes (die Anzahl der Tabulatorzeichen am Anfang der Zeile) ist falsch. Du hast eine oder mehrere Tabulatorzeichen vergessen oder hast zu viele eingefügt. Der Computer verwendet diese führenden Tabulatorzeichen in Codezeilen, um zu wissen, welche Codezeilen Teil eines Codeblocks sind, wie eine Funktion.
es: La sangría de tu código (el número de caracteres de tabulación al principio de la línea) es incorrecta. Te faltan uno o varios tabuladores, o has insertado demasiados. La computadora utiliza esos caracteres de tabulación iniciales en las líneas de código para saber qué líneas de código forman parte de un bloque de código, como una función.
fr: L'indentation de votre code (le nombre de caractères de tabulation au début de la ligne) est incorrecte. Il vous manque une ou plusieurs tabulations, ou vous en avez inséré trop. L'ordinateur utilise ces caractères de tabulation initiaux sur les lignes de code pour savoir quelles lignes de code font partie d'un bloc de code, comme une fonction.
it: L'indentazione del tuo codice (il numero di caratteri di tabbazione all'inizio della riga) è incorretto. Ti manca uno o più simboli di tabbazione o ne ha inseriti troppi. Il computer usa quei caratteri iniziali per capire quali righe fanno parte di un blocco di codice, come una funzione.
ja: コードのインデント (行頭のtab文字の数) が正しくありません。 1 つ以上のタブが欠落しているか、挿入したtabが多すぎます。 コンピューターは、コード行の先頭のtab文字を使用して、コードのどの行が関数などのコード ブロックの一部であるかを認識します。
nl: De inspringing van je code (het aantal tab-tekens aan het begin van de regel) is onjuist. Je mist één of meer tabs of je hebt er te veel ingevoegd. De computer gebruikt deze tab-tekens aan het begin van coderegels om te weten welke coderegels deel uitmaken van een codeblok, zoals een functie.
pt_br: A indentação do seu código (o número de caracteres de tabulação no começo da linha) está incorreto. Está faltando um ou mais caracteres de tabulação, ou você colocou demais. O computador usa esses caracteres de tabulação nas linhas de código para saber quais dessas linhas fazem parte de um bloco de código, como uma função por exemplo.
ru: Отступы в вашем коде (количество символов табуляции в начале строки) неверны. Вам не хватает одной или нескольких табуляций, или вы вставили их слишком много. Компьютер использует эти символы, чтобы распознать, к какому блоку, например функции, относятся строки кода.
ta: உங்கள் குறியீட்டின் உள்தள்ளல் (வரியின் தொடக்கத்தில் தாவல் எழுத்துகளின் எண்ணிக்கை) தவறானது. நீங்கள் ஒன்று அல்லது அதற்கு மேற்பட்ட தாவல்களைக் காணவில்லை, அல்லது பலவற்றை செருகினீர்கள். ஒரு செயல்பாடு போன்ற குறியீட்டுத் தொகுதியின் ஒரு பகுதி குறியீட்டின் எந்தக் கோடுகள் என்பதை அறிய கணினி குறியீடு வரிகளில் அந்த முன்னணி தாவல் எழுத்துக்களைப் பயன்படுத்துகிறது.
tr: Kodunun girinti miktarı yanlış. (satır başındaki sekme karakterlerinin sayısı) Bir ya da daha fazla sekme karakteri eksik, ya da çok fazla kullandınız. Bilgisayar, kod satırlarının başındaki bu sekme karakterlerini kullanarak, hangi satırların yazdığınız kodun (mesela fonksiyonun) gövdesine ait olduğunu anlamaya çalışır.
uk: Відступи у коді (кількість символів табуляції на початку рядка) неправильні. Не вистачає однієї чи кількох табуляцій, або ви вставили їх надто багато. Комп'ютер використовує ці символи, щоб розпізнати, до якого блоку, наприклад, функції, належать рядки коду.
zh_hans: 代码的缩进（行首的制表符数量）不正确。 您缺少一个或多个选项卡，或者您插入了太多选项卡。 计算机使用代码行上的那些前导制表符来了解哪些代码行是代码块的一部分，例如函数。
zh_hant: 你的程式碼縮排（行首的 tab 字符數量）不正確。 你可能遺漏了一個或多個 tab，或者插入了太多。 電腦利用這些行首的 tab 字符來識別程式碼行是否屬於某個程式區塊，例如一個函式。

source: If the line of code with the error is right after a line ending with a colon, like a function definition, you need one extra indent level compared to the previous line. In other words, your line should have one more leading tab character than the function definition.
cs: Pokud se řádek kódu s chybou nachází hned za řádkem končícím dvojtečkou, jako je definice funkce, je třeba oproti předchozímu řádku přidat jednu úroveň odsazení navíc. Jinými slovy, váš řádek by měl mít o jeden úvodní znak tabulátoru více než definice funkce.
de: Wenn sich die Codezeile mit dem Fehler direkt nach einer Zeile befindet, die mit einem Doppelpunkt endet, wie bei einer Funktionsdefinition, benötigst Du im Vergleich zur vorherigen Zeile eine zusätzliche Einzugsebene. Mit anderen Worten, Deine Zeile sollte ein führendes Tabulatorzeichen mehr haben als die Funktionsdefinition.
es: Si la línea de código con el error está justo después de una línea que termina con dos puntos, como la definición de una función, necesitas un nivel de sangría adicional en comparación con la línea anterior. En otras palabras, tu línea debe tener un carácter de tabulación más que la definición de la función.
fr: Si la ligne de code avec l'erreur se trouve juste après une ligne se terminant par deux points, comme une définition de fonction, vous avez besoin d'un niveau d'indentation supplémentaire par rapport à la ligne précédente. En d'autres termes, votre ligne doit avoir un caractère de tabulation de plus que la définition de la fonction.
it: Se la riga di codice con l'errore è subito dopo una riga che finisce con dei due punti, come una definizione di funzione, devi aggiungere un livello di indentazione extra rispetto alla riga precedente. In altre parole, la tua riga dovrebbe avere un'indentazione iniziale maggiore rispetto alla definizione della funzione.
ja: 関数定義など、エラーのあるコード行がコロンで終わる行の直後にある場合は、前の行と比較してインデント レベルを 1 つ増やす必要があります。 つまり、行の先頭には関数定義よりも 1 つ多くのtab文字が必要です。
nl: Als de regel code met de foutmelding direct na een regel komt die eindigt met een dubbele punt, zoals een functiedefinitie, dan heb je een extra inspringniveau nodig ten opzichte van de vorige regel. Met andere woorden, je regel moet één tab-teken meer hebben dan de functiedefinitie.
pt_br: Se a linha de código que contém o erro estiver logo após uma linha que termina com dois pontos, como uma função por exemplo, você precisa de um nível extra de indentação comparado a linha anterior. Em outras palavras, sua linha deverá ter um caractere de tabulação a mais do que a definição da função.
ru: Если строка кода с ошибкой находится сразу после строки, заканчивающейся двоеточием, как в определении функции, вам нужно поставить код в строке на следующий уровень отступа по сравнению с предыдущей строкой. Другими словами, в начале вашей строки должно быть на один символ табуляции больше, чем в определении функции.
ta: பிழையுடன் குறியீட்டின் வரி ஒரு பெருங்குடலுடன் முடிவடைந்த ஒரு வரிக்குப் பிறகு, ஒரு செயல்பாட்டு வரையறை போன்றது என்றால், முந்தைய வரியுடன் ஒப்பிடும்போது உங்களுக்கு ஒரு கூடுதல் உள்தள்ளல் நிலை தேவை. வேறு வார்த்தைகளில் கூறுவதானால், உங்கள் வரியில் செயல்பாட்டு வரையறையை விட ஒரு முன்னணி தாவல் எழுத்து இருக்க வேண்டும்.
tr: Eğer hata kodunun gösterdiği satır, iki nokta üst üste ile biten bir satırdan sonra ise (mesela bir fonksiyon tanımı gibi), önceki satırdan bir seviye içeriye girinti yapmanız gerekir. Başka bir deyişle, kodu yazdığınız satıra, fonksiyon tanımı satırından bir tane daha fazla sekme karakteri koymalısınız.
uk: Якщо рядок коду з помилкою розташований зразу після рядка, що закінчується двокрапкою, як у визначенні функції, потрібно поставити код у рядку на наступний рівень відступу порівняно з попереднім рядком. Іншими словами, на початку вашого рядка має бути на один символ табуляції більше, ніж у заголовку функції.
zh_hans: 如果出现错误的代码行紧跟在以冒号结尾的行之后，例如函数定义，则与前一行相比，您需要一个额外的缩进级别。 换句话说，您的行应该比函数定义多一个前导制表符。
zh_hant: 如果出錯的程式碼行緊接在以冒號結尾的行之後，例如函式定義，你需要比上一行多一級縮排。 換句話說，這行程式碼的縮排應該比函式定義多一個 tab 字符。
