Repository: GDQuest/learn-gdscript
Catalog: i18n/*/error_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: You get this error when the name between the [code]for[/code] and [code]in[/code] is not a valid variable name, or you are missing the [code]in[/code] keyword. In a [code]for[/code] loop, the [code]in[/code] keyword only accepts a valid temporary variable name to assign values in each loop iteration. The loop creates a new variable with the desired name and assigns each element of the array to it.
cs: Tato chyba se zobrazí, pokud název mezi [code]for[/code] a [code]in[/code] není platným názvem proměnné nebo pokud chybí klíčové slovo [code]in[/code]. Ve smyčce [code]for[/code] přijímá klíčové slovo [code]in[/code] pouze platné jméno dočasné proměnné pro přiřazení hodnot v každé iteraci smyčky. Smyčka vytvoří novou proměnnou s požadovaným jménem a přiřadí do ní každý prvek pole.
de: Du bekommst den Fehler, wenn der Name zwischen [code]for[/code] und [code]in[/code] kein gültiger Variablenname ist oder du das [code]in[/code] Schlüsselwort vergessen hast. In einer [code]for[/code]-Schleife akzeptiert das [code]in[/code]-Schlüsselwort nur einen gültigen temporären Variablennamen, um Werte in jeder Schleifeniteration zuzuweisen. Die Schleife erstellt eine neue Variable mit dem gewünschten Namen und weist ihr jedes Element des Arrays zu.
es: Obtienes este error cuando el nombre entre [code]for[/code] y [code]in[/code] no es un nombre de variable válido, o te falta la palabra clave [code]in[/code]. En un bucle [code]for[/code], la palabra clave [code]in[/code] sólo acepta un nombre de variable temporal válido para asignar valores en cada iteración del bucle. El bucle crea una nueva variable con el nombre deseado y le asigna cada elemento del array.
fr: Vous obtenez cette erreur lorsque le nom entre [code]for[/code] et [code]in[/code] n'est pas un nom de variable valide, ou qu'il manque le mot-clé [code]in[/code]. Dans une boucle [code]for[/code], le mot-clé [code]in[/code] n'accepte qu'un nom de variable temporaire valide pour affecter des valeurs à chaque itération de la boucle. La boucle crée une nouvelle variable avec le nom souhaité et lui affecte chaque élément du tableau.
it: Si ottiene questo errore quando il nome tra il [code]for[/code] e [code]in[/code] non è un nome di variabile valido, oppure manca la parola chiave [code]in[/code]. In un ciclo [code]for[/code], la parola chiave [code]in[/code] accetta solo un nome di variabile temporanea valido per assegnare valori a ogni iterazione del ciclo. Il ciclo crea una nuova variabile con il nome desiderato e vi assegna ogni elemento dell'array.
ja: [code]for[/code] と [code]in[/code] の間の名前が有効な変数名ではない場合、または [code]in[/code] キーワードが欠落している場合に、このエラーが発生します。 [code]for[/code] ループの、[code]in[/code] キーワードでは、各ループ反復で値を割り当てるための有効な一時変数名のみを受け入れます。 このループは、必要な名前を持つ新しい変数を作成し、配列の各要素をそれに割り当てます。
nl: Je krijgt deze foutmelding als de naam tussen de [code]for[/code] en [code]in[/code] geen geldige variabelennaam is, of als je het sleutelwoord [code]in[/code] mist. In een [code]for[/code]-lus accepteert het [code]in[/code] sleutelwoord alleen een geldige tijdelijke variabelennaam om waarden aan toe te wijzen in elke iteratie van de lus. De lus maakt een nieuwe variabele met de gewenste naam en wijst elk element van de array eraan toe.
pt_br: Você encontra esse erro quando o nome entre [code]for[/code] e [code]in[/code] não é um nome válido de uma variável, ou quando está faltando a palavra-chave [code]in[/code]. Em um loop [code]for[/code], a palavra-chave [code]in[/code] só aceita um nome de variável temporária para atribuir os valores em cada iteração. O loop cria uma nova variável com o nome desejado e atribui o valor de cada elemento da array a ela.
ru: Эта ошибка возникает, когда имя между [code]for[/code] и [code]in[/code] не является допустимым именем переменной или отсутствует ключевое слово [code]in[/code]. В цикле [code]for[/code] ключевое слово [code]in[/code] принимает только допустимое имя временной переменной для присвоения значений на каждой итерации цикла. Цикл создаёт новую переменную с выбранным именем и присваивает ей каждый элемент массива.
ta: [/குறியீடு] மற்றும் [/குறியீடு] க்கான [குறியீடு] க்கு இடையிலான பெயர் சரியான மாறி பெயர் அல்ல, அல்லது [/குறியீடு] முக்கிய சொற்களில் [குறியீட்டை] காணவில்லை. [/குறியீடு] வளையத்திற்கான [குறியீடு] இல், [/குறியீடு] முக்கிய சொற்களில் [குறியீடு] ஒவ்வொரு லூப் மறு செய்கையிலும் மதிப்புகளை ஒதுக்க சரியான தற்காலிக மாறி பெயரை மட்டுமே ஏற்றுக்கொள்கிறது. லூப் விரும்பிய பெயருடன் ஒரு புதிய மாறியை உருவாக்குகிறது மற்றும் வரிசையின் ஒவ்வொரு உறுப்புக்கும் ஒதுக்குகிறது.
tr: Bu hatayı alıyorsanız, [code]for[/code] ve [code]in[/code] arasındaki isim geçerli bir değişken ismi değildir, ya da [code]in[/code] kelimesini unutmuşsunuzdur. Bir [code]for[/code] döngüsünde, döngünün her bir yinelemesinde kullanmak için, [code]in[/code] kelimesi sadece geçici değişken isimlerini kabul eder. Bu şekilde döngü, istenilen isimde yeni bir değişken oluşturur ve dizinin öğelerini tek tek buna atama yapar.
uk: Ця помилка виникає, коли назва між [code]for[/code] і [code]in[/code] не є допустимою назвою змінної або відсутнє ключове слово [code]in[/code]. У циклі [code]for[/code] ключове слово [code]in[/code] приймає лише допустиму назву тимчасової змінної для присвоєння значень кожної ітерації циклу. Цикл створює нову змінну з вибраною назвою і присвоює їй кожен елемент масиву.
zh_hans: 如果 [code]for[/code] 和 [code]in[/code] 之间的名称不是有效的变量名，或者缺少 [code]in[/code] 关键字，则会出现此错误。 在 [code]for[/code] 循环中，[code]in[/code] 关键字只接受有效的临时变量名，以便在每次循环迭代中赋值。循环使用所需的名称创建一个新变量，并将数组的每个元素赋值给它。
zh_hant: 當 [code]for[/code] 和 [code]in[/code] 之間的名稱不是有效的變數名稱，或是你遺漏了 [code]in[/code] 關鍵字時，會出現這個錯誤。 在 [code]for[/code] 迴圈中， [code]in[/code] 關鍵字只接受一個有效的臨時變數名稱，並將每次迴圈的值指定給該變數。這個迴圈會創建一個新的變數並將陣列中的每個元素依照順序指定給它。

source: To fix this error, you need to ensure that the name between the [code]for[/code] and [code]in[/code] keywords is a valid variable name with no punctuation or spaces. For example, this code is invalid: [code]for cell_position.x in cell_positions_array:[/code] because [code]cell_position.x[/code] isn't a valid variable name. To access the [code]x[/code] sub-component of the variable, you need to do that inside of the loop's body: [code]for cell_position in cell_positions_array: cell_position.x += 1.0[/code]
cs: Chcete-li tuto chybu opravit, musíte zajistit, aby název mezi klíčovými slovy [code]for[/code] a [code]in[/code] byl platný název proměnné bez interpunkce a mezer. Například tento kód je neplatný: [code]for cell_position.x in cell_positions_array:[/code] protože [code]cell_position.x[/code] není platný název proměnné. Chcete-li získat přístup k [code]x[/code] dílčí komponentě proměnné, musíte to udělat uvnitř těla smyčky: [code]for cell_position in cell_positions_array: cell_position.x += 1.0[/code]
de: Um diesen Fehler zu beheben, musst du sicherstellen, dass der Name zwischen den Schlüsselwörtern [code]for[/code] und [code]in[/code] ein gültiger Variablenname ohne Interpunktion oder Leerzeichen ist. Dieser Code ist zum Beispiel ungültig: [code]for cell_position.x in cell_positions_array:[/code], weil [code]cell_position.x[/code] kein gültiger Variablenname ist. Um auf die Unterkomponente [code]x[/code] der Variablen zuzugreifen, musst du dies innerhalb des Schleifenkörpers tun: [code]for cell_position in cell_positions_array: cell_position.x += 1.0[/code]
es: Para solucionar este error, debes asegurarte de que el nombre entre las palabras clave [code]for[/code] y [code]in[/code] es un nombre de una variable válido sin puntuación ni espacios. Por ejemplo, este código no es válido [code]for cell_position.x in cell_positions_array:[/code] porque [code]cell_position.x[/code] no es un nombre de una variable válida. Para acceder al subcomponente [code]x[/code] de la variable, tienes que hacerlo dentro del cuerpo del bucle: [code]for cell_position in cell_positions_array: cell_position.x += 1.0[/code]
fr: Pour corriger cette erreur, vous devez vous assurer que le nom entre les mots-clés [code]for[/code] et [code]in[/code] est un nom de variable valide sans ponctuation ni espace. Par exemple, le code suivant n'est pas valide : [code]for cell_position.x in cell_positions_array:[/code] car [code]cell_position.x[/code] n'est pas un nom de variable valide. Pour accéder à la sous-composante [code]x[/code] de la variable, vous devez le faire à l'intérieur du corps de la boucle : [code]for cell_position in cell_positions_array: cell_position.x += 1.0[/code]
it: Per risolvere questo errore, è necessario assicurarsi che il nome tra le parole chiave [code]for[/code] e [code]in[/code] sia un nome di variabile valido, senza punteggiatura o spazi. Ad esempio, questo codice non è valido: [code]for cell_position.x in cell_positions_array:[/code] perché [code]cell_position.x[/code] non è un nome di variabile valido. Per accedere alla sotto-componente [code]x[/code] della variabile, è necessario farlo all'interno del corpo del ciclo: [code]for cell_position in cell_positions_array: cell_position.x += 1,0[/codice]
ja: このエラーを修正するには、[code]for[/code] キーワードと [code]in[/code] キーワードの間の名前が、句読点やスペースのない有効な変数名であることを確認する必要があります。 たとえば、次のコードは無効です: [code]for cell_position.x in cell_positions_array:[/code]。[code]cell_position.x[/code] は有効な変数名ではないためです。 変数の [code]x[/code] サブコンポーネントにアクセスするには、ループ本体内でそれを行う必要があります。 [code]for cell_position in cell_positions_array: cell_position.x += 1.0[/code]
nl: Om deze fout op te lossen, moet je ervoor zorgen dat de naam tussen de sleutelwoorden [code]for[/code] en [code]in[/code] een geldige variabelennaam is zonder leestekens of spaties. Deze code is bijvoorbeeld ongeldig: [code]for cell_position.x in cell_positions_array:[/code] omdat [code]cell_position.x[/code] geen geldige variabelennaam is. Om toegang te krijgen tot het onderdeel [code]x[/code] van de variabele, moet je dat binnen de lus doen: [code]for cell_position in cell_positions_array: cell_position.x += 1.0[/code]
pt_br: Para corrigir esse erro, você precisa certificar que o nome entre as palavra-chave [code]for[/code] e [code]in[/code] são nomes válidos de variáveis, sem pontuação ou espaços. Por exemplo, esse código é inválido: [code]for cell_position.x in cell_positions_array:[/code] porque [code]cell_position.x[/code] não é um nome válido de variável. Para acessar o subcomponente [code]x[/code] da variável, você precisa fazer isso dentro do bloco do loop. [code]for cell_position in cell_positions_array: cell_position.x += 1.0[/code]
ru: Чтобы исправить эту ошибку, вам необходимо убедиться, что имя между ключевыми словами [code]for[/code] и [code]in[/code] является допустимым именем переменной без знаков препинания и пробелов. Например, этот код недействителен: [code]for cell_position.x in cell_positions_array:[/code], поскольку [code]cell_position.x[/code] не является допустимым именем переменной. Чтобы получить доступ к подкомпоненту [code]x[/code] переменной, вам нужно сделать это внутри тела цикла: [code]for cell_position in cell_positions_array: cell_position.x += 1.0[/code]
ta: இந்த பிழையை சரிசெய்ய, [/குறியீடு] மற்றும் [குறியீடு] க்கான [/குறியீடு] க்கு இடையிலான பெயர் [/குறியீடு] முக்கிய வார்த்தைகள் என்பது நிறுத்தற்குறி அல்லது இடைவெளிகள் இல்லாத சரியான மாறி பெயர் என்பதை உறுதிப்படுத்த வேண்டும். எடுத்துக்காட்டாக, இந்த குறியீடு தவறானது: [குறியீடு] செல்_போசிசன். மாறியின் [குறியீடு] ஃச் [/குறியீடு] துணைக் கூறுகளை அணுக, நீங்கள் அதை வளையத்தின் உடலின் உள்ளே செய்ய வேண்டும்: [குறியீடு] செல்_போசிசன்களில் செல்_போசிசன்களில்_ஆரேயில்: Cell_Position.x += 1.0 [/குறியீடு]
tr: Bu hatayı düzeltmek için, [code]for[/code] ve [code]in[/code] kelimeleri arasına, içinde noktalama işareti ya da boşluk bulunmayan geçerli bir değişken ismi girdiğinizden emin olmalısınız. Örneğin, bu kod hatalıdır: [code]for cell_position.x in cell_positions_array:[/code]. Çünkü [code]cell_position.x[/code] geçerli bir değişken ismi değildir. Bir değişkenin [code]x[/code] alt-elemanına erişmek için, bunu döngünün içerisinde aşağıdaki gibi kullanmalısınız. [code]for cell_position in cell_positions_array: # "for hücre_konumu in hücre_konumları_disizi" anlamında cell_position.x += 1.0[/code]
uk: Щоб виправити цю помилку, слід переконатися, що між ключовими словами [code]for[/code] і [code]in[/code] зазначено допустиму назву змінної без розділових знаків і пропусків. Наприклад, цей код хибний: [code]for cell_position.x in cell_positions_array:[/code], оскільки [code]cell_position.x[/code] не є допустимою назвою змінної. Щоб отримати доступ до підкомпонента [code]x[/code] змінної, слід зробити це всередині тіла циклу: [code]for cell_position in cell_positions_array: cell_position.x += 1.0[/code]
zh_hans: 要解决此错误，您需要确保 [code]for[/code] 和 [code]in[/code] 关键字之间的名称是一个有效的变量名，且没有标点符号或空格。 例如，以下代码无效： [code]for cell_position.x in cell_positions_array:[/code] 因为 [code]cell_position.x[/code] 不是一个有效的变量名。 要访问变量的 [code]x[/code] 子组件，需要在循环的主体中进行： [code]for cell_position in cell_positions_array： cell_position.x += 1.0[/code]
zh_hant: 要修正這個錯誤，你需要確保 [code]for[/code] 和 [code]in[/code] 之間的名稱是有效的變數名稱，且不包含標點符號或空格。 例如，這段程式碼是無效的：[code]for cell_position.x in cell_positions_array:[/code]，因為 [code]cell_position.x[/code] 不是有效的變數名稱。 若要訪問變數的 [code]x[/code] 子組件，你需要將這個操作放在迴圈的內容區塊內： [code]for cell_position in cell_positions_array: cell_position.x += 1.0[/code]

source: If you get this error, you are most likely trying to assign a value to something other than a variable, which is impossible. You can only assign values to variables. Another possibility is that you want to check for equality in a condition but wrote a single = instead of ==.
cs: Pokud dojde k této chybě, pravděpodobně se pokoušíte přiřadit hodnotu něčemu jinému než proměnné, což není možné. Hodnoty lze přiřazovat pouze proměnným. Další možností je, že chcete zkontrolovat rovnost v podmínce, ale místo = instead of ==.
de: Wenn du diese Fehlermeldung erhältst, versuchst du höchstwahrscheinlich, einen Wert einer anderen Variable zuzuweisen, was unmöglich ist. Du kannst nur Variablen Werte zuweisen. Eine andere Möglichkeit ist, dass du in einer Bedingung auf Gleichheit prüfen willst, aber ein einzelnes = statt == geschrieben hast.
es: Si obtienes este error, lo más probable es que estés intentando asignar un valor a algo que no sea una variable, lo cual es imposible. Sólo se pueden asignar valores a variables. Otra posibilidad es que quieras comprobar la igualdad en una condición pero hayas escrito un solo = en lugar de ==.
fr: Si vous obtenez cette erreur, vous essayez probablement d'attribuer une valeur à quelque chose d'autre qu'une variable, ce qui est impossible. Vous ne pouvez assigner des valeurs qu'à des variables. Il est également possible que vous souhaitiez vérifier l'égalité dans une condition, mais que vous ayez écrit un seul = au lieu de ==.
it: Se si ottiene questo errore, molto probabilmente si sta cercando di assegnare un valore a qualcosa di diverso da una variabile, il che è impossibile. Si possono assegnare valori solo alle variabili. Un'altra possibilità è che si voglia verificare l'uguaglianza in una condizione, ma si sia scritto un singolo = invece di ==.
ja: このエラーが発生した場合は、変数以外のものに値を代入しようとしている可能性が高く、これは不可能です。 変数には値のみを代入できます。 もう 1 つの可能性としては、条件内の等しいかどうかをチェックしたいが、== の代わりに単一の = を記述したということです。
nl: Als je deze foutmelding krijgt, probeer je waarschijnlijk een waarde toe te wijzen aan iets anders dan een variabele, wat onmogelijk is. Je kunt alleen waarden toewijzen aan variabelen. Een andere mogelijkheid is dat je wilt controleren op gelijkheid in een conditie, maar een enkele = hebt geschreven in plaats van ==.
pt_br: Se você recebeu esse erro, você provavelmente está tentando atribuir um valor a algo que não é uma variável, o que é impossível. Você só pode atribuir valores em variáveis. Outra possibilidade é que você está tentando fazer uma comparação de igualdade mas escreveu um único = ao invés de ==.
ru: Если вы получаете эту ошибку, вы, скорее всего, пытаетесь присвоить значение чему-то другому, кроме переменной, что невозможно. Вы можете присваивать значения только переменным. Другой случай заключается в том, что вы хотите проверить равенство условия, но написали один символ = вместо ==.
ta: இந்த பிழையைப் பெற்றால், நீங்கள் ஒரு மாறியைத் தவிர வேறு எதையாவது மதிப்பை ஒதுக்க முயற்சிக்கிறீர்கள், இது சாத்தியமற்றது. நீங்கள் மாறிகளுக்கு மட்டுமே மதிப்புகளை ஒதுக்க முடியும். மற்றொரு சாத்தியம் என்னவென்றால், நீங்கள் ஒரு நிபந்தனையில் சமத்துவத்தை சரிபார்க்க விரும்புகிறீர்கள், ஆனால் == க்கு பதிலாக ஒற்றை = எழுதினார்.
tr: Bu hatayı alırsanız, büyük ihtimalle değişken olmayan bir şeylere bir değer atamaya çalışıyorsunuz demektir ve bu mümkün değildir. Sadece değişkenlere değere atayabilirsiniz. Bir diğer olasılık ise, bir koşul işleminde eşitliği test etmek istemiş, ama "==" yerine "=" yazmışsınızdır.
uk: Якщо ви отримуєте цю помилку, ви, найпевніш, намагаєтеся надати значення не змінній, а чомусь іншому, що неможливо. Ви можете надавати значення лише змінним. Ще можливо, що ви хочете перевірити рівність умови, але написали один символ = замість ==.
zh_hans: 如果出现这个错误，很可能是你试图给变量以外的东西赋值，这是不可能的。你只能给变量赋值。 另一种可能是，你想在条件中检查相等性，但却写了一个 = 而不是 ==。
zh_hant: 如果你遇到這個錯誤，很可能是你正在嘗試將值指定給不是變數的東西，這是無法實現的。你只能將值指定給變數。 另一個可能性是，你想要在條件判斷中檢查相等性，但錯誤地寫成單個 [code]=[/code] 而不是 [code]==[/code]。

source: If you want to assign a value to a variable, double-check that what you have on the left side of the = sign is a variable and not a function. You also need to ensure the syntax is correct. For example, there shouldn't be parentheses on the left side of the equal sign. In the case of a condition, ensure that you are using two equal signs to check for equality (==).
cs: Pokud chcete proměnné přiřadit hodnotu, zkontrolujte dvakrát, že to co máte na levé straně znaku =, je proměnná, a ne funkce. Je také třeba zajistit správnou syntaxi. Například na levé straně znaku rovnosti by neměly být závorky. V případě podmínky se ujistěte, že používáte dvě znaménka rovnosti pro kontrolu rovnosti (==).
de: Wenn du einer Variablen einen Wert zuweisen willst, musst du dich vergewissern, dass es sich bei der Variablen links vom =-Zeichen um eine Variable und nicht um eine Funktion handelt. Du musst auch sicherstellen, dass die Syntax korrekt ist. Zum Beispiel sollten auf der linken Seite des Gleichheitszeichens keine Klammern stehen. Bei einer Bedingung musst du sicherstellen, dass du zwei Gleichheitszeichen verwendest, um die Gleichheit zu prüfen (==).
es: Si quieres asignar un valor a una variable, comprueba que lo que tienes a la izquierda del signo = es una variable y no una función. También debes asegurarte de que la sintaxis es correcta. Por ejemplo, no debe haber un paréntesis a la izquierda del signo igual. En el caso de una condición, asegúrate de que estás utilizando dos signos iguales para comprobar la igualdad (==).
fr: Si vous souhaitez attribuer une valeur à une variable, vérifiez que ce que vous avez à gauche du signe = est bien une variable et non une fonction. Vous devez également vous assurer que la syntaxe est correcte. Par exemple, il ne doit pas y avoir de parenthèses à gauche du signe égal. Dans le cas d'une condition, assurez-vous que vous utilisez deux signes égaux pour vérifier l'égalité (==).
it: Se si vuole assegnare un valore a una variabile, bisogna verificare che quella che si trova a sinistra del segno = sia una variabile e non una funzione. È inoltre necessario assicurarsi che la sintassi sia corretta. Ad esempio, non dovrebbero esserci parentesi sul lato sinistro del segno di uguale. Nel caso di una condizione, assicuratevi di utilizzare due segni di uguale per verificare l'uguaglianza (==).
ja: 変数に値を代入する場合は、「=」 記号の左側にあるものが関数ではなく変数であることを再確認してください。 構文が正しいことも確認する必要があります。 たとえば、等号の左側に括弧があってはなりません。 条件の場合は、等号 「==」をチェックするために 2 つの等号を使用していることを確認してください。
nl: Als je een waarde wilt toewijzen aan een variabele, controleer dan of wat je aan de linkerkant van het = teken hebt staan een variabele is en geen functie. Zorg er ook voor dat de vorm correct is. Er mogen bijvoorbeeld geen haakjes staan aan de linkerkant van het gelijkheidsteken. In het geval van een conditie, moet je ervoor zorgen dat je twee gelijkheidstekens gebruikt om te controleren op gelijkheid (==).
pt_br: Se você quer atribuir um valor a uma variável, certifique-se que o que você possui do lado esquerdo do sinal = é uma variável e não uma função. Você também precisa verificar se a sintaxe está correta. Por exemplo, não pode haver parêntesis do lado esquerdo do sinal de igual. No caso de uma condição, certifique-se que está usando dois sinais de igual para checar igualdade (==).
ru: Если вы хотите присвоить значение переменной, дважды проверьте, что слева от знака = находится переменная, а не функция. Вам также необходимо убедиться в правильности синтаксиса. Например, слева от знака равенства не должно быть круглых скобок. В случае условия убедитесь, что вы используете два знака равенства для проверки равенства (==).
ta: நீங்கள் ஒரு மாறிக்கு ஒரு மதிப்பை ஒதுக்க விரும்பினால், = அடையாளத்தின் இடது பக்கத்தில் நீங்கள் வைத்திருப்பது ஒரு மாறி மற்றும் ஒரு செயல்பாடு அல்ல என்பதை இருமுறை சரிபார்க்கவும். தொடரியல் சரியானது என்பதை நீங்கள் உறுதிப்படுத்த வேண்டும். எடுத்துக்காட்டாக, சம அடையாளத்தின் இடது பக்கத்தில் அடைப்புக்குறிப்புகள் இருக்கக்கூடாது. ஒரு நிபந்தனையின் விசயத்தில், சமத்துவத்தை (==) சரிபார்க்க நீங்கள் இரண்டு சம அறிகுறிகளைப் பயன்படுத்துகிறீர்கள் என்பதை உறுதிப்படுத்தவும்.
tr: Eğer bir değişkene değer atamak istiyorsanız, "=" işaretinin sol tarafına bir fonksiyon (ya da değer) yazmak yerine bir değişken ismi yazdığınızı iki kere kontrol etmelisiniz. Ayrıca doğru şekilde yazdığınızdan da emin olmalısınız. Örneğin, eşitliğin sol tarafında parantezler olmamalıdır. Bir koşul yazıyorsanız, iki tane eşittir işareti (==) kullandığınızdan emin olmalısınız.
uk: Якщо ви хочете надати значення змінній, двічі перевірте, що ліворуч від знака = зазначено змінну, а не функцію. Також необхідно переконатись у правильності синтаксису. Наприклад, ліворуч від знака рівності не повинно бути круглих дужок. Якщо ж це умова, то переконайтеся, що для перевірки рівності використано два знаки дорівнює (==).
zh_hans: 如果要给变量赋值，请仔细检查 = 符号左边的是变量而不是函数。 您还需要确保语法正确。例如，等号左侧不应有括号。 如果是条件，请确保使用两个等号来检查是否相等（==）。
zh_hant: 如果你想將值指定給變數，請再次確認＝符號左邊的是變數，而不是函數。 你還需要確保語法正確。例如，等號左邊不應該有括號。 在條件判斷中，確保你使用的是兩個等號來檢查是否相等 (==)。
