Repository: GDQuest/learn-gdscript
Catalog: i18n/*/error_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: To solve this error, triple-check that there is no typo in the line. If you can, try to go to the variable or function definition, double-click the name, copy it, and paste it where you see the error. If you don't see any typo, then you need to ensure that you defined the variable, function, or class you are referring to.
cs: Chcete-li tuto chybu vyřešit, třikrát zkontrolujte, zda v řádku není překlep. Pokud můžete, zkuste přejít na definici proměnné nebo funkce, dvakrát klikněte na její název, zkopírujte jej a vložte na místo, kde se chyba objevila. Pokud žádný překlep nevidíte, pak se musíte ujistit, že jste definovali proměnnou, funkci nebo třídu, na kterou se odkazujete.
de: Um diesen Fehler zu beheben, überprüfe dreimal, dass die Zeile keinen Tippfehler enthält. Wenn du kannst, versuche zur Variablen- oder Funktionsdefinition zu gehen, doppelklicke auf den Namen, kopiere ihn und füge ihn an der Stelle ein, an der du den Fehler siehst. Wenn du keinen Tippfehler siehst, musst du sicherstellen, dass du die Variable, Funktion oder Klasse, auf die du dich beziehst, definiert hast.
es: Para solucionar este error, comprueba tres veces que no haya ningún error tipográfico en la línea. Si puedes, intenta ir a la definición de la variable o función, haz doble clic en el nombre, cópialo y pégalo donde veas el error. Si no ves ningun error tipográfico, entonces tienes que asegurarte de haber definido la variable, función o clase a la que te refieres.
fr: Pour résoudre cette erreur, vérifiez trois fois qu'il n'y a pas de faute de frappe dans la ligne. Si vous le pouvez, essayez d'aller à la définition de la variable ou de la fonction, double-cliquez sur le nom, copiez-le et collez-le à l'endroit où vous voyez l'erreur. Si vous ne voyez aucune faute de frappe, vous devez alors vous assurer que vous avez défini la variable, la fonction ou la classe à laquelle vous faites référence.
it: Per risolvere questo errore, controlla più volte che non ci siano errori di battitura (typo) nella riga. Se puoi, cerca di andare alla definizione della variabile o della funzione, clicca due volte il nome, copialo e incollalo dove vedi l'errore. Se non vedi alcun typo, allora ti devi assicurare che hai definito quella variabile, funzione o classe a cui ti riferisci.
ja: このエラーを解決するには、その行にタイプミスがないかをトリプルチェックしてください。 可能であれば、変数や関数の定義に移動し、名前をダブルクリックしてコピーし、エラーのある場所に貼り付けてみてください。 タイプミスが見当たらない場合は、参照している変数、関数、クラスを確実に定義する必要があります。
nl: Om deze foutmelding te verhelpen, moet je drie keer controleren of er geen typefout in de regel staat. Als dat mogelijk is, probeer dan naar de variabele- of functiedefinitie te gaan, dubbel te klikken op de naam, deze te kopiëren en te plakken waar je de fout ziet. Als je geen typefout ziet, dan moet je ervoor zorgen dat je de variabele, functie of klasse waarnaar je verwijst hebt gedefinieerd.
pt_br: Para resolver esse erro, cheque várias vezes que não há erros de digitação na linha de código. Se você puder, tente ir na definição da variável ou função, reveja o nome, copie ele e cole onde estiver dando o erro. Se você não achar nenhum erro de digitação, então garanta que você definiu a variável, a função ou a classe que você estiver tentando referenciar.
ru: Чтобы устранить эту ошибку, внимательно проверьте, нет ли в строке опечатки. Если можете, попробуйте перейти к определению переменной или функции, дважды щелкните по имени, скопируйте его и вставьте туда, где вы видите ошибку. Если вы не видите никаких опечаток, то вам необходимо убедиться, что вы определили переменную, функцию или класс, на который ссылаетесь.
ta: இந்த பிழையைத் தீர்க்க, வரிசையில் எழுத்துப்பிழை இல்லை என்பதை மூன்று மடங்கு சரிபார்க்கவும். உங்களால் முடிந்தால், மாறி அல்லது செயல்பாட்டு வரையறைக்குச் செல்ல முயற்சிக்கவும், பெயரை இருமுறை சொடுக்கு செய்து, நகலெடுத்து, பிழையைப் பார்க்கும் இடத்தில் ஒட்டவும். நீங்கள் எந்த எழுத்துப்பிழையையும் காணவில்லை என்றால், நீங்கள் குறிப்பிடும் மாறி, செயல்பாடு அல்லது வகுப்பை நீங்கள் வரையறுத்துள்ளீர்கள் என்பதை உறுதிப்படுத்த வேண்டும்.
tr: Bu hatayı çözmek için, tüm satırları yazım hataları için üç kere kontrol etmelisiniz. Mümkünse, ilgili değişken ya da fonksiyon tanımına gidin, ismine çift tıklayın, kopyalayın ve hatayı daha iyi görebileceğiniz boş bir alana yapıştırın. Eğer bir yazım hatası göremiyorsanız, ilgili değişkeni, fonksiyonu, ya da sınıfı tanımladığınızdan emin olmalısınız.
uk: Щоб усунути цю помилку, уважно перевірте, чи немає в рядку хибодруку. Якщо можете, спробуйте перейти до визначення змінної або функції, двічі клацніть на назві, скопіюйте її і вставте туди, де ви бачите помилку. Якщо ви не бачите жодних хибодруків, слід переконатися, що ви визначили змінну, функцію або клас, на який посилаєтеся.
zh_hans: 要解决此错误，请仔细检查该行中是否存在拼写错误。 如果可以，请尝试转到变量或函数定义，双击名称，复制它，然后将其粘贴到您看到错误的位置。 如果您没有看到任何拼写错误，那么您需要确保您定义了您所指的变量、函数或类。
zh_hant: 要解決這個錯誤，請三次檢查該行，確保沒有打錯字。 如果可以，嘗試跳轉到變數或函式的定義，雙擊名稱，複製並將其貼到出錯的地方。 如果你確認沒有打錯字，那麼你需要確保已經定義了你所引用的變數、函式或類別。

source: You can only use keywords like [code]break[/code] or [code]continue[/code] in a loop. Outside a loop, they are invalid. The [code]continue[/code] keyword means "jump to the next iteration of the loop." And the [code]break[/code] keyword means "end the loop right now and jump to the first line of code after the loop block.
cs: Klíčová slova jako [code]break[/code] nebo [code]continue[/code] můžete použít pouze ve smyčce. Mimo smyčku jsou neplatné. Klíčové slovo [code]continue[/code] znamená "skok na další iteraci smyčky." A klíčové slovo [code]break[/code] znamená "ukončení smyčky právě teď a skok na první řádek kódu za blokem smyčky.
de: Schlüsselwörter wie [code]break[/code] oder [code]continue[/code] kannst du nur in einer Schleife verwenden. Außerhalb einer Schleife sind sie ungültig. Das Schlüsselwort [code]continue[/code] bedeutet "Zur nächsten Iteration der Schleife springen". Und das Schlüsselwort [code]break[/code] bedeutet "beende die Schleife jetzt und springen zur ersten Codezeile nach dem Schleifenblock.
es: Sólo puedes utilizar palabras clave como [code]break[/code] o [code]continue[/code] en un bucle. Fuera de un bucle, no son válidas. La palabra clave [code]continue[/code] significa "saltar a la siguiente iteración del bucle". Y la palabra clave [code]break[/code] significa "terminar el bucle ahora mismo y saltar a la primera línea de código después del bloque del bucle".
fr: Vous ne pouvez utiliser des mots-clés comme [code]break[/code] ou [code]continue[/code] que dans une boucle. En dehors d'une boucle, ils sont invalides. Le mot-clé [code]continue[/code] signifie « passer à l'itération suivante de la boucle ». Et le mot-clé [code]break[/code] signifie « terminer la boucle tout de suite et passer à la première ligne de code après le bloc de la boucle ».
it: Puoi solamente usare parole chiave come [code]break[/code] o [code]continue[/code] in un ciclo. Fuori dal ciclo, sono invalide. La parola chiave [code]continue[/code] significa "salta la prossima iterazione del ciclo". E la parola chiave [code]break[/code] significa "finisci il ciclo adesso e salta alla prima riga di codice dopo il blocco del ciclo".
ja: [code]break[/code]や[code]continue[/code]のようなキーワードはループの中でしか使えない。ループの外では、これらは無効です。 [code]continue[/code]キーワードは、"ループの次の繰り返しにジャンプする "という意味です。そして、[code]break[/code]キーワードは、「今すぐループを終了し、ループブロックの後のコードの最初の行にジャンプする」という意味です。
nl: Je kunt sleutelwoorden als [code]break[/code] of [code]continue[/code] alleen in een lus gebruiken. Buiten een lus zijn ze ongeldig. Het sleutelwoord [code]continue[/code] betekent "naar de volgende iteratie van de lus springen". En het sleutelwoord [code]break[/code] betekent "beëindig de lus nu en spring naar de eerste regel code na het lusblok.
pt_br: Você só pode usar palavras-chave como: [code]break[/code] ou [code]continue[/code] numa estrutura de repetição. Fora de uma estrutura de repetição, elas são inválidas. A palavra-chave [code]continue[/code] significa "vá para a próxima iteração da repetição." e a palavra_chave [code]break[/code] significa "finalize a repetição agora mesmo e vá para a primeira linha de código depois do bloco dessa estrutura de repetição".
ru: Такие ключевые слова как [code]break[/code] или [code]continue[/code] можно использовать только в цикле. Вне цикла они недопустимы. Ключевое слово [code]continue[/code] означает «перейти к следующей итерации цикла». А ключевое слово [code]break[/code] означает «закончить цикл прямо сейчас и перейти к первой строке кода после блока цикла».
ta: [குறியீடு] பிரேக் [/குறியீடு] அல்லது [குறியீடு] ஒரு வளையத்தில் [/குறியீடு] போன்ற முக்கிய வார்த்தைகளை மட்டுமே நீங்கள் பயன்படுத்த முடியும். ஒரு வளையத்திற்கு வெளியே, அவை தவறானவை. [குறியீடு] தொடரவும் [/குறியீடு] முக்கிய சொல் "வளையத்தின் அடுத்த மறு செய்கைக்கு செல்லவும்." [குறியீடு] இடைவெளி [/குறியீடு] முக்கிய சொல் "இப்போது வளையத்தை முடித்து, லூப் தொகுதிக்குப் பிறகு குறியீட்டின் முதல் வரிக்கு செல்லவும்.
tr: [code]break[/code] veya [code]continue[/code] gibi bazı anahtar kelimeleri sadece bir döngünün içinde kullanabilirsiniz. Bunlar döngü dışında geçersizdir. [code]continue[/code] anahtar kelimesi "döngünün sonraki yinelemesine sıçra" anlamına gelir. Ve [code]break[/code] anahtar kelimesi "döngüyü hemen şimdi bitir ve döngü gövdesinin bittiği ilk satıra zıpla" anlamındadır.
uk: Такі ключові слова як [code]break[/code] або [code]continue[/code] можна використовувати лише в циклі. Поза циклом вони неприпустимі. Ключове слово [code]continue[/code] означає «перейти до наступної ітерації циклу». А ключове слово [code]break[/code] означає «закінчити цикл прямо зараз і перейти до першого рядка коду після блоку циклу».
zh_hans: 您只能在循环中使用 [code]break[/code] 或 [code]continue[/code] 等关键字。 在循环之外，它们是无效的。 [code]continue[/code] 关键字的意思是“跳到循环的下一次迭代”。 而 [code]break[/code] 关键字的意思是“立即结束循环并跳转到循环块之后的第一行代码。
zh_hant: 你只能在迴圈中使用像是 [code]break[/code] 或 [code]continue[/code] 這樣的關鍵字。若在迴圈外使用，會是無效的。 [code]continue[/code] 關鍵字的意思是「跳到下一次的迴圈執行」。而 [code]break[/code] 關鍵字則表示「立即結束這個迴圈，並跳到迴圈區塊之後的第一行程式碼」。

source: If you wrote one of these keywords outside a loop, you need to remove it. If you are trying to use it inside a loop, your indentation is most likely at fault. You may need to insert one or more leading tab characters to the keyword.
cs: Pokud jste jedno z těchto klíčových slov napsali mimo smyčku, musíte ho odstranit. Pokud se ho snažíte použít uvnitř smyčky, je pravděpodobně na vině vaše odsazení. Možná budete muset ke klíčovému slovu vložit jeden nebo více úvodních znaků tabulátoru.
de: Wenn Du eines dieser Schlüsselwörter außerhalb einer Schleife geschrieben hast, musst Du es entfernen. Wenn Du versuchst, es innerhalb einer Schleife zu verwenden, ist Dein Einzug höchstwahrscheinlich schuld. Möglicherweise musst Du ein oder mehrere führende Tabulatorzeichen in das Schlüsselwort einfügen.
es: Si escribiste una de estas palabras clave fuera de un bucle, debes eliminarla. Si intentas utilizarla dentro de un bucle, lo más probable es que tu sangría tenga la culpa. Es posible que tengas que insertar uno o más caracteres de tabulación iniciales a la palabra clave.
fr: Si vous avez écrit l'un de ces mots-clés en dehors d'une boucle, vous devez le supprimer. Si vous essayez de l'utiliser à l'intérieur d'une boucle, votre indentation est très probablement en cause. Il se peut que vous deviez insérer un ou plusieurs caractères de tabulation initiaux au mot-clé.
it: Se scrivi una di queste parole chiave fuori da un ciclo, devi rimuoverla. Se stai cercando di usarlo all'interno di un ciclo, la tua indentazione è probabilmente sbagliata. Potresti dover inserire uno o più caratteri di tabbazione iniziali alla parola chiave.
ja: もしこれらのキーワードをループの外に書いたのなら、それを削除する必要がある。 ループの中で使おうとしている場合は、インデントに問題がある可能性が高い。キーワードの先頭に1つ以上のタブ文字を挿入する必要があるかもしれません。
nl: Als je een van deze sleutelwoorden buiten een lus hebt geschreven, moet je het verwijderen. Als je het binnen een lus probeert te gebruiken, dan is waarschijnlijk je inspringing fout. Het kan zijn dat je één of meer tab-tekens voor het sleutelwoord moet zetten.
pt_br: Se você escreveu uma dessas palavras-chave fora de uma estrutura de repetição, você precisa remove-la. Se você estiver tentando usa-las dentro de uma estrutura de repetição, sua indentação provavelmente está errada. Você precisa colocar um ou mais caractere de tabulação na palavra-chave.
ru: Если вы написали одно из этих ключевых слов вне цикла, вам нужно удалить это слово. Если вы пытаетесь использовать ключевое слово внутри цикла, скорее всего, строка имеет неправильный отступ. Возможно, вам нужно вставить один или несколько символов табуляции перед ключевым словом.
ta: இந்த முக்கிய வார்த்தைகளில் ஒன்றை நீங்கள் ஒரு வளையத்திற்கு வெளியே எழுதியிருந்தால், அதை அகற்ற வேண்டும். நீங்கள் அதை ஒரு வளையத்திற்குள் பயன்படுத்த முயற்சிக்கிறீர்கள் என்றால், உங்கள் உள்தள்ளல் பெரும்பாலும் தவறு செய்யும். ஒன்று அல்லது அதற்கு மேற்பட்ட முன்னணி தாவல் எழுத்துக்களை நீங்கள் முக்கிய சொல்லுக்கு செருக வேண்டியிருக்கலாம்.
tr: Eğer bu anahtar kelimelerden birini döngü dışında yazmışsanız, hemen kaldırmanız gerekiyor. Eğer zaten döngü içinde kullandıysanız, bu durumda kodun girinti miktarı hatalıdır. Kelimenin olduğu satırın başına bir ya da iki tane daha sekme karakteri eklemelisiniz.
uk: Якщо ви написали одне з цих ключових слів поза циклом, потрібно видалити це слово. Якщо ви намагаєтеся використати ключове слово всередині циклу, найпевніше, рядок має неправильний відступ. Можливо, перед ключовим словом потрібно вставити один або кілька символів табуляції.
zh_hans: 如果您在循环之外编写了这些关键字之一，则需要将其删除。 如果您尝试在循环中使用它，那么您的缩进很可能是错误的。 您可能需要在关键字中插入一个或多个前导制表符。
zh_hant: 如果你在迴圈外寫了其中一個關鍵字，則需要將其刪除。 如果你是想在迴圈內使用該關鍵字，最有可能的問題是縮排錯誤。你可能需要在該關鍵字前插入一個或多個縮排的制表符（tab）。

source: When the computer talks about a constant expression, it expects a fixed value, a fixed calculation, or the name of an existing constant. In other words, it wants something that can never change. This is why the computer will reject function calls and variables where it needs a constant expression.
cs: Když počítač mluví o konstantním výrazu, očekává pevnou hodnotu, pevný výpočet nebo jméno existující konstanty. Jinými slovy, chce něco, co se nikdy nemůže změnit. Proto počítač odmítne volání funkcí a proměnných tam, kde potřebuje konstantní výraz.
de: Wenn der Computer über einen konstanten Ausdruck spricht, erwartet er einen festen Wert, eine feste Berechnung oder den Namen einer vorhandenen Konstante. Mit anderen Worten, es will etwas, das sich niemals ändern kann. Aus diesem Grund lehnt der Computer Funktionsaufrufe und Variablen ab, wenn er einen konstanten Ausdruck benötigt.
es: Cuando la computadora habla de una expresión constante, esta espera un valor fijo, un cálculo fijo o el nombre de una constante existente. En otras palabras, quiere algo que no pueda cambiar nunca. Es por esto que la computadora rechazará las llamadas a funciones y las variables donde necesite una expresión constante.
fr: Lorsque l'ordinateur parle d'une expression constante, il attend une valeur fixe, un calcul fixe ou le nom d'une constante existante. En d'autres termes, il veut quelque chose qui ne peut jamais changer. C'est pourquoi l'ordinateur rejettera les appels de fonction et les variables lorsqu'il a besoin d'une expression constante.
it: Quando il computer parla di un'espressione costante, si aspetta un valore fisso, un calcolo fisso o un nome si una costante esistente. In altre parole, vuole qualcosa che non può mai cambiare. Questo è il motivo pe cui il computer rifiuterà le chiamate di funzione e le variabili dove necessita di un'espressione costante.
ja: コンピュータが定数式について語るとき、固定値、固定計算、あるいは既存の定数の名前を期待している。 言い換えれば、決して変化しないものを求めているのだ。コンピュータが定数式を必要とする関数呼び出しや変数を拒否するのはこのためです。
nl: Wanneer de computer het heeft over een constante uitdrukking, verwacht hij een vaste waarde, een vooraf bepaalde berekening of de naam van een bestaande constante. Met andere woorden, hij wil iets dat nooit kan veranderen. Dit is de reden waarom de computer functieaanroepen en variabelen zal afwijzen waar het een constante uitdrukking nodig heeft.
pt_br: Quando o computador fala sobre uma expressão constante, ele espera um valor fixo, um cálculo fixo ou o nome de uma constante existente. Em outras palavras, ele quer alguma coisa que nunca pode mudar. É por isso que o computador irá rejeitar chamadas de funções e variáveis onde precisam de uma expressão constante.
ru: Когда компьютер говорит о постоянном выражении (constant expression), он ожидает фиксированное значение, фиксированное вычисление или имя существующей константы. Другими словами, он хочет чего-то, что никогда изменится. Вот почему компьютер будет отклонять вызовы функций и переменных там, где ему требуется постоянное выражение.
ta: கணினி ஒரு நிலையான வெளிப்பாட்டைப் பற்றி பேசும்போது, அது ஒரு நிலையான மதிப்பு, ஒரு நிலையான கணக்கீடு அல்லது ஏற்கனவே உள்ள மாறிலியின் பெயரை எதிர்பார்க்கிறது. வேறு வார்த்தைகளில் கூறுவதானால், அது ஒருபோதும் மாற முடியாத ஒன்றை விரும்புகிறது. இதனால்தான் கணினி ஒரு நிலையான வெளிப்பாடு தேவைப்படும் செயல்பாட்டு அழைப்புகள் மற்றும் மாறிகள் நிராகரிக்கும்.
tr: Bilgisayar size sabit bir ifadeden bahsediyorsa (constant), sizden sabitlenmiş bir değer, sabit bir hesaplama, ya da var olan bir sabitin ismini istiyor demektir. Diğer bir deyişle, hiç değişmeyecek bir şey istiyor demektir. Bilgisayarın, sabit ifadeler beklediği fonksiyon çağrıları ya da değişkenleri geri çevirme sebebi bundandır.
uk: Коли комп'ютер повідомляє про сталий вираз (constant expression), він очікує незмінне значення, незмінне обчислення чи назву константи, яка існує. Іншими словами, він хоче щось таке, що ніколи не зміниться. Ось чому комп'ютер відхилятиме виклики функцій і змінних там, де йому потрібен сталий вираз.
zh_hans: 当计算机谈论一个常量表达式时，它期望一个固定的值、一个固定的计算或一个现有常量的名称。 换句话说，它想要一些永远不会改变的东西。 这就是为什么计算机会拒绝需要常量表达式的函数调用和变量。
zh_hant: 當電腦提到「常數運算式」（constant expression）時，它指的是固定的數值、固定的計算結果，或是已定義的常數名稱。 換句話說，電腦需要的是一個不會改變的內容。因此，在需要常數運算式的地方，如果您使用了函式呼叫或變數，電腦就會拒絕，因為這些值可能會變動。

source: You need to replace function calls or variables with a constant value like a whole number, decimal number, string, vector, a predefined array, etc. You can also use arithmetic operators like multiplications (*), additions (+), and so on.
cs: Volání funkcí nebo proměnné musíte nahradit konstantní hodnotou, jako je celé číslo, desetinné číslo, řetězec, vektor, předdefinované pole atd. Můžete také použít aritmetické operátory jako násobení (*), sčítání (+) a tak dále.
de: Funktionsaufrufe oder Variablen durch einen konstanten Wert wie eine ganze Zahl, eine Dezimalzahl, eine Zeichenfolge, einen Vektor, ein vordefiniertes Array usw. ersetzt werden. Du kannst auch arithmetische Operatoren wie Multiplikationen (*), Additionen (+) usw. verwenden.
es: Debes reemplazar las llamadas a funciones o las variables por un valor constante como un número entero, un número decimal, una cadena, un vector, una matriz predefinida, etc. También puedes utilizar operadores aritméticos como multiplicaciones (*), sumas (+), entre otros.
fr: Vous devez remplacer les appels de fonction ou les variables par une valeur constante comme un nombre entier, un nombre décimal, une chaîne de caractères, un vecteur, un tableau prédéfini, etc. Vous pouvez également utiliser des opérateurs arithmétiques tels que des multiplications (*), des additions (+), etc.
it: Devi rimpiazzare le chiamate di funzione o le variabili con un valore costante come un numero intero, stringa, vettore un array predefinito, ecc. Puoi pure usare un'operazione aritmetica come le moltiplicazioni (*), addizioni (+) e così via.
ja: 関数呼び出しや変数を、整数、10進数、文字列、ベクトル、定義済み配列などの定数値に置き換える必要がある。 乗算（*）や加算（+）などの算術演算子も使用できます。
nl: Je moet functieaanroepen of variabelen vervangen door een constante waarde zoals een geheel getal, kommagetal, string, vector, een vooraf gedefinieerde array, enzovoort. Je kunt ook rekenkundige operatoren gebruiken zoals vermenigvuldigingen (*), optellingen (+), enzovoort.
pt_br: Você precisa substituir chamadas de funções ou variáveis com um valor constante como um número inteiro, um número decimal, string (cadeia de caractere), vetor, um array (uma matriz) predefinido, etc. Você também pode usar operadores aritméticos como multiplicações (*), adições (+), e assim por diante.
ru: Вам нужно заменить вызовы функций или переменные константным значением, например целым числом, десятичной дробью, строкой, вектором, предопределенным массивом и т.д. Вы также можете использовать арифметические операторы, такие как умножение (*), сложение (+) и так далее.
ta: செயல்பாட்டு அழைப்புகள் அல்லது மாறிகள் முழு எண், தசம எண், சரம், திசையன், முன் வரையறுக்கப்பட்ட வரிசை போன்ற நிலையான மதிப்புடன் நீங்கள் மாற்ற வேண்டும். பெருக்கங்கள் (*), சேர்த்தல் (+) மற்றும் பலவற்றையும் நீங்கள் பயன்படுத்தலாம்.
tr: Fonksiyon çağrısını ya da değişkenlerini şunlar gibi sabit değerlerle değiştirmelisiniz: bir tam sayı, ondalıklı sayı, dize, vektör, ön tanımlı dizi, vb. Bunlarla çarpma (*), toplama (+) ve benzeri aritmetik işlemleri de kullanabilirsiniz.
uk: Треба замінити виклики функцій або змінні сталим значенням, наприклад, цілим числом, десятковим дробом, рядком, вектором, передвизначеним масивом тощо. Також можете використовувати арифметичні оператори, такі як множення (*), додавання (+) тощо.
zh_hans: 您需要将函数调用或变量替换为常数值，例如整数、十进制数、字符串、向量、预定义数组等。 您还可以使用算术运算符，例如乘法 (*)、加法 (+) 等。
zh_hant: 您需要將函式呼叫或變數替換為常數值，例如整數、浮點數、字串、向量、預先定義的陣列等等。 您也可以使用算術運算子，例如乘法（*）、加法（+）等等。
