Repository: GDQuest/learn-gdscript
Catalog: i18n/*/error_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: You get this error when the name between the [code]for[/code] and [code]in[/code] is not a valid variable name, or you are missing the [code]in[/code] keyword.
da: Du får denne fejl, når navnet mellem [code]for[/code] og [code]in[/code] ikke er et gyldigt variabel navn, eller du mangler [code]in[/code] nøgleord.

source: In a [code]for[/code] loop, the [code]in[/code] keyword only accepts a valid temporary variable name to assign values in each loop iteration. The loop creates a new variable with the desired name and assigns each element of the array to it.
da: I et [code]for[/code] loop accepterer [code]in[/code] kun et gyldigt midlertidig variabelt navn for at tildele værdier i hver løkke iteration. Løkken laver en ny variabel med det ønskede navn og tildeler hvert element af arrayet til det.

source: To fix this error, you need to ensure that the name between the [code]for[/code] and [code]in[/code] keywords is a valid variable name with no punctuation or spaces.
da: For at rette denne fejl, skal du sikre, at navnet mellem [code]for[/code] og [code]in[/code] nøgleord er et gyldigt variabel navn uden punktum eller mellemrum.

source: For example, this code is invalid: [code]for cell_position.x in cell_positions_array:[/code] because [code]cell_position.x[/code] isn't a valid variable name.
da: For eksempel er denne kode ugyldig: [code]for cell_position.x in cell_positions_array:[/code], fordi [code]cell_position.x[/code] ikke er et gyldigt variabel navn.

source: To access the [code]x[/code] sub-component of the variable, you need to do that inside of the loop's body:
da: For at få adgang til [code]x[/code] underkomponenten af variablen skal du gøre det inde i sløjfens krop:

source: If you get this error, you are most likely trying to assign a value to something other than a variable, which is impossible. You can only assign values to variables.
da: Hvis du får denne fejl, forsøger du sandsynligvis at tildele en værdi til noget andet end en variabel, hvilket er umuligt. Du kan kun tildele værdier til variabler.

source: Another possibility is that you want to check for equality in a condition but wrote a single = instead of ==.
da: En anden mulighed er, at du ønsker at kontrollere for lighed i en tilstand, men skrev en enkelt = i stedet for ==.

source: If you want to assign a value to a variable, double-check that what you have on the left side of the = sign is a variable and not a function.
da: Hvis du vil tildele en værdi til en variabel, skal du dobbelttjeke, at hvad du har på venstre side af = tegn er en variabel og ikke en funktion.

source: You also need to ensure the syntax is correct. For example, there shouldn't be parentheses on the left side of the equal sign.
da: Du skal også sikre, at synsaksen er korrekt. For eksempel bør der ikke være parenteser på venstre side af ligmed tegnet.

source: In the case of a condition, ensure that you are using two equal signs to check for equality (==).
da: I tilfælde af en betingelse, sikre, at du bruger to ligmed tegn til at kontrollere lighed (==).

source: A cyclic reference is when a class references itself, directly or indirectly.
da: En cyklisk reference er, når en klasse refererer til sig selv, direkte eller indirekte.
pt: Uma referência cíclica é quando uma classe referencia ela mesma, direta ou indiretamente.

source: It has two possible causes:
da: Det har to mulige årsager:
pt: Possui duas causas possíveis:

source: 1. You used the class name in the class itself. 2. Your code refers to another class that refers to this class, causing an endless reference cycle.
da: 1. Du brugte klassenavnet i selve klassen. 2. Din kode refererer til en anden klasse, der refererer til denne klasse, hvilket forårsager en uendelig referencecyklus.
pt: 1. Usou o nome da classe na própria classe. 2. O seu código refere-se a outra classe que se refere para esta classe, causando um ciclo de referência infinito.

source: Either way, due to how GDScript works in Godot 3, unfortunately,you cannot do this. Godot 4 should solve this problem, but you need to work around it in the meantime.
da: Uanset hvad, på grund af hvordan GDScript fungerer i Godot 3, kan du desværre ikke gøre dette. Godot 4 burde løse dette problem, men du er nødt til at arbejde omkring det i mellemtiden.
pt: De qualquer jeito, devido ao jeito que o GDScript funciona no Godot 3, infelizmente, Não pode fazer isso. Godot 4 poderá resolver esse problema, mas precisa contornar isso nesse meio tempo.

source: Erase the type hint in the error line, and the problem should disappear.
da: Slet typehintet i fejllinjen, og problemet burde forsvinde.
pt: Apague a dica de tipo na linha de erro e o problema deve desaparecer.

source: At GDQuest, when we face this error, we remove the type hints on lines causing cyclic references. It solves the problem in the vast majority of cases.
da: Når vi hos GDQuest støder på denne fejl, fjerner vi typehintene på linjer, der forårsager cykliske referencer. Det løser problemet i langt de fleste tilfælde.
pt: No GDQuest, quando encontramos esse erro, removemos as dicas de tipo nas linhas que causam referências cíclicas. Isso resolve o problema na grande maioria dos casos.

source: The indentation of your code (the number of tab characters at the start of the line) is incorrect.
da: Indrykningen af din kode (antallet af tabulatortegn i starten af linjen) er forkert.
pt: A indentação do seu código (a quantidade de caracteres de tabulação no começo da linha) está incorreto.

source: You are missing one or more tabs, or you inserted too many.
da: Du mangler en eller flere tabulatorer, eller du har indsat for mange.
pt: Faltam-lhe um ou mais caracteres de tabulação ou pôs demais.

source: The computer uses those leading tab characters on code lines to know which lines of code are part of a code block, like a function.
da: Computeren bruger de indledende tabulatortegn på kodelinjer til at vide, hvilke kodelinjer der er en del af en kodeblok, f.eks. en funktion.
pt: O computador usa esses caracteres de tabulação nas linhas de código para saber quais dessas linhas fazem parte de um bloco de código, como uma função por exemplo.

source: If the line of code with the error is right after a line ending with a colon, like a function definition, you need one extra indent level compared to the previous line.
da: Hvis kodelinjen med fejlen er lige efter en linje, der slutter med et kolon, f.eks. en funktionsdefinition, skal du bruge et ekstra indrykningsniveau i forhold til den foregående linje.
pt: Se a linha de código que contém o erro estiver logo após uma linha que termina com dois pontos, como uma função por exemplo, precisa de um nível extra de indentação comparado a linha anterior.

source: In other words, your line should have one more leading tab character than the function definition.
da: Med andre ord skal din linje have et indledende tabulatortegn mere end funktionsdefinitionen.
pt: Em outras palavras, a sua linha deverá ter um caractere de tabulação a mais do que a definição da função.

source: You get this error when you wrote something that is syntactically invalid, or you are missing something to complete this line or previous lines of code.
da: Du får denne fejl, når du har skrevet noget, der er syntaktisk ugyldigt, eller du mangler noget for at fuldføre denne linje eller foregående linjer kode.
pt: Recebe esse erro quando escreveu alguma palavra sintaticamente inválida, ou quando falta algo para completar essa linha de código ou a anterior.

source: You need to be extremely precise when you write code for the computer. This kind of error is easy to get as all it takes is one wrong character.
da: Du skal være ekstremt præcis, når du skriver kode til computeren. Denne type fejl er let at få, da alt, hvad der kræves, er ét forkert tegn.
pt: Deve ser extremamente preciso quando for escrever código para o computador. Esse tipo de erro é comum acontecer pois precisa somente de um caractere errado.

source: Note that this error can appear [b]after[/b] the line causing it due to how the computer reads and analyzes your code.
da: Bemærk, at denne fejl kan vises [b]efter[/b] den linje, der forårsager den, på grund af den måde, computeren læser og analyserer din kode på.
pt: Note que esse erro pode aparecer [b]depois[/b] da linha que o causa devido à forma que o computador lê e analisa o seu código.

source: The way to solve this kind of error is highly contextual. The error message should tell you which character or element it's missing.
da: Løsningen på denne type fejl er meget kontekstafhængig. Fejlmeddelelsen bør fortælle dig, hvilket tegn eller element der mangler.
pt: A maneira de resolver esse tipo de erro é altamente contextual. A mensagem de erro deve dizer-lhe qual caractere ou elemento falta.

source: If the error says "expected," then you're likely missing something in one of the [b]previous[/b] code lines. It could be a punctuation mark, a parenthesis, or something else.
da: Hvis fejlen siger "forventet", mangler du sandsynligvis noget i en af de [b]forrige[/b] kodelinjer. Det kan være et tegnsætningstegn, en parentes eller noget andet.
pt: Se o erro disser "esperado," então é bem provável que falta algo nas linhas de código [b]anteriores[/b]. Pode ser um sinal de pontuação, um parênteses, ou qualquer coisa assim.

source: If it says "unterminated," you are missing some character at the end of an expression, like a closing bracket. In this case, it most likely comes from the line with the error.
da: Hvis der står "uafsluttet", mangler du et tegn i slutningen af et udtryk, f.eks. en afsluttende parentes. I dette tilfælde kommer det højst sandsynligt fra linjen med fejlen.
pt: Se disser "indeterminado", então está faltando algum caractere no final de uma expressão, como um colchete de fechamento. Nesse caso, é bem provável que esteja na linha do próprio erro.

source: This error tells you that you are missing a parenthesis (or sometimes a comma or a path).
da: Denne fejl fortæller dig, at du mangler en parentes (eller nogle gange et komma eller en sti).
pt: Esse erro diz-lhe que falta um parêntesis (ou às vezes uma vírgula ou um caminho de algum arquivo).

source: Three keywords in GDScript work like function calls and require parentheses: [code]yield()[/code], [code]preload()[/code], and [code]assert()[/code].
da: Tre nøgleord i GDScript fungerer som funktionskald og kræver parenteser: [code]yield()[/code], [code]preload()[/code] og [code]assert()[/code].
pt: Três palavras-chave no GDScript funcionam como chamadas de função e precisam de parênteses: [code]yield()[/code], [code]preload()[/code] e [code]assert()[/code].

source: To address the error, you want to add the missing opening parenthesis, the closing parenthesis, or the comma.
cs: Chybu vyřešíte tak, že doplníte chybějící úvodní závorku, uzavírací závorku nebo čárku.
da: For at rette fejlen skal du tilføje den manglende indledende parentes, den afsluttende parentes eller kommaet.
de: Um den Fehler zu beheben, musst Du die fehlende öffnende Klammer, die schließende Klammer oder das Komma hinzufügen.
es: Para solucionar el error, debes agregar el paréntesis de apertura, el paréntesis de cierre o la coma que falta.
fr: Pour corriger l'erreur, vous devez ajouter la parenthèse ouvrante, la parenthèse fermante ou la virgule qui manque.
it: Per risolvere l'errore, devi aggiungere le parentesi di apertura mancanti, le parentesi di chiusura o la virgola.
ja: このエラーに対処するには、欠落している開き括弧、閉じ括弧、またはコンマを追加します。
nl: Om de foutmelding te verhelpen, moet je het ontbrekende openende of sluitende haakje of de komma toevoegen.
pt: Para resolver esse erro, precisa adicionar o parêntese de abertura, o parêntese de fechamento, ou a vírgula que estiver faltando.
pt_br: Para resolver esse erro, você precisa adicionar o parêntese de abertura, o parêntese de fechamento, ou a vírgula que estiver faltando.
ru: Чтобы устранить ошибку, вам необходимо добавить отсутствующую открывающую круглую скобку, закрывающую круглую скобку или запятую.
ta: பிழையை நிவர்த்தி செய்ய, நீங்கள் காணாமல் போன தொடக்க அடைப்புக்குறி, இறுதி அடைப்புக்குறிப்பு அல்லது கமாவைச் சேர்க்க விரும்புகிறீர்கள்.
tr: Bu hatayı gidermek için, eksik olan açık parantezi, kapalı parantezi, ya da virgülü eklemek isteyebilirsiniz.
uk: Щоб усунути помилку, вам слід додати відсутню відкривну чи закривну круглу дужку або кому.
zh_hans: 要解决该错误，您需要添加缺少的左括号、右括号或逗号。
zh_hant: 要解決這個錯誤，你需要添加缺失的開括號、閉括號或逗號。

source: This error tells you are missing some parenthesis, a comma, or some value in your export hint.
cs: Tato chyba vás informuje o tom, že v nápovědě k exportu chybí závorka, čárka nebo nějaká hodnota.
da: Denne fejl fortæller, at du mangler en parentes, et komma eller en værdi i dit eksporthint.
de: Dieser Fehler besagt, dass eine Klammer, ein Komma oder ein Wert in im Exporthinweis fehlt.
pt_br: Esse erro fala pra você que está faltando algum parêntese, uma vírgula, ou algum valor na sua dica de exportação.
ta: இந்த பிழை உங்கள் ஏற்றுமதி குறிப்பில் சில அடைப்புக்குறிப்புகள், ஒரு கமா அல்லது சில மதிப்பைக் காணவில்லை என்று கூறுகிறது.
tr: Bu hata, birkaç parantezi, bir virgülü, ya da dışa aktarım (export) ipucundaki bir değeri unuttuğunuzu söyler.
uk: Ця помилка повідомляє про те, що у вашому описі параметрів експорту змінної відсутні якісь круглі дужки, кома або якесь значення.
zh_hant: 這個錯誤告訴你在導出提示中缺少了某個括號、逗號或某個值。

source: You need to read the error message and add the missing character or value it requests.
cs: Musíte si přečíst chybovou zprávu a doplnit chybějící znak nebo hodnotu, kterou požaduje.
da: Du skal læse fejlmeddelelsen og tilføje det manglende tegn eller den manglende værdi, den anmoder om.
de: Du musst die Fehlermeldung lesen und das fehlende Zeichen oder den angeforderten Wert hinzufügen.
es: Debes leer el mensaje de error y añadir el carácter o valor faltante que solicita.
fr: Vous devez lire le message d'erreur et ajouter le caractère manquant ou la valeur demandée.
it: Devi leggere il messaggio di errore e aggiungere il carattere mancante o il valore richiesto.
ja: エラー メッセージを読み、不足している文字または要求されている値を追加する必要があります。
nl: Je moet de foutmelding lezen en het ontbrekende teken of de waarde waar het om vraagt toevoegen.
pt: Precisa ler a mensagem de erro e adicionar o caractere ou o valor que estiver faltando.
pt_br: Você precisa ler a mensagem de erro e adicionar o caractere ou o valor que estiver faltando.
ru: Вам нужно прочитать сообщение об ошибке и добавить отсутствующий символ или значение, которое оно запрашивает.
ta: நீங்கள் பிழை செய்தியைப் படித்து, காணாமல் போன எழுத்து அல்லது மதிப்பைக் கோருகிறீர்கள்.
tr: Hata mesajını okumalı ve size söylediği eksik olan karakteri ya da değeri eklemelisiniz.
uk: Вам потрібно прочитати повідомлення про помилку та додати відсутній символ або значення, про яке йдеться.
zh_hans: 您需要阅读错误消息并添加它请求的缺失字符或值。
zh_hant: 你需要閱讀錯誤訊息，並根據它的要求添加缺少的字符或值。

source: This error happens in several cases:
da: Denne fejl opstår i flere tilfælde:
pt: Esse erro acontece em muitos casos:

source: 1. You wrote an identifier (variable or function name) in the wrong place. 2. You wrote a keyword like [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code], and you did not follow it by a name. 3. You wrote a function definition but forgot the parentheses before the colon.
da: 1. Du skrev en identifikator (variabel- eller funktionsnavn) det forkerte sted. 2. Du skrev et nøgleord som [code]var[/code], [code]func[/code], [code]for[/code] eller [code]signal[/code], og du efterfulgte det ikke af et navn. 3. Du skrev en funktionsdefinition, men glemte parenteserne før kolonet.
pt: 1. Escreveu um identificador (variável ou nome de um função) no lugar errado. 2. Escreveu uma palavra-chave como [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code] e em seguida não pôs um nome. 3. Escreveu uma definição de função mas esqueceu-se do parêntese antes do sinal de dois pontos.

source: If the error tells you it expected something, you likely forgot to write a name after a keyword like [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code], making your code invalid. Or you forgot parentheses in a function definition. You can address the error by adding the missing name or parentheses.
da: Hvis fejlen fortæller dig, at den forventede noget, har du sandsynligvis glemt at skrive et navn efter et nøgleord som [code]var[/code], [code]func[/code], [code]for[/code] eller [code]signal[/code], hvilket gør din kode ugyldig. Eller du har glemt parenteser i en funktionsdefinition. Du kan løse fejlen ved at tilføje det manglende navn eller de manglende parenteser.
pt: Se o erro te disser que espera algo, provavelmente esqueceu-se de escrever um nome depois de uma palavra-chave como [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code], fazendo assim o seu código inválido. Ou esqueceu-de de um parêntese numa definição de função. Pode resolver esse erro adicionando o nome ou parêntese que falta.

source: If the error says you have something unexpected, you are likely missing a keyword like [code]var[/code], [code]func[/code], [code]for[/code], etc.
da: Hvis fejlen siger, at du har noget uventet, mangler du sandsynligvis et nøgleord som [code]var[/code], [code]func[/code], [code]for[/code] osv.
pt: Se o erro disser que tem algo inesperado, provavelmente esqueceu-se de uma palavra-chave como [code]var[/code], [code]func[/code], [code]for[/code], etc.

source: Another possibility is that you need to write a colon at the end of a function definition, [code]for[/code] loop, or a line starting with [code]if[/code], [code]elif[/code], or [code]else[/code].
da: En anden mulighed er, at du skal skrive et kolon i slutningen af en funktionsdefinition, en [code]for[/code]-løkke eller en linje, der starter med [code]if[/code], [code]elif[/code] eller [code]else[/code].
pt: Outra possibilidade é que precisa escrever o sinal de dois pontos no final da definição da função, estrutura de repetição [code]for[/code], ou numa linha começando com [code]if[/code], [code]elif[/code], ou [code]else[/code].

source: This error tells you that you are missing a type somewhere. A type can be [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code], and many identifiers representing a data structure.
da: Denne fejl fortæller dig, at du mangler en type et sted. En type kan være [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code] og mange identifikatorer, der repræsenterer en datastruktur.
pt: Esse erro diz-lhe que falta um tipo em algum lugar. Um tipo pode ser [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code] e muitos identificadores que representam uma estrutura de dados.

source: Most of the time, this error occurs when you wrote a colon after a variable name but did not follow it with a type name.
da: Denne fejl opstår oftest, når du har skrevet et kolon efter et variabelnavn, men ikke efterfulgt det af et typenavn.
pt: Na maioria das vezes, esse erro acontece quando escreve o sinal de dois pontos depois de um nome de uma variável que não possui o nome do tipo dela logo em seguida.

source: It also occurs when you write an arrow ([code]->[/code]) after the parentheses of a function definition but do not follow it with a type name.
da: Den opstår også, når du skriver en pil ([code]->[/code]) efter parenteserne i en funktionsdefinition, men ikke efterfulgt den af et typenavn.
pt: Também acontece quando escreve uma seta ([code]->[/code]) depois de um parêntese de uma definição de função que não foi seguido pelo nome do tipo.

source: To solve this, you need to write the name of the type after the colon, arrow (in the case of function return types), inside parentheses (for export types), or after the [code]as[/code] keyword.
cs: Chcete-li to vyřešit, musíte napsat název typu za dvojtečku, šipku (v případě návratových typů funkcí), do závorek (u typů exportu) nebo za klíčové slovo [code]as[/code].
da: For at løse dette skal du skrive navnet på typen efter kolon, pil (i tilfælde af funktionsreturtyper), i parenteser (for eksporttyper) eller efter nøgleordet [code]as[/code].
de: Um dieses Problem zu lösen, muss man den Namen des Typs nach dem Doppelpunkt, dem Pfeil (im Falle von Funktionsrückgabetypen), in Klammern (für Exporttypen) oder nach dem Schlüsselwort [code]as[/code] schreiben.
es: Para solucionarlo, tienes que escribir el nombre del tipo después de los dos puntos o de la flecha (en el caso de los tipos de retorno de una función), entre paréntesis (para los tipos de exportación), o después de la palabra clave [code]as[/code].
fr: Pour résoudre ce problème, vous devez écrire le nom du type après le deux points ou la flèche (dans le cas des types de retour de fonction), à l'intérieur des parenthèses (pour les types d'exportation), ou après le mot-clé [code]as[/code].
it: Per risolverlo, devi scrivere il nome del tipo dopo i due punti, freccia (nel caso di del tipo di ritorno di una funzione), dentro le parentesi (oer i tipi da esportare) o dopo la parola chiave [code]as[/code].
ja: これを解決するには、コロンの後、矢印の後（関数のリターン型の場合）、括弧の中（エクスポート型の場合）、または[code]as[/code]キーワードの後に型名を書く必要がある。
nl: Om dit op te lossen, moet je de naam van het type schrijven na de dubbele punt, de pijl (in het geval van functieteruggavetypes), tussen haakjes (voor exporttypes) of na het sleutelwoord [code]as[/code].
pt: Para resolver esse erro, precisa escrever o nome do tipo depois do sinal de dois pontos, da seta (no caso de ser uma função que retorna algum tipo), de dentro do parêntese (para tipos que exportam), ou depois da palavra-chave [code]as[/code].
pt_br: Para resolver esse erro, você precisa escrever o nome do tipo depois do sinal de dois pontos, da seta (no caso de ser uma função que retorna algum tipo), de dentro do parêntese (para tipos que exportam), ou depois da palavra-chave [code]as[/code].
ru: Чтобы решить эту проблему, вам нужно написать имя типа после двоеточия, стрелки (в случае типов, возвращаемых функцией), внутри круглых скобок (для типов экспорта) или после ключевого слова [code]as[/code].
ta: இதைத் தீர்க்க, நீங்கள் பெருங்குடல், அம்பு (செயல்பாட்டு திரும்ப வகைகளின் விசயத்தில்), அடைப்புக்குறிக்குள் (ஏற்றுமதி வகைகளுக்கு), அல்லது [குறியீடு] [/குறியீடு] முக்கிய சொற்களுக்குப் பிறகு வகையின் பெயரை எழுத வேண்டும்.
tr: Bunu çözmek için, iki nokta üst üste ve ok 'tan (fonksiyon bir dönüş tipine sahipse) sonra, parantezlerin içinde (dışa aktarım -export- tipleri için), veya [code]as[/code] anahtar kelimesinden sonra, ilgili tip ismini yazmalısınız.
uk: Щоб розв'язати цю проблему, потрібно написати назву типу після двокрапки, стрілки (в разі типів, які повертає функція), усередині круглих дужок (для типів експорту) або після ключового слова [code]as[/code].
zh_hans: 为了解决这个问题，您需要在冒号、箭头（对于函数返回类型的情况下）、括号内（对于导出类型）或 [code]as[/code] 关键字之后编写类型的名称。
zh_hant: 為了解決這個問題，你需要在冒號、箭頭（對於函式回傳類型的情況下）、括號內（對於導出類型）或 [code]as[/code] 關鍵字後編寫類型名稱。

source: The variable, function name, or class name you are trying to use does not exist.
da: Variablen, funktionsnavnet eller klassenavnet, du prøver at bruge, findes ikke.
pt: A variável, nome de função, ou nome de classe que tenta usar não existe.

source: You most often get this error when you make typos. Maybe you swapped two letters, forgot a letter... sometimes, it's hard to spot.
da: Du får oftest denne fejl, når du laver stavefejl. Måske har du byttet om på to bogstaver, glemt et bogstav... nogle gange er det svært at få øje på.
pt: Geralmente recebe esse erro quando comete erros na digitação de alguma palavra. Talvez trocou duas letras de lugar, esqueceu uma letra... às vezes é difícil de identificar.
