Repository: GDQuest/learn-gdscript
Catalog: i18n/*/error_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: The function you're trying to define exists in a parent class, so your definition overrides the parent class's function. When you override a parent class's function, the new function must match the parent. The new function should have the same number and type of parameters as the parent class. For example, if the parent has two arguments, you need your new function also to have two arguments. If you use type hints in your function definitions, the argument types must match the parent class.
cs: Funkce, kterou se snažíte definovat, existuje v nadřazené třídě, takže vaše definice přepisuje funkci nadřazené třídy. Když přepíšete funkci nadřazené třídy, musí nová funkce odpovídat nadřazené třídě. Nová funkce by měla mít stejný počet a typ parametrů jako rodičovská třída. Například pokud má rodičovská třída dva argumenty, musí mít vaše nová funkce také dva argumenty. Pokud v definicích funkcí používáte typové nápovědy, musí typy argumentů odpovídat rodičovské třídě.
de: Die Funktion, die definieren möchtest, ist in einer übergeordneten Klasse vorhanden, sodass Ihre Definition die Funktion der übergeordneten Klasse überschreibt. Wenn Du die Funktion einer übergeordneten Klasse überschreibst, muss die neue Funktion mit der übergeordneten Klasse übereinstimmen. Die neue Funktion sollte die gleiche Anzahl und den gleichen Typ von Parametern wie die übergeordnete Klasse aufweisen. Wenn das übergeordnete Element beispielsweise über zwei Argumente verfügt, muss die neue Funktion ebenfalls über zwei Argumente verfügen. Wenn Du Typhinweise in Funktionsdefinitionen verwendest, müssen die Argumenttypen mit der übergeordneten Klasse übereinstimmen.
es: La función que intentas definir existe en una clase padre, por lo que tu definición anula la función de la clase padre. Cuando anulas la función de una clase padre, la nueva función debe coincidir con la del padre. La nueva función debe tener el mismo número y tipo de parámetros que la clase padre. Por ejemplo, si la clase padre tiene dos argumentos, necesitas que tu nueva función también tenga dos argumentos. Si utilizas sugerencias de tipo en tus definiciones de función, los tipos de argumento deben coincidir con la clase padre.
fr: La fonction que vous essayez de définir existe dans une classe parent, votre définition annule donc la fonction de la classe parent. Lorsque vous annulez la fonction d'une classe parent, la nouvelle fonction doit correspondre à celle du parent. La nouvelle fonction doit avoir le même nombre et le même type de paramètres que la classe parent. Par exemple, si le parent a deux arguments, votre nouvelle fonction doit aussi avoir deux arguments. Si vous utilisez des suggestions de type dans vos définitions de fonction, les types d'arguments doivent correspondre à la classe parent.
it: La funzione che stai cercando di definire esiste in una classe genitore, quindi la tua definizione sovrascrive la funzione della classe genitore. Quando sovrascrivi la funzione di una classe genitore, la nuova funzione deve combaciare con quella genitore. La nuova funzione dovrebbe avere lo stesso numero e tipo di parametri della classe genitore. Per esempio, se il genitore ha due argomenti, devi far sì che la tua nuova funzione abbia due argomenti. Se usi i suggerimenti di tipo nella definizione della tua funzione, i tipi dell'argomento devono combaciare la classe genitore.
ja: 定義しようとしている関数は親クラスに存在するので、定義した関数は親クラスの関数をオーバーライドします。 親クラスの関数をオーバーライドする場合、新しい関数は親クラスと一致しなければなりません。新しい関数は、親クラスと同じ数と型のパラメータを持つ必要があります。 例えば、親クラスが2つの引数を持つ場合、新しい関数も2つの引数を持つ必要があります。関数定義で型ヒントを使用する場合、引数の型は親クラスと一致していなければなりません。
nl: De functie die je probeert te definiëren bestaat in een bovenliggende klasse, dus je definitie overschrijft de functie van de bovenliggende klasse. Wanneer je een functie van een bovenliggende klasse overschrijft, moet de nieuwe functie overeenkomen met de bovenliggende klasse. De nieuwe functie moet hetzelfde aantal en type parameters hebben als die van de bovenliggende klasse. Als de bovenliggende klasse bijvoorbeeld twee argumenten heeft, dan moet je nieuwe functie ook twee argumenten hebben. Als je typehints gebruikt in je functiedefinities, moeten de argumenttypes overeenkomen met de bovenliggende klasse.
pt_br: A função que você está tentando definir já existe numa classe pai, então sua definição sobrescreve a função da classe pai. Quando você sobrescreve uma função da classe pai, a nova função precisa corresponder a da classe pai. A nova função deve ter o mesmo número e tipo de parâmetros que a classe pai. Por exemplo, se a classe pai possuir dois argumentos, você precisa garantir que a nova função também tenha dois argumentos. Se você usar a dica de tipo na suas definições de funções, os tipos de argumentos devem corresponder a da classe pai.
ru: Функция, которую вы пытаетесь определить, существует в родительском классе, поэтому ваше определение переопределяет функцию родительского класса. Когда вы переопределяете функцию родительского класса, сигнатура новой функции должна соответствовать сигнатуре родительской. Это значит что количество и типы параметров, в ней должны быть такими же, как и в функции родительского класса. Например, если родительский элемент имеет два аргумента, вам нужно, чтобы ваша новая функция также имела два аргумента. Если вы используете обозначения типов переменных в определениях функций, типы аргументов должны соответствовать типам в родительском классе.
ta: நீங்கள் வரையறுக்க முயற்சிக்கும் செயல்பாடு பெற்றோர் வகுப்பில் உள்ளது, எனவே உங்கள் வரையறை பெற்றோர் வர்க்கத்தின் செயல்பாட்டை மீறுகிறது. பெற்றோர் வகுப்பின் செயல்பாட்டை நீங்கள் மேலெழுதும்போது, புதிய செயல்பாடு பெற்றோருடன் பொருந்த வேண்டும். புதிய செயல்பாட்டில் பெற்றோர் வகுப்பின் அதே எண் மற்றும் அளவுருக்கள் இருக்க வேண்டும். எடுத்துக்காட்டாக, பெற்றோருக்கு இரண்டு வாதங்கள் இருந்தால், இரண்டு வாதங்களைக் கொண்டிருக்க உங்கள் புதிய செயல்பாடு தேவை. உங்கள் செயல்பாட்டு வரையறைகளில் வகை குறிப்புகளைப் பயன்படுத்தினால், வாத வகைகள் பெற்றோர் வகுப்போடு பொருந்த வேண்டும்.
tr: Tanımlamaya çalıştığınız fonksiyon, ana sınıfın içinde zaten tanımlı durumda, yani sizin tanımlamanız ana sınıftaki fonksiyonun üzerine yazıyor. Ana sınıfın bir fonksiyonunun üzerine yazacaksanız, yeni fonksiyon ana sınıftaki ile eşdeğer olmalıdır. Yeni fonksiyonun parametrelerinin sayısı ve tipleri, ana sınıfın fonksiyonu ile aynı olmalıdır. Örneğin, ana sınıfta iki tane girilen değer varsa, sizin fonksiyonunuz da iki girilen değişken kullanmalıdır. Fonksiyon tanımında tip belirteçleri kullanıyorsanız, girdi değişkenleri ana sınıftakilerle aynı tipte olmalıdır.
uk: Функція, яку ви намагаєтеся визначити, існує у батьківському класі, тому ваше визначення перевизначає функцію батьківського класу. Коли ви перевизначаєте функцію батьківського класу, сигнатура нової функції повинна відповідати батьківській сигнатурі. Це означає, що кількість і типи параметрів у ній повинні бути такими ж, як і у функції батьківського класу. Наприклад, якщо батьківський елемент має два аргументи, вам потрібно, щоб ваша нова функція також мала два аргументи. Якщо ви використовуєте позначення типів змінних у визначеннях функцій, типи аргументів повинні відповідати типу в батьківському класі.
zh_hans: 您尝试定义的函数存在于父类中，因此您的定义会覆盖父类的函数。 当您覆盖父类的函数时，新函数必须与父类匹配。 新函数应具有与父类相同数量和类型的参数。 例如，如果父函数有两个参数，则您的新函数也需要有两个参数。 如果您在函数定义中使用类型提示，则参数类型必须与父类匹配。
zh_hant: 您嘗試定義的函式已經存在於父類別中，因此您的定義會覆蓋父類別的函式。 當您覆寫（override）父類別的函式時，新函式必須與父類別的函式匹配。新函式的參數數量與類型都必須與父類別相同。 舉例來說，如果父類別的函式有兩個參數，您的新函式也必須有兩個參數。若您的函式定義使用了型別註記（type hints），則參數的型別必須與父類別一致。

source: All the values in your code have a specific type. That type can be a whole number (int), a decimal number (float), text (String), and so on. There are tons of possible types, and you can even define your own! When you make any operation, the computer compares the types you are using. Some types are compatible, and some are not. For example, you cannot directly add a whole number to a text string. You first need to convert the number into text. You'll need to read the error message to see what is not matching because there are many possible cases.
cs: Všechny hodnoty ve vašem kódu mají určitý typ. Tímto typem může být celé číslo (int), desetinné číslo (float), text (String) atd. Existuje spousta možných typů a můžete si dokonce definovat vlastní! Když provádíte jakoukoli operaci, počítač porovnává typy, které používáte. Některé typy jsou kompatibilní a některé ne. Například k textovému řetězci nelze přímo přičíst celé číslo. Nejprve musíte číslo převést na text. Budete si muset porozumět chybovému hlášení, abyste zjistili, co se neshoduje, protože existuje mnoho možných případů.
de: Alle Werte im Code haben einen bestimmten Typ. Dieser Typ kann eine ganze Zahl (int), eine Dezimalzahl (Float), Text (String) usw. sein. Es gibt Tonnen von möglichen Typen, und Du kannst sogar eigene definieren! Wenn Du eine Operation ausführst, vergleicht der Computer die von Dir verwendeten Typen. Einige Typen sind kompatibel, andere nicht. Beispielsweise kannst Du einer Textzeichenfolge nicht direkt eine ganze Zahl hinzufügen. Die Nummer muss zuerst in Text umwandelt werden. Du musst die Fehlermeldung lesen, um zu sehen, was nicht übereinstimmt, da es viele mögliche Fälle gibt.
es: Todos los valores de tu código tienen un tipo específico. Ese tipo puede ser un número entero (int), un número decimal (float), texto (String), etc. Hay montones de tipos posibles, ¡e incluso puedes definir los tuyos propios! Cuando realizas cualquier operación, la computadora compara los tipos que estás utilizando. Algunos tipos son compatibles, y otros no. Por ejemplo, no puedes sumar directamente un número entero a una cadena de texto. Primero necesitas convertir el número en texto. Tendrás que leer el mensaje de error para ver qué es lo que no coincide, ya que hay muchos casos posibles.
fr: Toutes les valeurs de votre code ont un type spécifique. Ce type peut être un nombre entier (int), un nombre décimal (float), du texte (String), etc. Il existe des tonnes de types possibles, et vous pouvez même définir les vôtres ! Lorsque vous effectuez une opération, l'ordinateur compare les types que vous utilisez. Certains types sont compatibles, d'autres non. Par exemple, vous ne pouvez pas additionner directement un nombre entier à une chaîne de texte. Vous devez d'abord convertir le nombre en texte. Vous devrez lire le message d'erreur pour voir ce qui ne correspond pas car il existe de nombreux cas possibles.
it: Tutti i valori nel tuo codice hanno dei tipi specifici. Questo tipo può essere un numero intero (int), un numero decimale (float), testo (String) e così via. Ci sono un sacco di possibili tipi e puoi anche definire il tuo! Quando fai ogni operazione, il computer compara i tipi che stai usando. Alcuni tipi sono compatibili e altri no. Per esempio, non puoi aggiungere direttamente dei numeri interi ad una stringa di testo. Devi prima convertirei numeri in testo. Devi leggere il messaggio di errore per vedere cosa non combacia perchè ci sono molti casi possibili.
ja: コード内のすべての値には特定の型があります。その型には整数（int）、小数（float）、テキスト（String）などがある。可能な型は大量にあり、自分で定義することもできる！ 演算を行う際、コンピュータは使用している型を比較します。 互換性のある型もあれば、そうでない型もある。例えば、テキスト文字列に直接整数を加えることはできません。まず数値をテキストに変換する必要があります。 エラーメッセージを読んで、何が一致しないのかを確認する必要があります。
nl: Alle waarden in je code hebben een specifiek type. Dat type kan een geheel getal zijn (int), een kommagetal (float), tekst (String), enzovoort. Er zijn heel veel mogelijke types en je kunt zelfs je eigen types definiëren! Wanneer je een operatie uitvoert, vergelijkt de computer de types die je gebruikt. Sommige types zijn compatibel, andere niet. Je kunt bijvoorbeeld niet direct een geheel getal optellen bij een tekststring. Je moet eerst het getal omzetten in tekst. Je moet de foutmelding lezen om te zien wat niet overeenkomt, want er zijn veel mogelijke gevallen.
pt_br: Todos os valores no seu código possuem um tipo específico. Esse tipo pode ser um número inteiro (int), um número decimal (float), um texto (String), e assim por diante. Há vários tipos possíveis, e você pode até mesmo definir seus próprios tipos! Quando você faz qualquer operação, o computador compara os tipos que você está usando. Alguns tipos são compatíveis, e outros não. Por exemplo, você não pode adicionar diretamente um número inteiro a uma cadeia de caractere (string). Você precisa primeiro converter o número em texto. Você vai precisar ler a mensagem de erro para ver o que não está compatível porque existe muitos casos possíveis.
ru: Все значения в вашем коде имеют определенный тип. Этот тип может быть целым числом (int), десятичной дробью (float), текстом (String) и так далее. Существует множество возможных типов, и вы даже можете определить свой собственный! Когда вы выполняете какую-либо операцию, компьютер сравнивает используемые вами типы. Некоторые типы совместимы, а некоторые — нет. Например, вы не можете напрямую добавить целое число в текстовую строку. Сначала вам нужно преобразовать число в текст. Текст сообщения об ошибке точно покажет вам, какие именно типы не соответствует друг другу, так как ошибка может возникнуть во многих случаях.
ta: உங்கள் குறியீட்டில் உள்ள அனைத்து மதிப்புகளும் ஒரு குறிப்பிட்ட வகையைக் கொண்டுள்ளன. அந்த வகை முழு எண் (எண்ணாக), ஒரு தசம எண் (மிதவை), உரை (சரம்) மற்றும் பலவற்றாக இருக்கலாம். சாத்தியமான டன் வகைகள் உள்ளன, மேலும் நீங்கள் உங்கள் சொந்தத்தை வரையறுக்கலாம்! நீங்கள் எந்த செயல்பாட்டையும் செய்யும்போது, கணினி நீங்கள் பயன்படுத்தும் வகைகளை ஒப்பிடுகிறது. சில வகைகள் இணக்கமானவை, சில இல்லை. எடுத்துக்காட்டாக, நீங்கள் ஒரு முழு எண்ணையும் ஒரு உரை சரத்திற்கு நேரடியாக சேர்க்க முடியாது. நீங்கள் முதலில் எண்ணை உரையாக மாற்ற வேண்டும். பொருந்தாதவற்றைக் காண நீங்கள் பிழை செய்தியைப் படிக்க வேண்டும், ஏனெனில் பல சாத்தியமான வழக்குகள் உள்ளன.
tr: Kodunuzdaki bütün değerler, belirli bir tipe sahiptir. Bunlar bir tam sayı (int), bir ondalık sayı (float), bir dize (String), ve benzeri olabilirler. Mümkün olan tonlarca farklı tip var ve hatta kendinize ait bir tip tanımlayabilirsiniz. Bir işlem yaptığınızda, bilgisayar kullandığınız bu tipleri karşılaştırır. Bazı tipler uyumludur, bazıları uyumsuz. Örnek olarak, bir tam sayı ile bir dizeyi doğrudan toplayamazsınız. İlk önce sayıyı bir dizeye çevirmeniz gerekir. Bu konuda o kadar çok olasılık var ki, nelerin uyuşmadığını görmek için hata mesajını okumanız gerekiyor.
uk: Кожне значення у вашому коді має певний тип. Цей тип може бути цілим числом (int), десятковим дробом (float), текстом (String) тощо. Існує безліч можливих типів, і ви можете навіть визначати свої власні! Коли ви виконуєте якусь операцію, комп'ютер порівнює типи, які використовуєте ви. Деякі типи сумісні, а деякі ні. Наприклад, ви не можете безпосередньо додати ціле число до текстового рядка. Спочатку потрібно перетворити число на текст. Щоб зрозуміти, які саме типи не відповідають один одному, слід прочитати повідомлення про помилку, оскільки є багато варіантів.
zh_hans: 代码中的所有值都具有特定类型。 该类型可以是整数 (int)、十进制数 (float)、文本 (String) 等。 有很多可能的类型，您甚至可以定义自己的类型！ 当您进行任何操作时，计算机会比较您正在使用的类型。 有些类型兼容，有些则不兼容。 例如，您不能直接将整数添加到文本字符串中。 您首先需要将数字转换为文本。 您需要阅读错误消息以查看不匹配的内容，因为有很多可能的情况。
zh_hant: 程式碼中的所有數值都有特定的型別，例如整數（int）、小數（float）、文字（String）等。此外，還有許多其他型別，甚至可以自訂型別！ 當您執行某些運算時，電腦會檢查所使用的型別是否相容。 某些型別可以互相運算，但有些則不行。例如，您無法直接將整數與文字字串相加，必須先將數字轉換為文字格式。 由於可能出現多種型別錯誤，您需要仔細閱讀錯誤訊息，以確認哪個型別不匹配，然後進行適當的轉換或調整。

source: If the error mentions the assigned value type not matching the variable, the problem is on the right side of the equal sign (=). If the error talks about the return type not matching the function, then it is the value after the return keyword that is problematic. If the computer talks about an invalid operand, then the issue is that the operation does not exist for the type you're trying to use. For example, while you can add two 2D vectors, you can't add a whole number or text to a 2D vector.
cs: Pokud je v chybě uvedeno, že přiřazený typ hodnoty neodpovídá proměnné, je problém na pravé straně znaménka rovnosti (=). Pokud chyba hovoří o tom, že typ návratové hodnoty neodpovídá funkci, pak je problematická hodnota za klíčovým slovem return. Pokud počítač hovoří o neplatném operandu, pak je problém v tom, že operace pro typ, který se snažíte použít, neexistuje. Zatímco například můžete sečíst dva 2D vektory, nemůžete k 2D vektoru přičíst celé číslo nebo text.
de: Wenn der Fehler den zugewiesenen Werttyp erwähnt, der nicht mit der Variablen übereinstimmt, befindet sich das Problem auf der rechten Seite des Gleichheitszeichens (=). Wenn der Fehler davon spricht, dass der Rückgabetyp nicht mit der Funktion übereinstimmt, ist der Wert nach dem "return" Schlüsselwort problematisch. Wenn der Computer über einen ungültigen Operanden spricht, besteht das Problem darin, dass der Vorgang für den Typ, den Du verwenden möchtest, nicht vorhanden ist. Während Du beispielsweise zwei 2D-Vektoren hinzufügen kannst, kannst Du einem 2D-Vektor keine ganze Zahl oder Text hinzufügen.
es: Si el error menciona que el tipo de valor asignado no coincide con la variable, el problema está en el lado derecho del signo igual (=). Si el error habla de que el tipo de retorno no coincide con la función, entonces el problema está en el valor que está después de la palabra clave "return". Si la computadora habla de un operando no válido, entonces el problema es que la operación no existe para el tipo que estás intentando utilizar. Por ejemplo, aunque puedes sumar dos vectores 2D, no puedes sumarle un número entero o un texto a un vector 2D.
fr: Si l'erreur mentionne que le type de valeur assignée ne correspond pas à la variable, le problème se trouve à droite du signe égal (=). Si l'erreur mentionne que le type de retour ne correspond pas à la fonction, c'est la valeur après le mot-clé « return » qui pose problème. Si l'ordinateur parle d'un opérande invalide, alors le problème est que l'opération n'existe pas pour le type que vous essayez d'utiliser. Par exemple, alors que vous pouvez additionner deux vecteurs 2D, vous ne pouvez pas additionner un nombre entier ou du texte à un vecteur 2D.
it: Se l'errore menziona il tipo di valore assegnato che non combacia con la variabile, il problema è alla destra del segno di uguaglianza (=). Se l'errore parla di un tipo di valore di ritorno che non combacia con la funzione, allora è il valore dopo la parola chiave return che dà problemi. Se il computer parla di un operando invalido, allora il problema è che l'operazione non esiste per il tipo che stai cercando di usare. Per esempio: puoi sommare due vettori 2D tra di loro, ma non puoi aggiungere un numero intero o del testo ad un vettore 2D.
ja: 代入された値の型が変数と一致しないというエラーの場合、問題は等号（=）の右側にある。 戻り値の型が関数と一致しないというエラーの場合は、returnキーワードの後の値に問題があります。 コンピュータがオペランドが無効だと言っている場合は、使おうとしている型にその演算が存在しないことが問題なのです。例えば、2つの2Dベクトルを加算することはできますが、整数やテキストを2Dベクトルに加算することはできません。
nl: Als de foutmelding aangeeft dat het toegewezen waardentype niet overeenkomt met de variabele, dan zit het probleem aan de rechterkant van het gelijkheidsteken (=). Als de foutmelding aangeeft dat het teruggavetype niet overeenkomt met de functie, dan is de waarde na het sleutelwoord return het probleem. Als de computer het heeft over een ongeldige operand, dan is het probleem dat de operatie niet bestaat voor het type dat je probeert te gebruiken. Hoewel je bijvoorbeeld twee 2D vectoren kunt optellen, kun je niet een geheel getal of tekst optellen bij een 2D vector.
pt_br: Se o erro mencionar que o tipo do valor não é compatível com a variável, o problema está no lado direito do sinal de igual (=). Se o erro disser que o tipo de retorno não é compatível com a função, então é o valor depois da palavra-chave 'return' que está causando o problema. Se o computador disser sobre um operador inválido, então o problema é que a operação para aquele tipo que você está tentando usar não existe. Por exemplo, você pode somar dois vetores 2D, mas você não pode somar um número inteiro ou um texto e um vetor 2D.
ru: Если в ошибке говорится о том, что тип присваиваемого значения не соответствует типу переменной, проблема находится справа от знака равенства (=). Если ошибка говорит о том, что тип возвращаемого значения не соответствует возвращаемому типу функции — проблема в значении после ключевого слова return. Если компьютер говорит о недопустимом операнде — проблема в том, что операция неприменима для типа, который вы пытаетесь использовать. Например, хотя вы и можете сложить два 2D-вектора, вы не можете прибавить целое число или текст к 2D-вектору.
ta: பிழையானது ஒதுக்கப்பட்ட மதிப்பு வகையை மாறி பொருந்தவில்லை என்று குறிப்பிட்டால், சிக்கல் சம அடையாளத்தின் (=) வலது பக்கத்தில் இருக்கும். ரிட்டர்ன் வகை செயல்பாட்டுடன் பொருந்தாதது பற்றி பிழை பேசினால், அது திரும்பும் முக்கிய சொல்லுக்குப் பிறகு இது சிக்கலானது. கணினி தவறான செயல்பாட்டைப் பற்றி பேசினால், நீங்கள் பயன்படுத்த முயற்சிக்கும் வகைக்கு செயல்பாடு இல்லை என்பதே சிக்கல். எடுத்துக்காட்டாக, நீங்கள் இரண்டு 2 டி திசையன்களைச் சேர்க்கும்போது, 2 டி திசையனில் முழு எண் அல்லது உரையைச் சேர்க்க முடியாது.
tr: Eğer hata, atamaya çalıştığınız değerin, değişken ile uyuşmadığını söylüyorsa (value type), sorun eşitlik (=) işaretinin sağ tarafındadır. Eğer hata, geri dönüş tipinin fonksiyon ile uyuşmadığını söylerse (return type), bu durumda sorun "return" anahtar kelimesinden sonra yazılan değerdedir. Eğer bilgisayar, geçersiz bir işlenen (operand) var diyorsa, böyle bir işlemin kullanmaya çalıştığınız tip için tanımlı olmadığı anlamındadır. Örneğin, iki tane 2D vektörü birbirine ekleyebilirken, bir 2D vektörü ile bir sayıyı ya da yazıyı toplayamazsınız.
uk: Якщо в описі йдеться про те, що тип значення, яке присвоюється, не відповідає типу змінної, проблема міститься праворуч від знака рівності (=). Якщо сказано, що тип значення, яке повертається, не відповідає типу, який функція повертає, — проблема у значенні після ключового слова return. Якщо повідомлено про неприпустимий операнд — проблема в тому, що операція незастосовна до типу, який ви намагаєтеся використати. Наприклад, хоча ви можете додати два 2D-вектори, ви не можете додати до 2D-вектора ціле число або текст.
zh_hans: 如果错误提到分配的值类型与变量不匹配，则问题出在等号 (=) 的右侧。 如果错误是关于返回类型与函数不匹配，那么是 return 关键字后面的值有问题。 如果计算机谈论无效的操作数，那么问题是您尝试使用的类型不存在该操作。 例如，虽然您可以添加两个 2D 矢量，但不能将整数或文本添加到 2D 矢量。
zh_hant: 如果錯誤提到指派的值類型與變數不匹配，問題通常出現在等號（=）右側的值。 如果錯誤與函式的回傳類型不匹配，那麼問題出在 return 關鍵字後面的值。 如果系統提示無效的運算元，代表你嘗試執行的運算不適用於該類型。例如，雖然可以相加兩個 2D 向量，但無法將整數或文字加到 2D 向量上。
