Repository: GDQuest/learn-gdscript
Catalog: i18n/*/error_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: You get this error when you wrote something that is syntactically invalid, or you are missing something to complete this line or previous lines of code. You need to be extremely precise when you write code for the computer. This kind of error is easy to get as all it takes is one wrong character. Note that this error can appear [b]after[/b] the line causing it due to how the computer reads and analyzes your code.
cs: Tato chyba se zobrazí, pokud jste napsali něco, co je syntakticky neplatné, nebo vám chybí něco k dokončení tohoto řádku nebo předchozích řádků kódu. Při psaní kódu pro počítač musíte být velmi přesní. Tento druh chyby se snadno objeví, protože stačí jeden chybný znak. Všimněte si, že tato chyba se může objevit [b]po[/b] řádku, který ji způsobuje, a to kvůli tomu, jak počítač čte a analyzuje váš kód.
de: Du bekommst diesen Fehler gezeigt , wenn Du etwas geschrieben hast, das syntaktisch ungültig ist, oder wenn Die etwas vergessen hast, um diese Zeile oder frühere Codezeilen zu vervollständigen. Du musst extrem präzise sein, wenn Du Code für den Computer schreibst. Diese Art von Fehler ist leicht zu bekommen, da alles, was es braucht, ein falsches Zeichen ist. Beachte, dass dieser Fehler [b]nach[/b] der Zeile erscheinen kann, die ihn verursacht, auf Grund der Art und Weise wie der Computer Ihren Code liest und analysiert.
es: Obtienes este error cuando has escrito algo que no es sintácticamente válido, o te falta algo para completar esta línea o las líneas de código anteriores. Tienes que tener una enorme precisión cuando escribes código para la computadora. Este tipo de error es fácil de obtener, ya que todo lo que se necesita para obtenerlo es un carácter incorrecto. Ten en cuenta que este error puede aparecer [b]después[/b] de la línea que lo provoca, debido a cómo la computadora lee y analiza tu código.
fr: Vous obtenez cette erreur lorsque vous avez écrit quelque chose dont la syntaxe n'est pas valide, ou qu'il vous manque quelque chose pour compléter cette ligne ou les lignes de code précédentes. Vous devez être extrêmement précis lorsque vous écrivez du code pour l'ordinateur. Ce type d'erreur est facile à obtenir car il suffit d'un seul caractère erroné pour l'obtenir. Notez que cette erreur peut apparaître [b]après[/b] la ligne qui la provoque en raison de la façon dont l'ordinateur lit et analyse votre code.
it: Ricevi questo errore quando scrivi qualcosa di sintatticamente invalido o ti manca qualcosa per completare questa riga o le righe precedenti del codice. Devi essere estremamente preciso quando scrivi codice per il computer. Questi tipi di errore sono molto facili da ottenere poiché basta sbagliare un solo carattere. Nota che questo errore si manifesta [b]dopo[/b] la riga che lo causa poiché il computer legge e analizza il tuo codice in questo modo.
ja: このエラーは、構文的に無効な内容を記述した場合、またはコードのこの行または前の行を完了するためのものが不足している場合に発生します。 コンピューター用のコードを記述するときは、非常に正確である必要があります。 この種のエラーは、1 文字間違っているだけで済むため、簡単に発生します。 このエラーは、コンピュータがコードを読み取って分析する方法によって、原因となった行の[b]後[/b]に表示される場合があることに注意してください。
nl: Je krijgt deze foutmelding als je iets hebt geschreven met een ongeldig vorm, of als je iets mist om deze regel of vorige regels code mee af te maken. Je moet heel precies zijn als je code voor de computer schrijft. Dit soort fouten is makkelijk te maken, want er is maar één verkeerd teken voor nodig. Merk op dat deze foutmelding kan verschijnen [b]na[/b] de regel die de fout veroorzaakt door de manier waarop de computer je code leest en analyseert.
pt_br: Você recebe esse erro quando você escreveu alguma palavra sintaticamente inválida, ou quando está faltando algo para completar essa linha de código ou a anterior. Você deve ser extremamente preciso quando for escrever código para o computador. Esse tipo de erro é comum acontecer pois precisa somente de um caractere errado. Note que esse erro pode aparecer [b]depois[/b] da linha que está causando ele devido a forma que o computador lê e analisa seu código.
ru: Вы получаете эту ошибку, когда написали что-то синтаксически недопустимое или вам чего-то не хватает для завершения этой строки или предыдущих строк кода. Вам нужно быть предельно точным, когда вы пишете код для компьютера. Такую ошибку легко получить, так как для к ней приводит всего один неправильный символ. Обратите внимание, что данная ошибка может появиться [b]после[/b] строки, вызывающей ее, из-за особенностей того, как компьютер считывает и анализирует ваш код.
ta: நீங்கள் செயற்கையாக செல்லாத ஒன்றை எழுதியபோது இந்த பிழையைப் பெறுவீர்கள், அல்லது இந்த வரியை அல்லது முந்தைய குறியீட்டின் வரிகளை முடிக்க ஏதாவது காணவில்லை. கணினிக்கான குறியீட்டை எழுதும்போது நீங்கள் மிகவும் துல்லியமாக இருக்க வேண்டும். இந்த வகையான பிழை பெறுவது எளிதானது, ஏனெனில் அது எடுப்பது ஒரு தவறான பாத்திரம். கணினி உங்கள் குறியீட்டை எவ்வாறு படிக்கிறது மற்றும் பகுப்பாய்வு செய்கிறது என்பதன் காரணமாக [/b] வரிய பிறகு இந்த பிழை [b] தோன்றும் என்பதை நினைவில் கொள்க.
tr: Bu hatayı alıyorsanız, yazım kurallarına uymayan bir şey yazmışsınızdır, ya da bu satırdaki veya önceki satırdan devam eden kodu tamamlamak için gereken bir şey eksiktir. Bilgisayar için bir kod yazarken son derece kesin olmalısınız. Bu tarz bir hatayı almak çok kolaydır, çünkü tek gereken bir tane hatalı karakterdir. Ayrıca şuna dikkat edin: bu hata, sebebi olan kod satırından [b]sonra[/b] geliyormuş gibi görünebilir, çünkü bilgisayar yazdığınız kodu bu şekilde okuyup analiz eder.
uk: Ви отримуєте цю помилку, коли написали щось синтаксично неприпустиме або вам чогось бракує для завершення цього рядка чи попередніх рядків коду. Слід бути гранично точним, коли ви пишете код для комп'ютера. Таку помилку легко отримати, оскільки до неї приводить навіть один неправильний символ. Зверніть увагу, що ця помилка може виникнути [b]після[/b] рядка, що викликає її, через особливості того, як комп'ютер читає та аналізує ваш код.
zh_hans: 当你写了一些语法上无效的东西，或者你缺少一些东西来完成这一行或前几行代码时，你会得到这个错误。 为计算机编写代码时需要非常精确。 这种错误很容易得到，因为只需要一个错误的字符。 请注意，由于计算机如何读取和分析您的代码，此错误可能会出现在导致该错误的行之后 [b][/b]。
zh_hant: 當你寫了語法不正確的程式碼，或者你遺漏了某些內容來完成這行或前面的程式碼時，會出現這個錯誤。 當你為電腦編寫程式碼時，需要極為精確。這類錯誤很容易出現，因為只要有一個錯誤的字符，就會發生。 請注意，由於電腦讀取和分析程式碼的方式，這個錯誤可能會出現在 [b]造成錯誤的行之後[/b]。

source: The way to solve this kind of error is highly contextual. The error message should tell you which character or element it's missing. If the error says "expected," then you're likely missing something in one of the [b]previous[/b] code lines. It could be a punctuation mark, a parenthesis, or something else. If it says "unterminated," you are missing some character at the end of an expression, like a closing bracket. In this case, it most likely comes from the line with the error.
cs: Způsob řešení tohoto druhu chyby je velmi závislý na kontextu. Chybová zpráva by vám měla sdělit, který znak nebo prvek chybí. Pokud chyba říká "expected,", pak vám'pravděpodobně něco chybí v některém z [b]předchozích[/b] řádků kódu. Může to být interpunkční znaménko, závorka nebo něco jiného. Pokud je napsáno "neukončeno," chybí vám nějaký znak na konci výrazu, například uzavírací závorka. V tomto případě nejspíše pochází z řádku s chybou.
de: Der Weg, diese Art von Fehler zu lösen, ist sehr kontextabhängig. Die Fehlermeldung sollte Dir sagen, welches Zeichen oder Element fehlt. Wenn der Fehler "expected" enthält , hast du wahrscheinlich etwas in einer der [b]vorherigen[/b]-Codezeilen vergessen. Es könnte ein Satzzeichen, eine Klammer oder etwas anderes sein. Wenn der Fehler "unterminated" enthält, fehlt am Ende eines Ausdrucks ein Zeichen, z. B. eine schließende Klammer. In diesem Fall kommt es höchstwahrscheinlich von der Zeile mit dem Fehler.
es: La forma de resolver este tipo de error es muy contextual. El mensaje de error debería indicarte qué carácter o elemento falta. Si el error dice "expected" (esperado), es probable que te falte algo en una de las líneas de código [b]anteriores[/b]. Puede ser un signo de puntuación, un paréntesis o alguna otra cosa. Si dice "unterminated" (sin terminar), te falta algún carácter al final de una expresión, como un paréntesis de cierre. En este caso, lo más probable es que provenga de la línea con el error.
fr: La façon de résoudre ce type d'erreur est très contextuelle. Le message d'erreur devrait vous indiquer quel caractère ou élément il manque. Si l'erreur dit « expected » (attendu), il vous manque probablement quelque chose dans l'une des lignes de code [b]précédentes[/b]. Il peut s'agir d'un signe de ponctuation, d'une parenthèse ou d'autre chose. S'il est écrit « unterminated » (non terminé), il vous manque un caractère à la fin d'une expression, comme un crochet fermant. Dans ce cas, il est très probable que cela vient de la ligne contenant l'erreur.
it: Il modo per risolvere questo tipo di errori dipende fortemente dal contesto. Il messaggio di errore ti dovrebbe dire quale carattere o elemento è mancante. Se l'errore dice "expected", probabilmente ti manca qualcosa in una delle righe di codice [b]precedenti[/b]. Potrebbe essere un simbolo di punteggiatura, una parentesi o qualcos'altro. Se dice "unterminated", ti manca qualche carattere alla fine di un'espressione, come una parentesi chiusa. In questo caso, molto probabilmente l'errore viene dalla riga specificata.
ja: この種のエラーを解決する方法は、状況に応じて大きく異なります。 エラー メッセージには、どの文字または要素が欠落しているかが示されます。 エラーに「expected(予想通り)」と表示されている場合は、[b]前の[/b]コード行のいずれかに何かが欠けている可能性があります。 句読点、括弧、またはその他のものである可能性があります。 「unterminated(終了していない)」と表示されている場合は、右括弧など、式の末尾の文字が欠落しています。 この場合、エラーが発生した行から発生している可能性が高くなります。
nl: De manier om dit soort fouten op te lossen is zeer afhankelijk van de omstandigheden. De foutmelding zou je moeten vertellen welk karakter of element het mist. Als de foutmelding "expected" zegt, dan mis je waarschijnlijk iets in een van de [b]vorige[/b] coderegels. Het kan een leesteken zijn, een haakje of iets anders. Als er "unterminated" staat, dan mis je een karakter aan het einde van een uitdrukking, zoals een haakje. In dit geval komt het waarschijnlijk van de regel met de foutmelding.
pt_br: A maneira de resolver esse tipo de erro é altamente contextual. A mensagem de erro deve falar para você qual caractere ou elemento está faltando. Se o erro disser "esperado," então é bem provável que está faltando algo nas linhas de código [b]anteriores[/b]. Pode ser um sinal de pontuação, um parênteses, ou qualquer coisa assim. Se disser "indeterminado", então está faltando algum caractere no final de uma expressão, como um colchete de fechamento. Nesse caso, é bem provável que esteja na linha do próprio erro.
ru: Способ устранения такого рода ошибок в значительной степени зависит от контекста. В сообщении об ошибке должно быть указано, какой символ или элемент отсутствует. Если в сообщении об ошибке написано «ожидается» ("expected"), скорее всего, вы что-то упустили в одной из [b]предыдущих[/b] строк кода. Это может быть знак препинания, скобка или что-то еще. Если в сообщении написано «незавершенный» ("unterminated"), значит вам не хватает какого-то символа в конце выражения, например, закрывающей скобки. В данном случае проблема скорее всего исходит из строки с ошибкой.
ta: இந்த வகையான பிழையைத் தீர்ப்பதற்கான வழி மிகவும் சூழ்நிலை. பிழை செய்தி எந்த எழுத்து அல்லது உறுப்பு காணவில்லை என்பதை உங்களுக்குக் கூற வேண்டும். பிழை "எதிர்பார்த்தது" என்று சொன்னால், முந்தைய [/b] குறியீடு வரிகளில் ஒன்றில் நீங்கள் எதையாவது காணவில்லை. இது ஒரு நிறுத்தற்குறி, ஒரு அடைப்புக்குறிப்பு அல்லது வேறு ஏதாவது இருக்கலாம். அது "வெளியிடப்படாதது" என்று சொன்னால், ஒரு வெளிப்பாட்டின் முடிவில், ஒரு இறுதி அடைப்புக்குறி போன்ற சில கதாபாத்திரங்களை நீங்கள் காணவில்லை. இந்த வழக்கில், இது பெரும்பாலும் பிழையுடன் வரியிலிருந்து வருகிறது.
tr: Böyle bir hatanın çözümü büyük oranda içeriğe bağlıdır. Hata mesajı size, hangi karakter ya da öğenin eksik olduğunu söylüyor olmalıdır. Eğer hata "expected" (beklenen) diyorsa, [b]önceki[/b] satırların birinde bir şeyleri atlamış olmalısınız. Bir noktalama işareti, bir parantez, ya da başka bir şey. Eğer "unterminated" (sonlandırılmadı) diyorsa, bir ifadenin sonunda olması gereken bir karakteri unutmuşsunuzdur (mesela kapalı parantez). Bu durumda, sorun genelde hata mesajında verilen satırdadır.
uk: Спосіб усунення таких помилок значною мірою залежить від контексту. У повідомленні про помилку має бути зазначено, який символ або елемент відсутній. Якщо у повідомленні про помилку написано «очікується» ("expected"), найпевніше, ви щось пропустили в одному з [b]попередніх[/b] рядків коду. Це може бути розділовий знак, дужка або щось ще. Якщо в повідомленні написано «незавершений» ("unterminated"), значить бракує якогось символу в кінці виразу, наприклад, закривної дужки. В такому разі проблему, найпевніше, спричинив рядок із помилкою.
zh_hans: 解决这种错误的方法是高度上下文相关的。 错误消息应该告诉您它缺少哪个字符或元素。 如果错误显示“预期”，那么您可能在 [b]previous[/b] 代码行之一中遗漏了某些内容。 它可以是标点符号、括号或其他东西。 如果它显示“未终止”，则表示表达式末尾缺少某些字符，例如右括号。 在这种情况下，它很可能来自错误所在的行。
zh_hant: 解決這類錯誤的方法非常具有上下文依賴性。錯誤訊息應該會告訴你缺少的是哪個字符或元素。 如果錯誤訊息說「expected」（預期），那麼你很可能在 [b]前面的[/b] 程式碼行中遺漏了某些東西。可能是標點符號、括號或其他東西。 如果錯誤訊息說「unterminated」（未結束），那麼你缺少的是表達式結尾處的某個字符，例如閉合括號。在這種情況下，錯誤通常來自於有錯誤的那一行。

source: This error tells you that you are missing a parenthesis (or sometimes a comma or a path). Three keywords in GDScript work like function calls and require parentheses: [code]yield()[/code], [code]preload()[/code], and [code]assert()[/code].
cs: Tato chyba vás informuje o tom, že chybí závorka (nebo někdy čárka či cesta). Tři klíčová slova v jazyce GDScript fungují jako volání funkcí a vyžadují závorky: [code]yield()[/code], [code]preload()[/code] a [code]assert()[/code].
de: Dieser Fehler besagt, dass eine Klammer (oder manchmal ein Komma oder ein Pfad) fehlt. Drei Schlüsselwörter in GDScript funktionieren wie Funktionsaufrufe und erfordern Klammern: [code]yield()[/code], [code]preload()[/code] und [code]assert()[/code].
es: Este error te indica que te falta un paréntesis (o, a veces, una coma o una ruta). Hay tres palabras clave en GDScript que funcionan como llamadas a funciones y requieren paréntesis: [code]yield()[/code], [code]preload()[/code] y [code]assert()[/code].
fr: Cette erreur vous indique qu'il vous manque une parenthèse (ou parfois une virgule ou un chemin). Trois mots-clés dans GDScript fonctionnent comme des appels de fonction et nécessitent des parenthèses : [code]yield()[/code], [code]preload()[/code], et [code]assert()[/code].
it: Questo errore ti dice ti manca una parentesi (o certe volte una virgola o un percorso). Tre parole chiave in GDScript funzionano come delle chiamate di funzione e richiedono delle parentesi: [code]yield()[/code], [code]preload()[/code] e [code]assert()[/code].
ja: このエラーは、括弧 (場合によってはカンマやパス) が欠落していることを示します。 GDScript の 3 つのキーワードは関数呼び出しのように機能し、括弧が必要です: [code]yield()[/code]、[code]preload()[/code]、および [code]assert()[/code]。
nl: Deze foutmelding vertelt je dat je een haakje mist (of soms een komma of een pad). Drie sleutelwoorden in GDScript werken als functieaanroepen en vereisen haakjes: [code]yield()[/code], [code]preload()[/code], en [code]assert()[/code].
pt_br: Esse erro fala pra você que está faltando um parêntesis (ou às vezes uma vírgula ou um caminho de algum arquivo). Três palavras-chave no GDScript funcionam como chamadas de função e precisam de parênteses: [code]yield()[/code], [code]preload()[/code], e [code]assert()[/code].
ru: Данная ошибка говорит вам о том, что у вас отсутствует скобка (иногда — запятая или путь). Три ключевых слова в GDScript работают как вызовы функций и требуют круглых скобок: [code]yield()[/code], [code]preload()[/code] и [code]assert()[/code].
ta: இந்த பிழை நீங்கள் ஒரு அடைப்புக்குறிக்கு (அல்லது சில நேரங்களில் ஒரு கமா அல்லது பாதையை) காணவில்லை என்று சொல்கிறது. GDSCRIPT இல் உள்ள மூன்று முக்கிய வார்த்தைகள் செயல்பாட்டு அழைப்புகள் மற்றும் அடைப்புக்குறிப்புகள் தேவை: [குறியீடு] மகசூல் () [/குறியீடு], [குறியீடு] முன் ஏற்றுதல் () [/குறியீடு] மற்றும் [குறியீடு] உறுதிப்படுத்தல் () [/குறியீடு].
tr: Bu hata, bir parantezi (ya da virgülü veya bir yolu) eksik yazdığınızı söyler. GDScript'te üç tane kelime fonksiyon çağrısı gibi çalışır ve paranteze ihtiyaç duyar: [code]yield()[/code], [code]preload()[/code], ve [code]assert()[/code].
uk: Ця помилка повідомляє про те, що у вас відсутня дужка (іноді - кома або шлях). Три ключові слова в GDScript працюють як виклики функцій і вимагають круглих дужок: [code]yield()[/code], [code]preload()[/code] і [code]assert()[/code].
zh_hans: 此错误告诉您缺少括号（有时是逗号或路径）。 GDScript 中的三个关键字的作用类似于函数调用并需要括号：[code]yield()[/code]、[code]preload()[/code] 和 [code]assert()[/code]。
zh_hant: 這個錯誤告訴你缺少了一個括號（有時是逗號或路徑）。 在 GDScript 中，有三個關鍵字像函式呼叫一樣，並需要括號： [code]yield()[/code], [code]preload()[/code] 和 [code]assert()[/code]。

source: This error happens in several cases: 1. You wrote an identifier (variable or function name) in the wrong place. 2. You wrote a keyword like [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code], and you did not follow it by a name. 3. You wrote a function definition but forgot the parentheses before the colon.
cs: K této chybě dochází v několika případech: 1. Zapsali jste identifikátor (název proměnné nebo funkce) na špatné místo. 2. Napsali jste klíčové slovo jako [code]var[/code], [code]func[/code], [code]for[/code] nebo [code]signal[/code] a nenásledoval za ním název. 3. Napsali jste definici funkce, ale zapomněli jste na závorky před dvojtečkou.
de: Dieser Fehler tritt in mehreren Fällen auf: 1. Du hast einen Bezeichner (Variablen- oder Funktionsname) an der falschen Stelle geschrieben. 2. Du hast ein Schlüsselwort wie [code]var[/code], [code]func[/code], [code]for[/code] oder [code]signal[/code] geschrieben und keinen Namen gegeben. 3. Du hast eine Funktionsdefinition geschrieben, aber die Klammern vor dem Doppelpunkt vergessen.
es: Este error se produce en varios casos: 1. Escribiste un identificador (nombre de variable o función) en un lugar equivocado. 2. Escribiste una palabra clave como [code]var[/code], [code]func[/code], [code]for[/code] o [code]signal[/code], y no escribiste un nombre inmediatamente después de ella. 3. Escribiste una definición de función pero olvidaste los paréntesis antes de los dos puntos.
fr: Cette erreur se produit dans plusieurs cas : 1. Vous avez écrit un identifiant (nom de variable ou de fonction) au mauvais endroit. 2. Vous avez écrit un mot-clé comme [code]var[/code], [code]func[/code], [code]for[/code], ou [code]signal[/code], et vous ne l'avez pas fait suivre d'un nom. 3. Vous avez écrit une définition de fonction mais vous avez oublié les parenthèses avant le deux-points.
it: Questo errore avviene in molti casi: 1. Hai scritto un identificatore (il nome di una variabile o di una funzione) nel posto sbagliato. 2. Hai scritto una parola chiave come [code]var[/code], [code]func[/code], [code]for[/code] o [code]signal[/code] e non l'hai accompagnata con un nome. 3. Hai scritto una definizione di funzione e hai dimenticato le parentesi prima della virgola.
ja: このエラーはいくつかの場合に発生します。 1. 識別子（変数名または関数名）を間違った場所に記述しました。 2. [code]var[/code]、[code]func[/code]、[code]for[/code]、[code]signal[/code] などのキーワードを書き、その後に名前を付けなかった。 3. 関数定義を書きましたが、コロンの前の括弧を忘れました。
nl: Deze fout treedt in verschillende gevallen op: 1. Je hebt een identifier (variabele of functienaam) op de verkeerde plaats geschreven. 2. Je hebt een sleutelwoord geschreven zoals [code]var[/code], [code]func[/code], [code]for[/code], of [code]signal[/code], en je hebt er geen naam achter gezet. 3. Je hebt een functiedefinitie geschreven maar bent de haakjes voor de dubbele punt vergeten.
pt_br: Esse erro acontece em muitos casos: 1. Você escreveu um identificador (variável ou nome de um função) no lugar errado. 2. Você escreveu uma palavra-chave como [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code], e em seguida não colocou um nome. 3. Você escreveu uma definição de função mas esqueceu o parêntese antes do sinal de dois pontos.
ru: Эта ошибка возникает в нескольких случаях: 1. Вы написали идентификатор (имя переменной или функции) в неправильном месте. 2. Вы написали ключевое слово типа [code]var[/code], [code]func[/code], [code]for[/code] или [code]signal[/code], но не написали имя после него. 3. Вы написали определение функции, но забыли поставить круглые скобки перед двоеточием.
ta: இந்த பிழை பல சந்தர்ப்பங்களில் நிகழ்கிறது: 1. நீங்கள் தவறான இடத்தில் ஒரு அடையாளங்காட்டி (மாறி அல்லது செயல்பாட்டு பெயர்) எழுதியுள்ளீர்கள். 2. [குறியீடு] var [/code], [குறியீடு] ஃபங்க் [/குறியீடு], [குறியீடு] [/குறியீடு], அல்லது [குறியீடு] சமிக்ஞை [/குறியீடு] போன்ற ஒரு முக்கிய சொல்லை நீங்கள் எழுதினீர்கள், நீங்கள் அதைப் பின்பற்றவில்லை ஒரு பெயரால். 3. நீங்கள் ஒரு செயல்பாட்டு வரையறையை எழுதியுள்ளீர்கள், ஆனால் பெருங்குடலுக்கு முன் அடைப்புக்குறிகளை மறந்துவிட்டீர்கள்.
tr: Bu hata birkaç farklı durumda oluşabilir: 1. Bir tanımlayıcıyı (değişken ya da fonksiyon ismi) yanlış yerde kullandınız. 2. [code]var[/code], [code]func[/code], [code]for[/code], ya da [code]signal[/code] gibi bir anahtar kelime yazdınız, ama bunun devamına bir isim eklemediniz. 3. Bir fonksiyon tanımı yazdınız ama iki nokta üst üste 'den önceki parantezleri eklemediniz.
uk: Ця помилка виникає у кількох випадках: 1. Ви написали ідентифікатор (назву змінної або функції) в неправильному місці. 2. Ви написали ключове слово на зразок [code]var[/code], [code]func[/code], [code]for[/code] або [code]signal[/code], але не написали після нього назву. 3. Ви написали визначення функції, але забули поставити перед двокрапкою круглі дужки.
zh_hans: 在几种情况下会发生此错误： 1. 你在错误的地方写了一个标识符（变量或函数名）。 2. 写了[code]var[/code]、[code]func[/code]、[code]for[/code]、[code]signal[/code]这样的关键字，你没有按照 由一个名字。 3. 你写了一个函数定义，但忘记了冒号前的括号。
zh_hant: 這個錯誤發生在幾種情況下： 1. 你把識別符（變數或函式名稱）寫錯位置。 2. 你寫了像 [code]var[/code], [code]func[/code], [code]for[/code] 或 [code]signal[/code] 這樣的關鍵字，但後面沒有接名稱。 3. 你寫了函式定義，但忘記在冒號之前加上括號。
