Repository: GDQuest/learn-gdscript
Catalog: i18n/*/error_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: GDScript supports type inference. The computer will automatically recognize the type of value you are working with. In some cases, though, it can't figure it out. When that happens, you need to specify the type yourself or remove type inference altogether for this variable.
cs: GDScript podporuje odvozování typů. Počítač automaticky rozpozná typ hodnoty, se kterou pracujete. V některých případech to však nedokáže zjistit. V takovém případě musíte typ zadat sami nebo odvození typu pro tuto proměnnou zcela odstranit.
de: GDScript unterstützt type inference (Typrückschluss). Der Computer erkennt automatisch den Typ des Wertes, mit dem Du arbeitest In einigen Fällen kann jedoch nicht vom Wert auf den Typ geschlossen werden. In diesem Fall musst Du den Typ selbst angeben oder den Typrückschluss für diese Variable vollständig entfernen.
es: GDScript admite la inferencia de tipos. La computadora reconocerá automáticamente el tipo de valor con el que estás trabajando. Sin embargo, en algunos casos no puede averiguarlo. Cuando esto suceda, deberás especificar el tipo tú mismo o eliminar la inferencia de tipo por completo para esta variable.
fr: GDScript admet l'inférence de type. L'ordinateur reconnaîtra automatiquement le type de valeur avec lequel vous travaillez. Dans certains cas, cependant, il se peut qu'il n'arrive pas à l'identifier. Dans ce cas, vous devez spécifier le type vous-même ou supprimer complètement l'inférence de type pour cette variable.
it: GDScript supporta l'inferenza del tipo. Il computer riconoscerà automaticamente il tipo del valore con cui stai valorando. In alcuni casi, tuttavia, non riesce a riconoscerlo. Quando questo succede, devi specificare tu stesso il tipo o rimuovere l'inferenza del tipo per quella variabile.
ja: GDScript は型推論をサポートしています。コンピュータは、あなたが扱っている値の型を自動的に認識します。しかし、場合によっては認識できないこともあります。 そのような場合は、自分で型を指定するか、この変数の型推論を完全に削除する必要があります。
nl: GDScript ondersteunt type-inferentie. De computer herkent automatisch met welk type waarde je werkt. In sommige gevallen komt hij er echter niet zelf uit. In dat geval moet je het type zelf aangeven of type-inferentie helemaal verwijderen voor deze variabele.
pt_br: GDScript suporta inferência de tipo. O computador vai reconhecer automaticamente o tipo de valor que você estiver usando. Porém, em alguns casos ele não vai conseguir descobrir o tipo. Quando isso acontecer, você mesmo precisa especificar o tipo ou remover completamente a inferência de tipo para essa variável.
ru: GDScript поддерживает автоматическое определение типа. Компьютер автоматически распознает тип значения, с которым вы работаете, однако в некоторых случаях он не может этого сделать. В таких ситуациях, вам нужно указать тип самостоятельно или вообще убрать автоопределение типа для этой переменной.
ta: GDSCRIPT வகை அனுமானத்தை ஆதரிக்கிறது. நீங்கள் பணிபுரியும் மதிப்பின் வகையை கணினி தானாகவே அங்கீகரிக்கும். சில சந்தர்ப்பங்களில், அதை கண்டுபிடிக்க முடியாது. அது நிகழும்போது, இந்த மாறிக்கு நீங்கள் வகையை குறிப்பிட வேண்டும் அல்லது வகை அனுமானத்தை அகற்ற வேண்டும்.
tr: GDScript, tip çıkarımı yapabilir. Bilgisayar, üzerinde çalıştığınız değer tipini kendiliğinden tanıyabilir. Yine de bazı durumlarda bunu başaramaz. Bu olduğunda, ilgili tip tanımını kendiniz yapabilir veya bu değişken için tip çıkarımını tümüyle kaldırabilirsiniz.
uk: GDScript підтримує автоматичне визначення типу. Комп'ютер автоматично розпізнає тип значення, з яким ви працюєте, однак у деяких випадках він не може цього зробити. У таких ситуаціях потрібно вказати тип самостійно або взагалі прибрати автовизначення типу для цієї змінної.
zh_hans: GDScript 支持类型推断。 计算机将自动识别您正在使用的值的类型。 但是，在某些情况下，它无法弄清楚。 发生这种情况时，您需要自己指定类型或完全删除此变量的类型推断。
zh_hant: GDScript 支援類型推斷。系統會自動辨識你正在使用的值的類型。不過，在某些情況下，它無法推斷出來。 當這種情況發生時，你需要自己指定該變數的類型，或者移除該變數的類型推斷。

source: The simplest way to solve this error is to remove types for this variable or this function's arguments. Otherwise, you can manually specify the value type after the colon. We recommend specifying the type whenever possible to reap the typing system's benefits.
cs: Nejjednodušší způsob, jak tuto chybu vyřešit, je odstranit typy pro tuto proměnnou nebo argumenty této funkce. V opačném případě můžete ručně zadat typ hodnoty za dvojtečkou. Doporučujeme uvádět typ, kdykoli je to možné, abyste využili výhod systému typování - např. nabízení relevantních metod pro daný typ při psaní kódu.
de: Die einfachste Möglichkeit, diesen Fehler zu beheben, besteht darin, Typen für diese Variable oder die Parameter dieser Funktion zu entfernen. Andernfalls kannst Du den Typ der Variable nach dem Doppelpunkt manuell angeben. Wir empfehlen nach Möglichkeit, den Typ anzugeben, um die Vorteile des Typisierungssystems zu nutzen.
es: La forma más sencilla de resolver este error es eliminar los tipos de esta variable o de los argumentos de esta función. Si no, puedes especificar manualmente el tipo de valor después de los dos puntos. Recomendamos especificar el tipo siempre que sea posible para aprovechar las ventajas del sistema de tipos.
fr: La façon la plus simple de résoudre cette erreur est de supprimer les types pour cette variable ou les arguments de cette fonction. Sinon, vous pouvez spécifier manuellement le type de valeur après le deux-points. Nous vous recommandons de spécifier le type chaque fois que possible pour profiter des avantages du système de typage.
it: Il modo più semplice per risolvere questo errore è quello di rimuovere i tipi per questa variabile o per gli argomenti di questa funzione. Altrimenti, puoi specificare manualmente il tipo di valore con dei due punti. Ti consigliamo di specificare il tipo quando possibile per sfruttare i vantaggi del sistema di scrittura.
ja: このエラーを解決する最も簡単な方法は、この変数またはこの関数の引数の型を削除することである。そうでなければ、コロンの後に値の型を手動で指定します。 型付けシステムのメリットを享受するために、可能な限り型を指定することをお勧めします。
nl: De eenvoudigste manier om deze fout op te lossen is door types te verwijderen voor deze variabele of de argumenten van deze functie. Je kunt ook handmatig het waardentype opgeven na de dubbele punt. We raden aan om waar mogelijk het type te specificeren om te profiteren van de voordelen van het typesysteem.
pt_br: A maneira mais simples de resolver esse erro é remover os tipos dessa variável ou os argumentos dessa função. Caso contrário, você pode especificar manualmente o tipo do valor depois do sinal de dois pontos. Nós recomendamos especificar o tipo sempre que for possível para colher os benefícios do sistema de digitação.
ru: Самый простой способ устранить эту ошибку — удалить типы для этой переменной или аргументов этой функции. Также вы можете вручную указать тип значения после двоеточия. Мы рекомендуем указывать тип всякий раз, когда это возможно, чтобы получить возможность использовать преимущества системы типизации.
ta: இந்த பிழையைத் தீர்ப்பதற்கான எளிய வழி, இந்த மாறி அல்லது இந்த செயல்பாட்டின் வாதங்களுக்கான வகைகளை அகற்றுவதாகும். இல்லையெனில், பெருங்குடலுக்குப் பிறகு மதிப்பு வகையை கைமுறையாகக் குறிப்பிடலாம். தட்டச்சு அமைப்பின் நன்மைகளை அறுவடை செய்ய முடிந்தவரை வகையைக் குறிப்பிட பரிந்துரைக்கிறோம்.
tr: Bu hatayı çözmenin en kolay yolu, bu değişkenden ya da fonksiyonun girdi değişkenlerinden tipleri kaldırmak. Aksi durumda, iki nokta üst üsteden sonra tip değerini elle girerek tanımlamalısınız. Tip sisteminin nimetlerinden yararlanmak için, mümkün olduğu kadar tipleri belirtmenizi tavsiye ediyoruz.
uk: Найпростіший спосіб усунути цю помилку – видалити типи для цієї змінної чи аргументів цієї функції. Також можна вручну вказати тип значення після двокрапки. Ми радимо вказувати тип щоразу, коли це можливо, щоб скористатися перевагами системи типізації.
zh_hans: 解决此错误的最简单方法是删除此变量或此函数参数的类型。 否则，您可以在冒号后手动指定值类型。 我们建议尽可能指定类型以获得打字系统的好处。
zh_hant: 解決這個錯誤最簡單的方法是移除這個變數或函式參數的類型。否則，你可以在冒號後手動指定值的類型。 我們建議盡可能指定類型，以充分利用類型系統的好處。

source: There is an issue with the return value of your function. There are two main cases here: 1. Your function is a void function, thus it should not return a value. This includes functions with the '-> void' syntax and class constructors ('_init()'). 2. You specified a return type for your function, but you are not returning a value in all possible branches (if, elif, and else blocks) or at the end.
cs: V návratové hodnotě vaší funkce je problém. Existují dva hlavní případy: 1. Vaše funkce je funkce void, neměla by tedy vracet žádnou hodnotu. To zahrnuje funkce se syntaxí '-> void' a konstruktory tříd ('_init()'). 2. Zadali jste návratový typ funkce, ale nevracíte hodnotu ve všech možných větvích (bloky if, elif a else) nebo na konci.
de: Es liegt ein Problem mit dem Rückgabewert DeinerFunktion vor. Hier gibt es zwei Hauptfälle: 1. Ihre Funktion ist eine void-Funktion, daher sollte sie keinen Wert zurückgeben. Dazu gehören Funktionen mit der Syntax '-> void' und Klassenkonstruktoren ('_init()'). 2. Du hast einen Rückgabetyp für deine Funktion angegeben, aber Du gibst keinen Wert in allen möglichen Verzweigungen (if, elif und else-Blöcke) oder am Ende zurück.
es: Hay un problema con el valor de retorno de tu función. Hay dos casos principales: 1. Tu función es una función "void", por lo que no debería devolver ningún valor. Esto incluye las funciones con la sintaxis '-> void' y los constructores de clases ('_init()'). 2. Especificaste un tipo de retorno para tu función, pero no estás devolviendo un valor en todas las ramas posibles (bloques if, elif y else) o al final.
fr: Il y a un problème avec la valeur de retour de votre fonction. Il y a deux cas principaux ici : 1. Votre fonction est une fonction « void », elle ne doit donc pas renvoyer de valeur. Cela inclut les fonctions avec la syntaxe '-> void' et les constructeurs de classe ('_init()'). 2. Vous avez spécifié un type de retour pour votre fonction, mais vous ne retournez pas une valeur dans toutes les branches possibles (blocs if, elif et else) ou à la fin.
it: C'è un problema con il valore di ritorno della tua funzione. I casi possibili sono due: 1. La tua funzione è una funzione void, dunque non dovrebbe ritornare alcun valore. Questo include le funzioni con la sintassi "-> void" e i costruttori di classi "_init()". 2. Hai specificato un tipo di ritorno per la tua funzione, ma non stai ritornato un valore in ogni possibile ramificazione (blocchi if, elif e else) o alla fine.
ja: 関数の戻り値に問題があります。ここには主に2つのケースがあります。 1.関数がvoid関数であり、値を返してはならない。これには、'-> void' 構文を持つ関数やクラス・コンストラクタ ('_init()')が含まれます。 2. 関数に戻り値の型を指定したが、すべての可能な分岐（if、elif、elseブロック）または最後に値を返していない。
nl: Er is een probleem met de teruggavewaarde van je functie. Er zijn hier twee belangrijke gevallen: 1. Je functie is een void-functie en zou dus geen waarde moeten teruggeven. Dit geldt ook voor functies met de vorm '-> void' en klasseconstructors ('_init()'). 2. Je hebt een teruggavetype opgegeven voor je functie, maar je geeft geen waarde terug in alle mogelijke vertakkingen (if-, elif- en else-blokken) of aan het einde.
pt_br: Tem um problema com o valor de retorno da sua função. Há dois casos principais aqui: 1. Sua função é uma função vazia, logo não deve retornar um valor. Isso inclui funções com a sintaxe '-> void' e construtores de classe ('_init()'). 2. Você especificou um tipo de retorno na sua função, mas você não está retornando nenhum valor em todas as ramificações possíveis (blocos if, elif, e else) ou no final.
ru: Возникла проблема с возвращаемым значением вашей функции. Она возникает в двух случаях: 1. Тип возвращаемого значения вашей функции — void, поэтому она не может возвращать значение. Сюда входят функции с синтаксисом «-> void» и конструкторы классов («_init()»). 2. Вы указали тип возвращаемого значения для своей функции, но возвращаете значение не во всех возможных ветвях (блоки if, elif и else, или конец функции).
ta: உங்கள் செயல்பாட்டின் வருவாய் மதிப்பில் சிக்கல் உள்ளது. இங்கே இரண்டு முக்கிய வழக்குகள் உள்ளன: 1. உங்கள் செயல்பாடு ஒரு வெற்றிட செயல்பாடு, இதனால் அது ஒரு மதிப்பைத் தரக்கூடாது. இதில் '-> வெற்றிட' தொடரியல் மற்றும் வகுப்பு கட்டமைப்பாளர்கள் ('_init ()') உடன் செயல்பாடுகள் அடங்கும். 2. உங்கள் செயல்பாட்டிற்கான வருவாய் வகையை நீங்கள் குறிப்பிட்டுள்ளீர்கள், ஆனால் சாத்தியமான அனைத்து கிளைகளிலும் (IF, ELIF, மற்றும் வேறு தொகுதிகள்) அல்லது இறுதியில் ஒரு மதிப்பை நீங்கள் திருப்பித் தரவில்லை.
tr: Fonksiyonunuzun dönüş değerinde bir sorun var. Burada iki durum söz konusu: 1. Fonksiyonunuz bir boş (void) fonksiyondur ve herhangi bir değer döndürmemelidir. Bu tip fonksiyonlar, '-> void' söz dizimiyle tanımlanan fonksiyonlar ve sınıf yapıcılarıdır ('_init()'). 2. Fonksiyonunuz için bir dönüş tipi tanımladınız, ama gerekli tüm kollardan (if, elif ve else kalıpları) ya da en son satırdan bir değer geri döndürmüyorsunuz.
uk: Виникла проблема зі значенням, яке повертає ваша функція. Можливі два випадки: 1. Ваша функція повертає значення типу void, тому вона не може повертати значення. Сюди входять функції зі синтаксисом. «-> void» і конструктори класів («_init()»). 2. Ви вказали тип значення, яке повертає ваша функція, але повертаєте значення не у всіх можливих гілках (блоки if, elif та else, або кінець функції).
zh_hans: 您的函数的返回值存在问题。 这里主要有两种情况： 1. 你的函数是一个 void 函数，因此它不应该返回一个值。 这包括具有'-> void' 语法的函数和类构造函数（'_init()'）。 2. 你为你的函数指定了一个返回类型，但你没有在所有可能的分支（if、elif 和 else 块）中或最后返回一个值。
zh_hant: 你的函式回傳值有問題，這裡有兩個主要情況： 1. 你的函式是無回傳值函式，因此不應該回傳任何值。這包括使用 '-> void' 語法的函式和類別建構子（'_init()'）。 2. 你為函式指定了回傳類型，但在所有可能的分支（if、elif 和 else 區塊）或最後並沒有回傳值。

source: When your function is 'void', you should never return a value. You can use the 'return' keyword to end the function early, but you should never write anything after that. When you use a return type, you must always return something at the end of the function or in every branch (if, elif, and else block) of the function.
cs: Pokud je vaše funkce 'void', nikdy byste neměli vracet žádnou hodnotu. Klíčové slovo 'return' můžete použít k předčasnému ukončení funkce, ale nikdy byste po něm neměli nic psát. Použijete-li return s hodnotou (ta je vždy určitého typu), musíte ji vždy vrátit na konci funkce nebo v každé větvi (bloku if, elif a else) funkce.
de: Wenn Deine Funktion "void" ist, solltest Du niemals einen Wert zurückgeben. Du das Schlüsselwort 'return' verwenden, um die Funktion vorzeitig zu beenden, aber Du solltest danach nie etwas schreiben. Wenn Du einen Rückgabetyp verwendest, musst Du immer etwas am Ende der Funktion oder in jedem Zweig (if, elif und else block) der Funktion zurückgeben.
es: Cuando tu función es 'void', nunca debes devolver un valor. Puedes utilizar la palabra clave 'return' para terminar la función antes de tiempo, pero nunca debes escribir nada después de eso. Cuando utilices un tipo de retorno, siempre debes devolver algo al final de la función o en cada rama (bloque if, elif y else) de la función.
fr: Lorsque votre fonction est 'void', vous ne devez jamais retourner une valeur. Vous pouvez utiliser le mot-clé 'return' pour terminer la fonction plus tôt, mais vous ne devez jamais écrire quoi que ce soit après. Lorsque vous utilisez un type de retour, vous devez toujours retourner quelque chose à la fin de la fonction ou dans chaque branche (bloc if, elif et else) de la fonction.
it: Quando la tua funzione è "void", non dovresti mai ritornare un valore. Puoi usare la parola chiave "return" per finire prima la funzione, ma non dovresti mai scrivere niente dopo questa. Quando usi un tipo di ritorno, devi sempre ritornare qualcosa alla fine della funzione o in ogni possibile ramificazione (blocchi if, elif e else) della funzione.
ja: 関数が'void'の場合、決して値を返してはならない。'return'キーワードを使って関数を早めに終了させることはできますが、その後に何かを書いてはいけません。 return型を使う場合は、関数の最後か、関数のすべての分岐（if、elif、elseブロック）で必ず何かを返さなければなりません。
nl: Als je functie 'void' is, mag je nooit een waarde teruggeven. Je kunt het sleutelwoord 'return' gebruiken om de functie vroegtijdig te beëindigen, maar je mag daarna nooit meer iets schrijven. Als je een teruggavetype gebruikt, moet je altijd iets teruggeven aan het einde van de functie of in elke vertakking (if-, elif- en else-blok) van de functie.
pt_br: Quando a sua função é vazia (void), você nunca deve retornar um valor. Você pode usar a palavra-chave 'return' para encerrar a função mais cedo, mas nunca deve escrever nada depois disso. Quando você usa um tipo de retorno, você precisa sempre retornar algo no final da função ou em toda ramificação (blocos if, elif, e else) da função.
ru: Когда тип возвращаемого значения вашей функции — «void», вы не должны возвращать значение. Вы можете использовать ключевое слово «return», для досрочного завершения функции, но писать что-либо после этого ключевого слова не следует. Когда вы используете возвращаемый тип, вы всегда должны возвращать что-то в конце функции или в каждой ветви (блоки if, elif и else) функции.
ta: உங்கள் செயல்பாடு 'வெற்றிடமாக' இருக்கும்போது, நீங்கள் ஒருபோதும் ஒரு மதிப்பை திருப்பித் தரக்கூடாது. செயல்பாட்டை முன்கூட்டியே முடிக்க நீங்கள் 'ரிட்டர்ன்' முக்கிய சொல்லைப் பயன்படுத்தலாம், ஆனால் அதற்குப் பிறகு நீங்கள் ஒருபோதும் எழுதக்கூடாது. நீங்கள் திரும்பும் வகையைப் பயன்படுத்தும்போது, செயல்பாட்டின் முடிவில் அல்லது செயல்பாட்டின் ஒவ்வொரு கிளையிலும் (IF, ELIF, மற்றும் BLOCK) நீங்கள் எப்போதும் எதையாவது திருப்பித் தர வேண்டும்.
tr: Fonksiyonunuz 'void' ise (boş), geriye bir değer döndürmemelisiniz. 'return' anahtar kelimesini, fonksiyonu erken sonlandırmak için kullanabilirsiniz, ama bunun arkasına hiçbir şey yazmamalısınız. Bir dönüş tipi kullanıyorsanız, ya fonksiyon bitiminde ya da fonksiyonun her bir kolunda (if, elif, and else) aynı şekilde dönüş yapmalısınız.
uk: Якщо ваша функція повертає значення типу «void», ви не маєте повертати значення. Ви можете використати ключове слово «return», для дострокового завершення функції, але писати щось після цього ключового слова не слід. Коли ви зазначаєте тип, що повертається, ви завжди повинні повертати щось в кінці функції або в кожній гілці (блоки if, elif та else) функції.
zh_hans: 当你的函数是'void'时，你永远不应该返回一个值。 你可以使用'return'关键字来提前结束函数，但你不应该在那之后写任何东西。 当您使用返回类型时，您必须始终在函数的末尾或函数的每个分支（if、elif 和 else 块）中返回一些内容。
zh_hant: 當你的函式是「無回傳（void））」時，絕對不應該回傳任何值。你可以使用 return 關鍵字提前結束函式，但在 return 之後不應該再寫任何東西。 當你使用回傳類型時，必須在函式的結尾或每個分支（if、elif 和 else 區塊）中都回傳某個值。

source: You probably have a typo in the name of the sub-variable that you are trying to access. Ensure that you don't have a capital letter where you should have a lowercase letter and vice versa.
cs: Pravděpodobně máte překlep v názvu dílčí proměnné, ke které se snažíte získat přístup. Ujistěte se, že nemáte velké písmeno tam, kde byste měli mít malé písmeno, a naopak.
de: Wahrscheinlich hast du einen Tippfehler im Namen der Untervariablen, auf die du zugreifen willst. Vergewissere dich, dass du keinen Großbuchstaben anstelle eines Kleinbuchstabens verwendest und andersherum.
es: Es probable que haya un error tipográfico en el nombre de la subvariable a la que intentas acceder. Asegúrate de que no tienes una letra mayúscula donde deberías tener una letra minúscula y viceversa.
fr: Vous avez probablement une faute de frappe dans le nom de la sous-variable à laquelle vous essayez d'accéder. Assurez-vous que vous n'avez pas de lettre majuscule là où vous devriez avoir une lettre minuscule et vice versa.
it: Probabilmente c'è un errore di battitura nel nome della variabile secondaria a cui si sta cercando di accedere. Assicurarsi che non ci sia una lettera maiuscola al posto di una minuscola e viceversa.
ja: おそらく、アクセスしようとしているサブ変数の名前にタイプミスがあると思われます。 小文字を使用する必要がある場所に大文字が使用されていないこと、またはその逆のことを確認してください。
nl: Je hebt waarschijnlijk een typefout in de naam van de deelvariabele die je probeert te gebruiken. Zorg ervoor dat je geen hoofdletter hebt waar je een kleine letter zou moeten hebben en andersom.
pt_br: Provavelmente há um erro de digitação no nome da sub-variável que você está tentando acessar. Verifique se você não está usando letras maiúsculas onde deveriam ser minúsculas ou vice versa.
ru: Вероятно, у вас опечатка в названии подпеременной, к которой вы пытаетесь получить доступ. Убедитесь, что у вас нет заглавной буквы там, где должна быть строчная, и наоборот.
ta: நீங்கள் அணுக முயற்சிக்கும் துணை மாறக்கூடிய பெயரில் உங்களிடம் ஒரு எழுத்துப்பிழை இருக்கலாம். உங்களிடம் ஒரு சிறிய கடிதம் இல்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், அங்கு உங்களிடம் சிறிய எழுத்து இருக்க வேண்டும், நேர்மாறாகவும்.
tr: Muhtemelen, kullanmaya çalıştığınız alt-değişkenin isminde bir yazım hatası yaptınız. Küçük harf kullanmanız gereken yerde büyük harf kullanmadığınıza emin olun, ya da tam tersi.
uk: Ймовірно, у вас хибодрук у назві підзмінної, до якої ви намагаєтеся отримати доступ. Переконайтесь, що у вас немає великої букви там, де має бути мала, і навпаки.
zh_hans: 您尝试访问的子变量名可能有错别字。 确保本应使用小写字母的地方没有大写字母，反之亦然。
zh_hant: 你可能在嘗試存取的子變數名稱上有拼字錯誤。 請確保大小寫正確，避免該出現大寫字母的地方用到了小寫字母，或是反之。
