Repository: GDQuest/learn-gdscript
Catalog: i18n/*/error_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: If the error tells you it expected something, you likely forgot to write a name after a keyword like [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code], making your code invalid. Or you forgot parentheses in a function definition. You can address the error by adding the missing name or parentheses. If the error says you have something unexpected, you are likely missing a keyword like [code]var[/code], [code]func[/code], [code]for[/code], etc. Another possibility is that you need to write a colon at the end of a function definition, [code]for[/code] loop, or a line starting with [code]if[/code], [code]elif[/code], or [code]else[/code].
cs: Pokud vám chyba říká, že něco očekávala, pravděpodobně jste zapomněli napsat jméno za klíčové slovo jako [code]var[/code], [code]func[/code], [code]for[/code] nebo [code]signal[/code], čímž se váš kód stane neplatným. Nebo jste zapomněli závorky v definici funkce. Chybu můžete vyřešit přidáním chybějícího názvu nebo závorek. Pokud chyba říká, že máte něco neočekávaného, pravděpodobně vám chybí klíčové slovo jako [code]var[/code], [code]func[/code], [code]for[/code] atd. Další možností je, že musíte napsat dvojtečku na konec definice funkce, [code]for[/code] smyčky nebo řádku začínajícího na [code]if[/code], [code]elif[/code] nebo [code]else[/code].
de: Wenn der Fehler Dir sagt, dass er etwas erwartet hat, hast Du wahrscheinlich vergessen, einen Namen nach einem Schlüsselwort wie [code]var[/code], [code]func[/code], [code]for[/code] oder [code]signal[/code] zu schreiben, wodurch Dein Code ungültig wird. Oder Du hast Klammern in einer Funktionsdefinition vergessen. Du kannst den Fehler beheben, indem Du den fehlenden Namen oder die fehlenden Klammern hinzufügst. Wenn der Fehler besagt, dass Du etwas Unerwartetes hast, fehlt Dir wahrscheinlich ein Schlüsselwort wie [code]var[/code], [code]func[/code], [code]for[/code] usw. Eine andere Möglichkeit besteht darin, dass Du einen Doppelpunkt am Ende einer Funktionsdefinition, der Schleife [code]for[/code] oder einer Zeile schreiben musst, die mit [code]if[/code], [code]elif[/code] oder [code]else[/code] beginnt.
es: Si el error te dice que esperaba algo, es probable que hayas olvidado escribir un nombre después de una palabra clave como [code]var[/code], [code]func[/code], [code]for[/code] o [code]signal[/code], lo que hace que tu código no sea válido. O tal vez olvidaste los paréntesis en la definición de una función. Puedes solucionar el error añadiendo el nombre o los paréntesis que faltan. Si el error dice que tienes algo inesperado, es probable que te falte una palabra clave como [code]var[/code], [code]func[/code], [code]for[/code], etc. Otra posibilidad es que necesites escribir dos puntos al final de una definición de función, de un bucle [code]for[/code] o de una línea que empiece por [code]if[/code], [code]elif[/code] o [code]else[/code].
fr: Si l'erreur vous dit qu'elle attendait quelque chose, vous avez probablement oublié d'écrire un nom après un mot clé comme [code]var[/code], [code]func[/code], [code]for[/code] ou [code]signal[/code], ce qui rend votre code invalide. Ou vous avez oublié les parenthèses dans une définition de fonction. Vous pouvez corriger l'erreur en ajoutant le nom ou les parenthèses manquants. Si l'erreur indique que vous avez quelque chose d'inattendu, il vous manque probablement un mot-clé comme [code]var[/code], [code]func[/code], [code]for[/code], etc. Une autre possibilité est que vous ayez besoin d'écrire deux points à la fin d'une définition de fonction, d'une boucle [code]for[/code] ou d'une ligne commençant par [code]if[/code], [code]elif[/code] ou [code]else[/code].
it: Se l'errore ti dice che si aspettava qualcosa, probabilmente hai dimenticato di scrivere un nome dopo una parola chiave come [code]var[/code], [code]func[/code], [code]for[/code] o [code]signal[/code], rendendo il tuo codice non valido. Oppure hai dimenticato le parentesi nella definizione di una funzione. Puoi risolvere l'errore aggiungendo il nome o le parentesi mancanti. Se l'errore dice che c'è qualcosa di inaspettato, probabilmente ti manca un una parola chiave come [code]var[/code], [code]func[/code], [code]for[/code], ecc. Un'altra possibilità può essere che devi scrivere dei due punti alla fine della definizione di una funzione, di un ciclo [code]for[/code] o di una riga che inizia con [code]if[/code], [code]elif[/code] o [code]else[/code].
ja: もしエラーが何かを期待していたと言うのであれば、[code]var[/code]、[code]func[/code]、[code]for[/code]、[code]signal[/code]のようなキーワードの後に名前を書き忘れていて、コードが無効になっている可能性があります。あるいは、関数の定義で括弧を忘れてしまった。不足している名前や括弧を追加することで、エラーに対処できます。 エラーに「予期しないものがある」と書かれている場合は、[code]var[/code]、[code]func[/code]、[code]for[/code]などのキーワードが欠けている可能性が高い。 もう一つの可能性は、関数定義、[code]for[/code]ループ、または[code]if[/code]、[code]elif[/code]、[code]else[/code]で始まる行の最後にコロンを書く必要があることです。
nl: Als de foutmelding aangeeft dat er iets werd verwacht, dan ben je waarschijnlijk vergeten een naam te schrijven na een sleutelwoord zoals [code]var[/code], [code]func[/code], [code]for[/code], of [code]signal[/code], waardoor je code ongeldig is. Of je bent de haakjes vergeten in een functiedefinitie. Je kunt de foutmelding verhelpen door de ontbrekende naam of haakjes toe te voegen. Als de foutmelding zegt dat je iets onverwachts hebt, mis je waarschijnlijk een sleutelwoord zoals [code]var[/code], [code]func[/code], [code]for[/code], enz. Een andere mogelijkheid is dat je een dubbele punt moet schrijven aan het einde van een functiedefinitie, [code]for[/code]-lus, of een regel die begint met [code]if[/code], [code]elif[/code], of [code]else[/code].
pt_br: Se o erro te disser que espera algo, você provavelmente esqueceu de escrever um nome depois de uma palavra-chave como [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code], fazendo assim seu código inválido. Ou você esqueceu um parêntese numa definição de função. Você pode resolver esse erro adicionando o nome ou parêntese que estiver faltando. Se o erro disser que você tem algo inesperado, você provavelmente esqueceu de uma palavra-chave como [code]var[/code], [code]func[/code], [code]for[/code], etc. Outra possibilidade é que você precisa escrever o sinal de dois pontos no final da definição da função, estrutura de repetição [code]for[/code], ou numa linha começando com [code]if[/code], [code]elif[/code], ou [code]else[/code].
ru: Если если в тексте ошибки сказано, что что-то ожидалось (expected), то вы, скорее всего, забыли написать имя после ключевого слова, такого как [code]var[/code], [code]func[/code], [code]for[/code] или [code]signal[/code], что делает ваш код нерабочим, либо вы забыли круглые скобки в определении функции. Вы можете устранить ошибку, добавив отсутствующее имя или круглые скобки. Если в ошибке сказано, что в коде есть что-то неожиданное (unexpected), вероятно, где-то не хватает ключевого слова, такого как [code]var[/code], [code]func[/code], [code]for[/code] и т.п. Другая причина может быть в том, что вам нужно написать двоеточие в конце определения функции, цикла [code]for[/code] или строки, начинающейся с [code]if[/code], [code]elif[/code] или [code]else[/code].
ta: பிழை எதையாவது எதிர்பார்க்கிறது என்று சொன்னால், [குறியீடு] var [/code], [குறியீடு] func [/code], [குறியீடு] [/குறியீடு] அல்லது [குறியீடு போன்ற ஒரு முக்கிய சொல்லுக்குப் பிறகு ஒரு பெயரை எழுத மறந்துவிட்டீர்கள் ] சமிக்ஞை [/குறியீடு], உங்கள் குறியீட்டை செல்லாது. அல்லது ஒரு செயல்பாட்டு வரையறையில் அடைப்புக்குறிக்கு நீங்கள் மறந்துவிட்டீர்கள். காணாமல் போன பெயர் அல்லது அடைப்புக்குறிப்புகளைச் சேர்ப்பதன் மூலம் பிழையை நிவர்த்தி செய்யலாம். உங்களிடம் எதிர்பாராத ஒன்று இருப்பதாக பிழை கூறினால், [குறியீடு] var [/code], [குறியீடு] FUNC [/குறியீடு], [குறியீடு] [/குறியீடு] போன்ற ஒரு முக்கிய சொல்லை நீங்கள் காணவில்லை. மற்றொரு சாத்தியம் என்னவென்றால், நீங்கள் ஒரு செயல்பாட்டு வரையறையின் முடிவில் ஒரு பெருங்குடலை எழுத வேண்டும், [/குறியீடு] வளையத்திற்கான [குறியீடு] அல்லது [/குறியீடு], [குறியீடு] ELIF [/குறியீடு] என்றால் [குறியீடு] தொடங்கி ஒரு வரி , அல்லது [குறியீடு] வேறு [/குறியீடு].
tr: Eğer bir hata size bir şey beklediğini (expected) söylüyorsa, [code]var[/code], [code]func[/code], [code]for[/code], ya da [code]signal[/code] gibi bir anahtar kelimeden sonra bir isim yazmayı unuttuğunuz için kod geçersiz hale gelmiştir. Ya da fonksiyon tanımlarken parantezleri unutmuşsunuzdur. Eksik olan ismi ya da parantezleri ekleyerek hatayı giderebilirsiniz. Eğer hata size beklenmedik bir şey yaptığınızı söylerse (unexpected), [code]var[/code], [code]func[/code], [code]for[/code] gibi bir anahtar bir kelimeyi unutmuşsunuzdur. Bir diğer olasılık ise, şunları yazarken en sonda iki nokta üst üste eklemenizin gerekmesidir: fonksiyon tanımlarken, ya da [code]for[/code] döngüsü, [code]if[/code], [code]elif[/code], veya [code]else[/code] ile başlayan satırlarda.
uk: Якщо в описі помилки сказано, що щось очікувалося (expected), то ви, найпевніше, забули написати назву після ключового слова, такого як [code]var[/code], [code]func[/code], [code]for[/code] або [code]signal[/code], що робить ваш код неробочим, або забули круглі дужки у визначенні функції. Ви можете усунути помилку, додавши відсутню назву або круглі дужки. Якщо в описі помилки сказано, що код має щось несподіване (unexpected), ймовірно, десь бракує ключового слова, такого як [code]var[/code], [code]func[/code], [code]for[/code] тощо. Інша причина може бути в тому, що потрібно написати двокрапку в кінці визначення функції, циклу [code]for[/code] або рядка, який починається з [code]if[/code], [code]elif[/code] чи [code]else[/code].
zh_hans: 如果错误告诉你它预期的东西，你可能忘记在关键字后写一个名称，如 [code]var[/code]、[code]func[/code]、[code]for[/code] 或 [code] ]signal[/code]，使您的代码无效。 或者你忘记了函数定义中的括号。 您可以通过添加缺少的名称或括号来解决错误。 如果错误提示您有意外情况，您可能缺少 [code]var[/code]、[code]func[/code]、[code]for[/code] 等关键字。 另一种可能性是您需要在函数定义、[code]for[/code] 循环或以 [code]if[/code]、[code]elif[/code] 开头的行的末尾写一个冒号 , 或 [code]else[/code]。
zh_hant: 如果錯誤告訴你預期某個東西，你很可能在 [code]var[/code], [code]func[/code], [code]for[/code] 或 [code]signal[/code] 等關鍵字後面忘了寫名稱，導致程式碼無效。或者你忘記了函式定義中的括號。你可以通過添加缺少的名稱或括號來解決這個錯誤。 如果錯誤告訴你有意外情況，那麼你很可能漏寫了像 [code]var[/code]、[code]func[/code]、[code]for[/code] 等關鍵字。 另一種可能是，你需要在函式定義、[code]for[/code] 迴圈，或以 [code]if[/code]、[code]elif[/code] 或 [code]else[/code] 開頭的條件語句後加上冒號。

source: This error tells you that you are missing a type somewhere. A type can be [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code], and many identifiers representing a data structure. Most of the time, this error occurs when you wrote a colon after a variable name but did not follow it with a type name. It also occurs when you write an arrow ([code]->[/code]) after the parentheses of a function definition but do not follow it with a type name.
cs: Tato chyba vám říká, že vám někde chybí typ. Typ může být [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code] a mnoho identifikátorů představujících data struktura. K této chybě většinou dochází, když jste za názvem proměnné napsali dvojtečku, ale nenásledovali jste ji názvem typu. Objevuje se také, když napíšete šipku ([code]->[/code]) za závorku definice funkce, ale nenásleduje za ní název typu.
de: Dieser Fehler besagt, dass Du irgendwo einen Typ vergessen hast. Ein Typ kann [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code] und viele andere Bezeichner sein, die eine Datenstruktur darstellen. Meistens tritt dieser Fehler auf, wenn man einen Doppelpunkt nach einem Variablennamen geschrieben hat, aber keinen Typnamen definiert. Es tritt auch auf, wenn man einen Pfeil ([code]->[/code]) nach den Klammern einer Funktionsdefinition schreibt, aber keinen Typnamen definiert.
es: Este error te indica que te falta un tipo en alguna parte. Un tipo puede ser [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code], y muchos otros identificadores que representan una estructura de datos. La mayoría de las veces, este error se produce cuando escribiste dos puntos después del nombre de una variable pero no escribiste un nombre de tipo inmediatamente después de ella. También ocurre cuando escribes una flecha ([code]->[/code]) después del paréntesis de una definición de función pero no escribes un nombre de tipo después de ella.
fr: Cette erreur vous indique qu'il vous manque un type quelque part. Un type peut être [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code], et de nombreux identifiants représentant une structure de données. La plupart du temps, cette erreur se produit lorsque vous avez écrit un deux-points après un nom de variable mais que vous ne l'avez pas fait suivre d'un nom de type. Elle se produit également lorsque vous écrivez une flèche ([code]->[/code]) après les parenthèses d'une définition de fonction mais que vous ne la faites pas suivre d'un nom de type.
it: Questo errore ti dice che ti manca un tipo da qualche parte. Un tipo può essere [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code] e molti altri identificatori che rappresentano strutture di dati. La maggior parte delle volte, questo errore si verifica quando scrivi dei due punti dopo il nome di una variabile ma non li accompagni con il nome di un tipo. Si verifica pure quando scrivi una freccia ([code]->[/code]) dopo le parentesi di una funzione ma non la accompagni con il nome di un tipo.
ja: このエラーは、どこかに型がないことを示しています。型には、[code]int[/code]、[code]float[/code]、[code]String[/code]、[code]Array[/code]、[code]Vector2[/code]、その他データ構造を表す多くの識別子があります。 ほとんどの場合、このエラーは変数名の後にコロンを書き、その後に型名を書かなかった場合に発生します。 また、関数定義の括弧の後に矢印（[code]->[/code]）を書き、その後に型名を記述しなかった場合にも発生します。
nl: Deze foutmelding vertelt je dat je ergens een type mist. Een type kan zijn [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code], en vele identifiers die een datastructuur vertegenwoordigen. Meestal treedt deze fout op wanneer je een dubbele punt achter een variabelenaam hebt geschreven, maar deze niet hebt gevolgd met een typenaam. Het komt ook voor wanneer je een pijl ([code]->[/code]) na de haakjes van een functiedefinitie schrijft, maar er geen typenaam achter zet.
pt_br: Esse erro fala para você que está faltando um tipo em algum lugar. Um tipo pode ser [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code], e muitos identificadores que representam uma estrutura de dados. Na maioria das vezes, esse erro acontece quando você escreve o sinal de dois pontos depois de um nome de uma variável que não possui o nome do tipo dela logo em seguida. Também acontece quando você escreve uma seta ([code]->[/code]) depois de um parêntese de uma definição de função que não foi seguido pelo nome do tipo.
ru: Эта ошибка говорит о том, что где-то вы упустили определение типа. Тип может быть представлен [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code] и другими идентификаторами, представляющими структуру данных. В большинстве случаев данная ошибка возникает, когда вы написали двоеточие после имени переменной, но не указали за ним имя типа. Также, такое происходит, когда вы пишете стрелку ([code]->[/code]) после круглых скобок определения функции, но не указываете имя типа после неё.
ta: இந்த பிழை நீங்கள் எங்காவது ஒரு வகையை காணவில்லை என்று சொல்கிறது. ஒரு வகை [குறியீடு] int [/code], [குறியீடு] மிதவை [/குறியீடு], [குறியீடு] சரம் [/குறியீடு], [குறியீடு] வரிசை [/குறியீடு], [குறியீடு] திசையன் 2 [/குறியீடு] மற்றும் தரவு கட்டமைப்பைக் குறிக்கும் பல அடையாளங்காட்டிகள். பெரும்பாலான நேரங்களில், மாறி பெயருக்குப் பிறகு நீங்கள் ஒரு பெருங்குடலை எழுதியபோது இந்த பிழை ஏற்படுகிறது, ஆனால் அதை ஒரு வகை பெயருடன் பின்பற்றவில்லை. ஒரு செயல்பாட்டு வரையறையின் அடைப்புக்குறிக்கு பிறகு நீங்கள் ஒரு அம்பு ([குறியீடு]-> [/குறியீடு]) எழுதும்போது இது நிகழ்கிறது, ஆனால் அதை ஒரு வகை பெயருடன் பின்பற்ற வேண்டாம்.
tr: Bu hata, bir yerlerde bir tip tanımını unuttuğunuzu söyler. Bir tip, [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code], ve bunlar gibi veri yapılarını temsil eden daha pek çok tanımlayıcı olabilir. Çoğunlukla, bu hatayı aldığınızda, bir değişken isminden sonra iki nokta üst üste yazmış, ama bunun devamında bir tip ismi belirtmemişsinizdir. Bu durum ayrıca, fonksiyon tanımlarken parantezden sonra bir ok ([code]->[/code]) yazmış ama bunu bir tip ismi ile bitirmemiş olduğunuzda ortaya çıkar (fonksiyonun dönüş tipi).
uk: Ця помилка означає, що ви десь пропустили визначення типу. Тип може бути позначений [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code] та іншими ідентифікаторами, які представляють структуру даних. Здебільшого ця помилка виникає, коли ви написали двокрапку після назви змінної, але не вказали після неї назву типу. Також, таке трапляється, якщо написати стрілку ([code]->[/code]) після круглих дужок визначення функції, але не вказати після неї назву типу.
zh_hans: 此错误告诉您在某处缺少类型。 类型可以是 [code]int[/code]、[code]float[/code]、[code]String[/code]、[code]Array[/code]、[code]Vector2[/code] 和 许多表示数据结构的标识符。 大多数情况下，当您在变量名后写了一个冒号但后面没有跟类型名时，就会发生此错误。 当您在函数定义的括号后写一个箭头 ([code]->[/code]) 但后面没有跟类型名称时，也会发生这种情况。
zh_hant: 這個錯誤告訴你缺少某個類型。類型可以是 [code]int[/code]、[code]float[/code]、[code]String[/code]、[code]Array[/code]、[code]Vector2[/code]，以及許多代表資料結構的識別符。 大多數情況下，這個錯誤發生在你在變數名稱後寫了冒號，但沒有加上類型名稱時。 它也會發生在你在函式定義的括號後寫了箭頭（[code]->[/code]），但沒有加上類型名稱時。

source: The variable, function name, or class name you are trying to use does not exist. You most often get this error when you make typos. Maybe you swapped two letters, forgot a letter... sometimes, it's hard to spot. The other cause for this error is that you didn't define the variable, function, or class you're trying to access.
cs: Název proměnné, funkce nebo třídy, kterou se snažíte použít, neexistuje. Tato chyba se nejčastěji objevuje při překlepu. Možná jste prohodili dvě písmena, zapomněli na písmeno... někdy je těžké to odhalit. Další příčinou této chyby je, že jste nedefinovali proměnnou, funkci nebo třídu, ke které se snažíte přistupovat.
de: Die Variable, der Funktionsname oder der Klassenname, die bzw. die Du verwenden möchtest, ist nicht vorhanden. Du erhältst diesen Fehler am häufigsten, wenn Du Tippfehler machst. Vielleicht hast Du zwei Buchstaben vertauscht, einen Buchstaben vergessen... manchmal ist es schwer zu erkennen. Die andere Ursache für diesen Fehler ist, dass die Variable, Funktion oder Klasse, auf die Du zugreifen möchtest, nicht definiert ist.
es: La variable, el nombre de la función o el nombre de la clase que intentas utilizar no existe. La mayoría de las veces te aparece este error cuando cometes errores tipográficos. Tal vez intercambiaste dos letras, olvidaste una letra...; a veces, es difícil de detectar. La otra causa de este error es que no hayas definido la variable, función o clase a la que intentas acceder.
fr: La variable, le nom de fonction ou le nom de classe que vous essayez d'utiliser n'existe pas. Vous obtenez le plus souvent cette erreur lorsque vous faites des fautes de frappe. Vous avez peut-être interverti deux lettres, oublié une lettre... parfois, c'est difficile à repérer. L'autre cause de cette erreur est que vous n'avez pas défini la variable, la fonction ou la classe à laquelle vous essayez d'accéder.
it: La variabile, nome della funzione, o nome della classe che stai cercando di usare non esiste. Spesso ottieni questo errore quando fai degli errori di battitura. Forse hai scambiato due lettere, dimenticato lettere... certe volte è difficile da trovare. L'altro caso in cui questo errore si verifica è quando non definisci la variabile, la funzione o la classe che stai cercando di usare.
ja: 使用しようとしている変数名、関数名、またはクラス名が存在しません。 このエラーは、タイプミスをしたときによく出ます。2文字を入れ替えてしまったり、1文字忘れてしまったり......見つけるのが難しいこともあります。 このエラーのもう一つの原因は、アクセスしようとしている変数、関数、クラスを定義していないことです。
nl: De variabele, functienaam of klassenaam die je probeert te gebruiken bestaat niet. Je krijgt deze fout meestal wanneer je een typefout maakt. Misschien heb je twee letters verwisseld, ben je een letter vergeten... soms is het moeilijk te zien. De andere oorzaak van deze foutmelding is dat je de variabele, functie of klasse die je probeert te gebruiken niet hebt gedefinieerd.
pt_br: A variável, nome de função, ou nome de classe que você está tentando usar não existe. Você geralmente recebe esse erro quando você comete erros na digitação de alguma palavra. Talvez você trocou duas letras de lugar, esqueceu uma letra... às vezes é difícil de identificar. A outra causa para você ter recebido esse erro é que você não definiu a variável, função, ou classe que você está tentando acessar.
ru: Переменная, имя функции или имя класса, которое вы пытаетесь использовать — не существует. Чаще всего вы получаете эту ошибку, когда делаете опечатки. Может быть, вы поменяли местами две буквы, забыли букву... иногда это трудно заметить. Другая причина этой ошибки в том, что вы не определили переменную, функцию или класс, к которым пытаетесь получить доступ.
ta: நீங்கள் பயன்படுத்த முயற்சிக்கும் மாறி, செயல்பாட்டு பெயர் அல்லது வகுப்பு பெயர் இல்லை. நீங்கள் எழுத்துப்பிழைகளை உருவாக்கும்போது இந்த பிழையைப் பெறுவீர்கள். ஒருவேளை நீங்கள் இரண்டு கடிதங்களை மாற்றிக்கொண்டிருக்கலாம், ஒரு கடிதத்தை மறந்துவிட்டீர்கள் ... சில நேரங்களில், அதைக் கண்டறிவது கடினம். இந்த பிழைக்கான மற்ற காரணம் என்னவென்றால், நீங்கள் அணுக முயற்சிக்கும் மாறி, செயல்பாடு அல்லது வகுப்பை நீங்கள் வரையறுக்கவில்லை.
tr: Kullanmaya çalıştığınız değişken ismi, fonksiyon ismi veya sınıf ismi tanımlı değil. Bu hatayı aldığınızda genellikle yazım hatası yapmışsınızdır. Belki iki harfin yerini karıştırdınız, ya da bir harfi unuttunuz... bunu fark etmek çoğunlukla zordur. Bu hatanın bir diğer sebebi de erişmeye çalıştığınız değişkeni, fonksiyonu, ya da sınıfı tanımlamamış olmanızdır.
uk: Змінна, назва функції або назва класу, яку ви намагаєтеся використати, не існує. Найчастіше ця помилка свідчить про хибодрук. Можливо, ви поміняли місцями дві літери, пропустили літеру... іноді це складно помітити. Інша причина цієї помилки в тому, що ви не визначили змінну, функцію або клас, до яких намагаєтеся отримати доступ.
zh_hans: 您尝试使用的变量、函数名或类名不存在。 当您打错字时，您最常遇到此错误。 也许你交换了两个字母，忘记了一个字母……有时，很难发现。 此错误的另一个原因是您没有定义您尝试访问的变量、函数或类。
zh_hant: 你嘗試使用的變數、函式名稱或類別名稱不存在。 當你打錯字時，通常會出現這個錯誤。也許你交換了兩個字母、忘了寫一個字母……有時候很難發現。 這個錯誤的另一個原因是你沒有定義你正在嘗試存取的變數、函式或類別。
