Repository: GDQuest/learn-gdscript
Catalog: i18n/*/error_database.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: The other cause for this error is that you didn't define the variable, function, or class you're trying to access.
da: Den anden årsag til denne fejl er, at du ikke har defineret den variabel, funktion eller klasse, du prøver at få adgang til.
pt: A outra causa para ter recebido esse erro é que não definiu a variável, função, ou classe que tenta aceder.

source: To solve this error, triple-check that there is no typo in the line.
da: For at løse denne fejl skal du tredobbelt kontrollere, at der ikke er nogen tastefejl i linjen.
pt: Para resolver esse erro, verifique várias vezes que não há erros de digitação na linha de código.

source: If you can, try to go to the variable or function definition, double-click the name, copy it, and paste it where you see the error.
da: Hvis du kan, så prøv at gå til definitionen af variablen eller funktionen, dobbeltklik på navnet, kopier det og indsæt det, hvor du ser fejlen.
pt: Se puder, tente ir à definição da variável ou função, reveja o nome, copie ele e cole onde estiver dando o erro.

source: If you don't see any typo, then you need to ensure that you defined the variable, function, or class you are referring to.
da: Hvis du ikke ser nogen tastefejl, skal du sørge for at have defineret den variabel, funktion eller klasse, du refererer til.
pt: Se não achar nenhum erro de digitação, garanta que definiu a variável, a função ou a classe que tenta referenciar.

source: You can only use keywords like [code]break[/code] or [code]continue[/code] in a loop. Outside a loop, they are invalid.
da: Du kan kun bruge nøgleord som [code]break[/code] eller [code]continue[/code] i et loop. Uden for et loop er de ugyldige.
pt: Só pode usar palavras-chave como: [code]break[/code] ou [code]continue[/code] numa estrutura de repetição. Fora de uma estrutura de repetição, elas são inválidas.

source: The [code]continue[/code] keyword means "jump to the next iteration of the loop." And the [code]break[/code] keyword means "end the loop right now and jump to the first line of code after the loop block.
da: Nøgleordet [code]continue[/code] betyder "hop til den næste iteration af loopet". Og nøgleordet [code]break[/code] betyder "afslut loopet lige nu og hop til den første kodelinje efter loopblokken".
pt: A palavra-chave [code]continue[/code] significa "vá para a próxima iteração da repetição." e a palavra_chave [code]break[/code] significa "finalize a repetição agora mesmo e vá para a primeira linha de código depois do bloco dessa estrutura de repetição".

source: If you wrote one of these keywords outside a loop, you need to remove it.
da: Hvis du skrev et af disse nøgleord uden for en løkke, skal du fjerne det.
pt: Se escreveu uma dessas palavras-chave fora de uma estrutura de repetição, precisa remove-la.

source: If you are trying to use it inside a loop, your indentation is most likely at fault. You may need to insert one or more leading tab characters to the keyword.
da: Hvis du prøver at bruge det i en løkke, er det højst sandsynligt din indrykning, der er skyld i problemet. Du skal muligvis indsætte et eller flere indledende tabulatortegn før nøgleordet.
pt: Se tenta usa-las dentro de uma estrutura de repetição, a sua indentação provavelmente está errada. Precisa pôr um ou mais caractere de tabulação na palavra-chave.

source: When the computer talks about a constant expression, it expects a fixed value, a fixed calculation, or the name of an existing constant.
da: Når computeren taler om et konstant udtryk, forventer den en fast værdi, en fast beregning eller navnet på en eksisterende konstant.
pt: Quando o computador fala sobre uma expressão constante, ele espera um valor fixo, um cálculo fixo ou o nome de uma constante existente.

source: In other words, it wants something that can never change. This is why the computer will reject function calls and variables where it needs a constant expression.
da: Med andre ord ønsker den noget, der aldrig kan ændre sig. Det er derfor, computeren vil afvise funktionskald og variabler, hvor den har brug for et konstant udtryk.
pt: Em outras palavras, ele quer alguma coisa que nunca pode mudar. É por isso que o computador irá rejeitar chamadas de funções e variáveis onde precisam de uma expressão constante.

source: You need to replace function calls or variables with a constant value like a whole number, decimal number, string, vector, a predefined array, etc.
da: Du skal erstatte funktionskald eller variabler med en konstant værdi, som et helt tal, et decimaltal, en streng, en vektor, et foruddefineret array osv.
pt: Precisa substituir chamadas de funções ou variáveis com um valor constante como um número inteiro, um número decimal, string (cadeia de caractere), vetor, um array (uma matriz) predefinido, etc.

source: You can also use arithmetic operators like multiplications (*), additions (+), and so on.
da: Du kan også bruge aritmetiske operatorer som multiplikationer (*), additioner (+) osv.
pt: Também pode usar operadores aritméticos como multiplicações (*), adições (+) e assim por diante.

source: When defining a new class, you need to follow a specific pattern. You must write the name in plain text, starting with a letter.
da: Når du definerer en ny klasse, skal du følge et specifikt mønster. Du skal skrive navnet i almindelig tekst, startende med et bogstav.
pt: Quando definir uma nova classe, precisa seguir um padrão específico. Precisa escrever o nome dela com texto puro, começando com uma letra.

source: We typically write class names in PascalCase: with a capital letter at the start of every word that composes the class name.
da: Vi skriver typisk klassenavne i PascalCase: med et stort bogstav i starten af hvert ord, der udgør klassenavnet.
pt: Tipicamente escrevemos nome de classes em PascalCase: Com uma letra em maiúscula no começo de cada palavra que compõe o nome da classe.

source: To fix this error, replace whatever you put after the 'extends' or 'class_name' keyword by a name without spaces and starting with a capital letter.
da: For at rette denne fejl skal du erstatte det, du har angivet efter nøgleordet 'extends' eller 'class_name', med et navn uden mellemrum, der starter med et stort bogstav.
pt: Para resolver esse erro, substitua tudo aquilo que pôs depois das palavras-chave 'extends' ou 'class_name' por um nome sem espaços entre eles e começando com uma letra em maiúscula.

source: You can optionally use numbers in the name, but not in the first position.
da: Du kan eventuelt bruge tal i navnet, men ikke på første position.
pt: Tem a opção de usar números no nome, mas não na primeira posição (não pode começar com números).

source: You are trying to define a function or variable that already exists; You can't do that.
da: Du forsøger at definere en funktion eller variabel, der allerede findes; Det kan du ikke.
pt: Tenta definir uma função ou variável que já existe. Não pode fazer isso.

source: Perhaps the function or variable already exists in the current code file, but it may also be in a parent class that this GDScript code extends.
da: Måske findes funktionen eller variablen allerede i den aktuelle kodefil, men den kan også være i en overordnet klasse, som denne GDScript-kode udvider.
pt: Talvez a função ou variável já exista no ficheiro de código atual, mas também pode estar na classe pai que esse código de GDScript estende.

source: In the app, your code extends some built-in Godot code that's not visible to you.
da: I appen udvider din kode noget indbygget Godot-kode, som du ikke kan se.
pt: Na app, o seu código estende alguns códigos que já vêm integrado na Godot que não visíveis para si.

source: When that happens, you need to either rename your function or variable to one that will not collide with an existing one or remove this line of code.
da: Når det sker, skal du enten omdøbe din funktion eller variabel til en, der ikke kolliderer med en eksisterende, eller fjerne denne kodelinje.
pt: Quando isso acontece, precisa: ou renomear a sua função ou variável que não seja igual a um nome que já exista nesses códigos integrados ou remover essa linha de código.

source: You are trying to define a signal that already exists; You can't do that.
da: Du prøver at definere et signal, der allerede findes. Det kan du ikke.
pt: Tenta definir um sinal que já existe; Não pode fazer isso.

source: Perhaps the signal already exists in the current code file, but it may also be in a parent class that this GDScript code extends.
da: Måske findes signalet allerede i den aktuelle kodefil, men det kan også være i en overordnet klasse, som denne GDScript-kode udvider.
pt: Talvez esse sinal já exista no ficheiro do código atual, mas também pode estar na classe pai que esse código de GDScript estende.

source: When that happens, you need to either rename your signal to one that will not collide with an existing one or remove this line of code.
da: Når det sker, skal du enten omdøbe dit signal til et, der ikke kolliderer med et eksisterende signal, eller fjerne denne kodelinje.
pt: Quando isso acontece, precisa: ou renomear o seu sinal que não seja igual a um nome que já exista nesses códigos integrados ou remover essa linha de código.

source: The function you're trying to define exists in a parent class, so your definition overrides the parent class's function.
da: Den funktion, du forsøger at definere, findes i en overordnede klasse, så din definition overskriver den overordnede klasses funktion.
pt: A função que tenta definir já existe numa classe pai, então a sua definição sobrescreve a função da classe pai.

source: When you override a parent class's function, the new function must match the parent. The new function should have the same number and type of parameters as the parent class.
da: Når du overskriver en overordnede klasses funktion, skal den nye funktion matche den overordnede. Den nye funktion skal have samme antal og type parametre som den overordnede klasse.
pt: Quando sobrescreve uma função da classe pai, a nova função precisa corresponder a da classe pai. A nova função deve ter a mesma quantidade e tipo de parâmetros que a classe pai.

source: For example, if the parent has two arguments, you need your new function also to have two arguments. If you use type hints in your function definitions, the argument types must match the parent class.
da: For eksempel, hvis den overordnede har to argumenter, skal din nye funktion også have to argumenter. Hvis du bruger typehints i dine funktionsdefinitioner, skal argumenttyperne matche den overordnede klasse.
pt: Por exemplo, se a classe pai possuir dois argumentos, precisa garantir que a nova função também tenha dois argumentos. Se usar a dica de tipo nas suas definições de funções, os tipos de argumentos devem corresponder a da classe pai.

source: You need to check the parent class's function and its definition in the code reference. Then, you need to edit your function definition to have the same number and type of parameters as the parent class.
cs: Je třeba zkontrolovat funkci nadřazené třídy a její definici v odkazu na kód. Poté musíte upravit definici své funkce tak, aby měla stejný počet a typ parametrů jako nadřazená třída.
da: Du skal kontrollere den overordnede klasses funktion og dens definition i kodereferencen. Derefter skal du redigere din funktionsdefinition, så den har det samme antal og den samme type parametre som den overordnede klasse.
de: Du musst die Funktion der übergeordneten Klasse und ihre Definition in der Codereferenz überprüfen. Anschließend musst Du ihre Funktionsdefinition bearbeiten, um die gleiche Anzahl und den gleichen Typ von Parametern wie die übergeordnete Klasse zu haben.
es: Tienes que comprobar la función de la clase padre y su definición en la referencia del código. Luego, tienes que editar la definición de tu función para que tenga el mismo número y tipo de parámetros que la clase padre.
fr: Vous devez vérifier la fonction de la classe parent et sa définition dans la référence du code. Ensuite, vous devez modifier la définition de votre fonction pour avoir le même nombre et le même type de paramètres que la classe parent.
it: Devi controllare la funzione della classe genitore e la sua definizione nel riferimento del codice. Poi, devi modificare la tua funzione di definizione per far sì che abbia lo stesso numero e tipo di parametri della classe genitore.
ja: 親クラスの関数とその定義をコード・リファレンスで確認する必要がある。そして、親クラスと同じ数と種類のパラメータを持つように、関数定義を編集する必要があります。
nl: Je moet de functie van de bovenliggende klasse en de definitie ervan in de codereferentie raadplegen. Dan moet je je functiedefinitie aanpassen zodat deze hetzelfde aantal en type parameters heeft als de bovenliggende klasse.
pt: Precisa verificar a função da classe pai e as suas definições na referência de código. Então, precisa editar a sua definição de função para ter a mesma quantidade e tipos de parâmetros que a classe pai.
pt_br: Você precisa checar a função da classe pai e suas definições na referência de código. Então, você precisa editar sua definição de função para ter o mesmo número e tipos de parâmetros que a classe pai.
ru: Вам необходимо ознакомиться с функцией родительского класса и её определением в справочнике по коду. Затем вам нужно отредактировать определение вашей функции, чтобы количество и типы параметров были такими же как в родительском классе.
ta: குறியீடு குறிப்பில் பெற்றோர் வகுப்பின் செயல்பாடு மற்றும் அதன் வரையறையை நீங்கள் சரிபார்க்க வேண்டும். பின்னர், பெற்றோர் வகுப்பின் அதே எண் மற்றும் அளவுருக்களின் வகையை வைத்திருக்க உங்கள் செயல்பாட்டு வரையறையை நீங்கள் திருத்த வேண்டும்.
tr: Ana sınıfın fonksiyonunu ve nasıl tanımlandığını, kod başvuru kaynaklarından kontrol etmelisiniz. Sonra, fonksiyon tanımını, girdi değişkenlerinin sayılarını ve tiplerini ana sınıftaki ile aynı olacak şekilde yeniden düzenlemelisiniz.
uk: Вам слід ознайомитися з функцією батьківського класу та її визначенням у довіднику. Потім потрібно відредагувати визначення вашої функції, щоб кількість та типи параметрів були такими ж як у батьківському класі.
zh_hans: 您需要在代码参考中检查父类的函数及其定义。 然后，您需要编辑函数定义，使其具有与父类相同数量和类型的参数。
zh_hant: 您需要查閱父類別的函式及其定義，參考程式碼文件中的說明。接著，請修改您的函式定義，使其參數數量與型別與父類別的函式保持一致。

source: This whole class of errors has to do with calling functions with either the wrong number of arguments or the wrong kind of argument. You will need to use the error message to see what is going wrong.
cs: Celá tato skupina chyb souvisí s voláním funkcí s nesprávným počtem argumentů nebo nesprávným druhem argumentu. Abyste zjistili, co je špatně, musíte porozumět chybovému hlášení.
da: Hele denne klasse af fejl har at gøre med kald af funktioner med enten det forkerte antal argumenter eller den forkerte type argument. Du bliver nød til at bruge fejlmeddelelsen til at se, hvad der går galt.
de: Diese ganze Klasse von Fehlern hat mit dem Aufrufen von Funktionen zu tun, die entweder die falsche Anzahl von Parametern oder die falsche Art von Parametern haben. Du musst die Fehlermeldung lesen, um zu sehen, was schiefläuft.
es: Toda esta clase de errores tiene que ver con llamar a funciones con el número incorrecto de argumentos o con el tipo de argumento incorrecto. Deberás utilizar el mensaje de error para ver qué está fallando.
fr: Toute cette classe d'erreurs est liée à l'appel de fonctions avec soit le mauvais nombre d'arguments, soit le mauvais type d'argument. Vous devrez utiliser le message d'erreur pour voir ce qui ne va pas.
it: Questo intero insieme di errori ha a che fare con chiamate di funzioni che hanno o il numero errato di argomenti o il tipo errato dell'argomento. Dovrai usare il messaggio di errore per vedere cosa è andato storto.
ja: このクラスのエラーは、間違った数の引数や間違った種類の引数で関数を呼び出すことに関係しています。何が間違っているのかを確認するには、エラーメッセージを使用する必要があります。
nl: Deze hele categorie van foutmeldingen heeft te maken met het aanroepen van functies met het verkeerde aantal argumenten of het verkeerde soort argument. Je zult de foutmelding moeten lezen om te begrijpen wat er mis gaat.
pt: Todos esses erros de classe tem a ver com chamar funções com a quantidade de argumentos errados ou com o tipo errado de argumento. Precisa usar a mensagem de erro para ver o que dá errado.
pt_br: Todos esses erros de classe tem a ver com chamar funções com o número de argumentos errados ou com o tipo errado de argumento. Você precisa usar a mensagem de erro para ver o que está dando de errado.
ru: Ошибки этого класса возникают при вызове функций с неправильным количеством аргументов, либо с аргументами неправильных типов. Вам нужно будет воспользоваться сообщением об ошибке, чтобы понять, что пошло не так.
ta: இந்த முழு வகுப்பு பிழைகள் தவறான எண்ணிக்கையிலான வாதங்கள் அல்லது தவறான வகையான வாதத்துடன் செயல்பாடுகளை அழைப்பதோடு தொடர்புடையது. என்ன தவறு நடக்கிறது என்பதைக் காண நீங்கள் பிழை செய்தியைப் பயன்படுத்த வேண்டும்.
tr: Bu hata sınıfı, fonksiyonları, ya yanlış sayıda girdi değişkeni ile çağırmak, ya da yanlış girdi değişkeni tipi kullanmak ile ilgilidir. Hata mesajının kendisini okuyup neyin yanlış olduğunu görmeniz gerekiyor.
uk: Помилки цього класу виникають під час виклику функцій з неправильною кількістю аргументів або з аргументами неправильних типів. Вам потрібно буде скористатися повідомленням про помилку, щоб зрозуміти, що саме не так.
zh_hans: 这类错误与使用错误数量的参数或错误类型的参数调用函数有关。 您将需要使用错误消息来查看问题所在。
zh_hant: 這類錯誤通常與函式呼叫時，傳入的參數數量不正確或參數類型不匹配有關。您需要根據錯誤訊息來確認問題所在，並調整函式的參數數量或類型，以符合函式的定義。

source: You need to either remove, add, or change the values you're trying to pass to the function to solve this issue. To know exactly how many arguments you need, you need to check the code reference. It will show you the function definition and the mandatory arguments.
cs: Abyste tento problém vyřešili, musíte buď odebrat, přidat, nebo změnit hodnoty, které se snažíte funkci předat. Chcete-li přesně zjistit, kolik argumentů potřebujete, musíte se podívat do reference kódu. Ten vám ukáže definici funkce a povinné argumenty.
da: Du skal enten fjerne, tilføje eller ændre de værdier, du prøver at videregive til funktionen, for at løse dette problem. For at vide præcis, hvor mange argumenter du har brug for, skal du tjekke kodereferencen. Den viser dig funktionsdefinitionen og de obligatoriske argumenter.
de: Du musst die Werte, die Du an die Funktion übergeben möchtest, entweder entfernen, hinzufügen oder ändern, um dieses Problem zu beheben. Um genau zu wissen, wie viele Parameter benötigt werden, musst Du die Codereferenz überprüfen. Es zeigt die Funktionsdefinition und die nötigen Parameter.
es: Debes eliminar, agregar o cambiar los valores que intentas pasar a la función para resolver este problema. Para saber exactamente cuántos argumentos necesitas, tienes que verificar la referencia del código. Te mostrará la definición de la función y los argumentos obligatorios.
fr: Pour résoudre ce problème, vous devez soit supprimer, ajouter ou modifier les valeurs que vous essayez de passer à la fonction. Pour savoir exactement combien d'arguments vous avez besoin, vous devez vérifier la référence du code. Elle vous montrera la définition de la fonction et les arguments obligatoires.
it: Devi rimuovere, aggiungere o cambiare i valori che stai cercando di passare alla funzione per risolvere questo problema. Per sapere esattamente quanti argomenti ti servono, devi controllare il rimando del codice. Ti mostrerà la definizione della funzione e gli argomenti obbligatori.
ja: この問題を解決するには、関数に渡そうとしている値を削除するか、追加するか、変更する必要がある。必要な引数の数を正確に知るには、コード・リファレンスをチェックする必要がある。関数の定義と必須の引数が表示されます。
nl: Je moet de waarden die je probeert door te geven aan de functie verwijderen, toevoegen of aanpassen om dit probleem op te lossen. Om te weten hoeveel argumenten je precies nodig hebt, moet je de codereferentie raadplegen. Deze toont je de functiedefinitie en de verplichte argumenten.
pt: Precisa remover, adicionar ou mudar os valores que tenta passar para a função para resolver esse problema. Para saber exatamente quantos argumentos precisa usar, precisa verificar a referência de código. Ela vai mostrar-lhe a definição da função e os argumentos mandatórios.
pt_br: Você precisa remover, adicionar ou mudar os valores que está tentando passar para a função para resolver esse problema. Para saber exatamente quantos argumentos você precisa usar, você precisa verificar a referência de código. Ela vai mostrar pra você a definição da função e os argumentos mandatórios.
ru: Чтобы решить эту проблему вам нужно удалить, добавить, либо изменить значения, которые вы пытаетесь передать функции. Информацию о том, какие аргументы принимает функция, можно найти в справочнике по коду. В нём вы увидите определение функции и обязательные аргументы.
ta: இந்த சிக்கலைத் தீர்க்க நீங்கள் செயல்பாட்டிற்கு அனுப்ப முயற்சிக்கும் மதிப்புகளை அகற்ற வேண்டும், சேர்க்க வேண்டும் அல்லது மாற்ற வேண்டும். உங்களுக்கு எத்தனை வாதங்கள் தேவை என்பதை அறிய, நீங்கள் குறியீடு குறிப்பை சரிபார்க்க வேண்டும். இது செயல்பாட்டு வரையறை மற்றும் கட்டாய வாதங்களை உங்களுக்குக் காண்பிக்கும்.
tr: Bunu çözmek için, ya fonksiyona gönderdiğiniz değişkenlere ekleme yapmalı, ya bunlardan birkaçını çıkarmalı, ya da bunların değerlerini değiştirmelisiniz. Tam olarak kaç tane girdi değişkeni gerektiğini görmek için kod başvuru kaynaklarına bakmanız gerekiyor. Bunlar size fonksiyonun nasıl tanımlandığını ve gerekli olan girdi değişkenlerini gösterecektir.
uk: Щоб вирішити цю проблему, потрібно видалити, додати, або змінити значення, які ви намагаєтеся передати функції. Інформацію про те, які аргументи приймає функція, можна знайти у довіднику. У ньому ви побачите визначення функції та обов'язкові аргументи.
zh_hans: 您需要删除、添加或更改您尝试传递给函数的值以解决此问题。 要确切知道您需要多少个参数，您需要检查代码参考。 它将向您显示函数定义和强制参数。
zh_hant: 您需要刪除、添加或修改傳遞給函式的參數值，才能解決這個問題。要確定正確的參數數量，請查閱程式碼文件中的函式定義，它會顯示該函式所需的必要參數。

source: All the values in your code have a specific type. That type can be a whole number (int), a decimal number (float), text (String), and so on. There are tons of possible types, and you can even define your own!
da: Alle værdierne i din kode har en specifik type. Denne type kan være et helt tal (int), et decimaltal (float), tekst (String) osv. Der er tonsvis af mulige typer, og du kan endda definere dine egne!
pt: Todos os valores no seu código possuem um tipo específico. Esse tipo pode ser um número inteiro (int), um número decimal (float), um texto (string) e assim por diante. Há vários tipos possíveis e pode até mesmo definir os seus próprios tipos!

source: When you make any operation, the computer compares the types you are using.
da: Når du udfører en handling, sammenligner computeren de typer, du bruger.
pt: Quando faz qualquer operação, o computador compara os tipos que usa.

source: Some types are compatible, and some are not. For example, you cannot directly add a whole number to a text string. You first need to convert the number into text.
da: Nogle typer er kompatible, og andre er ikke. For eksempel kan du ikke direkte tilføje et helt tal til en tekststreng. Du skal først konvertere tallet til tekst.
pt: Alguns tipos são compatíveis e outros não. Por exemplo, não pode adicionar diretamente um número inteiro a uma cadeia de caractere (string). Precisa primeiro converter o número em texto.

source: You'll need to read the error message to see what is not matching because there are many possible cases.
da: Du skal læse fejlmeddelelsen for at se, hvad der ikke matcher, fordi der er mange mulige tilfælde.
pt: Vai precisar ler a mensagem de erro para ver o que não está compatível porque existe muitos casos possíveis.
