Repository: GDQuest/learn-gdscript
Catalog: i18n/*/glossary_database.po
Languages: cs, da, de, es, fr, it, ja, nl, tr, zh_hant

source: member function
cs: členská funkce
da: medlemsfunktion
de: Memberfunktion
es: función miembro
fr: fonction membre
it: funzione membro
ja: メンバ関数
nl: lidfunctie
tr: üye fonksiyon
zh_hant: 成員函式

source: member functions
cs: členské funkce
da: medlemsfunktioner
de: Memberfunktionen
es: funciones miembro
fr: fonctions membres
it: funzioni membro
ja: メンバ関数
nl: lidfuncties
tr: üye fonksiyonlar
zh_hant: 成員函式

source: Member functions are functions attached to a specific value type, like arrays, strings, or dictionaries. We also call them methods.
da: Medlemsfunktioner er funktioner der knyttet til en bestemt værditype, som arrays, strenge eller ordbøger. Vi kalder også dem metoder.
de: Memberfunktionen sind Funktionen, die auf einem bestimmten Wertyp angehören, z. B. Arrays, Strings oder Dictionaries. Wir nennen sie auch Methoden.
es: Las funciones miembro son funciones adjuntas a un tipo de valor específico, como matrices, cadenas o diccionarios. También las llamamos métodos.
it: Le funzioni membro sono funzioni collegate ad uno specifico tipo di valore, come array, stringhe o dizionari. Le chiamiamo pure metodi.
nl: Lidfuncties zijn functies die gekoppeld zijn aan een specifiek waardentype, zoals arrays, strings of dictionaries. We noemen ze ook wel methoden.

source: For example, arrays have member functions like [code]array.append()[/code].
da: For eksempel har arrays medlemsfunktioner som [code]array.append()[/code].
de: Arrays verfügen beispielsweise über Memberfunktionen wie [code]array.append()[/code].
es: Por ejemplo, las matrices tienen funciones miembro como [code]array.append()[/code].
it: Per esempio, gli array hanno funzioni membro come [code]array.append()[/code].
nl: Arrays hebben bijvoorbeeld lidfuncties zoals [code]array.append()[/code].

source: You can only call the function on an array, using the access operator ([code].[/code]) to access it, as shown above.
da: Du kan kun kalde funktionen på et array, ved hjælp af adgangs "operatoren" ([code].[/code]) for at få adgang til den, som vist ovenfor.
de: Du kannst die Methode auf einem Array nur mit dem Zugriffsoperator ([code].[/code]) aufrufen, wie oben gezeigt.
es: Sólo puedes llamar a la función en una matriz, utilizando el operador de acceso ([code].[/code]) para acceder a ella, como se muestra arriba.
it: Puoi chiamare questa funzione solo su un array, usando l'operatore di accesso ([code].[/code]) per accedervi, come mostrato qui sopra.
nl: Je kunt de functie alleen aanroepen op een array, met behulp van de toegangsoperator ([code].[/code]), zoals hierboven getoond.

source: member variable
cs: členská proměnná
da: medlemsvariabel
es: variable miembro
fr: variable membre
it: variabile membro
ja: メンバ変数
nl: lidvariabele
tr: üye değişken
zh_hant: 成員變數

source: member variables
cs: členské proměnné
da: medlemsvariabler
de: Membervariablen
es: variables miembro
fr: variables membres
it: variabili membro
ja: メンバ変数
nl: lidvariabelen
tr: üye değişkenler
zh_hant: 成員變數

source: Member variables are variables attached to a specific value type, like a vector's [code]x[/code] and [code]y[/code] sub-variables. We also call them [i]properties[/i] or [i]fields[/i] of the vector.
da: Medlemsvariabler er variabler knyttet til en bestemt værditype, såsom en vektors [code]x[/code] og [code]y[/code] undervariabler. Vi kalder dem også for [i]egenskaber[/i] eller [i]felter[/i] af vektoren.
de: Membervariablen sind Variablen, die Teil eines bestimmten Werttyps sind, z. B. die Untervariablen [code]x[/code] und [code]y[/code] eines Vektors. Wir nennen sie auch [i]Properties[/i] oder [i]Felder[/i] des Vektors.
es: Las variables miembro son variables adjuntas a un tipo de valor específico, como las subvariables [code]x[/code] y [code]y[/code] de un vector. También las llamamos [i]propiedades[/i] o [i]campos[/i] del vector.
it: Le variabili membro sono variabili collegate a un tipo di valore specifico, come le sotto-variabili [code]x[/code] e [code]y[/code] di un vettore. Le chiamiamo anche [i]proprietà[/i] o [i]campi[/i] del vettore.
nl: Lidvariabelen zijn variabelen die gekoppeld zijn aan een specifiek waardentype, zoals de deelvariabelen [code]x[/code] en [code]y[/code] van een vector. We noemen ze ook wel [i]eigenschappen[/i] of [i]velden[/i] van de vector.

source: To access a member variable, you must first write the value's name followed by the access operator ([code].[/code]). For example, [code]position.x[/code].
da: For at få adgang til en medlemsvariabel skal du først skrive værdiens navn efterfulgt af adgangsoperatoren ([code].[/code]). For eksempel [code]position.x[/code].
de: Um auf eine Membervariable zuzugreifen, schreiben wir den Namen der Variablen gefolgt vom Zugriffsoperator ([code].[/code]) und dann dem Namen der Membervariable. Beispiel: [code]position.x[/code].
es: Para acceder a una variable miembro, debes escribir primero el nombre del valor seguido del operador de acceso ([code].[/code]). Por ejemplo, [code]position.x[/code].
it: Per accedere a una variabile membro, è necessario scrivere prima il nome del valore seguito dall'operatore di accesso ([code].[/code]). Ad esempio, [code]position.x[/code].
nl: Om een lidvariabele te gebruiken, moet je eerst de naam van de waarde schrijven, gevolgd door de toegangsoperator ([code].[/code]). Bijvoorbeeld, [code]position.x[/code].

source: parameter
cs: parametr
es: parámetro
fr: paramètre
it: parametro
ja: パラメータ
tr: alınan değişken, parametre
zh_hant: 參數

source: parameters
cs: parametry
da: parametre
de: Parameter
es: parámetros
fr: paramètres
it: parametri
ja: パラメータ
tr: alınan değişkenler, parametreler
zh_hant: 參數

source: A parameter is a variable you create as part of a function definition.
da: En parameter er en variabel, du opretter som en del af en funktionsdefinition.
de: Ein Parameter ist eine Variable, die Teil einer Funktionsdefinition ist.
es: Un parámetro es una variable que creas como parte de la definición de una función.
it: Un parametro è una variabile che crei come parte della definizione di una funzione.
nl: Een parameter is een variabele die je maakt als onderdeel van een functiedefinitie.

source: It allows you to reuse the function more by having values that vary in the function's body.
da: Den giver dig mulighed for at genbruge funktionen flere steder ved at have værdier, der varierer i funktionens krop.
de: Parameter ermöglichen es dir, Funktionen zu erstellen, die an mehreren Stellen in deinem Code verwendet werden können, indem du der Funktion bei Aufrufen andere Werte als Parameter mitgibst.
es: Te permite reutilizar más la función al tener valores que varían en el cuerpo de la función.
it: Ti consente di riutilizzare la funzione più volte avendo valori che cambiano nel corpo della funzione.
nl: Hiermee kun je de functie vaker hergebruiken met waarden die variëren binnen de functie.

source: radian
cs: radián
de: Radiant
es: radián
it: radiante
ja: ラジアン
nl: radiaal
tr: radyan
zh_hant: 弧度

source: radians
cs: radiánů
da: radianer
de: Radianten
es: radianes
it: radianti
ja: ラジアン
nl: radialen
tr: radyan
zh_hant: 弧度

source: A radian is a unit of measurement of angles based on the circle's circumference.
da: En radian er en måleenhed for vinkler baseret på cirklens omkreds.
de: Ein Radiant ist eine Maßeinheit für Winkel, die auf dem Umfang des Kreises basiert.
es: Un radián es una unidad de medida de ángulos basada en la circunferencia del círculo.
it: Un radiante è un'unità di misura degli angoli basata sulla circonferenza del cerchio.
nl: Een radiaal is een meeteenheid van hoeken gebaseerd op de omtrek van de cirkel.

source: We tend to use degrees more in our daily lives, but in computer programming, and especially in games, radians are common.
da: Vi bruger ofte grader i vores dagligdag, men i computerprogrammering, og især i spil, er radianer almindelige.
de: Im alltag wird oftmals das Grad system verwednet, in der Computerprogrammierung hingegen, besonders bei Spielen, fällt die wahl jedoch meist auf Radianten.
es: Tendemos a utilizar más los grados en nuestra vida cotidiana, pero en la programación informática, y especialmente en los juegos, los radianes son comunes.
it: Nella vita di tutti i giorni tendiamo ad usare i gradi, ma in programmazione e specialmente nei videogiochi, i radianti sono più comuni.
nl: In ons dagelijks leven gebruiken we meestal graden, maar in computerprogrammering en vooral in games komen vaak radialen voor.

source: An angle of [code]2 * PI[/code] radians corresponds to 360 degrees. And an angle of [code]PI[/code] radians corresponds to 180 degrees.
da: En vinkel på [code]2 * PI[/code] radianer svarer til 360 grader. Og en vinkel på [code]PI[/code] radianer svarer til 180 grader.
de: Ein Winkel von [code]2 * PI[/code] Radiant entspricht 360 Grad. Und ein Winkel von [code]PI[/code] Radiant entspricht 180 Grad.
es: Un ángulo de [code]2 * PI[/code] radianes corresponde a 360 grados. Y un ángulo de [code]PI[/code] radianes corresponde a 180 grados.
it: Un angolo di [code]2 * PI[/code] radianti corrisponde a 360 gradi. E un angolo di [code]PI[/code] radianti corrisponde a 180 gradi.
nl: Een hoek van [code]2 * PI[/code] radialen komt overeen met 360 graden. En een hoek van [code]PI[/code] radialen komt overeen met 180 graden.

source: type
cs: typ
de: Typ
es: tipo
it: tipo
ja: 型
tr: tip
zh_hant: 類型

source: types
cs: typy
da: typer
de: Typen
es: tipos
it: tipi
ja: 型
tr: tipler
zh_hant: 類型

source: In computer programming, a type is the class of a value. For example, whole numbers like [code]3[/code], [code]11[/code], and [code]255462[/code] are all of type [code]int[/code] (short for integer).
da: I computerprogrammering er en type, klassen af en værdi. For eksempel er hele tal som [code]3[/code], [code]11[/code] og [code]255462[/code] alle af typen [code]int[/code] (forkortelse for heltal).
de: In der Computerprogrammierung ist ein Typ die Klasse eines Werts. Beispielsweise sind ganze Zahlen wie [code]3[/code], [code]11[/code] und [code]255462[/code] alle vom Typ [code]int[/code] (kurz für integer).
es: En programación informática, un tipo es la clase de un valor. Por ejemplo, números enteros como [code]3[/code], [code]11[/code] y [code]255462[/code] son todos del tipo [code]int[/code] (abreviatura de entero).
it: In programmazione, un tipo è la classe di un valore. Per esempio, i numeri interi come [code]4[/code], [code]8[/code], [code]15[/code], [code]1623[/code] e [code]42[/code] sono tutti del tipo [code]int[/code] (diminutivo di intero).
nl: In computerprogrammering is een type de klasse van een waarde. Bijvoorbeeld, gehele getallen zoals [code]3[/code], [code]11[/code], en [code]255462[/code] zijn allemaal van het type [code]int[/code] (afkorting voor integer).

source: The computer uses types to determine which operations are valid between two values and when they're undefined.
da: Computeren bruger typer til at bestemme, hvilke operationer der er gyldige mellem to værdier, og hvornår de er udefinerede.
de: Der Computer verwendet Typen, um zu bestimmen, welche Vorgänge zwischen zwei Werten gültig sind und wann sie nicht definiert sind.
es: El ordenador utiliza los tipos para determinar qué operaciones son válidas entre dos valores y cuándo son indefinidas.
it: Il computer usa i tipi per determinare quali operatori sono validi tra due valori e quando sono indefiniti.
nl: De computer gebruikt types om te bepalen welke bewerkingen geldig zijn tussen twee waarden en wanneer ze ongedefinieerd zijn.

source: iteration
cs: iterace
de: Wiederholung (Iteration)
es: iteración
fr: itération
it: iterazione
ja: 反復
nl: iteratie
tr: yineleme
zh_hant: 迭代

source: iterations
cs: iterací
da: iterationer
de: Wiederholungen (Iterationen)
es: iteraciones
fr: itérations
it: iterazioni
ja: 反復
nl: iteraties
tr: yinelemeler
zh_hant: 迭代

source: In computer code, an iteration is one repetition of some process or code. We typically use the term with loops, where one iteration is one run of the loop's code.
da: I computerkode er en iteration én gentagelse af en proces eller kode. Vi bruger typisk udtrykket med løkker, hvor én iteration er én kørsel af løkkens kode.
de: Im Computercode ist eine Iteration eine Wiederholung eines Prozesses oder Codes. Wir verwenden den Begriff normalerweise mit Schleifen, wobei eine Iteration ein Durchlauf des Codes der Schleife ist.
es: En código informático, una iteración es una repetición de algún proceso o código. Solemos utilizar el término con los bucles, donde una iteración es una ejecución del código del bucle.
it: In programmazione, un'iterazione è una ripetizione dello stesso processo o codice. Di solito usiamo il temine con i cicli, dove un'iterazione è un'esecuzione del codice nel ciclo.
nl: In computercode is een iteratie een herhaling van een proces of code. We gebruiken de term meestal met lussen, waar een iteratie een herhaling is van de code in de lus.

source: When talking of algorithms, an iteration can mean a full pass of the algorithm on a data set.
da: Når man taler om algoritmer, kan en iteration betyde en fuld gennemgang af algoritmen på et datasæt.
de: Wenn man von Algorithmen spricht, kann eine Iteration einen vollständigen Durchlauf des Algorithmus auf einem Datensatz bedeuten.
es: Cuando hablamos de algoritmos, una iteración puede significar una pasada completa del algoritmo sobre un conjunto de datos.
it: Quando parliamo di algoritmi, un'iterazione può significare un'intera passata dell'algoritmo su un set di dati.
nl: Wanneer we het over algoritmes hebben, kan een iteratie een volledige doorloop van het algoritme op een verzameling gegevens betekenen.

source: vector
cs: vektor
da: vektor
de: Vektor
fr: vecteur
it: vettore
ja: ベクトル
tr: vektör
zh_hant: 向量

source: vectors
cs: vektory
da: vektorer
de: Vektoren
es: vectores
fr: vecteurs
it: vettori
ja: ベクトル
nl: vectoren
tr: vektörler
zh_hant: 向量

source: In math, a vector is a list of numbers. In games, we often use 2D and 3D vectors: respectively, lists of two and three numbers.
da: I matematik er en vektor en liste af tal. I spil bruger vi ofte 2D- og 3D-vektorer: henholdsvis lister af to og tre tal.
de: In der Mathematik ist ein Vektor eine Liste von Zahlen. In Spielen verwenden wir oft 2D- und 3D-Vektoren: Listen mit zwei bzw. drei Zahlen.
es: En matemáticas, un vector es una lista de números. En los juegos, a menudo utilizamos vectores 2D y 3D: respectivamente, listas de dos y tres números.
it: In matematica, un vettore è una lista di numeri. Nei videogiochi, usiamo spesso vettori 2D e 3D: rispettivamente, liste di due e tre numeri.
nl: In de wiskunde is een vector een lijst getallen. In spellen gebruiken we vaak 2D- en 3D-vectoren: respectievelijk lijsten van twee en drie getallen.

source: We use that to represent a direction and magnitude or intensity in space. For example, you can use a vector to represent the direction and speed at which a character or a vehicle moves.
da: Vi bruger det til at repræsentere en retning og størrelse eller intensitet i rummet. For eksempel kan du bruge en vektor til at repræsentere den retning og hastighed, hvormed en figur eller et køretøj bevæger sig.
de: Wir verwenden das, um eine Richtung und Größe oder Intensität im Raum darzustellen. Du kannst beispielsweise einen Vektor verwenden, um die Richtung und Geschwindigkeit darzustellen, mit der sich ein Charakter oder ein Fahrzeug bewegt.
es: Los utilizamos para representar una dirección y una magnitud o intensidad en el espacio. Por ejemplo, puedes utilizar un vector para representar la dirección y la rapidez a la que se mueve un personaje o un vehículo.
it: Li usiamo per rappresentare una direzione e intensità nello spazio. Per esempio, puoi usare un vettore per rappresentare la direzione e la velocità alla quale un personaggio o un velivolo si muove.
nl: We gebruiken die om een richting en grootte of intensiteit in de ruimte weer te geven. Je kunt een vector bijvoorbeeld gebruiken om de richting en snelheid weer te geven waarmee een personage of een voertuig beweegt.

source: Vectors can seem daunting at first because they are pretty abstract, but as you will see, they'll simplify code tremendously.
da: Vektorer kan virke skræmmende i starten, fordi de er ret abstrakte, men som du vil se, forenkler de kode enormt.
de: Vektoren können auf den ersten Blick entmutigend wirken, weil sie ziemlich abstrakt sind, aber wie Du sehen wirst werden sie den Code enorm vereinfachen.
es: Los vectores pueden parecer abrumadores al principio porque son bastante abstractos, pero como verás, simplificarán enormemente el código.
it: I vettori possono sembrare impegnativi all'inizio perché sono un po' astratti, ma come vedrai, semplificheranno estremamente il tuo codice.
nl: Vectoren kunnen in het begin ontmoedigend lijken omdat ze vrij abstract zijn, maar zoals je zult zien, vereenvoudigen ze code enorm.

source: argument
es: argumento
it: argomento
ja: 引数
tr: girilen değişken, girdi değişkeni, argüman
zh_hant: 引數（argument）

source: arguments
cs: argumenty
da: argumenter
de: Argumente (Parameter)
es: argumentos
it: argomenti
ja: 引数
nl: argumenten
tr: girilen değişkenler, girdi değişkenleri, argümanlar
zh_hant: 引數（argument）

source: An argument is a value that you pass to a function when calling the function. For example, in the call [code]rotate(0.5)[/code], the value [code]0.5[/code] in the parentheses is an argument.
da: Et argument er en værdi, som du sender til en funktion, når du kalder funktionen. For eksempel, i kaldet [code]rotate(0.5)[/code], er værdien [code]0.5[/code] i parentesen et argument.
de: Ein Argument ist ein Wert, den Du beim Aufrufen der Funktion an eine Funktion übergeben. Beispielsweise ist im Aufruf [code]rotate(0.5)[/code] der Wert [code]0.5[/code] in den Klammern ein Argument.
es: Un argumento es un valor que le pasas a una función cuando llamas a la función. Por ejemplo, en la llamada [code]rotate(0.5)[/code], el valor [code]0.5[/code] entre los paréntesis es un argumento.
it: Un argomento è un valore che passi ad una funzione quando la chiami. Per esempio, quando chiami [code]rotate(0.5)[/code], il valore [code]0.5[/code] tra parentesi è un argomento.
nl: Een argument is een waarde die je aan een functie meegeeft wanneer je de functie aanroept. Bijvoorbeeld, in de aanroep [code]rotate(0.5)[/code] is de waarde [code]0.5[/code] tussen de haakjes een argument.

source: A function can receive no arguments, one argument, or multiple arguments. Arguments can be mandatory or optional.
da: En funktion kan modtage ingen argumenter, ét argument eller flere argumenter. Argumenter kan være obligatoriske eller valgfrie.
de: Eine Funktion kann keine Argumente, kein Argument oder mehrere Argumente empfangen. Argumente können obligatorisch oder optional sein.
es: Una función puede no recibir ningún argumento, recibir un argumento o recibir varios argumentos. Los argumentos pueden ser obligatorios u opcionales.
it: Una funzione può anche non ricevere argomenti, riceverne uno o molteplici. Gli argomenti possono essere obbligatori o opzionali.
nl: Een functie kan geen argumenten, één argument of meerdere argumenten ontvangen. Argumenten kunnen verplicht of optioneel zijn.

source: When a function takes multiple arguments, you separate the values with commas, like in this function call: [code]jump(50, 100)[/code]
da: Når en funktion modtager flere argumenter, adskiller du værdierne med kommaer, som i dette funktionskald: [code]jump(50, 100)[/code]
de: Wenn eine Funktion mehrere Argumente akzeptiert, trennst Du die Werte durch Kommas, wie in diesem Funktionsaufruf: [code]jump(50, 100)[/code]
es: Cuando una función recibe varios argumentos, se separan los valores con comas, como en esta llamada de función: jump(50, 100).
it: Quando una funzione necessità molteplici argomenti, separi i valori con delle virgole, come nella chiamata seguente: [code]jump(50, 100)[/code].
nl: Als een functie meerdere argumenten krijgt, scheid je de waarden met komma's, zoals in deze functieaanroep: [code]jump(50, 100)[/code]

source: When [i]calling[/i] a function, we name the values passed in parentheses [i]arguments[/i].
da: Når vi [i]kalder[/i] en funktion, kalder vi de værdier, der sendes i parentes for [i]argumenter[/i].
de: Beim [i]aufrufen[/i] einer Funktion, benennen wir die übergebenen Werte in Klammern [i]Argumente[/i].
es: Al [i]llamar[/i] a una función, llamamos a los valores que se pasan entre paréntesis [i]argumentos[/i].
it: Quando [i]chiamiamo[/i] una funzione, chiamiamo i valori passati tra parentesi [i]argomenti[/i].
nl: Wanneer je een functie [i]aanroept[/i], noemen we de waarden tussen haakjes [i]argumenten[/i].

source: When writing a function definition, however, we talk about function [i]parameters[/i]. In the following example, the names [code]x[/code] and [code]y[/code] are [i]parameters[/i].
da: Når vi skriver en funktionsdefinition, taler vi dog om funktions[i]parametre[/i]. I det følgende eksempel er navnene [code]x[/code] og [code]y[/code] [i]parametre[/i].
de: Wenn wir jedoch eine Funktionsdefinition schreiben, sprechen wir von [i]Funktionsparametern[/i]. Im folgenden Beispiel sind die Namen [code]x[/code] und [code]y[/code] [i]Parameter[/i].
es: Sin embargo, al escribir una definición de función, hablamos de los [i]parámetros[/i] de la función. En el siguiente ejemplo, los nombres [code]x[/code] y [code]y[/code] son [i]parámetros[/i].
it: Tuttavia, quando definiamo una funzione, parliamo di [i]parametri[/i] della funzione. Nel seguente esempio, i nomi [code]x[/code] e [code]y[/code] sono [i]parametri[/i].
nl: Wanneer we echter een functiedefinitie schrijven, spreken we van [i]parameters[/i]. In het volgende voorbeeld zijn de namen [code]x[/code] en [code]y[/code] [i]parameters[/i].

source: arrays
cs: pole
de: Listen (Arrays)
es: matrices
fr: tableaux
it: array
ja: 配列
tr: diziler
zh_hant: 陣列

source: An array is a list of values. In GDScript, arrays can contain [i]any[/i] types of value.
da: Et array er en liste over værdier. I GDScript kan arrays indeholde [i]enhver[/i] type værdi.
de: Ein Array ist eine Liste von Werten. In GDScript können Arrays Werte [i]jeglichens[/i] Typen enthalten.
es: Una matriz, o [i]array[/i], es una lista de valores. En GDScript, las matrices pueden contener [i]cualquier[/i] tipo de valor.
it: Un array è una lista di valori. In GDScript, gli array possono contenere [i]ogni[/i] tipo di valore.
nl: Een array is een lijst van waarden. In GDScript kunnen arrays [i]elk[/i] type waarde bevatten.

source: To create an array, you write comma-separated values in square brackets: [code]var three_numbers = [1, 2, 3][/code]
da: For at oprette et array skriver du kommaseparerede værdier i firkantede parenteser: [code]var three_numbers = [1, 2, 3][/code]
de: Um ein Array zu erstellen, schreibst Du kommagetrennte Werte in eckige Klammern: [code]var three_numbers = [1, 2, 3][/code]
es: Para crear una matriz, escribes valores separados por comas entre corchetes: [code]var three_numbers = [1, 2, 3][/code].
it: Per creare un array, scrivi i valori, separati da una virgola, all'interno di parentesi quadre: [code]var three_numbers = [1, 2, 3][/code].
nl: Om een array te maken, schrijf je door komma's gescheiden waarden tussen vierkante haken: [code]var three_numbers = [1, 2, 3][/code]
