Repository: GDQuest/learn-gdscript
Catalog: i18n/*/glossary_database.po
Languages: cs, da, de, es, fr, it, ja, nl, tr, zh_hant

source: A while loop instructs the computer to keep running code based on a condition. While the condition is true, the loop keeps running.
da: En while-løkke instruerer computeren til at fortsætte med at køre kode baseret på en betingelse. Mens betingelsen er sand, fortsætter løkken med at køre.
de: Eine while-Schleife weist den Computer an, Code basierend auf einer Bedingung auszuführen. Während die Bedingung wahr ist, läuft die Schleife weiter.
es: Un bucle while le indica a la computadora que siga ejecutando código en función de una condición. Mientras la condición sea verdadera, el bucle seguirá ejecutándose.
it: Un ciclo while dice al computer di continuare ad eseguire il codice in base ad una condizione. Finché la condizione è vera, il ciclo continua.
nl: Een while-lus geeft de computer de opdracht om code te blijven uitvoeren op basis van een conditie. Zolang de conditie waar is, blijft de lus lopen.

source: When coding while loops, you must be careful: they will keep running infinitely and freeze your game if you get the condition wrong.
da: Når du koder while-løkker, skal du være forsigtig: de vil fortsætte med at køre uendeligt og fryse dit spil, hvis du får betingelsen forkert.
de: Wenn Du eine while Schleife programmierst musst Du vorsichtig sein: Sie laufen unendlich weiter und frieren Dein Spiel ein, wenn Du die Bedingung falsch aufbaust.
es: Cuando codifiques bucles while, debes tener cuidado: seguirán ejecutándose infinitamente y congelarán tu juego si te equivocas en la condición.
it: Programmando cicli while, devi stare attento: continueranno ad eseguire in modo infinito e bloccheranno il gioco se la condizione è sbagliata.
nl: Bij het coderen van while-lussen moet je voorzichtig zijn: ze blijven oneindig doorlopen en bevriezen je spel als je de verkeerde conditie gebruikt.

source: That's why we recommend using the safer for loop whenever you can.
da: Derfor anbefaler vi at bruge den mere sikre for-løkken, når du kan.
de: Aus diesem Grund empfehlen wir, wann immer möglich die sicherere for-Schleife zu verwenden.
es: Por eso recomendamos utilizar el bucle for, el cual es más seguro, siempre que puedas.
it: Ecco perchè consigliamo di usare il ciclo for, più sicuro, quando possibile.
nl: Daarom raden we aan om waar mogelijk de veiligere for-lus te gebruiken.

source: However, there are still essential cases in which we use while loops, like processing files, processing computer code, or for powerful algorithms.
da: Der er dog stadig vigtige tilfælde, hvor vi bruger while-løkker, f.eks. til behandling af filer, behandling af computerkode eller til kraftfulde algoritmer.
de: Es gibt jedoch immer noch wesentliche Fälle, in denen wir While-Schleifen verwenden, wie die Verarbeitung von Dateien, die Verarbeitung von Computercode oder für leistungsstarke Algorithmen.
es: Sin embargo, todavía hay casos esenciales en los que utilizamos los bucles while, como el procesamiento de archivos, el procesamiento de código informático o para usar algoritmos poderosos.
it: Tuttavia, ci sono sempre dei casi in cui usare i cicli while è essenziale, come per processare file, processare codice o per potenti algoritmi.
nl: Er zijn echter nog steeds essentiële gevallen waarin we while-lussen gebruiken, zoals het verwerken van bestanden, het verwerken van computercode of voor krachtige algoritmen.

source: body
cs: tělo
da: krop
es: cuerpo
fr: corps
it: corpo
ja: 体
nl: inhoud
tr: gövde
zh_hant: 主體（body）

source: We talk about a loop or a function's body to refer to the lines of code that are part of the loop or function.
cs: O těle smyčky nebo funkce hovoříme, když označujeme řádky kódu, které jsou součástí smyčky nebo funkce.
da: Vi taler om en løkke eller en funktions krop til at henvise til de kodelinjer, der er en del af løkken eller funktionen.
de: Wir sprechen über eine Schleife oder den Körper einer Funktion, um auf die Codezeilen zu verweisen, die Teil der Schleife oder Funktion sind.
es: Hablamos del cuerpo de un bucle o de una función para referirnos a las líneas de código que forman parte del bucle o de la función.
fr: On parle du corps d'une boucle ou d'une fonction pour faire référence aux lignes de code qui font partie de la boucle ou de la fonction.
it: Parliamo di corpo di una funzione o di un ciclo per riferirci alle linee di codice che sono all'interno della funzione o del ciclo.
ja: ループまたは関数の本体については、ループまたは関数の一部であるコード行を指します。
nl: We spreken van de inhoud van een lus of functie om te verwijzen naar de regels code die deel uitmaken van de lus of functie.
tr: Bir döngüden ya da bir fonksiyon'un içinden (gövdesinden) bahsederken, bir döngünün ya da fonksiyonun parçası olan kod satırlarını kastediyoruz.
zh_hant: 我們提到迴圈或函式的主體（body）是指那些屬於該迴圈或函式的程式碼行。

source: return
da: returnering
de: Rückgabe
es: devolver
fr: retour
it: ritorna
ja: 戻る
nl: teruggeven
tr: geri döndürme (return)
zh_hant: 回傳（return）

source: Returning a value is the process of sending a value to the place where you call a function.
da: At returnere en værdi er processen med at sende en værdi til det sted, hvor du kalder en funktion.
de: Die Rückgabe eines Werts ist der Prozess des Sendens eines Werts an die Stelle, an der Du eine Funktion aufrufst.
es: Devolver un valor es el proceso de enviar un valor al lugar donde se llama a una función.
it: Ritornare un valore è il processo di mandare un valore al posto in cui viene chiamata una funzione.
nl: Een waarde teruggeven is het proces waarin een waarde wordt verzonden naar de plaats waar je een functie aanroept.

source: It happens when a function uses the [code]return[/code] keyword followed by a value, for example: [code]return -1[/code].
da: Det sker, når en funktion bruger nøgleordet [code]return[/code] efterfulgt af en værdi, for eksempel: [code]return -1[/code].
de: Dies geschieht, wenn eine Funktion das Schlüsselwort [code]return[/code] gefolgt von einem Wert verwendet, z. B.: [code]return -1[/code].
es: Ocurre cuando una función utiliza la palabra clave [code]return[/code] seguida de un valor, por ejemplo: [code]return -1[/code].
it: Questo succede quando una funzione usa la parola chiave [code]return[/code] seguito da un valore, per esempio: [code]return - 1[/code] o [code]return vita[/code].
nl: Dit gebeurt wanneer een functie het sleutelwoord [code]return[/code] gebruikt gevolgd door een waarde, bijvoorbeeld: [code]return -1[/code].

source: library
cs: knihovna
da: bibliotek
de: Bibliothek
es: biblioteca
fr: bibliothèque
it: libreria
ja: ライブラリ
nl: bibliotheek
tr: kütüphane
zh_hant: 函式庫（library）

source: libraries
cs: knihovny
da: biblioteker
de: Bibliotheken
es: bibliotecas
fr: bibliothèques
it: librerie
ja: ライブラリ
nl: bibliotheken
tr: kütüphaneler
zh_hant: 函式庫（libraries）

source: A collection of valuable and reusable code bundled together by other programmers to save you time. All programmers use code libraries.
cs: Sbírka cenného a opakovaně použitelného kódu, kterou spojili dohromady jiní programátoři, aby vám ušetřili čas. Všichni programátoři používají knihovny kódu.
da: En samling af værdifuld og genanvendelig kode samlet af andre programmører for at spare dig tid. Alle programmører bruger kodebiblioteker.
de: Eine Sammlung an nützlichen und wiederverwendbaren Code der von anderen Programmierern zusammengefasst wurde um Zeit zusparen nennt man Bibliothek oder Library. Jeder nutzt sie.
es: Una colección de código valioso y reutilizable agrupado por otros programadores para ahorrarte tiempo. Todos los programadores utilizan bibliotecas de código.
fr: Une collection de code précieux et réutilisable regroupée par d'autres programmeurs pour vous faire gagner du temps. Tous les programmeurs utilisent des bibliothèques de code.
it: Una collezione di prezioso e riutilizzabile codice confezionato insieme da altri programmatori per farti salvare tempo. Tutti i programmatori usano librerie di codici.
ja: 時間を節約するために他のプログラマーによってバンドルされた貴重で再利用可能なコードのコレクション。 すべてのプログラマーはコード ライブラリを使用します。
nl: Een verzameling waardevolle en herbruikbare code gebundeld door andere programmeurs om je tijd te besparen. Alle programmeurs gebruiken codebibliotheken.
tr: Diğer programcılar tarafından, bize zaman kazandırmak için bir araya toplanmış, değerli ve tekrar kullanılabilir kod yığınlarıdır. Tüm programcılar kod kütüphaneleri kullanırlar.
zh_hant: 函式庫是由其他程式設計師整理並打包的一組有價值且可重複使用的程式碼，目的是為了節省你的時間。所有程式設計師都會使用程式碼函式庫。

source: sprites
cs: sprity
it: sprite
ja: スプライト
tr: grafik öğeler
zh_hant: 精靈（sprites）

source: In computer graphics, a sprite is an image you display on the screen. We generally use this word to talk about moving images, like a character, a monster, or an item falling on the ground.
cs: V počítačové grafice je sprite obrázek, který se zobrazuje na obrazovce. Obvykle toto slovo používáme pro pohyblivé obrázky, jako je postava, příšera nebo předmět padající na zem.
da: I computergrafik er en sprite et billede, du viser på skærmen. Vi bruger generelt dette ord til at beskrive levende billeder, som f.eks. en figur, et monster eller en genstand, der falder på jorden.
de: In Computer Grafiken nennt man Bilder die auf dem Bildschirm angezeigt werden können "Sprites". Wir nutzen dieses Wort typischerweise um über sich bewegende Bilder, wie zum Beispiel Charaktere, Monser oder Gegenstände zu reden.
es: En gráficos por computadora, un sprite es una imagen que se muestra en la pantalla. Generalmente utilizamos esta palabra para hablar de imágenes en movimiento, como un personaje, un monstruo o un objeto que cae al suelo.
fr: En infographie, un sprite est une image que vous affichez sur l'écran. On utilise généralement ce mot pour parler d'images en mouvement, comme un personnage, un monstre ou un objet qui tombe sur le sol.
it: In computer grafica, uno sprite è un'immagine che viene mostrata su schermo. In genere usiamo questa parola per parlare di immagini che cambiano con il tempo, come un personaggio, un mostro p un oggetto che cade a terra.
ja: コンピュータグラフィックスでは、スプライトは画面に表示する画像です。この言葉は一般的に、キャラクター、モンスター、地面に落ちるアイテムなどの動画について話すときに使用します。
nl: In computerafbeeldingen is een sprite een afbeelding die je op het scherm weergeeft. We gebruiken dit woord meestal om te praten over bewegende beelden, zoals een personage, een monster of een voorwerp dat op de grond valt.
tr: Bilgisayar grafiklerinde (çizimler, görseller), bir grafik öğe, ekranda gösterilen bir imgedir. Bu kelimeyi genellikle hareketli imgeler için kullanırız; bir karakter, bir canavar, ya da yere düşen bir nesne.
zh_hant: 在電腦圖形中，精靈是你顯示在螢幕上的影像。我們通常用這個詞來指代移動的影像，例如角色、怪物或掉落在地上的物品。

source: array
cs: pole
de: Liste (Array)
es: matriz
fr: tableau
ja: 配列
tr: dizi
zh_hant: 陣列

source: Member functions are functions attached to a specific value type, like arrays, strings, or dictionaries. We also call them methods. For example, arrays have member functions like [code]array.append()[/code]. You can only call the function on an array, using the access operator ([code].[/code]) to access it, as shown above.
cs: Členské funkce jsou funkce připojené k určitému typu hodnoty, jako jsou pole, řetězce nebo slovníky. Říkáme jim také metody. Například pole mají členské funkce jako [code]array.append()[/code]. Funkci můžete zavolat pouze na poli, přičemž pro přístup k ní použijete operátor přístupu ([code].[/code]), jak je uvedeno výše.
fr: Les fonctions membres sont des fonctions attachées à un type de valeur spécifique, comme des tableaux, des chaînes de caractères ou des dictionnaires. On les appelle aussi des méthodes. Par exemple, les tableaux (en anglais [i]array[/i]) ont des fonctions membres comme [code]array.append()[/code]. Vous ne pouvez appeler la fonction que sur un tableau, en utilisant l'opérateur d'accès ([code].[/code]) pour y accéder, comme indiqué ci-dessus.
ja: メンバ関数は、配列、文字列、辞書などの特定の値型に関連付けられた関数です。 それらはメソッドとも呼びます。 たとえば、配列には[code]array.append()[/code]のようなメンバ関数があります。 上記のように、アクセス演算子([code].[/code])を使用すると、配列の関数を呼び出すことができます。
tr: Üye fonksiyonlar, diziler (array), dizeler (string), ve sözlükler (dictionary) gibi belirli bir değer tipine bağlanmış fonksiyonlardır. Bunlara ayrıca metotlar da denilir. Örneğin, dizilerin [code]array.append()[/code] (arkaya ekleme) gibi üye fonksiyonları vardır. Böyle bir fonksiyonu çalıştırmak için, mesela bir dizi üzerinden erişirken, yukarıda görüldüğü gibi bir erişim işleci kullanmalısınız ([code].[/code], nokta işareti).
zh_hant: 成員函式是附加在特定值類型上的函式，例如陣列、字串或字典。我們也稱它們為方法(method)。 例如，陣列有像是 [code]array.append()[/code] 這樣的成員函式。 你只能在陣列上呼叫這些函式，並使用存取運算子（[code].[/code]）來存取它，如上所示。

source: Member variables are variables attached to a specific value type, like a vector's [code]x[/code] and [code]y[/code] sub-variables. We also call them [i]properties[/i] or [i]fields[/i] of the vector. To access a member variable, you must first write the value's name followed by the access operator ([code].[/code]). For example, [code]position.x[/code].
cs: Členské proměnné jsou proměnné připojené ke konkrétnímu typu hodnoty, jako jsou podproměnné [code]x[/code] a [code]y[/code] vektoru. Říkáme jim také [i]vlastnosti[/i] nebo [i]pole[/i] vektoru. Chcete-li získat přístup k členské proměnné, musíte nejprve napsat název hodnoty a za ním operátor přístupu ([code].[/code]). Například [code]position.x[/code].
fr: Les variables membres sont des variables attachées à un type de valeur spécifique, comme les sous-variables [code]x[/code] et [code]y[/code] d'un vecteur. On les appelle aussi [i]propriétés[/i] ou [i]champs[/i] du vecteur. Pour accéder à une variable membre, vous devez d'abord écrire le nom de la valeur suivi de l'opérateur d'accès ([code].[/code]). Par exemple, [code]position.x[/code].
ja: メンバー変数とは、ベクトルの[code]x[/code]および、[code]y[/code]といったサブ変数のように、特定の値型に関連付けられた変数です。 それらをベクトルの[i]プロパティ[/i]、または[i]フィールド[/i]とも呼びます。 メンバー変数にアクセスするには、最初に値の名前を記述して次にアクセス演算子([code].[/code])を記述する必要があります。 たとえば、[code]position.x[/code]のように記述します。
tr: Üye değişkenler, belirli bir değer tipine bağlanmış değişkenlerdir; örneğin bir vektörün (vector) [code]x[/code] ve [code]y[/code] alt-değişkenleri gibi. Bunları ayrıca değer tipinin, mesela vektörün, [i]özellikleri[/i] veya [i]alanları[/i] olarak da isimlendiririz. Bir üye değişkene erişmek için, önce ana değişken ismini ve ardından erişim işlecini ([code].[/code], nokta işareti) yazmanız gerekir. Örneğin [code]position.x[/code].
zh_hant: 成員變數是附加在特定值類型上的變數，例如向量的 [code]x[/code] 和 [code]y[/code] 子變數。我們也稱它們為向量的[b]屬性[/b]或[b]欄位[/b]。 要存取成員變數，必須先寫出值的名稱，接著使用存取運算子（[code].[/code]）。例如，[code]position.x[/code]。

source: A parameter is a variable you create as part of a function definition. It allows you to reuse the function more by having values that vary in the function's body.
cs: Parametr je proměnná, kterou vytvoříte jako součást definice funkce. Umožňuje opakované použití funkce tím, že má hodnoty, které se v těle funkce mění.
fr: Un paramètre est une variable que vous créez dans le cadre de la définition d'une fonction. Cela vous permet de réutiliser davantage la fonction en ayant des valeurs qui varient dans le corps de la fonction.
ja: パラメータは関数定義の一部として作成する変数です。 関数の本体で値を変えることで、関数をより便利に活用できます。
tr: Bir alınan değişken (parametre), bir fonksiyonun tanımının parçası olarak oluşturulan bir değişkendir. Bu bize, fonksiyon içinde değişebilen farklı değerler ile fonksiyonu farklı şekillerde yeniden kullanmamızı sağlar.
zh_hant: 參數是你在函式定義中創建的變數。 它讓你可以透過在函式內部使用不同的值來重複使用該函式。

source: A radian is a unit of measurement of angles based on the circle's circumference. We tend to use degrees more in our daily lives, but in computer programming, and especially in games, radians are common. An angle of [code]2 * PI[/code] radians corresponds to 360 degrees. And an angle of [code]PI[/code] radians corresponds to 180 degrees.
cs: Radián je jednotka pro měření úhlů na základě obvodu kruhu. V každodenním životě používáme spíše stupně, ale v počítačovém programování a zejména ve hrách se radiány používají běžně. Úhel [code]2 * PI[/code] radiánů odpovídá 360 stupňům. A úhel [code]PI[/code] radiánů odpovídá 180 stupňům.
fr: Un radian est une unité de mesure des angles basée sur la circonférence du cercle. Nous avons tendance à utiliser davantage les degrés dans notre vie quotidienne, mais en programmation informatique, et surtout dans les jeux, les radians sont courants. Un angle de [code]2 * PI[/code] radians correspond à 360 degrés. Et un angle de [code]PI[/code] radians correspond à 180 degrés.
ja: ラジアンとは、円の円周に基づく角度の測定単位です。 私たちは日常生活で度を使用する傾向がありますが、コンピュータープログラミング、特にゲームではラジアンが一般的です。 [code]2 * PI[/code]ラジアンの角度は360度に対応します。 また、[code]PI[/code]ラジアンの角度は180度に対応します。
tr: Bir radyan, bir dairenin çevresini temel alan bir açı ölçme birimidir. Günlük hayatımızda daha çok "derece" kullanmaya meyilliyiz, ama bilgisayar programcılığında ve özellikle oyunlarda, radyan daha yaygındır. [code]2 * PI[/code] radyanlık bir açı 360 dereceye karşılık gelir. Ve [code]PI[/code] radyanlık açı da 180 derecedir.
zh_hant: 弧度是根據圓周長來測量角度的單位。 我們在日常生活中比較常使用度數，但在程式設計，尤其是遊戲開發中，弧度更為常見。 [code]2 * PI[/code] 弧度等於 360 度，而 [code]PI[/code] 弧度等於 180 度。

source: In computer programming, a type is the class of a value. For example, whole numbers like [code]3[/code], [code]11[/code], and [code]255462[/code] are all of type [code]int[/code] (short for integer). The computer uses types to determine which operations are valid between two values and when they're undefined.
cs: V počítačovém programování je typ třídou hodnoty. Například celá čísla jako [code]3[/code], [code]11[/code] a [code]255462[/code] jsou všechna typu [code]int[/code] (zkratka pro celé číslo). Počítač používá typy k určení, které operace jsou platné mezi dvěma hodnotami a kdy jsou nedefinované.
fr: En programmation informatique, un type est la classe d'une valeur. Par exemple, des nombres entiers comme [code]3[/code], [code]11[/code] et [code]255462[/code] sont tous de type [code]int[/code] (abréviation du mot en anglais [i]integer[/i]), ce qui veut dire « entier ». L'ordinateur utilise les types pour déterminer quelles opérations sont valides entre deux valeurs et quand elles sont indéfinies.
ja: コンピュータプログラミングでは、型は値のクラスと言えます。 たとえば[code]3[/code]、[code]11[/code]、[code]255462[/code]などの整数はすべて[code]int[/code](integerの略)型です。 コンピュータは、型を使用して2つの値の間で有効な操作と、それらが未定義の場合を判別します。
tr: Bilgisayar programcılığında bir tip, bir değerin sınıfıdır. Mesela, [code]3[/code], [code]11[/code], ve [code]255462[/code] gibi tam sayıların hepsi [code]int[/code] (integer'ın kısaltması) tipindedir. Bilgisayarlar, iki değer arasında hangi işlemlerin geçerli olduğunu ve bunların ne zaman tanımsız olduğunu belirlerken tipleri kullanır.
zh_hant: 在程式設計中，類型是值的類別。例如像 [code]3[/code]、[code]11[/code] 和 [code]255462[/code] 這些整數都是 [code]int[/code](整數 integer 縮寫)。 電腦透過類型來判斷兩個值之間哪些運算是有效的，哪些是未定義的。

source: In computer code, an iteration is one repetition of some process or code. We typically use the term with loops, where one iteration is one run of the loop's code. When talking of algorithms, an iteration can mean a full pass of the algorithm on a data set.
cs: V počítačovém kódu je iterace opakováním nějakého procesu nebo kódu. Obvykle používáme termín se smyčkami, kde jedna iterace je jeden běh kódu smyčky. Když mluvíme o algoritmech, iterace může znamenat úplný průchod algoritmu na datové sadě.
fr: Dans le code informatique, une itération est une répétition d'un processus ou d'un code. Généralement, nous utilisons ce terme avec les boucles, où une itération est une exécution du code de la boucle. Lorsqu'on parle d'algorithmes, une itération peut signifier un passage complet de l'algorithme sur un ensemble de données.
ja: コンピュータのコード処理では、反復とはあるプロセスまたはコードの1回の繰り返し処理のことです。 通常この用語はループで使用されます。ここでは1回の反復はループでの1回分のコード処理実行です。 アルゴリズムについて話すとき、反復はデータセットに対するアルゴリズムの完全な処理実行を意味する場合があります。
tr: Bilgisayar kodunda bir yineleme, bir işlem ya da kodun bir kere tekrarlamasıdır. Bu terimi genellikle döngülerde kullanırız; bir yineleme döngüdeki kodun bir kere çalışmasıdır. Algoritmalardan bahsederken ise, bir yineleme, bir veri kümesi üzerinde algoritmanın bir tam geçiş yapması anlamını taşıyabilir.
zh_hant: 在程式碼中，迭代是某個過程或程式碼的一次重複。我們通常在迴圈中使用這個術語，其中一次迭代就是迴圈程式碼的一次執行。 在討論算法時，迭代可以指算法對資料集的完整處理一次。

source: In math, a vector is a list of numbers. In games, we often use 2D and 3D vectors: respectively, lists of two and three numbers. We use that to represent a direction and magnitude or intensity in space. For example, you can use a vector to represent the direction and speed at which a character or a vehicle moves. Vectors can seem daunting at first because they are pretty abstract, but as you will see, they'll simplify code tremendously.
cs: V matematice je vektor seznamem čísel. Ve hrách často používáme 2D a 3D vektory: seznamy dvou a tří čísel. Používáme to k reprezentaci směru a velikosti nebo intenzity v prostoru. Můžete například použít vektor k vyjádření směru a rychlosti, kterou se postava nebo vozidlo pohybuje. Vektory se mohou na první pohled zdát skličující, protože jsou dost abstraktní, ale jak uvidíte, ohromně zjednoduší kód.
fr: En mathématiques, un vecteur est une liste de nombres. Dans les jeux, nous utilisons souvent des vecteurs 2D et 3D : respectivement, des listes de deux et trois nombres. Nous les utilisons pour représenter une direction et une magnitude ou une intensité dans l'espace. Par exemple, vous pouvez utiliser un vecteur pour représenter la direction et la vitesse à laquelle un personnage ou un véhicule se déplace. Les vecteurs peuvent sembler intimidants au début car ils sont assez abstraits, mais comme vous le verrez, ils simplifieront énormément le code.
ja: 数学のベクトルは数値のリストです。 ゲームでは2Dおよび3Dベクトルを使用することがよくあります。それぞれ、2つおよび3つの数値のリストです。 これを使用して空間の方向と大きさまたは強度を表します。 たとえばベクトルを使用してキャラクター、または車両が移動する方向と速度を表すことができます。 ベクトルはかなり抽象的であるため、ちょっと難しく思えるかもしれません。でも後で分かりますがコードはとてもシンプルになります。
tr: Matematikte, bir vektör (vector) bir numara listesidir. Oyunlarda, genellikle 2B ve 3B vektörleri kullanırız; yani iki ve üç numaradan oluşan listeler. Bunları, yön ve büyüklüğü ya da uzaysal yoğunluğu betimlemek için kullanırız. Örneğin, bir karakter ya da aracın hareket yönünü ve hızını betimlerken bir vektör kullanırız. Vektörler, oldukça soyut olduklarından, ilk başta biraz caydırıcı olabilirler, ama ilerde göreceğiniz gibi, kodumuzu dehşet seviyede basitleştirirler.
zh_hant: 在數學中，向量是數字的列表。在遊戲中，我們常使用 2D 和 3D 向量，分別是兩個和三個數字的列表。 我們用向量來表示空間中的方向和大小或強度。例如，你可以使用向量來表示角色或交通工具移動的方向和速度。 向量一開始看起來可能有些令人生畏，因為它們相當抽象，但如你所見，它們會大大簡化程式碼。
