Repository: GDQuest/learn-gdscript
Catalog: i18n/*/glossary_database.po
Languages: cs, da, de, es, fr, it, ja, nl, tr, zh_hant

source: In games, we use arrays all the time to store lists of characters in a party, lists of items in inventory, lists of spells the player unlocked, and so on. They're everywhere.
da: I spil bruger vi arrays hele tiden til at gemme lister over karakterer i en gruppe, lister over genstande i lager, lister over trylleformularer, som spilleren har låst op, og så videre. De er overalt.
de: In Spielen verwenden wir ständig Arrays, um Listen von Charakteren in einer Gruppe, Listen von Gegenständen im Inventar, Listen von Zaubersprüchen, die der Spieler freigeschaltet hat, und so weiter zu speichern. Sie sind überall.
es: En los juegos, utilizamos matrices todo el tiempo para almacenar listas de personajes en un grupo, listas de objetos en el inventario, listas de hechizos que el jugador ha desbloqueado, etc. Están por todas partes.
it: Nei videogiochi, usiamo gli array praticamente sempre per conservare liste di personaggi in un gruppo, liste di oggetti nell'inventario, liste di incantesimi che il giocatore ha sbloccato e così via. Sono ovunque.
nl: In games gebruiken we vaak arrays om lijsten van personages in een groep op te slaan, lijsten van voorwerpen in de inventaris, lijsten van spreuken die de speler heeft vrijgespeeld, enzovoort. Ze zijn overal.

source: Arrays are a fundamental value type in computer programming. You'll find arrays in pretty much any programming language.
da: Arrays er en fundamental værditype i computerprogrammering. Du finder arrays i stort set alle programmeringssprog.
de: Arrays sind ein grundlegender Werttyp in der Computerprogrammierung. Du wirst Arrays in so ziemlich jeder Programmiersprache finden.
es: Las matrices son un tipo de valor fundamental en la programación informática. Encontrarás matrices en prácticamente cualquier lenguaje de programación.
it: Gli array sono una tipologia di valori fondamentale per la prgrammazione. Troverai gli array in praticamente ogni linguaggio di programmazione.
nl: Arrays zijn een fundamenteel waardentype in computerprogrammering. Je vindt arrays in vrijwel elke programmeertaal.

source: assign
cs: přiřadit
da: tildel
de: Zuweisung
es: asignar
fr: assigner
it: assegna
ja: 代入
nl: toewijzen
tr: atama
zh_hant: 指派

source: Assigning a value to a variable means that you store a value inside the variable. You do this with the equal sign ([code]=[/code]).
cs: Přiřazení hodnoty proměnné znamená, že do proměnné uložíte hodnotu. To provedete pomocí znaménka rovnosti ([code]=[/code]).
da: At tildele en værdi til en variabel betyder, at du gemmer en værdi inde i variablen. Du gør dette med lighedstegnet ([code]=[/code]).
de: Das Zuweisen eines Werts zu einer Variablen bedeutet, dass Du einen Wert in der Variablen speicherst. Das geschieht mit dem Gleichheitszeichen ([code]=[/code]).
es: Asignar un valor a una variable significa que almacenas un valor dentro de la variable. Haces esto con el signo de igual ([code]=[/code]).
fr: Assigner une valeur à une variable signifie que vous stockez une valeur à l'intérieur de la variable. Vous faites cela avec le signe égal ([code]=[/code]).
it: Assegnare un valore ad una variabile significa conservare un valore all'interno della variabile. Puoi fare questo con il simbolo di uguaglianza ([code]=[/code]).
ja: 変数に値を代入するということは、変数内に値を格納することを意味します。 これはイコール記号([code] = [/code])で行います。
nl: Een waarde toewijzen aan een variabele betekent dat je een waarde opslaat in de variabele. Je doet dit met het gelijkheidsteken ([code]=[/code]).
tr: Bir değeri bir değişkene atamak demek, bu değeri değişkenin içinde tutmak demektir. Bunun için eşitlik işareti ([code]=[/code]) kullanırsınız.
zh_hant: 將值指派給變數意味著將一個值儲存在該變數中。你可以使用等號（[code]=[/code]）來進行指派。

source: dictionary
cs: slovník
da: ordbog
de: Wörterbuch (dictionary)
es: diccionario
fr: dictionnaire
it: dizionario
ja: 辞書
tr: sözlük
zh_hant: 字典

source: dictionaries
cs: slovníky
da: ordbøger
es: diccionarios
fr: dictionnaires
it: dizionari
ja: 辞書
tr: sözlükler
zh_hant: 字典

source: A dictionary is a data structure that maps values with key-value pairs. When you give the dictionary a key, it finds and gives you back the corresponding value.
da: En ordbog er en datastruktur, der knytter værdier til nøgle-værdi-par. Når du giver ordbogen en nøgle, finder den og giver dig den tilsvarende værdi tilbage.
de: Ein Dictionary (Wörterbuch) ist eine Datenstruktur, die Werte mit Schlüssel-Wert-Paaren abbildet. Wenn Du dem Wörterbuch einen Schlüssel gibst, findet und gibt es Den entsprechenden Wert zurück.
es: Un diccionario es una estructura de datos que mapea valores con pares clave-valor. Cuando le das una clave al diccionario, éste encuentra y te devuelve el valor correspondiente.
it: Un dizionario è una struttura di dati che mappa valori in gruppi di chiave-valore. Quando dai una chiave ad un dizionario, trova e ti restituisce il valore corrispondente.
nl: Een dictionary is een datastructuur die waarden opslaat als sleutel-waarde paren. Wanneer je de dictionary een sleutel geeft, vindt hij de overeenkomstige waarde en geeft die terug.

source: In GDScript, keys can be many things. We often use text strings or numbers, but you're not limited to that. A [code]Vector2[/code] can also be a valid key, which is handy to map a grid cell to a unit or an item in a grid-based game.
da: I GDScript kan nøgler være mange ting. Vi bruger ofte tekststrenge eller tal, men du er ikke begrænset til det. En [code]Vector2[/code] kan også være en gyldig nøgle, hvilket er praktisk til at knytte en gittercelle til en enhed eller en genstand i et gitterbaseret spil.
de: In GDScript können Schlüssel viele Dinge sein. Wir verwenden oft Textzeichenfolgen oder Zahlen, aber Du bist nicht darauf beschränkt. Ein [code]Vector2[/code] kann auch ein gültiger Schlüssel sein, was praktisch ist, um eine Gitterzelle einer Einheit oder einem Element in einem rasterbasierten Spiel zuzuordnen.
es: En GDScript, las claves pueden ser muchas cosas. A menudo utilizamos cadenas de texto o números, pero las claves no se limitan solo a eso. Un [code]Vector2[/code] también puede ser una clave válida, lo que resulta útil para mapear una celda de cuadrícula a una unidad o a un objeto en un juego basado en cuadrículas.
it: In GDScript, le chiavi possono essere molte cose. Spesso usiamo stringhe di testo o numeri, ma non sei limitato solo a questi. Anche un [code]Vector2[/code] può essere usato come chiave, questo può tornare utile per mappare un'unità ad una cella di una griglia o un'oggetto in un gioco basato su griglia.
nl: In GDScript kunnen sleutels van alles zijn. We gebruiken vaak tekststrings of getallen, maar daar ben je niet toe beperkt. Een [code]Vector2[/code] kan ook een geldige sleutel zijn, wat handig is om een rastercel te koppelen aan een spelstuk of een voorwerp in een rastergebaseerd spel.

source: You will often use dictionaries to associate bits of data in your games. For example, we could use them to associate an equipment's name with its weapon stats in a database.
da: Du vil ofte bruge ordbøger til at knytte databits i dine spil. For eksempel kunne vi bruge dem til at knytte et udstyrs navn til dets våbenstatistik i en database.
de: Du wirst häufig Wörterbücher verwenden, um Datenbits in Deinem Spielen zuzuordnen. Zum Beispiel könnten wir sie verwenden, um den Namen einer Ausrüstung mit ihren Waffenstatistiken in einer Datenbank zu verknüpfen.
es: A menudo usarás los diccionarios para asociar datos en tus juegos. Por ejemplo, podríamos utilizarlos para asociar el nombre de un equipo de armas con sus estadísticas en una base de datos.
it: Userai spesso i dizionari per associare bit di dati nei tuoi giochi. Per esempio, li possiamo usare per associare il nome di un equipaggiamento con il le sue statistiche in un database.
nl: Je zult vaak dictionaries gebruiken om stukjes data te koppelen in je spellen. We kunnen ze bijvoorbeeld gebruiken om de naam van een uitrusting te koppelen aan de wapenstatistieken in een database.

source: Like arrays, they are a fundamental data type that you will see in many programming languages and use a lot.
da: Ligesom arrays er de en grundlæggende datatype, som du vil se i mange programmeringssprog og bruge meget.
de: Wie Arrays sind sie ein grundlegender Datentyp, den Sie in vielen Programmiersprachen sehen und häufig verwenden.
es: Al igual que las matrices, son un tipo de datos fundamental que verás en muchos lenguajes de programación y que utilizarás mucho.
it: Come gli array, sono una tipologia di dati fondamentale che vedrai in molti linguaggi di programmazione essere usati molto.
nl: Net als arrays zijn ze een fundamenteel datatype dat je in veel programmeertalen zult tegenkomen en veel zult gebruiken.

source: for loop
cs: smyčka for
da: for-løkke
de: for-Schleife
es: bucle for
fr: boucle for
it: ciclo for
ja: forループ
nl: for-lus
tr: for döngüsü
zh_hant: for 迴圈

source: for loops
cs: smyčky for
da: for-løkker
de: for-Schleifen
es: bucles for
fr: boucles for
it: cicli for
ja: forループ
nl: for-lussen
tr: for döngüleri
zh_hant: for 迴圈

source: A for loop instructs the computer to repeat a set of instructions once for each value in an array.
da: En for-løkke instruerer computeren til at gentage et sæt instruktioner én gang for hver værdi i et array.
de: Eine for-Schleife weist den Computer an, einen Satz von Anweisungen einmal für jeden Wert in einem Array zu wiederholen.
es: Un bucle for le indica a la computadora que repita un conjunto de instrucciones una vez por cada valor en una matriz.
it: Un ciclo for istruisce il computer a ripetere un insieme di istruzioni una volta per ogni valore in un array.
nl: Een for-lus geeft de computer de opdracht om een reeks instructies één keer te herhalen voor elke waarde in een array.

source: In each loop iteration, the compiler extracts one value from the array and gives you access to it in the loop's body.
da: I hver løkke-iteration udtrækker compileren én værdi fra arrayet og giver dig adgang til den i løkkens krop.
de: In jeder Schleifeniteration extrahiert der Compiler einen Wert aus dem Array und gibt Ihnen Zugriff darauf im Hauptteil der Schleife.
es: En cada iteración del bucle, el compilador extrae un valor de la matriz y te da acceso a él en el cuerpo del bucle.
it: Ad ogni iterazione, il compilatore estrae un valore dall'array e te ne da accesso nel corpo del ciclo.
nl: Tijdens elke ronde van de lus haalt de compiler een waarde uit de array en geeft je er toegang toe binnen de lus.

source: For loops run code a limited amount of times: one per value in the array. It is different from while loops that keep repeating code until a condition is met.
da: For-løkker køre kode et begrænset antal gange: én pr. værdi i arrayet. Det er forskelligt fra while-løkker, der bliver ved med at gentage kode, indtil en betingelse er opfyldt.
de: For Schleifen führen Code eine begrenzte Anzahl von Malen aus: eine pro Wert im Array. Es unterscheidet sich von while-Schleifen, die Code wiederholen, bis eine Bedingung erfüllt ist.
es: Los bucles for ejecutan el código una cantidad limitada de veces: una por cada valor en la matriz. Es diferente de los bucles while, que siguen repitiendo el código hasta que se cumpla una condición.
it: I cicli for eseguono il codice un numero limitato di volte: uno per ogni valore nell'array. Differisce dai cicli while che ripetono il codice a oltranza finché una condizione è raggiunta.
nl: For-lussen voeren code een beperkt aantal keer uit: één keer per waarde in de array. Dit verschilt van while-lussen die code blijven herhalen tot aan een conditie wordt voldaan.

source: We recommend favoring for loops when you can. They're safer and easier to use than while loops.
da: Vi anbefaler at foretrække for-løkker, når du kan. De er sikrere og nemmere at bruge end while-løkker.
de: Wir empfehlen, for Schleifen zu bevorzugen, wenn Du kannst sie sind sicherer und einfacher zu bedienen als While-Schleifen.
es: Recomendamos favorecer los bucles for siempre que puedas. Son más seguros y fáciles de usar que los bucles while.
it: Ti consigliamo di preferire i cicli for quando puoi. Sono più sicuri e più facili da usare rispetto ai cicli while.
nl: We raden aan om waar mogelijk de voorkeur te geven aan for-lussen. Ze zijn veiliger en gemakkelijker te gebruiken dan while-lussen.

source: function
cs: funkce
da: funktion
de: Funktion
es: función
fr: fonction
it: funzione
ja: 関数
nl: functie
tr: fonksiyon
zh_hant: 函式

source: functions
cs: funkcí
da: funktioner
de: Funktionen
es: funciones
fr: fonctions
it: funzioni
ja: 関数
nl: functies
tr: fonksiyonlar
zh_hant: 函式

source: A function is a group of code instructions you give a name. When you define a function, you can call it any time to run all the instructions it contains.
da: En funktion er en gruppe kodeinstruktioner, du giver et navn. Når du definerer en funktion, kan du til enhver tid kalde den for at køre alle de instruktioner, den indeholder.
de: Eine Funktion ist eine Gruppe von Codeanweisungen, denen Du einen Namen gibst. Wenn Du eine Funktion definierst, kannst Du sie jederzeit aufrufen, um alle darin enthaltenen Anweisungen auszuführen.
es: Una función es un grupo de instrucciones de código al que le das un nombre. Cuando defines una función, puedes llamarla en cualquier momento para ejecutar todas las instrucciones que contiene.
it: Una funzione è un gruppo di istruzioni di codice a cui attribuisci un nome. Quando definisci una funzione, la puoi chiamare ogni volta che vuoi per eseguire le istruzioni contenute al suo interno.
nl: Een functie is een groep code-instructies die je een naam geeft. Wanneer je een functie definieert, kun je deze daarna op elk moment aanroepen om alle instructies die erin staan uit te voeren.

source: You can modify a function's behavior with parameters. Parameters are variable names that you write in the function definition. You can then use them in the function's body to make your code adapt to different cases.
da: Du kan ændre en funktions adfærd med parametre. Parametre er variabelnavne, som du skriver i funktionsdefinitionen. Du kan derefter bruge dem i funktionens krop for at tilpasse din kode til forskellige tilfælde.
de: Du kannst das Verhalten einer Funktion mit Parametern ändern. Parameter sind Variablennamen, die Du in die Funktionsdefinition schreibst. Du kannst sie dann im Hauptteil der Funktion verwenden, um Deinem Code an verschiedene Fälle anzupassen.
es: Puedes modificar el comportamiento de una función con parámetros. Los parámetros son nombres de variables que escribes en la definición de la función. Luego puedes utilizarlos en el cuerpo de la función para hacer que tu código se adapte a diferentes casos.
it: Puoi modificare il comportamento di una funzione con i parametri. I parametri sono nomi di variabili che scrivi nella definizione della funzione. Li puoi usare nel corpo della funzione per far si che il codice si adatti a casi differenti.
nl: Je kunt het gedrag van een functie aanpassen met parameters. Parameters zijn namen van variabelen die je in de functiedefinitie zet. Je kunt ze dan gebruiken binnen de functie om je code aan te passen aan verschillende situaties.

source: Also, functions can optionally return a value to the code calling it.
da: Funktioner kan også valgfrit returnere en værdi til den kode, der kalder den.
de: Außerdem können Funktionen optional einen Wert an den Code zurückgeben, der ihn aufruft.
es: Además, las funciones pueden devolver opcionalmente un valor al código que lo llama.
it: Inoltre, le funzioni eventualmente possono ritornare un valore al codice che lo sta chiamando.
nl: Functies kunnen ook optioneel een waarde teruggeven aan de code die de functie aanroept.

source: increment
cs: přírůstek
da: forøgelse
de: Inkrement
es: incremento
fr: incrément
it: incremento
ja: インクリメント
nl: verhoging
tr: artış
zh_hant: 遞增

source: increments
cs: přírůstky
da: forøgelser
de: Inkrements
es: incrementos
fr: incréments
it: incrementi
ja: インクリメント
nl: verhogingen
tr: artışlar
zh_hant: 遞增

source: An increment is the amount by which a value changes in your code.
cs: Přírůstek je hodnota, o kterou se změní hodnota v kódu.
da: En forøgelse er den mængde, som en værdi ændres med i din kode.
de: Ein Inkrement ist der Betrag, um den sich ein Wert im Code ändert.
es: Un incremento es la cantidad por la cual cambia un valor en tu código.
fr: Un incrément est la quantité par laquelle une valeur change dans votre code.
it: Un incremento è la quantità con cui viene cambiato un valore nel tuo codice.
ja: インクリメントとはコードの中で値が変化する量のことです。
nl: Een verhoging is de hoeveelheid waarmee een waarde verandert in je code.
tr: Bir artış, kodunuzdaki bir değerin değişme miktarıdır.
zh_hant: 遞增是指程式碼中一個值變動的量。

source: instruction
cs: instrukce
da: instruktion
de: Anweisung
es: instrucción
it: istruzione
ja: 命令
nl: instructie
tr: talimat
zh_hant: 指令

source: instructions
cs: instrukce
da: instruktioner
de: Anweisungen
es: instrucciones
it: istruzioni
ja: 命令
nl: instructies
tr: talimatlar
zh_hant: 指令

source: In computer programming, instructions are a single operation the computer recognizes and can execute.
da: I computerprogrammering er instruktioner en enkelt operation, som computeren genkender og kan udføre.
de: In der Computerprogrammierung sind Anweisungen eine einzelne Operation, die der Computer erkennt und ausführen kann.
es: En la programación informática, las instrucciones son una operación única que la computadora reconoce y puede ejecutar.
it: In programmazione, le istruzioni sono una singola operazione che il computer riconosce e può eseguire.
nl: In computerprogrammering zijn instructies een enkele bewerking die de computer herkent en kan uitvoeren.

source: For example, a function call, an addition, or assigning a value to a variable.
da: For eksempel et funktionskald, en addition eller tildeling af en værdi til en variabel.
de: Zum Beispiel ein Funktionsaufruf, eine Addition oder das Zuweisen eines Werts zu einer Variablen.
es: Por ejemplo, una llamada a una función, una suma o la asignación de un valor a una variable.
it: Per esempio, la chiamata di una funzione, un'addizione o l'assegnazione di un valore ad una variabile.
nl: Bijvoorbeeld een functieaanroep, een optelling of het toewijzen van een waarde aan een variabele.

source: variable
cs: proměnná
da: variabel
it: variabile
ja: 変数
nl: variabele
tr: değişken
zh_hant: 變數

source: variables
cs: proměnné
da: variabler
de: Variablen
it: variabili
ja: 変数
nl: variabelen
tr: değişkenler
zh_hant: 變數

source: Variables are a tool to give a name to values you want to store in your code and change over time.
da: Variabler er et værktøj til at give et navn til værdier, du vil gemme i din kode, og som ændrer sig over tid.
de: Variablen sind ein Tool, um Werten, die Du in deinem Code speicherst und im Laufe der Zeit ändern möchtest, einen Namen zu geben.
es: Las variables son una herramienta para dar un nombre a los valores que quieras almacenar en tu código y que quieras cambiar con el tiempo.
it: Le variabili sono uno strumento utilizzato per dare un nome a valori che vuoi conservare nel tuo codice e vuoi cambiare nel tempo.
nl: Variabelen zijn een hulpmiddel waarmee je een naam kunt geven aan waarden die je wilt opslaan in je code en die in de loop van de tijd wilt kunnen veranderen.

source: For example, a character's health: when the character takes a hit, you want it to go down. When healing, you want the health to go back up.
da: For eksempel en figurs liv: Når figuren bliver ramt, skal den falde. Når den heler, skal livet stige igen.
de: Zum Beispiel das Leben eines Charakters: Wenn der Charakter einen Treffer erleidet, möchtest Du, dass es sinkt. Wenn Du heilst, möchtest Du, dass das Leben wieder steigt.
es: Por ejemplo, la salud de un personaje: cuando el personaje reciba un golpe, quieres que la salud baje. Cuando el personaje se cure, quieres que la salud vuelva a subir.
it: Per esempio, la vita di un personaggio: quando un personaggio viene colpito, vuoi farlo perire. Quando ti curi, vuoi che la vita risalga.
nl: Bijvoorbeeld de gezondheid van een personage: als het personage een geraakt wordt, wil je dat de gezondheid afneemt. Als het personage geneest, wil je dat de gezondheid weer toeneemt.

source: You can create a variable named [code]health[/code] to represent the health.
da: Du kan oprette en variabel med navnet [code]health[/code] for at repræsentere livet.
de: Du kannst eine Variable mit dem Namen [code]health[/code] erstellen, um das Leben darzustellen.
es: Puedes crear una variable llamada [code]health[/code] para representar la salud.
it: Puoi creare una variabile chiamata [code]vita[/code] per rappresentare la vita.
nl: Je kunt een variabele maken met de naam [code]health[/code] om de gezondheid weer te geven.

source: Then, every time you write the keyword [code]health[/code] in your code, the computer will fetch the corresponding value in its memory for you.
da: Hver gang du skriver nøgleordet [code]health[/code] i din kode, henter computeren den tilsvarende værdi i sin hukommelse for dig.
de: Jedes Mal, wenn Du das Schlüsselwort [code]health[/code] in deinem Code schreibst, ruft der Computer den entsprechenden Wert in seinem Speicher für Dich ab.
es: Entonces, cada vez que escribas la palabra clave [code]health[/code] en tu código, la computadora buscará el valor correspondiente en su memoria para ti.
it: Così, ogni volta che scrivi la parola chiave [code]vita[/code] nel tuo codice, il computer recupererà il valore corrispondente dalla sua memoria per te.
nl: Vervolgens, elke keer dat je het woord [code]health[/code] in je code schrijft, zal de computer de corresponderende waarde voor je ophalen uit het geheugen.

source: Variables work a bit like product labels in a supermarket. They are names that you attach to some value. Any time, you can take the label and stick it onto a new product or, in that case, a new value.
da: Variabler fungerer lidt ligesom produktetiketter i et supermarked. De er navne, som du knytter til en værdi. Du kan til enhver tid tage etiketten og sætte den på et nyt produkt eller i så fald en ny værdi.
de: Variablen funktionieren ein bisschen wie Produktetiketten in einem Supermarkt. Es sind Namen, denen Du einen bestimmten Wert gibst. Du kannst das Etikett jederzeit nehmen und es auf ein neues Produkt oder in diesem Fall einen neuen Wert kleben.
es: Las variables funcionan un poco como las etiquetas de los productos en un supermercado. Son nombres que adjuntas a algún valor. En cualquier momento, puedes tomar la etiqueta y pegarla en un nuevo producto o, en este caso, en un nuevo valor.
it: Le variabili funzionano un po' come le etichette sui prodotti al supermercato. Sono nomi che attacchi a del valore. Quando vuoi, puoi prendere l'etichetta e attaccarla ad un nuovo prodotto o in questo caso, un nuovo valore.
nl: Variabelen werken een beetje zoals productlabels in een supermarkt. Het zijn namen die je aan een waarde koppelt. Op elk moment kun je het label verwijderen en het op een nieuw product plakken ofwel, in dit geval, een nieuwe waarde.

source: while loop
cs: smyčka while
da: while-løkke
de: while-Schleife
es: bucle while
fr: boucle while
it: ciclo while
ja: whileループ
nl: while-lus
tr: while döngüsü
zh_hant: while 迴圈

source: while loops
cs: smyčky while
da: while-løkker
de: while-Schleifen
es: bucles while
fr: boucles while
it: cicli while
ja: whileループ
nl: while-lussen
tr: while döngüleri
zh_hant: while 迴圈
