Repository: GDQuest/learn-gdscript
Catalog: i18n/*/glossary_database.po
Languages: cs, da, de, es, fr, it, ja, nl, tr, zh_hant

source: An argument is a value that you pass to a function when calling the function. For example, in the call [code]rotate(0.5)[/code], the value [code]0.5[/code] in the parentheses is an argument. A function can receive no arguments, one argument, or multiple arguments. Arguments can be mandatory or optional. When a function takes multiple arguments, you separate the values with commas, like in this function call: [code]jump(50, 100)[/code] When [i]calling[/i] a function, we name the values passed in parentheses [i]arguments[/i]. When writing a function definition, however, we talk about function [i]parameters[/i]. In the following example, the names [code]x[/code] and [code]y[/code] are [i]parameters[/i].
cs: Argument je hodnota, kterou předáváte funkci při jejím volání. Například ve volání [code]rotate(0,5)[/code] je argumentem hodnota [code]0,5[/code] v závorce. Funkce může přijímat žádné argumenty, jeden argument nebo více argumentů. Argumenty mohou být povinné nebo nepovinné. Pokud funkce přijímá více argumentů, oddělujete hodnoty čárkami, jako v tomto volání funkce: [code]jump(50, 100)[/code]. Při [i]volání[/i] funkce pojmenováváme předávané hodnoty v závorkách [i]argumenty[/i]. Při psaní definice funkce však hovoříme o parametrech funkce [i]parametry[/i]. V následujícím příkladu jsou názvy [code]x[/code] a [code]y[/code] [i]parametry[/i].
fr: Un argument est une valeur que vous passez à une fonction lors de l'appel de la fonction. Par exemple, dans l'appel de [code]rotate(0.5)[/code], la valeur [code]0.5[/code] entre les parenthèses est un argument. Une fonction peut ne recevoir aucun argument, un argument ou plusieurs arguments. Les arguments peuvent être obligatoires ou facultatifs. Lorsqu'une fonction reçoit plusieurs arguments, vous séparez les valeurs par des virgules, comme dans cet appel de fonction : [code]jump(50, 100)[/code] Lors de [i]l'appel[/i] d'une fonction, on appelle les valeurs passées entre parenthèses des [i]arguments[/i]. Cependant, lors de l'écriture d'une définition de fonction, nous parlons des [i]paramètres[/i] de la fonction. Dans l'exemple suivant, les noms [code]x[/code] et [code]y[/code] sont des [i]paramètres[/i].
ja: 引数とは関数を呼び出すときに渡す値です。 たとえば[code]rotate(0.5)[/code]の呼び出しでは、括弧内の値[code]0.5[/code]は引数です。 関数は引数なし、もしくは1つから複数の引数を受け取ることができます。 引数は必須またはオプションにすることができます。 関数が複数の引数を受け取る場合は、次の関数呼び出しのように、値をカンマで区切ります： [code]jump(50,100)[/code]のようにします。 関数を[i]呼び出す[/i]ときは、括弧内に渡される[i]引数[/i]の値に名前を付けます。 関数定義を作成する時の、関数の[i]パラメーター[/i]について説明します。 次の例では、名前[code]x[/code]と[code]y[/code]は[i]パラメータ[/i]です。
tr: Bir girilen değişken (argüman), bir fonksiyonu çağırırken, fonksiyona girdiğiniz değerlerdir. Örneğin, [code]rotate(0.5)[/code] çağırmasında, parantez içindeki [code]0.5[/code] değeri bir girilen değişkendir. Bir fonksiyon hiçbir değer almayabileceği gibi, tek bir değer ya da çoklu değerler de alabilir. Girilen değişkenler zorunlu ya da isteğe bağlı olabilirler. Bir fonksiyon çoklu değerler bekliyorsa, değerleri virgül ile ayırmalısınız; mesela bu çağrıda olduğu gibi [code]jump(50, 100)[/code] Bir fonksiyonu [i]çağırırken[/i], parantez içine girdiğimiz değerlere [i]girilen değişken (argüman)[/i] ismini veriyoruz. Buna karşılık, bir fonksiyon tanımını yazarken, fonksiyonun [i]alınan değişkenleri (parameterler)[/i]'nden bahsederiz. Sıradaki örnekte, [code]x[/code] ve [code]y[/code] [i]alınan değişken (parametre)[/i]'lerdir.
zh_hant: 引數是你在呼叫函式時傳遞給函式的值。例如，在呼叫 [code]rotate(0.5)[/code] 時，括號中的值 [code]0.5[/code] 就是引數。 函式可以接收零個、一个或多個引數。引數可以是必要的，也可以是選擇性的。 當一個函式接受多個引數時，你可以用逗號將值分開，就像這個函式呼叫：[code]jump(50, 100)[/code]。 當[b]呼叫[/b]函式時，我們稱傳遞進括號中的值為 [ i]引數[/b]。 然而，在寫函式定義時，我們討論的是函式[b]參數（parameters）[/b]。在以下範例中，[code]x[/code] 和 [code]y[/code] 是[b]參數[/b]。

source: An array is a list of values. In GDScript, arrays can contain [i]any[/i] types of value. To create an array, you write comma-separated values in square brackets: [code]var three_numbers = [1, 2, 3][/code] In games, we use arrays all the time to store lists of characters in a party, lists of items in inventory, lists of spells the player unlocked, and so on. They're everywhere. Arrays are a fundamental value type in computer programming. You'll find arrays in pretty much any programming language.
cs: Pole je seznam hodnot. V jazyce GDScript mohou pole obsahovat hodnoty [i]jakéhokoli[/i] typu. Pole vytvoříte tak, že hodnoty oddělené čárkami zapíšete do hranatých závorek: [code]var three_numbers = [1, 2, 3][/code]. Ve hrách používáme pole neustále k ukládání seznamů postav v partě, seznamů předmětů v inventáři, seznamů kouzel, která hráč odemkl, a podobně. Jsou všude. Pole jsou základním hodnotovým typem v počítačovém programování. Pole najdete v podstatě v každém programovacím jazyce.
fr: Un tableau (en anglais [i]array[/i]) est une liste de valeurs. Dans GDScript, les tableaux peuvent contenir [i]n'importe quel[/i] type de valeur. Pour créer un tableau, vous écrivez des valeurs séparées par des virgules entre crochets : [code]var three_numbers = [1, 2, 3][/code] Dans les jeux, nous utilisons des tableaux tout le temps pour stocker des listes de personnages dans un groupe, des listes d'objets dans l'inventaire, des listes de sorts que le joueur a débloqués, etc. Ils sont partout. Les tableaux sont un type de valeur fondamental dans la programmation informatique. Vous trouverez des tableaux dans presque tous les langages de programmation.
ja: 配列は値のリストです。 GDScriptでは配列には[i]任意の[/i]タイプの値を含めることができます。 配列を作成するには、角かっこでコンマ区切りの値を記述します。[code] var three_numbers = [1, 2, 3] [/code] ゲームでは配列を使用して、パーティーのキャラクターのリスト、インベントリ内のアイテムのリスト、プレーヤーがロック解除した呪文のリストなどを保存します。 配列はいたるところで使われます。 配列はコンピュータープログラミングの基本的な型です。 配列はほとんどすべてのプログラミング言語で見つかります。
tr: Bir dizi, bir değerler listesidir. GDScript'te, diziler [i]herhangi[/i] bir değer tipini taşıyabilirler. Bir dizi oluşturmak için, köşeli parantez içinde virgülle-ayrılmış değerler yazarsınız: [code]var three_numbers = [1, 2, 3][/code] Oyunlarda, dizileri sürekli kullanırız; bir takımdaki karakterleri listelemek, envanterdeki öğelerin listesini tutmak, oyuncunun kilidini açtığı büyülerin listesini saklamak ve örnekler uzar gider. Bunlar her yerdeler. Diziler, bilgisayar programcılığının en temel değer tiplerinden biridir. Dizileri, belki de her tür programlama dilinde bulabilirsiniz.
zh_hant: 陣列是值的列表。在 GDScript 中，陣列可以包含[b]任何[/b]類型的值。 要創建陣列，你可以在方括號中寫下用逗號分隔的值：[code]var three_numbers = [1, 2, 3][/code] 在遊戲中，我們經常使用陣列來儲存角色隊伍的列表、背包中的物品列表、玩家解鎖的魔法列表等等。它們無處不在。 陣列是程式設計中一個基本的值類型。你幾乎會在任何程式語言中找到陣列。

source: A dictionary is a data structure that maps values with key-value pairs. When you give the dictionary a key, it finds and gives you back the corresponding value. In GDScript, keys can be many things. We often use text strings or numbers, but you're not limited to that. A [code]Vector2[/code] can also be a valid key, which is handy to map a grid cell to a unit or an item in a grid-based game. You will often use dictionaries to associate bits of data in your games. For example, we could use them to associate an equipment's name with its weapon stats in a database. Like arrays, they are a fundamental data type that you will see in many programming languages and use a lot.
cs: Slovník je datová struktura, která mapuje hodnoty pomocí párů klíč–hodnota. Když dáte slovníku klíč, najde a vrátí vám odpovídající hodnotu. V GDScriptu mohou být klíče mnoho věcí. Často používáme textové řetězce nebo čísla, ale nejste tím omezeni. [code]Vector2[/code] může být také platným klíčem, který je užitečný pro mapování buňky mřížky na jednotku nebo předmět ve hře založené na mřížce. K přiřazení bitů dat ve vašich hrách budete často používat slovníky. Mohli bychom je například použít k přiřazení názvu zařízení k jeho statistikám zbraní v databázi. Stejně jako pole jsou slovníky základním datovým typem, který uvidíte v mnoha programovacích jazycích a budete ho hodně používat.
fr: Un dictionnaire est une structure de données qui met en correspondance, ou « mappe », des valeurs avec des paires clé-valeur. Lorsque vous donnez une clé au dictionnaire, il trouve et vous rend la valeur correspondante. Dans GDScript, les clés peuvent être plusieurs choses. Nous utilisons souvent des chaînes de texte ou des nombres, mais vous n'es pas limité(e) à cela. Un [code]Vector2[/code] peut aussi être une clé valide, ce qui est pratique pour mapper une cellule de grille à une unité ou un élément dans un jeu basé sur une grille. Vous utiliserez souvent des dictionnaires pour associer des données dans vos jeux. Par exemple, nous pourrions les utiliser pour associer le nom d'un équipement à ses statistiques dans une base de données. Comme les tableaux, ils sont un type de données fondamental que vous verrez dans de nombreux langages de programmation et que vous utiliserez beaucoup.
ja: 辞書は値をキーと値のペアでマップするデータ構造の型です。 辞書にキーを与えると、対応する値が検出されて返されます。 GDScriptではキーは様々な型が使用可能です。 通常はテキスト文字列や数字をよく使用しますが、それに限定されません。 [code] Vector2 [/code]も有効なキーにすることができます。これは例えばグリッドベースのゲームでグリッドセルをユニットまたはアイテムにマッピングするときに便利です。 多くの場合、辞書を使用してゲーム内のデータの一部を関連付けます。例えば装備している武器の名前をデータベース内の武器データに関連付けることができます。 配列と同様、辞書は多くのプログラミング言語で見られ、よく使用される基本的なデータ型です。
tr: Bir sözlük, verilen değerleri, anahtar-değer çifti şeklinde haritalayan veri yapılarıdır. Bir sözlüğe bir anahtar verdiğinizde, karşılık olarak size, eşleşen değeri bulup geri döndürür. GDScript'te, anahtarlar birçok şey olabilir. Genellikle yazı dizeleri ya da numaralar kullanırız, ama bununla sınırlı değilsiniz. Bir [code]Vector2[/code] de geçerli anahtar olabilir; ızgara-temelli bir oyunda, bir ızgara hücresini bir birime ya da bir öğeye haritalamak oldukça kullanışlı olur. Oyunlarınızda veri parçalarını ilişkilendirmek için sözlükleri sıklıkla kullanacaksınız. Örneğin, bir ekipmanın adını, onun veri tabanındaki silah bilgileri ile ilişkilendirmek için kullanabiliriz. Sözlükler, diziler gibi, birçok programlama dilinde görebileceğiniz ve sıklıkla kullanacağınız en temel veri tiplerinden biridir.
zh_hant: 字典是一種資料結構，透過鍵值對來映射值。當你提供字典一個鍵時，它會找到並回傳對應的值。 在 GDScript 中，鍵可以是許多不同的東西。我們常使用文字字串或數字，但不僅限於這些。像是 [code]Vector2[/code] 也可以作為有效的鍵，這在將格子座標映射到單位或在基於格子的遊戲中映射物品時非常有用。 你會經常在遊戲中使用字典來關聯資料。例如，我們可以用它來將裝備的名稱與其武器數值在資料庫中對應起來。 像陣列一樣，字典是程式語言中一個基本的資料型別，你會在許多程式語言中看到並大量使用它。

source: A for loop instructs the computer to repeat a set of instructions once for each value in an array. In each loop iteration, the compiler extracts one value from the array and gives you access to it in the loop's body. For loops run code a limited amount of times: one per value in the array. It is different from while loops that keep repeating code until a condition is met. We recommend favoring for loops when you can. They're safer and easier to use than while loops.
cs: Smyčka for dává počítači pokyn, aby pro každou hodnotu v poli jednou zopakoval sadu instrukcí. V každé iteraci cyklu kompilátor z pole vybere jednu hodnotu a zpřístupní ji v těle cyklu. Smyčky for spouštějí kód daný počet opakování: jednou na každou hodnotu v poli. Tím se liší od smyček while, které opakují kód, dokud není splněna podmínka. Doporučujeme upřednostňovat smyčky for, pokud to jde. Jsou bezpečnější a snadněji použitelné než smyčky while.
fr: Une boucle for demande à l'ordinateur de répéter un ensemble d'instructions une fois pour chaque valeur d'un tableau. À chaque itération de la boucle, le compilateur extrait une valeur du tableau et vous y donne accès dans le corps de la boucle. Les boucles for exécutent le code un nombre limité de fois : une par valeur du tableau. Elles sont différentes des boucles while qui continuent à répéter le code jusqu'à ce qu'une condition soit remplie. Nous vous recommandons de privilégier les boucles for lorsque cela est possible. Elles sont plus sûres et plus faciles à utiliser que les boucles while.
ja: forループは配列内の値ごとに一連の命令を繰り返し行うようにコンピューターに指示します。 ループの反復ごとにコンパイラは配列から1つの値を取り出し、ループの本体でその値にアクセスできるようにします。 forループの場合、コードを実行する回数は配列内の値ごとに1回です。 これは条件が満たされるまでコードを繰り返し続けるwhileループとは異なります。 できるだけforループを優先して使用することをお勧めします。 forループはwhileループより安全で使いやすくなっています。
tr: Bir "for" döngüsü, bilgisayara, bir dizinin içindeki her bir değer için bir kere olmak üzere, bir talimat setini yinelemesini emreder. Her bir döngü yinelemesinde, derleyici, diziden bir değer çeker ve döngü içerisinde buna erişmeyi sağlar. "for" döngüleri, kodu belli bir sayıda çalıştırır; dizideki her bir değer için bir kere. Bu döngü tipi, belli bir şart sağlanana kadar tekrar eden "while" döngüsünden farklıdır. Mümkün oldukça "for" döngülerini tercih etmenizi öneririz. Hem daha güvenli hem de kullanımı "while" döngülerinden kolaydır.
zh_hant: for 迴圈指示電腦對陣列中的每個值重複執行一組指令一次。 在每次迴圈迭代中，編譯器會從陣列中提取一個值並讓你在迴圈的主體中使用它。 for 迴圈執行程式碼的次數是有限的：每個陣列中的值執行一次。這與 while 迴圈不同，後者會一直重複程式碼直到符合條件為止。 我們建議在可能的情況下使用 for 迴圈。它比 while 迴圈更安全且更容易使用。

source: A function is a group of code instructions you give a name. When you define a function, you can call it any time to run all the instructions it contains. You can modify a function's behavior with parameters. Parameters are variable names that you write in the function definition. You can then use them in the function's body to make your code adapt to different cases. Also, functions can optionally return a value to the code calling it.
cs: Funkce je skupina instrukcí kódu, které pojmenujete. Když definujete funkci, můžete ji kdykoli zavolat a spustit všechny pokyny, které obsahuje. Chování funkce můžete upravit pomocí parametrů. Parametry jsou názvy proměnných, které zapíšete do definice funkce. Pak je můžete použít v těle funkce, aby se váš kód přizpůsobil různým případům. Funkce mohou také volitelně vrátit hodnotu kódu, který ji volá.
fr: Une fonction est un groupe d'instructions de code auquel vous donnez un nom. Quand vous définissez une fonction, vous pouvez l'appeler à tout moment pour exécuter toutes les instructions qu'elle contient. Vous pouvez modifier le comportement d'une fonction avec des paramètres. Les paramètres sont des noms de variables que vous écrivez dans la définition de la fonction. Vous pouvez ensuite les utiliser dans le corps de la fonction pour adapter votre code à différents cas. De plus, les fonctions peuvent éventuellement retourner une valeur au code qui l'appelle.
ja: 関数は名前が付けられた命令コードのグループです。 関数を定義すれば、いつでも呼び出すことができ、関数に含まれるすべての命令を実行できます。 パラメータを使用して関数の動作を変更できます。 パラメータは関数定義に一緒に書かれる変数のことです。 次にパラメータを関数の本体で使用して、コードを様々な用途に適応させることができます。 また、関数はオプション的に呼び出し側のコードに値を返すことができます。
tr: Bir fonksiyon, bir isim altında topladığınız gruplanmış kod talimatlarıdır. Bir fonksiyon bir kez tanımladığınızda, içindeki tüm talimatları çalıştırmak için ne zaman isterseniz çağırabilirsiniz. Bir fonksiyonun davranışını, alınan değişkenler (parametreler) ile değiştirebilirsiniz. Bunlar fonksiyon tanımında yazdığınız değişken isimleridir. Bunları fonksiyon içerisinde, kodunuzu farklı durumlara uyarlamak için kullanabilirsiniz. Ayrıca fonksiyonlar, isteğe bağlı olarak, geriye değer de döndürebilirler.
zh_hant: 函式是你為一組程式碼指令指定的名稱。當你定義一個函式後，你可以隨時呼叫它來執行其中所有的指令。 你可以透過參數來修改函式的行為。參數是你在函式定義中寫的變數名稱，然後你可以在函式的主體中使用它們，使程式碼能夠適應不同的情況。 此外，函式也可以選擇性地將一個值回傳給呼叫它的程式碼。

source: In computer programming, instructions are a single operation the computer recognizes and can execute. For example, a function call, an addition, or assigning a value to a variable.
cs: V počítačovém programování představují instrukce jednotlivé operace, které počítač rozpozná a může provést. Například volání funkce, sčítání nebo přiřazení hodnoty proměnné.
fr: En programmation informatique, les instructions sont une opération unique que l'ordinateur reconnaît et peut exécuter. Par exemple, un appel de fonction, une addition ou l'attribution d'une valeur à une variable.
ja: コンピュータプログラミングにおいて、命令とはコンピュータが識別して実行できる1つの処理のこと。 例えば、関数呼び出し、加算、変数に値を代入することなどがある。
tr: Bilgisayar programcılığında, talimatlar, bilgisayarın tanıdığı ve çalıştırabileceği tekil işlemlerdir. Örneğin, bir fonksiyon çağırma, toplama işlemi yapma, ya da bir değişkene değer atamak gibi.
zh_hant: 在程式設計中，指令是電腦可以識別並執行的單一操作。 例如函式呼叫、加法運算、或是將值指派給變數。

source: Variables are a tool to give a name to values you want to store in your code and change over time. For example, a character's health: when the character takes a hit, you want it to go down. When healing, you want the health to go back up. You can create a variable named [code]health[/code] to represent the health. Then, every time you write the keyword [code]health[/code] in your code, the computer will fetch the corresponding value in its memory for you. Variables work a bit like product labels in a supermarket. They are names that you attach to some value. Any time, you can take the label and stick it onto a new product or, in that case, a new value.
cs: Proměnné jsou nástrojem pro pojmenování hodnot, které chcete uložit do kódu a v průběhu času je měnit. Například zdraví postavy: když postava dostane zásah, chcete, aby šel dolů. Při léčení chcete, aby se zdraví vrátilo nahoru. Můžete vytvořit proměnnou s názvem [code]health[/code], která bude reprezentovat zdraví. Poté, pokaždé, když do kódu napíšete klíčové slovo [code]health[/code], počítač za vás načte odpovídající hodnotu ve své paměti. Proměnné fungují trochu jako štítky produktů v supermarketu. Jsou to jména, kterým přikládáte nějakou hodnotu. Kdykoli můžete vzít štítek a nalepit jej na nový produkt nebo v takovém případě na novou hodnotu.
fr: Les variables sont un outil pour donner un nom aux valeurs que vous souhaitez stocker dans votre code et changer au fil du temps. Par exemple, la santé d'un personnage : lorsque le personnage prend un coup, vous voulez qu'elle diminue. Lorsque le personnage se soigne, vous voulez que la santé remonte. Vous pouvez créer une variable nommée [code]health[/code] pour représenter la santé. Ensuite, chaque fois que vous écrivez le mot-clé [code]health[/code] dans votre code, l'ordinateur va chercher la valeur correspondante dans sa mémoire pour vous. Les variables fonctionnent un peu comme les étiquettes des produits d'un supermarché. Ce sont des noms que vous attachez à une certaine valeur. À tout moment, vous pouvez prendre l'étiquette et la coller sur un nouveau produit ou, dans ce cas, sur une nouvelle valeur.
ja: 変数は、コードに保存して時間の経過とともに変更する値に名前を付けるツールです。 たとえば、キャラクターの体力: キャラクターが攻撃を受けたとき、体力を低下させたいと考えます。 治癒するときは、体力を回復したいと考えます。 体力状態を表す [code]health[/code] という名前の変数を作成できます。 その後、コードにキーワード [code]health[/code] を書き込むたびに、コンピューターはメモリ内の対応する値を取得します。 変数は、スーパーマーケットの商品の名前に似た働きをします。 変数は、何らかの値に付ける名前です。 いつでも名前の値を取得、または新しい名前に値を貼り付けることができます。
tr: Değişkenler, kodunuzun içinde saklamak istediğiniz ve zamanla değişebilen değerlere isim vermeye yarayan araçlardır. Örneğin, bir karakterin sağlığı gibi: karakter hasar aldığı zaman, sağlığının azalmasını istersiniz. İyileşmesi durumunda, sağlığının tekrar artmasını istersiniz. Sağlığı temsil etmesi için [code]health[/code](sağlık) isminde bir değişken oluşturabilirsiniz. Bundan sonra kodunuzda, ne zaman klavyeden [code]health[/code] yazarsanız, bilgisayar hafızasında karşılık gelen değeri sizin için bulup getirecektir. Değişkenler, süper marketlerdeki ürün etiketlerine biraz benzer. Bir değere iliştirdiğimiz isimlerdir. Herhangi bir zamanda, etiketi çıkartıp başka bir ürüne, ya da bu durumda yeni bir değere, yapıştırabilirsiniz.
zh_hant: 變數是一種工具，用來為你想要在程式中儲存並隨時間變動的值取的名字。 例如，角色的生命值：當角色受到攻擊時，你希望它下降；當治療時，你希望生命值回升。 你可以創建一個名為 [code]health[/code] 的變數來表示生命值。 然後，每當你在程式碼中寫下關鍵字 [code]health[/code] 時，電腦就會從記憶體中抓取對應的值。 變數有點像超市中的產品標籤。它們是你附加在某個值上的名稱。任何時候，你都可以將標籤取下並貼到新的產品上，或者在這個情況就是貼到新的值上。

source: A while loop instructs the computer to keep running code based on a condition. While the condition is true, the loop keeps running. When coding while loops, you must be careful: they will keep running infinitely and freeze your game if you get the condition wrong. That's why we recommend using the safer for loop whenever you can. However, there are still essential cases in which we use while loops, like processing files, processing computer code, or for powerful algorithms.
cs: Smyčka while dává počítači pokyn, aby ponechal spuštěný kód na základě podmínky. Pokud je podmínka pravdivá, smyčka běží dál. Při kódování smyček while musíte být opatrní: poběží nekonečně dlouho a zmrazí vaši hru, pokud podmínku uděláte špatně. Proto doporučujeme používat bezpečnější smyčku for, kdykoli je to možné. Stále však existují zásadní případy, kdy smyčky while používáme, jako je zpracování souborů, zpracování počítačového kódu nebo pro výkonné algoritmy.
fr: Une boucle while demande à l'ordinateur de continuer à exécuter du code en fonction d'une condition. Tant que la condition est vraie, la boucle continue de s'exécuter. Lorsque vous codez des boucles while, vous devez faire attention : elles continueront à s'exécuter à l'infini et gèleront votre jeu si vous vous trompez de condition. C'est pourquoi nous vous recommandons d'utiliser la boucle for, qui est plus sûre, chaque fois que vous le pouvez. Cependant, il existe encore des cas essentiels dans lesquels nous utilisons des boucles while, comme le traitement des fichiers, le traitement du code informatique ou pour les algorithmes puissants.
ja: while ループは、条件に基づいてコードを実行し続けるようにコンピューターに指示します。 条件が true の間、ループは実行され続けます。 while ループをコーディングするときは注意が必要です。条件を間違えると無限に実行され続け、ゲームがフリーズしてしまいます。 そのため、可能な限り、より安全な for ループを使用することをお勧めします。 ただし、ファイルの処理、コンピューター コードの処理、または強力なアルゴリズムなど、while ループを使用する重要なケースが依然としてあります。
tr: Bir "while" döngüsü bilgisayara, bir şarta bağlı olarak kodu sürekli çalıştırmasını emreder. Eğer şart geçerli ise, döngü sonsuza kadar çalışır. "while" döngülerini kodlarken dikkatli olmanız gerekir: eğer şartı yanlış seçerseniz, döngü sonsuza kadar çalışır ve bilgisayarınız donar. Mümkün olduğunca daha güvenli olan "for" döngüsünü kullanmanızı önerme sebebimiz bu yüzdendir. Yine de "while" döngülerini kullanmanın çok gerekli olduğu durumlar da vardır; dosyaları işlemek, bilgisayar kodu işletmek, ya da güçlü algoritmalar yazmak.
zh_hant: while 迴圈指示電腦根據條件繼續執行程式碼。當條件為真時，迴圈會繼續執行。 在編寫 while 迴圈時，你必須小心：如果條件設定錯誤，迴圈會無限執行並凍結遊戲。 因此，我們建議在可能的情況下使用更安全的 for 迴圈。 然而，仍然有一些必要的情況需要使用 while 迴圈，例如處理檔案、處理電腦程式碼或用於強大的算法。

source: Returning a value is the process of sending a value to the place where you call a function. It happens when a function uses the [code]return[/code] keyword followed by a value, for example: [code]return -1[/code].
cs: Vrácení hodnoty je proces odeslání hodnoty na místo, kde jste zavolali funkci. Dochází k němu, když funkce použije klíčové slovo [code]return[/code] následované hodnotou: [code]return -1[/code].
fr: Le retour (en anglais [i]return[/i]) d'une valeur est le processus qui consiste à envoyer une valeur à l'endroit où vous appelez une fonction. Cela se produit lorsqu'une fonction utilise le mot-clé [code]return[/code] suivi d'une valeur, par exemple : [code]return -1[/code].
ja: 値を返すとは、関数を呼び出した場所に値を送信するプロセスです。 これは、関数で [code]return[/code] キーワードの後に値が使用されている場合に発生します (例: [code]return -1[/code])。
tr: Bir değeri geri döndürmek, bir fonksiyonu çağırdığınız noktaya bir değer döndürme işlemidir. Bunun için bir fonksiyon [code]return[/code] kelimesinden hemen sonra bir değer kullanır; örneğin [code]return -1[/code] gibi.
zh_hant: 回傳值是將一個值傳送到呼叫函式的地方的過程。 當函式使用 [code]return[/code] 關鍵字後面加上一個值時，就會發生回傳，例如：[code]return -1[/code]。

source: sprite
ja: スプライト
tr: grafik öğe
zh_hant: 精靈（sprite）
