Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-3-standing-on-shoulders-of-giants.po
Languages: cs, da, de, es, fr, it, ja, nl, pt_br, ru, ta, uk, zh_hant

source: A function is a bundle of code you can execute anytime. It's a named list of instructions.
cs: Funkce je svazek kódu, který můžete kdykoli spustit. Je to pojmenovaný seznam instrukcí.
da: En funktion er en samling kode, du kan udføre når som helst. Det er en navngiven liste over instruktioner.
fr: Une fonction est un ensemble de code que vous pouvez exécuter à tout moment. C'est une liste d'instructions avec un nom.
ja: 関数はいつでも実行できるコードのバンドルです。 これは名前付きの命令リストとも言えます。
nl: Een functie is een bundel code die je op elk moment kunt uitvoeren. Het is een lijst van instructies, met een naam.
pt_br: Uma função é um conjunto de códigos que você pode executar a qualquer momento. É uma lista de instruções que contém um nome.
ru: Функция — это кусочек кода, который вы можете выполнить в любое время. Это именованный список инструкций.
ta: ஒரு செயல்பாடு என்பது நீங்கள் எப்போது வேண்டுமானாலும் இயக்கக்கூடிய குறியீட்டின் மூட்டை. இது பெயரிடப்பட்ட வழிமுறைகளின் பட்டியல்.
uk: Функція — це шматочок коду, який ви можете викликати в будь-який час. Це іменований перелік інструкцій.
zh_hant: 函式是你能隨時執行的程式碼集合包。是個有名字的指令清單。

source: To define a function, you need to write the [code]func[/code] keyword, the function's name, parentheses, and a colon: [code]func run():[/code] defines a function named [code]run()[/code].
cs: Chcete-li definovat funkci, musíte napsat klíčové slovo [code]func[/code], název funkce, závorky a dvojtečku: Např. [code]func run():[/code] definuje funkci s názvem [code]run()[/code].
da: For at definere en funktion skal du skrive nøgleordet [code]func[/code], funktionens navn, parenteser og et kolon: [code]func run():[/code] definerer en funktion med navnet [code]run()[/code].
fr: Pour définir une fonction, vous devez écrire le mot-clé [code]func[/code], le nom de la fonction, des parenthèses et deux-points : [code]func run():[/code] définit une fonction appelée [code]run()[/code].
ja: 関数を定義するには、[code] func [/code]キーワード、関数の名前、括弧、およびコロンを記述する必要があります。[code] func run(): [/code]は[code]run()[/code]という名前の関数を定義します。
nl: Om een functie te definiëren, moet je het [code]func[/code] sleutelwoord, de naam van de functie, haakjes en een dubbele punt schrijven: [code]func run():[/code] definieert een functie met de naam [code]run()[/code].
pt_br: Para definir uma função, você precisa escrever a palavra-chave [code]func[/code], seguido pelo nome da função, o parêntese e o sinal de dois pontos: [code]func run():[/code] define uma função chamada [code]run()[/code].
ru: Чтобы определить функцию, вам нужно написать ключевое слово [code]func[/code], имя функции, круглые скобки и двоеточие: [code]func run():[/code] определяет функцию с именем [code]run()[/code].
ta: ஒரு செயல்பாட்டை வரையறுக்க, நீங்கள் [குறியீடு] func [/code] முக்கிய சொல்லை எழுத வேண்டும், செயல்பாட்டின் பெயர், அடைப்புக்குறிப்புகள் மற்றும் ஒரு பெருங்குடல்: [குறியீடு] FUNC ரன் (): [/குறியீடு] [குறியீடு] ரன் என்ற செயல்பாட்டை வரையறுக்கிறது () [/குறியீடு].
uk: Щоб визначити функцію, потрібно написати ключове слово [code]func[/code], назву функції, круглі дужки і двокрапку: [code]func run():[/code] визначає функцію з назвою [code]run()[/code].
zh_hant: 要定義一個函式，你必須寫下關鍵字 [code]func[/code]（函式function的縮寫），函式的名稱、小括號、以及冒號。[code]func run():[/code] 定義了一個名為 [code]run()[/code] 的函式。

source: You then go to the next line to write the function's body. That's the instructions of the function.
cs: Na dalším řádku pak přejdete k zápisu těla funkce'. Tělo jsou instrukce funkce.
da: Du går derefter til den næste linje for at skrive funktionens krop. Det er funktionens instruktioner.
fr: Vous passez ensuite à la ligne suivante pour écrire le corps de la fonction. Ce sont les instructions de la fonction.
ja: そして次の行に移動して関数の本体を記述します。 これが関数の命令リストです。
nl: Vervolgens ga je naar de volgende regel om de inhoud van de functie te schrijven. Dat zijn de instructies van de functie.
pt_br: Então você vai para a próxima linha para escrever o corpo da função. O corpo é onde fica as instruções da função.
ru: Затем вам нужно перейти к следующей строке, чтобы написать тело функции, то есть список инструкций из которых она состоит.
ta: செயல்பாட்டின் உடலை எழுத அடுத்த வரிக்குச் செல்லுங்கள். அதுதான் செயல்பாட்டின் அறிவுறுத்தல்கள்.
uk: Потім ви маєте перейти до наступного рядка, щоб написати тіло функції, тобто список інструкцій з яких вона складається.
zh_hant: 接著你要寫到下一行，並編寫函式的主體。那就是函式的指令。

source: Notice how each instruction starts with a leading [code]Tab[/code] character. The computer uses that to know which lines are part of the function.
cs: Všimněte si, že každá instrukce začíná úvodním znakem [code]Tab[/code]. Podle něj počítač pozná, které řádky jsou součástí funkce.
da: Bemærk, hvordan hver instruktion starter med et indledende [code]Tab[/code]-tegn. Computeren bruger det til at vide, hvilke linjer der er en del af funktionen.
fr: Remarquez comment chaque instruction commence par un caractère [code]Tab[/code]. L'ordinateur l'utilise pour savoir quelles lignes font partie de la fonction.
ja: 各命令が先頭の[code]Tab[/code]文字で始まることに注意してください。 コンピューターはそれを使用して、どの行が関数の一部であるかを認識します。
nl: Merk op dat elke instructie begint met een [code]Tab[/code]-teken. De computer gebruikt dat om te weten welke regels onderdeel zijn van de functie.
pt_br: Repare como cada instrução começa com um [code]caractere de tabulação (espaço em branco na esquerda)[/code]. O computador usa isso para saber qual linha faz parte da função.
ru: Обратите внимание, что каждая инструкция начинается с символа [code]Tab[/code] (табуляции). Компьютер использует символы табуляции, чтобы узнать, какие строки являются частью функции.
ta: ஒவ்வொரு அறிவுறுத்தலும் ஒரு முன்னணி [குறியீடு] தாவல் [/குறியீடு] எழுத்துடன் எவ்வாறு தொடங்குகிறது என்பதைக் கவனியுங்கள். செயல்பாட்டின் ஒரு பகுதி எந்த கோடுகள் என்பதை அறிய கணினி அதைப் பயன்படுத்துகிறது.
uk: Зверніть увагу, що перед кожною інструкцією ставиться символу [code]Tab[/code] (табуляції). Комп'ютер використовує символи табуляції, щоб дізнатися, які рядки є частиною функції.
zh_hant: 請注意每個指令都由一個 [code]Tab[/code] 字元開頭。電腦會使用這個來知道哪些行屬於這個函式。

source: Throughout the course, you'll see many functions called [code]run()[/code].
cs: V průběhu kurzu se setkáte s mnoha funkcemi nazvanými [code]run()[/code].
da: Gennem hele kurset vil du se mange funktioner kaldet [code]run()[/code].
fr: Tout au long du cours, vous verrez de nombreuses fonctions appelées [code]run()[/code].
ja: コース全体を通して、[code] run() [/code]と呼ばれる多くの関数が表示されます。
nl: Door de cursus heen zul je veel functies zien met de naam [code]run()[/code].
pt_br: Ao longo do curso, você vai ver várias funções chamadas [code]run()[/code].
ru: На протяжении всего курса вы увидите множество функций, названных [code]run()[/code].
ta: பாடநெறி முழுவதும், [குறியீடு] ரன் () [/குறியீடு] எனப்படும் பல செயல்பாடுகளை நீங்கள் காண்பீர்கள்.
uk: Протягом усього курсу ви побачите багато функцій, названих [code]run()[/code].
zh_hant: 在整個課程中，你會看到許多名為 [code]run()[/code] 的函式。

source: Those are functions we created to give you interactive examples.
cs: To jsou funkce, které jsme vytvořili, abychom vám mohli poskytnout interaktivní příklady.
da: Det er funktioner, vi har skabt for at give dig interaktive eksempler.
fr: Ce sont des fonctions que nous avons créées pour vous donner des exemples interactifs.
ja: これらは、インタラクティブなサンプルを提供するために作成した関数です。
nl: Dat zijn functies die wij hebben gemaakt om je interactieve voorbeelden te geven.
pt_br: Essas funções foram criadas por nós para dar a você exemplos interativos.
ru: Это функции, которые мы создали, чтобы предоставить вам интерактивные примеры.
ta: அவை ஊடாடும் எடுத்துக்காட்டுகளை உங்களுக்கு வழங்க நாங்கள் உருவாக்கிய செயல்பாடுகள்.
uk: Це функції, які ми створили, щоб надати вам інтерактивні приклади.
zh_hant: 那些是我們創造來給你互動範例的函式。

source: Function arguments
cs: Argumenty funkce
da: Funktions argumenter
de: Funktionsargumente
es: Argumentos de la función
fr: Arguments de fonction
it: Argomenti delle funzioni
ja: 関数の引数
nl: Functie-argumenten
pt_br: Argumentos de função
ru: Аргументы функции
ta: செயல்பாட்டு வாதங்கள்
uk: Аргументи функції
zh_hant: 函式引數(Function arguments)

source: We use parentheses to call functions because you can give the function [i]arguments[/i] inside the parentheses when calling it.
da: Vi bruger parenteser til at kalde funktioner, fordi du kan angive funktionens [i]argumenter[/i] inden i parenteserne, når du kalder den.
fr: Nous utilisons des parenthèses pour appeler les fonctions car vous pouvez donner à la fonction des [i]arguments[/i] à l'intérieur des parenthèses lors de son appel.
ja: 関数の呼び出しには括弧を使用します。関数を呼び出すときは括弧内に関数の[i]引数[/i]を指定できるためです。
nl: We gebruiken haakjes om functies aan te roepen omdat je de functie [i]argumenten[/i] tussen de haakjes kunt geven als je haar aanroept.
pt_br: Nós usamos parênteses para chamar funções porque você pode colocar [i]argumentos[/i] dentro dos parêntesis quando chamamos a função.
ru: Мы используем круглые скобки для вызова функций, потому что в них можно поместить [i]аргументы[/i] функции при её вызове.
ta: செயல்பாடுகளை அழைக்க நாங்கள் அடைப்புக்குறிப்புகளைப் பயன்படுத்துகிறோம், ஏனென்றால் நீங்கள் அதை அழைக்கும்போது அடைப்புக்குறிக்குள் [i] வாதங்களை [/i] வழங்கலாம்.
uk: Для виклику функцій ми використовуємо круглі дужки, тому що в них можна помістити [i]аргументи[/i] функції під час її виклику.
zh_hant: 我們使用括號來呼叫函式，因為在呼叫函式時，你可以在括號內傳遞[b]引數[/b]。

source: Here's a [i]sprite[/i] standing straight. If we call the [code]rotate(0.3)[/code] function, the character [i]sprite[/i] turns by 0.3 radians.
cs: Zde je [i]sprite[/i] stojící rovně. Pokud zavoláme funkci [code]rotate(0.3)[/code], znak [i]sprite[/i] se změní o 0,3 jednotky.
da: Her er en [i]sprite[/i] stående lige. Hvis vi kalder funktionen [code]rotate(0.3)[/code], drejer karakteren [i]sprite[/i] sig med 0,3 radianer.
fr: Voici un [i]sprite[/i] qui est droit. Si nous appelons la fonction [code]rotate(0.3)[/code], le personnage [i]sprite[/i] tourne de 0.3 radians.
ja: これはキャラクターの[i]スプライト[/i]がまっすぐ立っているところです。 [code]rotate(0.3)[/code]を呼び出すと、キャラクター[i]スプライト[/i]は0.3単位で回転します。
nl: Hier is een [i]sprite[/i] die rechtop staat. Als we de functie [code]rotate(0.3)[/code] oproepen, draait het personage [i]sprite[/i] met 0,3 radialen.
pt_br: Aqui temos um [i]sprite[/i] que está reto. Se chamarmos a função [code]rotate(0.3)[/code], o [i]sprite[/i] do personagem vai girar 0.3 radianos.
ru: Вот [i]спрайт[/i], стоящий прямо. Если мы вызовем функцию [code]rotate(0.3)[/code], [i]спрайт[/i] персонажа повернётся на 0.3 радиан.
ta: இங்கே ஒரு [i] ச்பிரிட் [/i] நேராக நிற்கிறது. [குறியீடு] சுழற்சி (0.3) [/குறியீடு] செயல்பாட்டை நாம் அழைத்தால், எழுத்து [i] ச்பிரிட் [/i] 0.3 ரேடியன்களால் மாறும்.
uk: Ось [i]спрайт[/i], розташований прямо. Якщо ми викличемо функцію [code]rotate(0.3)[/code], [i]спрайт[/i] персонажа повернеться на 0.3 радіана.
zh_hant: 這裡是一個直立的[b]精靈(Sprite)[/b]。如果我們呼叫 [code]rotate(0.3)[/code] 函式，角色的[b]精靈[/b]就會旋轉 0.3 弧度。

source: The [code]0.3[/code] part between the parentheses is the function's [i]argument[/i].
cs: Část [code]0,3[/code] mezi závorkami je [i]argument funkce[/i].
da: [code]0.3[/code]-delen mellem parenteserne er funktionens [i]argument[/i].
fr: La partie [code]0.3[/code] entre les parenthèses est [i]l'argument[/i] de la fonction.
ja: 括弧内の[code]0.3[/code]の部分は、関数の[i]引数[/i]です。
nl: Het gedeelte [code]0.3[/code] tussen de haakjes is het [i]argument[/i] van de functie.
pt_br: A parte [code]0.3[/code] entre o parêntese é o [i]argumento[/i] da função.
ru: Запись [code]0.3[/code] в круглых скобках — это [i]аргумент[/i] функции.
ta: அடைப்புக்குறிக்கு இடையில் [குறியீடு] 0.3 [/குறியீடு] பகுதி செயல்பாட்டின் [i] உரையாடல் [/i].
uk: [code]0.3[/code], записане в круглих дужках — це [i]аргумент[/i] функції.
zh_hant: 小括號中間的 [code]0.3[/code] 部份便是函式的[b]引數[/b]。

source: Arguments are values (numbers, bits of text, and more) that change how the function behaves.
cs: Argumenty jsou hodnoty (čísla, části textu a další), které mění chování funkce.
da: Argumenter er værdier (tal, tekststykker og mere), der ændrer, hvordan funktionen opfører sig.
fr: Les arguments sont des valeurs (chiffres, morceaux de texte et autres) qui modifient le comportement de la fonction.
ja: 引数とは関数の動作を変更する値（数値、テキストなどのパラメータ）です。
nl: Argumenten zijn waarden (getallen, stukjes tekst en meer) die veranderen hoe de functie zich gedraagt.
pt_br: Argumento são valores (números, a parte de um texto entre outras coisas) que mudam o comportamento da função.
ru: Аргументы — это значения (числа, фрагменты текста и многое другое), которые изменяют поведение функции.
ta: வாதங்கள் மதிப்புகள் (எண்கள், உரையின் பிட்கள் மற்றும் பல) செயல்பாடு எவ்வாறு செயல்படுகிறது என்பதை மாற்றும்.
uk: Аргументи - це значення (числа, фрагменти тексту та багато іншого), які змінюють поведінку функції.
zh_hant: 引數是能改變函式行為的值（數字、一些文字等等）。

source: Arguments let you fine-tune the effect of the function call. They can be optional at times, but functions often require arguments in order to work.
cs: Argumenty umožňují parametrizovat a přesně vymezovat, co funkce udělá. Někdy mohou být nepovinné, ale často je funkce vyžadují, aby fungovaly.
da: Argumenter giver dig mulighed for at finjustere effekten af funktionskaldet. De kan være valgfrie til tider, men funktioner kræver ofte argumenter for at fungere.
fr: Les arguments vous permettent d'affiner l'effet de l'appel de la fonction. Ils peuvent parfois être facultatifs, mais les fonctions ont souvent besoin d'arguments pour fonctionner.
ja: 引数を使用すると関数呼び出しの効果を微調整できます。 これらはオプションの場合もありますが、関数が動作するために引数が必要になることがよくあります。
nl: Met argumenten kun je het effect van de functieoproep afstemmen. Ze kunnen soms optioneel zijn, maar functies hebben vaak argumenten nodig om te werken.
pt_br: Argumentos permitem que você ajuste o efeito da chamada da função. Eles às vezes podem ser opcionais. mas geralmente as funções vão exigir argumentos para poder funcionar.
ru: Аргументы позволяют вам точно настроить эффект который произведёт функция при вызове. Иногда аргументы могут быть необязательными, но часто функции требуют их для работы.
ta: செயல்பாட்டு அழைப்பின் விளைவை நன்றாக வடிவமைக்க வாதங்கள் உங்களை அனுமதிக்கின்றன. அவை சில நேரங்களில் விருப்பமாக இருக்கலாம், ஆனால் செயல்பாடுகளுக்கு பெரும்பாலும் வேலை செய்ய வாதங்கள் தேவைப்படுகின்றன.
uk: Аргументи дають змогу точно налаштувати дію функції під час виклику. Іноді аргументи можуть бути необов'язковими, але часто функції вимагають їх для роботи.
zh_hant: 引數讓你能微調函式呼叫的效果。有時不填也沒關係，但函式通常需要引數才能運作。

source: For example, calling [code]rotate()[/code] without any argument would result in an error. Without an argument, Godot doesn't know by [i]how much[/i] you intend to rotate the [i]sprite[/i].
cs: Například volání [code]rotate()[/code] bez jakéhokoli argumentu by vedlo k chybě. Bez argumentu Godot nepozná, o [i]kolik[/i] hodláte [i]spritem[/i] otáčet.
da: For eksempel vil et kald af [code]rotate()[/code] uden noget argument resultere i en fejl. Uden et argument ved Godot ikke, [i]hvor meget[/i] du har til hensigt at rotere [i]spriten[/i].
fr: Par exemple, appeler [code]rotate()[/code] sans aucun argument entraînerait une erreur. Sans argument, Godot ne sait pas [i]de combien[/i] vous avez l'intention de faire pivoter le [i]sprite[/i].
ja: 例えば引数なしで[code] rotate() [/code]を呼び出すとエラーが発生します。 引数というオーダーがなければGodotは[i]スプライト[/i]を[i]どれだけ[/i]回転させようとしているのかわかりません。
nl: Bijvoorbeeld, het aanroepen van [code]rotate()[/code] zonder enig argument zou resulteren in een fout. Zonder een argument weet Godot niet [i]hoeveel[/i] je de [i]sprite[/i] wilt draaien.
pt_br: Por exemplo, chamando a função [code]rotate()[/code] sem nenhum argumento pode resultar em um erro. Sem um argumento, a Godot não sabe [i]por quanto[/i] você pretende rotacionar a [i]sprite[/i].
ru: Например, вызов [code]rotate()[/code] без какого-либо аргумента приведет к ошибке. Без аргументов Godot не знает [i]как сильно[/i] вы собираетесь повернуть [i]спрайт[/i].
ta: எடுத்துக்காட்டாக, [குறியீடு] அழைப்பது () [/குறியீடு] எந்த வாதமும் இல்லாமல் சுழலும் () [/குறியீடு] பிழையை ஏற்படுத்தும். ஒரு உரையாடல் இல்லாமல், கோடோட் [நான்] [/i] நீங்கள் [i] ச்பிரட்டை சுழற்ற விரும்புகிறீர்கள் [/i].
uk: Наприклад, виклик [code]rotate()[/code] без будь-якого аргументу призведе до помилки. Без аргументів Godot не знає [i]як сильно[/i] ви збираєтеся повернути [i]спрайт[/i].
zh_hant: 例如，不使用引數呼叫 [code]rotate()[/code] 會導致錯誤。沒有引數，Godot 不知道你希望[b]精靈Sprite[/b]要旋轉[b]多少[/b]。

source: Don't worry about memorizing what arguments each function requires or accepts! As a programmer, the documentation will always be close by for you to refer to.
cs: Nedělejte si starosti s tím, abyste si zapamatovali, jaké argumenty jednotlivé funkce vyžadují nebo přijímají! Jako programátor budete mít dokumentaci vždy po ruce, abyste se na ni mohli podívat.
da: Du skal ikke bekymre dig om at huske, hvilke argumenter hver funktion kræver eller accepterer! Som programmør vil dokumentationen altid være lige ved hånden, så du kan referere til den.
fr: Ne vous souciez pas de mémoriser les arguments que chaque fonction requiert ou accepte ! En tant que programmeur et programmeuse, la documentation sera toujours à portée de main pour vous y référer.
ja: 各関数が必要とする、または受け入れる引数を常に覚えておく必要はありません。 関数のドキュメントはプログラマーがすぐ参照できるようになっています。
nl: Maak je geen zorgen over het onthouden van welke argumenten elke functie nodig heeft of aanneemt! Als programmeur heb je de documentatie altijd bij de hand.
pt_br: Não se preocupe em memorizar quais argumentos cada função exige ou aceita! Como programador(a), a documentação sempre estará por perto para você poder se referenciar.
ru: Не беспокойтесь о том, что вам нужно запомнить, какие аргументы требует или принимает каждая функция! Документация всегда будет у вас под рукой, чтобы вы могли обратиться к ней, как программист.
ta: ஒவ்வொரு செயல்பாட்டிற்கும் என்ன வாதங்கள் தேவை அல்லது ஏற்றுக்கொள்கின்றன என்பதை மனப்பாடம் செய்வதைப் பற்றி கவலைப்பட வேண்டாம்! ஒரு புரோகிராமராக, நீங்கள் குறிப்பிட ஆவணங்கள் எப்போதும் நெருக்கமாக இருக்கும்.
uk: Не турбуйтеся про те, що вам потрібно запам'ятати, які аргументи вимагає чи приймає кожна функція! Документація завжди буде під рукою, щоб ви могли звернутися до неї, як програміст.
zh_hant: 別擔心要記住每個函式需要或接受的引數！作為程式設計師，文檔隨時可以查閱，幫助你了解函式的詳細資訊。

source: Finally, notice how we use a dot in the number [code]0.3[/code] above: you need to use a dot like this to represent decimal numbers. You can't use commas as they have a different purpose in code.
cs: Nakonec si všimněte, jak jsme v čísle [code]0,3[/code] výše použili tečku: takovouto tečku je třeba používat pro vyjádření desetinných čísel. Nemůžete používat čárky, protože mají v kódu jiný účel (např. oddělují hodnoty nebo argumenty).
da: Læg endelig mærke til, hvordan vi bruger en prik i tallet [code]0.3[/code] ovenfor: du skal bruge en prik som denne til at repræsentere decimaltal. Du kan ikke bruge kommaer, da de har et andet formål i koden.
fr: Enfin, remarquez comment nous utilisons un point dans le nombre [code]0.3[/code] ci-dessus : vous devez utiliser un point comme celui-ci pour représenter les nombres décimaux. Vous ne pouvez pas utiliser de virgules car elles ont un but différent dans le code.
ja: 最後に上記の数値[code] 0.3 [/code]でドットを使用する方法に注意してください。小数点を表すにはドットを使用する必要があります。 コンマを小数点として使用することはできません。
nl: Merk tenslotte op hoe we een punt gebruiken in het getal [code]0.3[/code] hierboven: je moet zo'n punt gebruiken om kommagetallen weer te geven. Je kunt geen komma's gebruiken, omdat die een andere betekenis hebben in code.
pt_br: Finalmente, repare que usamos um sinal de ponto no número [code]0.3[/code] acima: você precisa usar o ponto para representar números decimais. Você não pode usar vírgulas porque elas tem um propósito diferente em código.
ru: Наконец, обратите внимание, как мы используем точку в числе [code]0.3[/code] выше: вам нужно использовать такую точку для представления десятичных дробей. Вы не можете использовать запятые, так как они имеют другое предназначение в коде.
ta: இறுதியாக, மேலே உள்ள [குறியீடு] 0.3 [/குறியீடு] எண்ணில் ஒரு புள்ளியை எவ்வாறு பயன்படுத்துகிறோம் என்பதைக் கவனியுங்கள்: தசம எண்களைக் குறிக்க இதுபோன்ற புள்ளியைப் பயன்படுத்த வேண்டும். குறியீட்டில் வேறு நோக்கம் இருப்பதால் நீங்கள் காற்புள்ளிகளைப் பயன்படுத்த முடியாது.
uk: Зрештою, зверніть увагу, як ми використовуємо крапку в числі [code]0.3[/code] вище: таку крапку слід використовувати для запису десяткових дробів. Не можна використовувати коми, оскільки вони в коді мають інше призначення.
zh_hant: 最後，請注意我們在上面的 [code]0.3[/code] 使用了小數點：你需要用這種點來表示小數。你不能用逗號，它們在程式中有不同的目的。

source: What are radians?
cs: Co jsou radiány?
da: Hvad er radianer?
de: Was ist das Bogenmaß?
es: ¿Qué son los radianes?
fr: Que sont les radians ?
it: Cosa sono i radianti?
ja: ラジアンとは？
nl: Wat zijn radialen?
pt_br: O que é radiano?
ru: Что такое радианы?
ta: ரேடியன்கள் என்றால் என்ன?
uk: Що таке радіани?
zh_hant: 弧度是什麼？

source: The value of [code]0.3[/code] is an angle in [i]radians[/i]. In daily life, we're used to measuring angles in degrees. The radian is another scale commonly used in video games and math.
cs: Hodnota [code]0,3[/code] je úhel v [i]radiánech[/i]. V každodenním životě jsme zvyklí měřit úhly ve stupních. Radián je jiná stupnice, která se běžně používá ve videohrách a matematice.
da: Værdien af [code]0.3[/code] er en vinkel i [i]radianer[/i]. I dagligdagen er vi vant til at måle vinkler i grader. Radianer er en anden skala, der almindeligvis bruges i videospil og matematik.
fr: La valeur de [code]0.3[/code] est un angle en [i]radians[/i]. Dans la vie quotidienne, nous sommes habitués à mesurer les angles en degrés. Le radian est une autre échelle couramment utilisée dans les jeux vidéo et les mathématiques.
ja: [code] 0.3 [/code]の値は[i]ラジアン[/i]単位の角度です。私たちの日常生活では角度を度で測ることに慣れています。ラジアンはビデオゲームや数学で一般的に使用されるもう1つの尺度です。
nl: De waarde van [code]0.3[/code] is een hoek in [i]radialen[/i]. In het dagelijks leven zijn we gewend om hoeken in graden te meten. De radiaal is een andere schaal die vaak wordt gebruikt in videospellen en wiskunde.
pt_br: O valor [code]0.3[/code] é um ângulo em [i]radiano[/i]. No nosso dia a dia, nós estamos acostumados a medir ângulos em graus. O radiano é uma outra medida usada em jogos e na matemática.
ru: Значение [code]0.3[/code] представляет собой угол в [i]радианах[/i]. В повседневной жизни мы привыкли измерять углы в градусах. Радиан — это ещё одна шкала, обычно используемая в видеоиграх и математике.
ta: [குறியீடு] 0.3 [/குறியீடு] இன் மதிப்பு [i] ரேடியன்களில் ஒரு கோணமாகும் [/i]. அன்றாட வாழ்க்கையில், டிகிரிகளில் கோணங்களை அளவிட நாங்கள் பழகிவிட்டோம். வீடியோ கேம்கள் மற்றும் கணிதத்தில் பொதுவாகப் பயன்படுத்தப்படும் மற்றொரு அளவுகோல் ரேடியன்.
uk: Значення [code]0.3[/code] - це величина кута в [i]радіанах[/i]. У повсякденному житті ми звикли вимірювати кути в градусах. Радіан — це ще одна одиниця вимірювання, яку зазвичай використовують у відеоіграх та математиці.
zh_hant: [code]0.3[/code] 的數值是以[b]弧度[/b]來表示的角度。在日常生活中，我們比較習慣用度數來衡量角度，但弧度是另一種常見的單位，尤其在數學和遊戲開發中廣泛使用。

source: You can convert radians into degrees by multiplying them by 180 and dividing them by PI:
cs: Radiány můžete převést na stupně tak, že je vynásobíte 180 a vydělíte PI:
da: Du kan konvertere radianer til grader ved at gange dem med 180 og dividere dem med PI:
fr: Vous pouvez convertir des radians en degrés en les multipliant par 180 et en les divisant par PI :
ja: ラジアンを180で乗算してからPIで除算することにより、ラジアンを度に変換できます。
nl: Je kunt radialen omzetten in graden door ze te vermenigvuldigen met 180 en te delen door PI:
pt_br: Você pode converter radiano em graus multiplicando o valor por 180 e depois dividindo o resultado por PI:
ru: Вы можете преобразовать радианы в градусы, умножив их на 180 и разделив результат на число Пи:
ta: ரேடியன்களை 180 ஆல் பெருக்கி அவற்றை பை மூலம் பிரிப்பதன் மூலம் டிகிரிகளாக மாற்றலாம்:
uk: Ви можете перетворити радіани на градуси, помноживши їх на 180 і поділивши результат на число Пі:
zh_hant: 你可以將弧度轉換為度數，公式是將弧度乘以 180，再除以PI：
