Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-7-member-variables.po
Languages: cs, da, de, es, fr, nl, pt_br, ru, ta, uk, zh_hans, zh_hant

source: This function increases or decreases the value of the entity's [code]rotation[/code] member variable. Say we want to reset the rotation to [code]0[/code] and make the character upright. Using the [code]rotate()[/code] function can prove difficult: you need to know the character's exact current angle to cancel it out. It's much easier to use the member variable rather than the function. The following code assigns the value [code]0[/code] to the character's rotation, resetting its angle and making it upright.
cs: Tato funkce zvyšuje nebo snižuje hodnotu členské proměnné [code]rotation[/code]. Řekněme, že chceme nastavit hodnotu rotace na [code]0[/code] a postavit postavu do svislé polohy. Použití funkce [code]rotate()[/code] to může být komplikované: potřebujeme znát přesný aktuální rotaci postavy, abychom o tento úhel mohli otočit postavu v opačném směru. Mnohem jednodušší je tedy nastavit rovnou členskou proměnnou. Následující kód přiřadí hodnotu [code]0[/code] natočení postavy a tím vynuluje jeho úhel a postaví ji do svislé polohy.
de: Diese Funktion erhöht oder verringert den Wert der Drehungs([code]rotation[/code])-Membervariablen der Entität. Angenommen, wir möchten die Rotation auf [code]0[/code] zurücksetzen und den Charakter aufrecht stellen. Die Verwendung der Funktion [code]rotate()[/code] kann sich als schwierig erweisen: Du musst den genauen aktuellen Winkel des Charakters kennen, um ihn aufrecht darzustellen. Es ist viel einfacher, die Membervariable anstelle der Funktion zu verwenden. Der folgende Code weist der Drehung des Charakters den Wert [code]0[/code] zu, indem er seinen Winkel zurücksetzt und aufrecht stellt.
nl: Deze functie verhoogt of verlaagt de waarde van de lidvariabele [code]rotation[/code] van het object. Stel dat we de rotatie willen terugbrengen naar [code]0[/code] en het personage rechtop willen zetten. Het gebruik van de functie [code]rotate()[/code] kan lastig zijn: je moet de exacte huidige hoek van het personage kennen om deze op te heffen. Het is veel makkelijker om de lidvariabele te gebruiken in plaats van de functie. De volgende code wijst de waarde [code]0[/code] toe aan de rotatie van het personage, waardoor de hoek wordt teruggezet en het rechtop komt te staan.
zh_hans: 此函数增加或减少实体的成员变量 [code]rotation[/code] 的值。 假设我们要将旋转重置为 [code]0[/code] 并使角色直立。 用这个 [code]rotate()[/code] 函数可能很困难做到：需要知道角色当前的确切角度才能抵消掉。 直接修改成员变量比使用这个简单的函数要容易得多。 以下代码将值 [code]0[/code] 赋值给角色的旋转，重置其角度并使其直立。
zh_hant: 這個函式會增加或減少實體的 [code]rotation[/code] 成員變數的值。 假設我們想將旋轉重設為 [code]0[/code]，並讓角色保持直立。使用 [code]rotate()[/code] 函式可能會很麻煩，因為你需要知道角色當前的精確角度才能將其抵消。 與其使用函式，直接操作成員變數會更簡單。 以下的程式碼將 [code]0[/code] 的值指定給角色的角度，從而重設角度並讓角色直立。

source: Variables are labels you use to access values that change over time. You can also use them to put a name on a value you want to reuse throughout your code. It makes your code easier to read and to change.
cs: Proměnné jsou štítky, které používáte k přístupu k hodnotám, které se v čase mění. Můžete je také použít k pojmenování hodnoty, kterou chcete znovu použít v celém kódu. Usnadňuje čtení a změnu kódu.
de: Variablen sind Beschriftungen, die Du verwendest, um auf Werte zuzugreifen, die sich im Laufe der Zeit ändern. Du kannst sie auch verwenden, um einen Wert, den Du im gesamten Code wiederverwenden möchtest, mit einem Namen zu versehen. Es macht deinen Code leichter zu lesen und zu ändern.
nl: Variabelen zijn labels die je gebruikt om toegang te krijgen tot waarden die in de loop van de tijd veranderen. Je kunt ze ook gebruiken om een naam te geven aan een waarde die je in je code wilt hergebruiken. Dit maakt je code gemakkelijker te lezen en te veranderen.
zh_hans: 变量是用于访问随时间变化的值的标签。 你还可以用他们来给在整个代码中会重复使用的值命名。这会使你的代码更易于阅读和更改。
zh_hant: 變數是用來存取隨時間變動的值的標籤。 你也可以用它們為一個你想在程式中重複使用的值命名。這樣可以讓你的程式碼更容易閱讀並且更方便修改。

source: In video games, you will see many member variables that have sub-values. For example, the [code]position[/code] we mentioned has two coordinates: [code]x[/code] and [code]y[/code]. It's the same for the [code]scale[/code]: it has [code]x[/code] and [code]y[/code] sub-variables. They respectively control the horizontal and vertical size of the game entity. To access those X and Y sub-components, you add a dot (".") after the variable name. The code below places the entity at [code]200[/code] pixels on the x-axis and [code]250[/code] pixels on the y-axis.
nl: In videospellen zul je veel lidvariabelen zien die deelwaarden hebben. Bijvoorbeeld, de [code]position[/code] die we eerder al noemden heeft twee coördinaten: [code]x[/code] en [code]y[/code]. Hetzelfde geldt voor de [code]scale[/code]: deze heeft deelvariabelen [code]x[/code] en [code]y[/code]. Deze bepalen respectievelijk de horizontale en verticale grootte van het object. Om toegang te krijgen tot die deelvariabelen X en Y voeg je een punt (".") toe na de naam van de variabele. De onderstaande code plaatst het object op [code]200[/code] pixels op de x-as en [code]250[/code] pixels op de y-as.
zh_hans: 在游戏中，你会看到许多具有子值的成员变量。 比如我们提到的[code]position[/code]有两个坐标：[code]x[/code]和[code]y[/code]。 [code]scale[/code] 也是如此：它有 [code]x[/code] 和 [code]y[/code] 子变量。 分别控制游戏实体的水平和垂直大小。 要访问这些 X 和 Y 子组件，请在变量名称后添加一个点（“.”）。 下面的代码会把实体放置在 x 轴上的 [code]180[/code] 像素和 y 轴上的 [code]120[/code] 像素处。
zh_hant: 在電子遊戲中，你會看到許多具有子值的成員變數。 例如，我們之前提到的 [code]position[/code] 變數，它有兩個座標：[code]x[/code] 和 [code]y[/code]。 [code]scale[/code] 也是一樣，它有 [code]x[/code] 和 [code]y[/code] 兩個子變數，分別控制遊戲實體在水平方向和垂直方向的大小。 要存取這些 X 和 Y 的子組件，你只需要在變數名稱後加上一個點（"."）。 以下的程式碼將實體放置在 X 軸 [code]200[/code] 像素，Y 軸 [code]250[/code] 像素的位置。

source: Notice how we use the equal sign ("=") to assign the numbers on the right to the sub-variables on the left. Unlike in maths, in computer programming, the equal sign ("=") does not mean "is equal to." Instead, it means "assign the result of the expression on the right to the variable on the left". We assign values so often in code that we prefer to reserve the equal sign for that.
cs: Všimněte si, že pomocí znaménka rovnosti ("=") přiřadíme čísla vpravo dílčím proměnným vlevo. Na rozdíl od matematiky v počítačovém programování znaménko rovnosti ("=") neznamená "je rovno." Místo toho znamená "přiřadit výsledek výrazu vpravo proměnné vlevo". V kódu přiřazujeme hodnoty tak často, že si pro to raději vyhrazujeme znaménko rovnosti.
de: Beachte, wie wir das Gleichheitszeichen ("=") verwenden, um die Zahlen auf der rechten Seite den Untervariablen auf der linken Seite zuzuweisen. Anders als in der Mathematik bedeutet das Gleichheitszeichen ("=") in der Computerprogrammierung nicht "ist gleich". Stattdessen bedeutet es "weisen Sie das Ergebnis des Ausdrucks auf der rechten Seite der Variablen auf der linken Seite zu". Wir weisen Werte so oft im Code zu, dass wir es vorziehen, das Gleichheitszeichen dafür zu reservieren.
nl: Merk op hoe we het gelijkheidsteken ("=") gebruiken om de getallen rechts toe te wijzen aan de deelvariabelen links. In tegenstelling tot in de wiskunde, betekent het gelijkheidsteken ("=") in computerprogrammering niet "is gelijk aan". In plaats daarvan betekent het "wijs het resultaat van de uitdrukking rechts toe aan de variabele links". We wijzen zo vaak waarden toe in code dat we daarvoor graag het gelijkheidsteken reserveren.
zh_hans: 请注意我们如何使用等号（“=”）将右侧的数字分配给左侧的子变量。 与数学不同，在计算机编程中，等号（“=”）并不是“等于”的意思。 相反，它的意思是“将右侧表达式的结果分配给左侧的变量”。 写代码时进行赋值实在是太频繁，以至于我们更倾向于把等号用在这件事情上。
zh_hant: 請注意，我們如何使用等號("=")將右邊的數字指定給左邊的子變數。 與數學不同，在程式設計中，等號("=")並不代表「等於」。 相反地，它表示「將右邊表達式的結果指定給左邊的變數」。在程式碼中，我們經常進行賦值，因此我們偏好將等號保留用於這個目的。

source: Note that in games, assuming your character's position starts at (0, 0), the code above moves the entity [code]200[/code] pixels to the right and [code]250[/code] pixels down. In math, the y-axis is generally positive going up by convention. The convention is the [i]opposite[/i] in video games and many computer applications: the y-axis is positive going down.
nl: Merk op dat in games, als de positie van je personage begint op (0, 0), de bovenstaande code het object [code]200[/code] pixels naar rechts verplaatst en [code]250[/code] pixels naar beneden. In de wiskunde is de y-as volgens conventie over het algemeen positief naar boven. De conventie is het [i]tegenovergestelde[/i] in videospellen en veel computertoepassingen: de y-as is positief naar beneden.
zh_hans: 请注意，在游戏中，假设你的角色的位置从 (0, 0) 开始，上面的代码将实体向右移动 [code]180[/code] 像素并向下移动 [code]120[/code] 像素。 在数学中，按照惯例，y 轴通常为正向上。 该约定与游戏和许多计算机应用程序中的[i]相反[/i]：y轴是向下为正的。
zh_hant: 請注意，在遊戲中，假設角色的位置從 (0, 0) 開始，上述程式碼將實體移動了 [code]200[/code] 像素到右邊，並將其向下移動了 [code]250[/code] 像素。 在數學中，通常 y 軸是往上為正方向。 但在遊戲和許多電腦應用程式中，這習慣是[b]相反的[/b]，y 軸是往下為正方向。

source: This may be confusing if you only saw the y-axis pointing up in math classes. However, in math, axes go in any direction. They don't even have to be perpendicular. On the computer, the position (0, 0) happens to correspond to the top-left of your computer screen. It then makes sense for coordinates to be positive when going towards the bottom-right corner. This leads to another question: why is position zero the top left of the screen? This is due to computer and TV displays history: they would calculate and display pixels starting from the top left corner and moving towards the bottom right corner.
cs: To může být matoucí, pokud jste v hodinách matematiky viděli pouze osu y směřující nahoru. V matematice však osy směřují libovolným směrem. Nemusí být ani kolmé. V počítači odpovídá poloha (0, 0) levé horní části obrazovky počítače. Pak má smysl, aby souřadnice byly kladné, když směřují k pravému dolnímu rohu. To vede k další otázce: proč je nulová pozice levým horním rohem obrazovky? Je to dáno historií počítačových a televizních displejů: počítaly a zobrazovaly pixely od levého horního rohu a směřovaly k pravému dolnímu rohu.
de: Dies kann verwirrend sein, wenn Du nur die y-Achse kennst, die im Mathematikunterricht nach oben zeigt. In der Mathematik gehen Achsen jedoch in jede Richtung. Sie müssen nicht einmal senkrecht stehen. Auf dem Computer entspricht die Position (0, 0) zufällig der oberen linken Seite Ihres Computerbildschirms. Es ist dann sinnvoll, dass die Koordinaten positiv sind, wenn Du in die rechte untere Ecke gehst. Dies führt zu einer anderen Frage: Warum ist Position Null oben links auf dem Bildschirm? Dies liegt an der Geschichte von Computer- und TV-Displays: Sie berechnen und zeigen Pixel beginnend mit der oberen linken Ecke und in Richtung der unteren rechten Ecke an.
nl: Dit kan verwarrend zijn als je in de wiskundeles alleen de y-as naar boven hebt zien wijzen. In de wiskunde kunnen assen echter in elke richting wijzen. Ze hoeven niet eens loodrecht te staan. Op de computer komt de positie (0, 0) toevallig overeen met de linkerbovenhoek van je computerscherm. Het is dan logisch dat coördinaten positief zijn wanneer je naar de rechterbenedenhoek gaat. Dit roept een andere vraag op: waarom is positie nul de linkerbovenhoek van het scherm? Dit komt door de geschiedenis van computer- en tv-schermen: ze berekenden en gaven pixels weer beginnend bij de linkerbovenhoek en werkend naar de rechterbenedenhoek.
zh_hans: 如果你只在数学课上看到过指向上方的y轴，这可能会令人困惑。 但是，在数学中，数轴可以指向任何地方。它们甚至不一定是垂直的。 在计算机领域，位置 (0, 0) 恰好对应计算机屏幕的左上角。 因此当朝向右下角时，坐标为正是有意义的。 这就引出了另一个问题：为什么零点在屏幕的左上角？ 这是由于计算机和显示器的历史：在以前是从左上角开始计算并显示像素，然后向右下角移动的。
zh_hant: 這可能會讓你感到困惑，因為在數學課中，y 軸通常是指向上的。然而，在數學中，座標軸的方向是可以任意設定的，甚至不必垂直。 在電腦中，位置 (0, 0) 恰好對應於螢幕的左上角。因此，當座標朝著右下角延伸時，數值就會變大，這樣就合理了。 這也引出了另一個問題：為什麼位置零是在螢幕的左上角？這是由於電腦和電視顯示的歷史：顯示設備會從螢幕的左上角開始計算和顯示像素，然後向右下角延伸。

source: To access a sub-variable, you need to write a dot between the parent variable name and the sub-variable name. For example, to access the [code]x[/code] sub-variable of the [code]position[/code] variable, you'll write [code]position.x[/code].
cs: Chcete-li přistupovat k dílčí proměnné, musíte mezi název nadřazené proměnné a název dílčí proměnné napsat tečku. Například pro přístup k [code]x[/code] podproměnné proměnné [code]position[/code] napíšete [code]position.x[/code].
de: Um auf eine Untervariable zuzugreifen, musst Du einen Punkt zwischen dem Namen der übergeordneten Variablen und dem Namen der Untervariablen schreiben. Um beispielsweise auf die Untervariable [code]x[/code] der Variablen [code]position[/code] zuzugreifen, schreibe [code]position.x[/code].
nl: Om een deelvariabele te gebruiken, zet je een punt tussen de naam van de bevattende variabele en de naam van de deelvariabele. Om bijvoorbeeld de deelvariabele [code]x[/code] van de variabele [code]position[/code] te gebruiken, schrijf je [code]position.x[/code].
zh_hans: 要访问子变量，需要在父变量名称和子变量名称之间写一个点。 例如，要访问变量 [code]position[/code] 的子变量 [code]x[/code] ，你需要写 [code]position.x[/code]。
zh_hant: 要存取子變數，你需要在父變數名稱和子變數名稱之間寫上一個點（"."）。 例如，要存取 [code]position[/code] 變數的 [code]x[/code] 子變數，你需要寫成 [code]position.x[/code]。

source: In a future lesson, we'll explain why and how those variables have sub-variables. For now, just know you can use the dot to access them. We'll tell you which variables have sub-components and what their names are. In the next lessons, you'll create your own variables and do operations on them to add or remove [code]score[/code], [code]health[/code], you name it. For now, let's practice accessing variables.
cs: V některé z příštích lekcí si vysvětlíme, proč a jak tyto proměnné mají dílčí proměnné. Zatím jen vězte, že k nim můžete přistupovat pomocí tečky. Řekneme si, které proměnné mají dílčí složky a jak se jmenují. V dalších lekcích si vytvoříte vlastní proměnné a budete s nimi provádět operace, abyste mohli přidávat nebo odebírat [code] score[/code], [code] health[/code] - skore, zdraví nebo cokoli dalšího Vás napadne. Prozatím si procvičme přístup k proměnným.
de: In einer zukünftigen Lektion werden wir erklären, warum und wie diese Variablen Untervariablen haben. Für den Moment weißt Du nur, dass Du den Punkt verwenden kannst, um auf sie zuzugreifen. Wir sagen dir, welche Variablen Unterkomponenten haben und wie sie heißen. In den nächsten Lektionen erstellst Du deine eigenen Variablen und führst Operationen für sie aus, um Punktzahl([code]score[/code]), Leben([code]health[/code] oder Andere hinzuzufügen oder zu entfernen. Lass uns zunächst den Zugriff auf Variablen üben.
nl: In een volgende les zullen we uitleggen waarom en hoe deze variabelen deelvariabelen hebben. Voor nu hoef je alleen maar te weten dat je de punt kunt gebruiken om ze te gebruiken. We zullen je vertellen welke variabelen deelvariabelen hebben en hoe ze heten. In de volgende lessen zul je je eigen variabelen maken en er bewerkingen op uitvoeren om [code]score[/code], [code]health[/code], noem maar op, toe te voegen of te verwijderen. Laten we nu oefenen met het gebruiken van variabelen.
zh_hans: 在以后的课程中，我们将解释这些变量为什么有子变量，以及是怎样实现的。 现在，你只需要知道可以使用点号来访问它们。 我们会告诉你哪些变量具有子组件以及子组件的名称。 在接下来的课程中，你将创建自己的变量并操作它们，添加或删除 [code]score[/code]（得分）、[code]health[/code]（生命值），什么都行。 现在，让我们来练习访问变量。
zh_hant: 在未來的課程中，我們將解釋為什麼以及如何讓這些變數有子變數。 目前，只需要知道你可以使用點（"."）來存取它們。 我們會告訴你哪些變數有子元件，以及它們的名稱。 在接下來的課程中，你將創建自己的變數並對它們進行操作，像是加減 [code]score[/code]、[code]health[/code] 等。 現在，讓我們來練習存取變數。

source: Draw a rectangle of 200 by 120 pixels at the X position of 120 pixels and Y position of 100 pixels. You need to replace the numbers in the code editor to draw the correct rectangle.
cs: Nakreslete obdélník 200 x 120 pixelů na pozici X 120 pixelů a pozici Y 100 pixelů. Abyste nakreslili správný obdélník, musíte čísla v editoru kódu nahradit.
de: Zeichne ein Rechteck von 200 x 120 Pixeln an der X-Position von 120 Pixeln und der Y-Position von 100 Pixeln. Du musst die Zahlen im Code-Editor ersetzen, um das richtige Rechteck zu zeichnen.
nl: Teken een rechthoek van 200 bij een X-positie van 120 pixels en een Y-positie van 100 pixels. Vervang de getallen in de code editor om de juiste rechthoek te tekenen.
zh_hans: 在X轴 120 像素位置和Y轴 100 像素位置绘制一个 200 x 120 像素的矩形。 你需要替换代码编辑器中的数字以绘制正确的矩形。
zh_hant: 在 X 位置為 120 像素、Y 位置為 100 像素的地方，繪製一個 200 x 120 像素的矩形。 你需要將程式碼編輯器中的數字替換為正確的數值，以繪製正確的矩形。

source: Draw three squares of size 100 by 100 that are 100 pixels apart on the horizontal axis. In other words, there should be a 100-pixel gap between two squares. You should draw the squares starting at the position (100, 100). This means you should position the first square at 100 on the X axis and 100 on the Y axis. Remember you need to use the equal sign ([code]=[/code]) to change the value of a variable, like the turtle's position. Write your code inside the [code]run()[/code] function so the computer can recognize it. Use the provided [code]draw_rectangle()[/code] function to draw each square.
nl: Teken drie vierkanten van 100 bij 100 die horizontaal 100 pixels uit elkaar liggen. Met andere woorden, er moet een ruimte van 100 pixels zijn tussen twee vierkanten. Teken de vierkanten vanaf de positie (100, 100). Dit betekent dat je het eerste vierkant op 100 op de X-as en 100 op de Y-as moet plaatsen. Onthoud dat je het gelijkheidsteken ([code]=[/code]) gebruikt om de waarde van een variabele te veranderen, zoals de positie van de schildpad. Zet je code in de [code]run()[/code] functie zodat de computer het kan herkennen. Gebruik de bijgeleverde functie [code]draw_rectangle()[/code] om elk vierkant te tekenen.
zh_hans: 绘制三个大小为 100 x 100 的正方形，它们在水平轴上相距 100 像素。 换句话说，两个正方形之间应该有 100 像素的间隙。 你应该从位置 (100, 100) 开始绘制正方形。 也就是说你应该将第一个正方形放置在 X 轴上的 100 和 Y 轴上的 100 处。 请记住，你需要使用等号 ([code]=[/code]) 来更改变量的值，例如海龟的位置。 在 [code]run()[/code] 函数中编写你的代码，以便计算机能够识别它。 画正方形的时候，用之前用过的 [code]draw_rectangle()[/code] 函数就行了。
zh_hant: 繪製三個大小為 100 x 100 的正方形，並且它們在水平方向上相隔 100 像素。換句話說，兩個正方形之間應該有 100 像素的間隙。 你應該從位置 (100, 100) 開始繪製這些正方形。這意味著你應該將第一個正方形放置在 X 軸的 100 和 Y 軸的 100。 記得你需要使用等號 ([code]=[/code]) 來改變變數的值，例如海龜的位置。 將你的程式碼寫在 [code]run()[/code] 函式中，讓電腦可以辨識它。 使用提供的 [code]draw_rectangle()[/code] 函式來繪製每個正方形。

source: In video games, you will see many member variables that have sub-values. For example, the [code]position[/code] we mentioned has two coordinates: [code]x[/code] and [code]y[/code]. It's the same for the [code]scale[/code]: it has [code]x[/code] and [code]y[/code] sub-variables. They respectively control the horizontal and vertical size of the game entity. To access those X and Y sub-components, you add a dot (".") after the variable name. The code below places the entity at [code]180[/code] pixels on the x-axis and [code]120[/code] pixels on the y-axis.
de: In Videospielen findest Du viele Mitgliedsvariablen mit Unterwerten. Zum Beispiel hat der Unterwert [code]position[/code], den wir erwähnt haben, zwei Koordinaten: [code]x[/code] und [code]y[/code]. Dasselbe gilt für den Unterwert [code]scale[/code]: er hat die Untervariablen [code]x[/code] und [code]y[/code].. Du steuerst jeweils die horizontale und vertikale Größe der Spielentität. Um auf diese X- und Y-Unterkomponenten zuzugreifen, füge nach dem Variablennamen einen Punkt (".") hinzu. Der folgende Code platziert die Entität bei [code]180[/code] Pixeln auf der x-Achse und [code]120[/code] Pixeln auf der y-Achse.

source: Note that in games, assuming your character's position starts at (0, 0), the code above moves the entity [code]180[/code] pixels to the right and [code]120[/code] pixels down. In math, the y-axis is generally positive going up by convention. The convention is the [i]opposite[/i] in video games and many computer applications: the y-axis is positive going down.
de: Beachte, dass in Spielen, wenn die Position deines Charakters bei (0, 0) beginnt, der obige Code die Entität [Code]180[/Code] Pixel nach rechts und [Code]120[/Code] Pixel nach unten verschiebt. In der Mathematik geht die y-Achse im Allgemeinen allgemein nach oben bei positiven Werten. Konventionell ist das [i]entgegengesetzt[/i] in Videospielen und vielen Computeranwendungen: Die y-Achse ist nach unten hin positiv.

source: Draw three squares of size 100 by 100 that are 100 pixels apart on the horizontal axis. In other words, there should be a 100-pixel gap between two squares. You should draw the squares starting at the position (100, 100). This means you should position the first square at 100 on the X axis and 100 on the Y axis. Remember you need to use the equal sign ([code]=[/code]) to change the value of a variable, like the turtle's position. Write your code inside the [code]run()[/code] function so the computer can recognize it.
de: Zeichne drei Quadrate der Größe 100 x 100, die auf der horizontalen Achse 100 Pixel voneinander entfernt sind. Mit anderen Worten, es sollte eine Lücke von 100 Pixeln zwischen zwei Quadraten bestehen. Du solltest die Quadrate beginnend an der Position (100, 100) zeichnen. Das bedeutet, dass Du das erste Quadrat auf der X-Achse bei 100 und auf der Y-Achse bei 100 positionieren solltest. Denke daran, dass Du das Gleichheitszeichen ([code]=[/code]) verwenden musst, um den Wert einer Variablen zu ändern, z. B. die Position der Schildkröte. Schreibe deinen Code in die Funktion [code]run()[/code], damit der Computer ihn erkennen kann.

source: Now you can place and draw one rectangle, how about placing several? To really get the hang of properties.
de: Jetzt kannst Du ein Rechteck platzieren und zeichnen, wie wäre es mit mehreren um wirklich den Dreh raus zu bekommen?
