Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-6-multiple-function-parameters.po
Languages: cs, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, zh_hans, zh_hant

source: Here's an example with a function to draw any square. Use the slider to change the value passed to the function and draw squares of different sizes.
cs: Zde je příklad s funkcí pro nakreslení libovolného čtverce. Pomocí posuvníku změňte hodnotu předávanou funkci a nakreslete čtverce různých velikostí.
de: Hier ist ein Beispiel mit einer Funktion, um ein beliebiges Quadrat zu zeichnen. Verwende den Schieberegler, um den an die Funktion übergebenen Wert zu ändern und Quadrate unterschiedlicher Größe zu zeichnen.
fr: Voici un exemple avec une fonction permettant de dessiner n'importe quel carré. Utilisez le curseur pour modifier la valeur passée à la fonction et dessiner des carrés de différentes tailles.
it: Ecco un esempio con una funzione che disegna ogni quadrato. Usa lo slider per cambiare il valore passato alla funzione e disegnare quadrati di grandezze differenti.
nl: Hier is een voorbeeld met een functie om een willekeurig vierkant te tekenen. Gebruik de schuifregelaar om de waarde die aan de functie wordt doorgegeven te veranderen en zo vierkanten van verschillende groottes te tekenen.
pt: Aqui está um exemplo de uma função para desenhar qualquer quadrado. Use o slider para alterar o valor passado para a função e desenhar quadrados de tamanhos diferentes.
ru: Вот пример с функцией для рисования любого квадрата. Используйте ползунок, чтобы изменить значение параметра, передаваемого в функцию, и нарисовать квадраты разных размеров.
ta: எந்த சதுரத்தையும் வரைய ஒரு செயல்பாட்டைக் கொண்ட ஒரு எடுத்துக்காட்டு இங்கே. செயல்பாட்டிற்கு அனுப்பப்பட்ட மதிப்பை மாற்றவும், வெவ்வேறு அளவிலான சதுரங்களை வரையவும் ச்லைடரைப் பயன்படுத்தவும்.

source: Which is the correct syntax for a function definition?
cs: Jaká je správná syntaxe pro definici funkce?
de: Was ist die korrekte Syntax für eine Funktionsdefinition?
es: ¿Cuál es la sintaxis correcta para la definición de una función?
fr: Quelle est la syntaxe correcte pour une définition de fonction ?
it: Qual è la sintassi corretta per una definizione di funzione?
ja: 関数定義の正しい構文はどれですか?
nl: Wat is de juiste vorm voor een functiedefinitie?
pt: Qual é a sintaxe correta para uma definição de função?
pt_br: Qual é a sintaxe correta para uma definição de função?
ru: Какой синтаксис является правильным для определения функции?
ta: செயல்பாட்டு வரையறைக்கு சரியான தொடரியல் எது?
zh_hans: 下列哪个函数定义的语法是正确的？
zh_hant: 哪一個是正確的函式定義語法？

source: To define a function, you need to start with the [code]func[/code] keyword followed by a space, the [code]function_name[/code], and optional parameters inside parentheses.
cs: Chcete-li definovat funkci, musíte začít klíčovým slovem [code]func[/code] následovaným mezerou, [code]název_funkce[/code] a volitelnými parametry v závorkách.
de: Um eine Funktion zu definieren, musst Du mit dem Schlüsselwort [code]func[/code] beginnen, gefolgt von einem Leerzeichen, dem [code]Funktionsnamen[/code] und optionalen Parametern in Klammern.
fr: Pour définir une fonction, vous devez commencer par le mot-clé [code]func[/code] suivi d'un espace, du [code]nom_de_fonction[/code] et des paramètres facultatifs entre parenthèses.
it: Per definire una funzione, devi iniziare con la parola chiave [code]func[/code] seguito da uno spazio, il [code]nome_della_funzione[/code] e dei parametri opzionali all'interno delle parentesi.
nl: Om een functie te definiëren, moet je beginnen met het sleutelwoord [code]func[/code], gevolgd door een spatie, de [code]function_name[/code] en eventuele parameters tussen haakjes.
pt: Para definir uma função, precisa começar com a palavra-chave [code]func[/code] seguida por um espaço, o [code]nome_da_função[/code] e parâmetros opcionais dentro dos parênteses.
ru: Чтобы определить функцию, нужно начать с ключевого слова [code]func[/code], за ним поставить пробел, [code]имя_функции[/code] и, при необходимости, указать параметры в круглых скобках.
ta: ஒரு செயல்பாட்டை வரையறுக்க, நீங்கள் [குறியீடு] FUNC [/code] முக்கிய சொல்லுடன் தொடங்க வேண்டும், அதைத் தொடர்ந்து ஒரு இடம், [குறியீடு] செயல்பாடு_பெயர் [/குறியீடு] மற்றும் அடைப்புக்குறிக்குள் விருப்ப அளவுருக்கள்.

source: You must end the line with a colon, which defines a new code block. We'll see moving forward that keywords other than [code]func[/code] require a colon at the end of the line.
cs: Řádek musíte ukončit dvojtečkou, která určuje začátek nového bloku kódu (instrukcí). V budoucnu uvidíme, že také jiná klíčová slova než [code]func[/code] vyžadují na konci řádku dvojtečku.
de: Du musst die Zeile mit einem Doppelpunkt beenden, dieser definiert einen neuen Codeblock. Wir werden in Zukunft sehen, dass andere Schlüsselwörter als [code]func[/code] einen Doppelpunkt am Ende der Zeile erfordern.
fr: Vous devez terminer la ligne par deux-points, ce qui définit un nouveau bloc de code. Nous verrons plus tard que les mots-clés autres que [code]func[/code] nécessitent deux-points à la fin de la ligne.
it: Devi concludere la riga con i due punti, che definiscono un nuovo blocco di codice. Vedremo, andando avanti, che le altre parole chiave oltre a [code]func[/code] richiedono i due punti alla fine della linea.
nl: Je moet de regel afsluiten met een dubbele punt, die een nieuw codeblok begint. We zullen verderop zien dat andere sleutelwoorden dan [code]func[/code] ook een dubbele punt aan het einde van de regel nodig hebben.
pt: Deve terminar a linha com o sinal de dois pontos, que define um novo bloco de código. Vamos ver mais para frente que outras palavras-chave diferentes de [code]func[/code] também vão exigir os dois pontos no final da linha.
ru: Вы должны закончить строку двоеточием, определяющим новый блок кода. В дальнейшем мы увидим, что ключевые слова, отличные от [code]func[/code], тоже требуют двоеточие в конце строки.
ta: புதிய குறியீடு தொகுதியை வரையறுக்கும் ஒரு பெருங்குடலுடன் நீங்கள் வரியை முடிக்க வேண்டும். [குறியீடு] FUNC [/code] ஐத் தவிர வேறு சொற்களுக்கு வரியின் முடிவில் ஒரு பெருங்குடல் தேவை என்பதை முன்னோக்கி நகர்த்துவோம்.

source: func function_name(parameter_name):
cs: func nazev_funkce(nazev_parametru):
es: func nombre_de_función(nombre_de_parámetro):
fr: func nom_de_fonction(nom_de_paramètre):
it: func nome_della_funzione(nome_del_parametro):
ja: func 関数名(パラメータ名):
pt: func nome_da_função(nome_do_parâmetro):
pt_br: func nome_da_função(nome_do_parâmetro):

source: func (function_name): parameter_name
cs: func (nazev_funkce): nazev_parametru
es: func (nombre_de_función): nombre_de_parámetro
fr: func (nom_de_fonction): nom_de_paramètre
it: func (nome_della_funzione): nome_del_parametro
ja: func (関数名): パラメータ名
pt: func (nome_da_função): nome_do_parâmetro
pt_br: func (nome_da_função): nome_do_parâmetro
ta: func (செயல்பாடு_பெயர்): அளவுரு_பெயர்

source: func function_name(parameter_name)
cs: func nazev_funkce(nazev_parametru)
es: func nombre_de_función(nombre_de_parámetro)
fr: func nom_de_fonction(nom_de_paramètre)
it: func nome_della_funzione(nome_del_parametro)
ja: func 関数名(パラメータ名)
pt: func nome_da_função(nome_do_parâmetro)
pt_br: func nome_da_função(nome_do_parâmetro)
ta: func function_name (அளவுரு_பெயர்)

source: function_name(parameter_name):
cs: nazev_funkce(nazev_parametru):
es: nombre_de_función(nombre_de_parámetro):
fr: nom_de_fonction(nom_de_paramètre):
it: nome_della_funzione(nome_del_parametro):
ja: 関数名(パラメータ名):
pt: nome_da_função(nome_do_parâmetro):
pt_br: nome_da_função(nome_do_parâmetro):

source: Functions can have multiple parameters
cs: Funkce mohou mít více parametrů
de: Funktionen können mehrere Parameter haben
es: Las funciones pueden tener varios parámetros
fr: Les fonctions peuvent avoir plusieurs paramètres
it: Le funzioni possono avere più parametri
ja: 関数には複数のパラメータを含めることができます
nl: Functies kunnen meerdere parameters hebben
pt: Funções podem ter vários parâmetros
pt_br: Funções podem ter vários parâmetros
ru: Функции могут иметь несколько параметров
ta: செயல்பாடுகள் பல அளவுருக்களைக் கொண்டிருக்கலாம்
zh_hans: 函数可以有多个参数
zh_hant: 函式可以有多個參數

source: You can use multiple parameters in a function. In fact, you can use as many as you [i]need[/i].
cs: Ve funkci můžete použít více parametrů. Ve skutečnosti jich můžete použít tolik, kolik [i]potřebujete[/i].
de: Du kannst mehrere Parameter in einer Funktion verwenden. Tatsächlich kannst Du so viele verwenden, wie Du [i]benötigst[/i].
fr: Vous pouvez utiliser plusieurs paramètres dans une fonction. En fait, vous pouvez en utiliser [i]autant que vous en avez besoin[/i].
it: Puoi usare più parametri in una funzione. Difatti, ne puoi usare quante ne [i]vuoi[/i].
nl: Je kunt meerdere parameters gebruiken in een functie. Je kunt er zelfs zoveel gebruiken als je [i]nodig hebt[/i].
pt: Pode usar vários parâmetros numa função. Na verdade, pode usar quantos parâmetros [i]precisar[/i].
ru: В функции можно использовать несколько параметров. По сути, вы можете использовать столько параметров, сколько вам [i]нужно[/i].
ta: நீங்கள் ஒரு செயல்பாட்டில் பல அளவுருக்களைப் பயன்படுத்தலாம். உண்மையில், நீங்கள் [எனக்கு] தேவைப்படும் பலவற்றைப் பயன்படுத்தலாம் [/i].

source: To separate the function parameters, you need to write a comma between them.
cs: Chcete-li parametry funkce oddělit, musíte mezi ně napsat čárku.
de: Um die Funktionsparameter zu trennen, musst Du ein Komma zwischen sie schreiben.
fr: Pour séparer les paramètres de la fonction, vous devez insérer une virgule entre eux.
it: Per separare i parametri della funzione, devi inserire una virgola tra questi.
nl: Om de functieparameters te scheiden, moet je er een komma tussen zetten.
pt: Para separar os parâmetros da função, precisa escrever uma vírgula entre eles.
ru: Чтобы разделить параметры функции, между ними нужно поставить запятую.
ta: செயல்பாட்டு அளவுருக்களை பிரிக்க, நீங்கள் அவர்களுக்கு இடையே ஒரு கமாவை எழுத வேண்டும்.

source: Must I write spaces between function parameters?
es: ¿Debo escribir espacios entre los parámetros de una función?
fr: Dois-je écrire des espaces entre les paramètres des fonctions ?
ja: 関数パラメータの間にスペースを入力する必要がありますか?
pt: Devo escrever espaços entre os parâmetros da função?
pt_br: Devo escrever espaços entre os parâmetros da função?
ru: Обязательно ли писать пробелы между параметрами функции?
ta: செயல்பாட்டு அளவுருக்களுக்கு இடையில் இடைவெளிகளை எழுத வேண்டுமா?

source: In a function definition, you must have a space between the [code]func[/code] keyword and the function name.
cs: V definici funkce musíte mít mezeru mezi klíčovým slovem [code]func[/code] a názvem funkce.
de: In einer Funktionsdefinition muss zwischen dem Schlüsselwort [code]func[/code] und dem Funktionsnamen ein Leerzeichen stehen.
fr: Dans une définition de fonction, vous devez avoir un espace entre le mot-clé [code]func[/code] et le nom de la fonction.
it: Nella definizione di una funzione, deve esserci uno spazio tra la parola chiave [code]func[/code] e il nome della funzione.
nl: In een functiedefinitie moet er een spatie staan tussen het sleutelwoord [code]func[/code] en de functienaam.
pt: Numa definição de função, deve ter um espaço entre a palavra-chave [code]func[/code] e o nome da função.
ru: В определении функции между ключевым словом [code]func[/code] и именем функции должен быть пробел.
ta: ஒரு செயல்பாட்டு வரையறையில், உங்களிடம் [குறியீடு] FUNC [/code] முக்கிய சொல் மற்றும் செயல்பாட்டு பெயருக்கு இடையில் ஒரு இடம் இருக்க வேண்டும்.

source: However, because we use the comma to separate parameters, it doesn't matter if you use spaces between parameters. As long as you have the comma, either syntax is correct.
cs: Protože však k oddělení parametrů používáme čárku, nezáleží na tom, zda mezi parametry používáte mezery.
de: Da wir jedoch das Komma verwenden, um Parameter zu trennen, spielt es keine Rolle, ob Du Leerzeichen zwischen Parametern verwendest. Solange Du das Komma verwendest, ist jede Syntax korrekt.
fr: Cependant, comme nous utilisons la virgule pour séparer les paramètres, cela n'a pas d'importance si vous utilisez des espaces entre eux. Tant que vous avez la virgule, les deux syntaxes sont correctes.
it: Tuttavia, dato che utilizziamo la virgola per separare i parametri, non importa se inserisci degli spazi tra i parametri. Finché hai la virgola, entrambe le sintassi sono corrette.
nl: Maar omdat we de komma gebruiken om parameters te scheiden, maakt het niet uit of je spaties zet tussen de parameters. Zolang je de komma gebruikt, zijn beide vormen correct.
pt: No entanto, como usamos a vírgula para separar os parâmetros, não importa se usa espaços entre os parâmetros. Contanto que tenha a vírgula, qualquer uma das sintaxes está correta.
ru: Однако, поскольку мы используем запятую для разделения параметров, использовать пробелы между параметрами не обязательно. При наличии запятой любой синтаксис будет правильным.
ta: இருப்பினும், அளவுருக்களைப் பிரிக்க கமாவைப் பயன்படுத்துவதால், நீங்கள் அளவுருக்களுக்கு இடையில் இடைவெளிகளைப் பயன்படுத்தினால் பரவாயில்லை. உங்களிடம் கமா இருக்கும் வரை, தொடரியல் சரியானது.

source: We often use spaces after the comma for readability.
cs: Pro čitelnost často používáme mezery za čárkou.
de: Wir verwenden oft Leerzeichen nach dem Komma um die Lesbarkeit zu erleichtern.
fr: Nous utilisons souvent des espaces après la virgule pour plus de lisibilité.
it: Spesso usiamo gli spazi dopo la virgola per rendere il codice più leggibile.
nl: We gebruiken vaak spaties na de komma voor de leesbaarheid.
pt: Costumamos a usar espaços após a vírgula para facilitar a leitura do código.
ru: Мы часто используем пробелы после запятой для удобства чтения.
ta: கமாவுக்குப் பிறகு வாசிப்புத்திறனுக்காக நாங்கள் பெரும்பாலும் இடங்களைப் பயன்படுத்துகிறோம்.

source: The following example defines a function that uses two parameters to move an entity on both the X and Y axes.
cs: Následující příklad definuje funkci, která pomocí dvou parametrů přesouvá entitu na osách X a Y.
de: Im folgenden Beispiel wird eine Funktion definiert, die zwei Parameter verwendet, um eine Entität sowohl auf der X- als auch auf der Y-Achse zu bewegen.
es: El siguiente ejemplo define una función que utiliza dos parámetros para mover una entidad en los ejes X e Y.
fr: L'exemple suivant définit une fonction qui utilise deux paramètres pour déplacer une entité sur les axes X et Y.
it: Il seguente esempio definisce una funzione che usa due parametri per muovere un elemento nell'asse sia x ché y.
ja: 次の例では、2 つのパラメーターを使用してエンティティを X 軸と Y 軸の両方に移動する関数を定義します。
nl: Het volgend voorbeeld definieert een functie die twee parameters gebruikt om een object te verplaatsen langs zowel de X-as als de Y-as.
pt: O exemplo a seguir define uma função que usa dois parâmetros para mover uma entidade nos eixos X e Y.
pt_br: O exemplo a seguir define uma função que usa dois parâmetros para mover uma entidade nos eixos X e Y.
ru: В следующем примере определена функция, которая использует два параметра для перемещения объекта по осям X и Y.
ta: ஃச் மற்றும் ஒய் அச்சுகள் இரண்டிலும் ஒரு நிறுவனத்தை நகர்த்த இரண்டு அளவுருக்களைப் பயன்படுத்தும் ஒரு செயல்பாட்டை பின்வரும் எடுத்துக்காட்டு வரையறுக்கிறது.
zh_hans: 以下示例定义了一个函数，该函数使用两个参数在 X 轴和 Y 轴上移动实体。
zh_hant: 以下範例定義了一個函式，使用兩個參數來同時移動一個實體於 X 軸和 Y 軸上。

source: How should I name my functions and parameters?
cs: Jak mám pojmenovat své funkce a parametry?
de: Wie soll ich meine Funktionen und Parameter benennen?
es: ¿Cómo debo nombrar mis funciones y parámetros?
fr: Comment dois-je nommer mes fonctions et paramètres ?
it: Come dovrei chiamare la mia funzione e i suoi parametri?
ja: 関数やパラメータにどのような名前を付ければよいでしょうか?
nl: Hoe moet ik mijn functies en parameters noemen?
pt: De que forma devo nomear as minhas funções e parâmetros?
pt_br: De que forma eu devo nomear minhas funções e parâmetros?
ru: Как правильно назвать свои функции и параметры?
ta: எனது செயல்பாடுகள் மற்றும் அளவுருக்களை நான் எவ்வாறு பெயரிட வேண்டும்?
zh_hans: 我应该如何命名我的函数和参数？
zh_hant: 我應該如何命名我的函式和參數？

source: The names of functions, parameters, or other things in your code are entirely up to you.
cs: Názvy funkcí, parametrů a dalších věcí v kódu jsou zcela na vás.
de: Die Namen von Funktionen, Parametern oder anderen Dingen in deinem Code kannst Du frei wählen.
fr: Les noms des fonctions, des paramètres ou d'autres éléments de votre code dépendent entièrement de vous.
it: I nomi delle funzioni, dei parametri, o di altre cose nel tuo codice sono a tua discrezione.
nl: De namen van functies, parameters en andere dingen in je code zijn geheel aan jou.
pt: Os nomes de funções, parâmetros ou outras coisas no seu código dependem inteiramente de si.
ru: Имена функций, параметров и других вещей в вашем коде зависят только от вас.
ta: உங்கள் குறியீட்டில் உள்ள செயல்பாடுகள், அளவுருக்கள் அல்லது பிற விசயங்களின் பெயர்கள் முற்றிலும் உங்களுடையது.

source: They are written by us programmers for other programmers. You want to use the names that make the most sense to you and fellow programmers.
cs: Píšeme je my, programátoři, pro jiné programátory. Chcete používat názvy, které dávají největší smysl vám i ostatním programátorům.
de: Sie werden von uns Programmierern für andere Programmierer geschrieben. Du solltest Namen verwenden, die für dich und andere Programmierer am sinnvollsten erscheinen.
fr: Ils sont écrits par nous, programmeurs, pour d'autres programmeurs. Vous voudrez ainsi utiliser les noms qui ont le plus de sens pour vous et pour les autres programmeurs.
it: Sono scritti da noi programmatori per altri programmatori. Dovresti voler utilizzare i nomi che hanno più senso per te e per gli altri programmatori.
nl: Ze zijn geschreven door ons programmeurs voor andere programmeurs. Je wilt namen gebruiken die voor jou en je collega-programmeurs het meest logisch zijn.
pt: Eles são escritos por nós programadores para outros programadores. Vai usar os nomes que fazem mais sentido para si e os seus colegas programadores.
ru: Они написаны нами, программистами, для других программистов. Правильнее использовать имена, которые имеют наибольший смысл для вас и других программистов.
ta: அவை மற்ற புரோகிராமர்களுக்காக அமெரிக்க புரோகிராமர்களால் எழுதப்பட்டுள்ளன. உங்களுக்கும் தம புரோகிராமர்களுக்கும் மிகவும் புரியும் பெயர்களை நீங்கள் பயன்படுத்த விரும்புகிறீர்கள்.

source: You could absolutely write single-letter names like in maths classes: [code]a[/code], [code]b[/code], [code]f[/code].
cs: Můžete psát jednopísmenné názvy jako v hodinách matematiky: [code]a[/code], [code]b[/code], [code]f[/code].
de: Du kannst durchaus Namen mit nur einem Buchstaben nehmen, wie im Matheunterricht: [code]a[/code], [code]b[/code], [code]f[/code].
fr: Vous pourriez tout à fait écrire des noms d'une seule lettre, comme dans les cours de maths : [code]a[/code], [code]b[/code], [code]f[/code].
it: Potresti scrivere nomi da una singola lettera come nelle lezioni di matematica: [code]a[/code], [code]b[/code], [code]f[/code].
nl: Je zou zeker namen van één letter kunnen gebruiken, zoals in wiskundelessen: [code]a[/code], [code]b[/code], [code]f[/code].
pt: Poderia muito bem escrever nomes de uma única letra como nas aulas de matemática: [code]a[/code], [code]b[/code], [code]f[/code].
ru: Вы можете писать однобуквенные имена, как на уроках математики: [code]a[/code], [code]b[/code], [code]f[/code].
ta: கணித வகுப்புகள் போன்ற ஒற்றை-எழுத்து பெயர்களை நீங்கள் முற்றிலும் எழுதலாம்: [குறியீடு] ஒரு [/குறியீடு], [குறியீடு] பி [/குறியீடு], [குறியீடு] எஃப் [/குறியீடு].

source: You can also write abbreviated names like [code]pos[/code] for position, [code]bg[/code] for background, and so on.
cs: Můžete také psát zkrácené názvy, například [code]pos[/code] pro pozici, [code]bg[/code] pro pozadí atd.
de: Du kannst auch abgekürzte Namen schreiben, wie [code]pos[/code] für Position, [code]bg[/code] für Background (auf deutsch Hintergrund) und so weiter.
fr: Vous pourriez également écrire des noms abrégés comme [code]pos[/code] pour la position, [code]ap[/code] pour l'arrière-plan, etc.
it: Puoi anche scrivere nomi abbreviati come [code]pos[/code] per posizione, [code]sf[/code] per sfondo e così via.
nl: Je kunt ook afgekorte namen gebruiken zoals [code]pos[/code] voor positie, [code]ag[/code] voor achtergrond, enzovoort.
pt: Também pode escrever nomes abreviados como [code]pos[/code] para posição, [code]bg[/code] para background e assim por diante.
ru: Также вы можете писать сокращенные имена, например [code]pos[/code] для позиции, [code]bg[/code] для фона и так далее.
ta: நிலைக்கு [குறியீடு] பிஓஎச் [/குறியீடு] போன்ற சுருக்கமான பெயர்களையும் எழுதலாம், [குறியீடு] பி.சி [/குறியீடு] பின்னணிக்கு மற்றும் பல.

source: Many programmers do either or both of the above.
cs: Mnoho programátorů provádí jednu nebo obě výše uvedené činnosti.
de: Viele Programmierer tun eines oder beide der oben genannten Dinge.
fr: De nombreux programmeurs font l'une ou l'autre ou les deux.
it: Molti programmatori fanno come uno o come entrambi i modi mostrati sopra.
nl: Veel programmeurs gebruiken een van de bovenstaande of beide.
pt: Muitos programadores fazem uma ou ambas as opções acima.
ru: Многие программисты выбирают один или оба из вышеперечисленных вариантов.
ta: பல புரோகிராமர்கள் மேலே அல்லது இரண்டையும் செய்கிறார்கள்.

source: At GDQuest, we favor complete and explicit names.
cs: V GDQuestu dáváme přednost úplným a explicitním názvům.
de: Bei GDQuest bevorzugen wir vollständige und eindeutige Namen.
fr: Dans GDQuest, nous privilégions les noms complets et explicites.
it: A GDQuest, preferiamo nomi completi ed espliciti.
nl: Bij GDQuest geven we de voorkeur aan volledige en duidelijke namen.
pt: Na GDQuest, preferimos nomes completos e explícitos.
ru: В GDQuest мы предпочитаем полные и ясные имена.
ta: GDQuest இல், முழுமையான மற்றும் வெளிப்படையான பெயர்களை நாங்கள் விரும்புகிறோம்.

source: We generally try to write code that is explicit and relatively easy to read.
cs: Obecně se snažíme psát kód, který je explicitní a relativně snadno čitelný.
de: Wir versuchen im Allgemeinen, Code zu schreiben, der eindeutig und relativ leicht zu lesen ist.
fr: Nous essayons généralement d'écrire du code qui est explicite et relativement facile à lire.
it: Generalmente cerchiamo di scrivere codice che è esplicito e relativamente semplice da leggere.
nl: Over het algemeen proberen we code te schrijven die duidelijk en relatief gemakkelijk te lezen is.
pt: Geralmente tentamos escrever código que seja explícito e relativamente fácil de ler.
ru: Обычно мы стараемся писать понятный и относительно легко читаемый код.
ta: நாங்கள் பொதுவாக வெளிப்படையான மற்றும் படிக்க எளிதான குறியீட்டை எழுத முயற்சிக்கிறோம்.

source: Right now, you have to enter every letter when you code, so long names may feel inconvenient.
cs: To, že musíte v tomto kurzu při kódování zadávat každé písmeno, může působit nepohodlně.
de: Im Moment musst du beim Programmieren jeden Buchstaben eingeben, somit können lange Namen als lästig empfunden werden.
fr: En ce moment, vous devez taper chaque lettre lorsque vous codez, alors les noms longs peuvent sembler gênants.
it: Adesso, devi scrivere ogni lettera quando programmi, quindi nomi lunghi potrebbero sembrare sconvenienti.
nl: Op dit moment moet je elke letter invoeren tijdens het coderen, dus lange namen kunnen onhandig aanvoelen.
pt: No momento, precisa digitar todas as letras ao programar, portanto, nomes longos podem parecer inconvenientes.
ru: Сейчас при написании кода вам приходится вводить каждую букву, поэтому длинные имена могут показаться неудобными.
ta: இப்போது, நீங்கள் குறியிடும்போது ஒவ்வொரு கடிதத்தையும் உள்ளிட வேண்டும், எனவே நீண்ட பெயர்கள் சிரமமாக இருக்கும்.
