Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-23-append-to-arrays.po
Languages: cs, de, es, it, ja, ru, ta, uk, zh_hant

source: In previous lessons, you learned how to create arrays to store lists of values and how to loop over them. It's nice, but you won't go far with only that.
de: In den vorherigen Lektionen hast du gelernt, wie du Arrays zum Speichern von mehreren Werten erstellst und Schleifen auf die Arrays anwendest. Das ist ein guter Start, aber nur damit wirst du nicht weit kommen.
es: En lecciones anteriores, aprendiste cómo crear matrices para almacenar listas de valores y cómo hacer bucles sobre ellas. Está muy bien, pero no llegarás muy lejos sólo con eso.
it: Nelle lezioni precedenti, hai imparato come si creano gli array per conservare liste di variabili e per ciclarvi attraverso. Fanno comodo, ma non andrai molto lontano solo con questo.
ja: 前のレッスンでは、値のリストを格納する配列を作成する方法と、値をループ処理する方法を学習しました。それは素晴らしいことですが、それだけでは遠くまで行きません。
ru: В предыдущих уроках вы научились создавать массивы для хранения списка значений и перебирать их элементы в цикле. Это здорово, но на этих возможностях вы далеко не уедете.
ta: முந்தைய பாடங்களில், மதிப்புகளின் பட்டியல்களை சேமிக்க வரிசைகளை எவ்வாறு உருவாக்குவது என்பதையும், அவற்றை எவ்வாறு சுழற்றுவது என்பதையும் நீங்கள் கற்றுக்கொண்டீர்கள். இது நன்றாக இருக்கிறது, ஆனால் நீங்கள் அதை மட்டுமே கொண்டு செல்ல மாட்டீர்கள்.

source: The real strength of arrays is that you can add and remove values from them at any time. It allows you to [i]queue[/i] or [i]stack[/i] data.
de: Die wahre Stärke von Arrays besteht darin, dass man ihnen jederzeit Werte hinzufügen und entfernen kann. Arrays ermöglichen es, Daten als [i]queue[/i] oder [i]stack[/i] darzustellen.
es: La verdadera fuerza de las matrices es que puedes agregar y quitar valores de ellas en cualquier momento. Te permite [i]poner en cola[/i] o [i]apilar[/i] datos.
it: La vera forza degli array sta nel fatto che puoi aggiungere rimuovere valori all'interno di questi quando vuoi. Ti permette di [i]accodare[/i] o [i]impilare[/i] dati.
ja: 配列の本当の強みは、いつでも値を追加および削除できることです。これにより、データを[i]キュー[/i]に入れたり[i]スタック[/i]したりできます。
ru: Настоящая сила массивов в том, что вы можете добавлять и удалять элементы из них в любое время. Это позволяет вам [i]ставить в очередь[/i] или [i]складывать данные в стек[/i].
ta: வரிசைகளின் உண்மையான வலிமை என்னவென்றால், நீங்கள் எந்த நேரத்திலும் அவர்களிடமிருந்து மதிப்புகளைச் சேர்த்து அகற்றலாம். இது [i] வரிசை [/i] அல்லது [i] அடுக்கை [/i] தரவை அனுமதிக்கிறது.

source: For now, let's take another example.
cs: Vezměme si nyní jiný příklad.
de: Schauen wir uns zunächst ein weiteres Beispiel an.
es: Por ahora, tomemos otro ejemplo.
it: Per ora, prendiamo un altro esempio.
ja: とりあえず、別の例を見てみましょう。
ru: Давайте рассмотрим пример.
ta: இப்போதைக்கு, மற்றொரு எடுத்துக்காட்டு எடுத்துக்கொள்வோம்.
uk: А поки візьмемо інший приклад.
zh_hant: 現在，讓我們來看另一個例子。

source: Tracking orders in a restaurant management game
cs: Sledování objednávek ve hře o řízení restaurace
de: Abarbeiten von Bestellungen in einem Restaurantmanagementspiel
es: Seguir pedidos en un juego de gestión de restaurantes
it: Gestire ordini in un gioco gestionale
ja: レストラン管理ゲームでの注文の追跡
ru: Отслеживание заказов в игре по управлению рестораном
ta: உணவக மேலாண்மை விளையாட்டில் ஆர்டர்களைக் கண்காணித்தல்
uk: Відстеження замовлень у грі про управління рестораном
zh_hant: 在餐廳經營遊戲中追蹤訂單

source: You're making a restaurant management game where customers place orders, and you need to handle them as they come.
de: Du machst ein Restaurantmanagementspiel, in welchem Kunden Bestellungen aufgeben, die du bearbeiten musst.
es: Estás haciendo un juego de gestión de restaurantes en el que los clientes hacen pedidos y tienes que manejarlos a medida que van llegando.
it: Stai facendo un gioco gestionale riguardo un ristorante in cui i clienti piazzano degli ordini e tu devi gestirli mano a mano che arrivano.
ja: 顧客が注文し、注文が来たときに処理する必要があるレストラン管理ゲームを作成しています。
ru: Вы создаёте игру про управление рестораном, где клиенты делают заказы, а вам нужно обрабатывать их по мере поступления.
ta: வாடிக்கையாளர்கள் ஆர்டர்களை வைக்கும் உணவக மேலாண்மை விளையாட்டை நீங்கள் உருவாக்குகிறீர்கள், மேலும் அவை வரும்போது அவற்றைக் கையாள வேண்டும்.

source: In this game, customers order meals that end up in a queue. You need to prepare them in the kitchen.
de: In diesem Spiel bestellen Kunden Mahlzeiten, die in einer Warteschlange landen. Du musst die Mahlzeiten in der Küche zubereiten.
es: En este juego, los clientes hacen pedidos de comida que acaban en una cola. Tienes que prepararlos en la cocina.
it: In questo gioco, i clienti ordinano dei pasti che finiscono in una lista d'attesa. Devi prepararli nella cucina.
ja: このゲームでは、顧客が注文した食事が列に並びます。キッチンで準備する必要があります。
ru: В этой игре заказы клиентов попадают в очередь. Вам нужно готовить их на кухне.
ta: இந்த விளையாட்டில், வாடிக்கையாளர்கள் ஒரு வரிசையில் முடிவடையும் உணவை ஆர்டர் செய்கிறார்கள். நீங்கள் அவற்றை சமையலறையில் தயாரிக்க வேண்டும்.

source: In this example, we simulate orders arriving and getting completed over time.
de: In diesem Beispiel simulieren wir, dass Bestellungen im Laufe der Zeit ankommen und abgeschlossen werden.
es: En este ejemplo, simulamos pedidos que llegan y que se completan con el tiempo.
it: In questo esempio, simuliamo gli ordini che arrivano e che vengono completati con il tempo.
ja: この例では、時間の経過とともに注文が到着し、完了することをシミュレートします。
ru: В этом примере мы имитируем поступление заказов и их выполнение за определённое время.
ta: இந்த எடுத்துக்காட்டில், காலப்போக்கில் வந்து முடிக்கப்பட்ட ஆர்டர்களை நாங்கள் உருவகப்படுத்துகிறோம்.

source: How do you keep track of pending and completed orders? With an array!
de: Wie behältst du den Überblick über ausstehende und abgeschlossene Bestellungen? Mit einem Array!
es: ¿Cómo llevas la cuenta de los pedidos pendientes y completados? ¡Con una matriz!
it: Come fai a gestire la lista di tutti gli ordini da completare e completati? Con un array!
ja: 保留中の注文と完了した注文をどのように追跡しますか?配列付き!
ru: Как отследить выполненные и невыполненные заказы? С помощью массива!
ta: நிலுவையில் உள்ள மற்றும் நிறைவு செய்யப்பட்ட ஆர்டர்களை எவ்வாறு கண்காணிப்பது? ஒரு வரிசையுடன்!

source: When a customer purchases a meal, you want to [i]append[/i] it to the array. Then, as you complete a meal in the kitchen and serve it, you want to remove it from the array.
de: Wenn ein Kunde eine Mahlzeit kauft, möchtest du sie an das Array [i]anhängen[/i]. Wenn du dann eine Mahlzeit in der Küche vervollständigst und servierst, möchtest du sie aus dem Array entfernen.
es: Cuando un cliente compre una comida, querrás [i]añadirla[/i] a la matriz. Luego, cuando completes una comida en la cocina y la sirvas, querrás eliminarla de la matriz.
it: Quando un cliente compra un pasto, lo vuoi [i]accodare[/i] all'array. Dopo, man mano che completi un pasto in cucina e lo servi, lo vuoi rimuovere dall'array.
ja: 顧客が食事を購入したら、その食事を配列に[i]追加[/i]します。次に、キッチンで食事を完成させて提供するときに、配列から削除する必要があります。
ru: Когда посетитель покупает блюдо, вы [i]добавляете[/i] его в массив. Затем, когда блюдо готово и подано посетителю, вы удаляете его из массива.
ta: ஒரு வாடிக்கையாளர் உணவை வாங்கும்போது, நீங்கள் அதை வரிசையில் சேர்க்க வேண்டும் [/i]. பின்னர், நீங்கள் சமையலறையில் ஒரு உணவை நிறைவு செய்து பரிமாறும்போது, அதை வரிசையிலிருந்து அகற்ற விரும்புகிறீர்கள்.

source: You can do that with the [code]append()[/code] and the [code]pop_front()[/code] functions of the array, respectively.
de: Du kannst dies mit den Funktionen [code]append()[/code] bzw. [code]pop_front()[/code] des Arrays tun.
es: Puedes hacer esto con las funciones [code]append()[/code] y [code]pop_front()[/code] de la matriz, respectivamente.
it: Puoi fare ciò con le funzioni per array [code]append()[/code] e [code]pop_front()[/code], rispettivamente.
ja: これは、配列の [code]append()[/code] 関数と [code]pop_front()[/code] 関数でそれぞれ行うことができます。
ru: Этого можно достичь при помощи [code]append()[/code] и [code]pop_front()[/code] — функций массива.
ta: நீங்கள் முறையே [குறியீடு] பிற்சேர் () [/code] மற்றும் [குறியீடு] POP_FRONT () [/குறியீடு] செயல்பாடுகளுடன் இதைச் செய்யலாம்.

source: Try to read the code below before moving on. Don't worry if not everything makes sense, as we'll break it all down.
de: Versuche, den folgenden Code zu lesen, bevor du fortfährst. Mach dir keine Sorgen, wenn nicht alles Sinn ergibt, wir werden es später im Detail anschauen.
es: Intenta leer el código a continuación antes de seguir adelante. No te preocupes si no todo tiene sentido, ya que lo desglosaremos.
it: Prova a leggere il codice qua sotto prima di andare avanti. Non ti preoccupare se qualcosa non la riesci a capire, tratteremo tutto in questa lezione.
ja: 先に進む前に、以下のコードを読んでみてください。すべてが理にかなっているとは限らなくても、すべてを分解しますのでご安心ください。
ru: Попробуйте прочитать код, приведённый ниже, прежде чем продвинетесь дальше. Не беспокойтесь, если не всё понятно, дальше мы детально его разберём.
ta: நகரும் முன் கீழே உள்ள குறியீட்டைப் படிக்க முயற்சிக்கவும். கவலைப்பட வேண்டாம் என்றால் எல்லாம் அர்த்தமல்ல, ஏனென்றால் நாம் அனைத்தையும் உடைப்போம்.

source: Notice how we call some functions by writing a dot after a variable name. Like a given value type can have sub-variables, it can also have its own functions.
de: Beachte, wie wir einige Funktionen aufrufen, indem wir einen Punkt nach einem Variablennamen schreiben. So wie ein Werttyp Untervariablen haben kann, kann er auch seine eigenen Funktionen haben.
es: Observa que llamamos a algunas funciones escribiendo un punto después del nombre de una variable. Al igual que un tipo de valor determinado puede tener subvariables, también puede tener sus propias funciones.
it: Osserva come chiamiamo delle funzioni inserendo un punto dopo il nome della variabile. Come un particolare tipo di variabile può avere delle sotto-variabili, può anche avere le sue funzioni.
ja: 変数名の後にドットを記述していくつかの関数を呼び出す方法に注目してください。特定の値型がサブ変数を持つことができるのと同様に、独自の関数を持つこともできます。
ru: Обратите внимание, что некоторые функции мы вызываем при помощи точки после имени переменной. Значение некоторого типа может иметь как внутренние переменные, так и внутренние функции.
ta: மாறி பெயருக்குப் பிறகு ஒரு புள்ளியை எழுதுவதன் மூலம் சில செயல்பாடுகளை எவ்வாறு அழைக்கிறோம் என்பதைக் கவனியுங்கள். கொடுக்கப்பட்ட மதிப்பு வகையைப் போலவே துணை மாறிகள் இருக்கக்கூடும், அது அதன் சொந்த செயல்பாடுகளையும் கொண்டிருக்கலாம்.

source: Functions like [code]append()[/code] and [code]pop_front()[/code] only exist on arrays. That's why to call them, we need to access it from the array using the dot: [code]array.append()[/code].
de: Funktionen wie [code]append()[/code] und [code]pop_front()[/code] existieren nur auf Arrays. Deshalb müssen wir, um sie aufzurufen, vom Array aus mit dem Punkt darauf zugreifen: [code]array.append()[/code].
es: Funciones como [code]append()[/code] y [code]pop_front()[/code] sólo existen en las matrices. Por eso, para llamarlas, tenemos que acceder desde la matriz utilizando el punto: [code]array.append()[/code].
it: Le funzioni come [code]append()[/code] e [code]pop_front()[/code] esistono soltanto sugli array. Questo è il motivo per cui, per chiamarle dobbiamo inserire un punto davanti l'array: [code]array.append()[/code].
ja: [code]append()[/code] や [code]pop_front()[/code] のような関数は配列にのみ存在します。そのため、それらを呼び出すには、ドットを使用して配列からアクセスする必要があります: [code]array.append()[/code]。
ru: Такие функции, как [code]append()[/code] и [code]pop_front()[/code], существуют только внутри массивов. Поэтому для их вызова нам необходимо ставить точку: [code]array.append()[/code].
ta: . அதனால்தான் அவர்களை அழைக்க, புள்ளியைப் பயன்படுத்தி வரிசையில் இருந்து அதை அணுக வேண்டும்: [குறியீடு] வரிசை.ஆப்பண்ட் () [/குறியீடு].

source: Let's break down the code.
de: Schauen wir uns den Code etwas genauer an.
es: Ahora, vamos a desglosar el código.
it: Analizziamo un po' il codice.
ja: コードを分解してみましょう。
ru: Давайте разберём код.
ta: குறியீட்டை உடைப்போம்.

source: We queue orders in the [code]waiting_orders[/code] array by appending them to the array.
de: Wir fügen Bestellungen in das Array [code]waiting_orders[/code], um diese in die Warteschlange zu legen.
es: Ponemos en cola los pedidos en la matriz denominada [code]waiting_orders[/code] añadiéndolos a la matriz.
it: Accodiamo gli ordini nell'array [code]waiting_orders[/code] aggiungendoli all'array.
ja: [code]waiting_orders[/code] 配列の注文を配列に追加してキューに入れます。
ru: Мы добавляем заказы в порядке очереди в массив [code]waiting_orders[/code].
ta: [குறியீடு] காத்திருப்பு_ ஆர்டர்கள் [/குறியீடு] வரிசையில் சேர்ப்பதன் மூலம் ஆர்டர்களை வரிசையில் சேர்ப்போம்.

source: We can use a string to represent a meal when calling the [code]add_order()[/code] function.
cs: Při volání funkce [code]add_order()[/code] můžeme k reprezentaci jídla použít řetězec.
de: Beim Aufruf der Funktion [code]add_order()[/code], geben wir den Namen der Mahlzeit als Zeichenfolge (String) mit.
es: Podemos utilizar una cadena para representar una comida cuando llamamos a la función [code]add_order()[/code].
it: Possiamo usare una stringa per rappresentare una pietanza quando chiamiamo la funzione [code]add_order()[/code].
ja: [code]add_order()[/code] 関数を呼び出すときに、文字列を使用して食事を表すことができます。
ru: Можно использовать строку для представления блюда при вызове функции [code]add_order()[/code].
ta: [குறியீடு] add_order () [/குறியீடு] செயல்பாட்டை அழைக்கும்போது உணவைக் குறிக்க ஒரு சரம் பயன்படுத்தலாம்.
uk: Ми можемо використовувати рядок для представлення страви під час виклику функції [code]add_order()[/code].
zh_hant: 我們可以在呼叫 [code]add_order()[/code] 函式時，使用字串來表示餐點。

source: When completing an order, we remove it from the [code]waiting_orders[/code] array by calling its [code]pop_front()[/code] function. This function gives us the order back, which allows us to assign it to a temporary variable.
cs: Při dokončení objednávky ji odstraníme z pole [code]waiting_orders[/code] zavoláním její funkce [code]pop_front()[/code]. Tato funkce nám vrací objednávku zpět, což nám umožňuje přiřadit ji k dočasné proměnné.
de: Wenn wir eine Bestellung abschließen, entfernen wir sie aus dem [code]waiting_orders[/code]-Array, indem wir auf dem Array die [code]pop_front()[/code]-Funktion aufrufen. Diese Funktion gibt uns die Bestellung zurück, wodurch wir sie einer temporären Variablen zuordnen können.
es: Al completar un pedido, lo eliminamos de la matriz [code]waiting_orders[/code] llamando a su función [code]pop_front()[/code]. Esta función nos devuelve el pedido, lo que nos permite asignarlo a una variable temporal.
it: Quando viene completato un ordine, lo rimuoviamo dall'array [code]waiting_orders[/code] chiamando la sua funzione [code]pop_front()[/code]. Questa funzione ci restituisce l'ordine e ci consente ti assegnarlo ad una variabile temporanea.
ja: 注文を完了すると、[code]pop_front()[/code] 関数を呼び出して [code]waiting_orders[/code] 配列から注文を削除します。この関数は順序を戻し、一時変数に割り当てることができます。
ru: При завершении заказа мы удаляем его из массива [code]waiting_orders[/code] при помощи вызова его функции [code]pop_front()[/code]. После выполнения эта функция возвращает нам удалённый элемент массива, что позволяет записать его во временную переменную.
ta: ஒரு ஆர்டரை முடிக்கும்போது, அதன் [குறியீடு] பாப்_பிரண்ட் () [/குறியீடு] செயல்பாட்டை அழைப்பதன் மூலம் [குறியீடு] காத்திருப்பு_ ஆர்டர்ச் [/குறியீடு] வரிசையிலிருந்து அதை நீக்குகிறோம். இந்த செயல்பாடு நமக்கு ஆர்டரைத் தருகிறது, இது ஒரு தற்காலிக மாறிக்கு ஒதுக்க அனுமதிக்கிறது.
uk: Виконуючи замовлення, ми видаляємо його з масиву [code]waiting_orders[/code], викликаючи його функцію [code]pop_front()[/code]. Ця функція повертає нам порядок, що дозволяє нам призначити його тимчасовій змінній.
zh_hant: 當完成一筆訂單時，我們透過呼叫 [code]waiting_orders[/code] 陣列的 [code]pop_front()[/code] 函式來將其移除。這個函式會回傳該筆訂單，讓我們可以將其指派給一個暫存變數。

source: We can then append the order to our [code]completed_orders[/code] array.
cs: Poté můžeme objednávku připojit k našemu poli [code]completed_orders[/code].
de: Nun können wir die Bestellung hinten in das [code]completed_orders[/code]-Array einfügen.
es: Podemos luego añadir el pedido a nuestra matriz [code]completed_orders[/code].
it: Possiamo accodare l'ordine al nostro array [code]completed_orders[/code].
ja: 次に、注文を [code]completed_orders[/code] 配列に追加できます。
ru: Мы можем добавлять заказы в наш массив [code]completed_orders[/code].
ta: எங்கள் [குறியீடு] நிறைவு செய்யப்பட்ட_ ஆர்டர்கள் [/குறியீடு] வரிசையில் ஆர்டரைச் சேர்க்கலாம்.
uk: Потім ми можемо додати замовлення до нашого масиву [code]completed_orders[/code].
zh_hant: 接著我們可以將該訂單加入到 [code]completed_orders[/code] 陣列中。

source: We call arrays like [code]waiting_orders[/code] a [i]queue[/i]: the first element we append to the array is the first one we remove.
cs: Pole jako [code]waiting_orders[/code] nazýváme [i]queue[/i](fronta): první prvek, který k poli přidáme, je první, který odstraníme.
de: Wir nennen Arrays wie [code]waiting_orders[/code] eine Warteschlange ([i]queue[/i]): Das erste Element, das wir an das Array anhängen, ist das erste, das wir entfernen.
es: Llamamos a matrices como [code]waiting_orders[/code] una [i]cola[/i](o [i]queue[/i]): el primer elemento que añadimos a la matriz es el primero que eliminamos.
it: Chiamiamo gli array come [code]waiting_orders[/code] delle [i]code[/i]: il primo elemento che accodiamo è il primo che rimuoviamo.
ja: [code]waiting_orders[/code] のような配列を[i]キュー[/i]と呼び、配列に追加する最初の要素が最初に削除します。
ru: Массивы, подобные [code]waiting_orders[/code], называются [i]очередями[/i]: первый добавленный элемент будет удалён первым.
ta: [குறியீடு] காத்திருப்பு_ ஆர்டர்ச் [/குறியீடு] ஒரு [i] வரிசை [/i] போன்ற வரிசைகளை நாங்கள் அழைக்கிறோம்: வரிசையில் நாம் சேர்க்கும் முதல் உறுப்பு நாம் அகற்றும் முதல் உறுப்பு.
uk: Ми називаємо такі масиви, як [code]waiting_orders[/code], [i]чергою[/i]: перший елемент, який ми додаємо до масиву, є першим, який ми видаляємо.
zh_hant: 我們把像是 [code]waiting_orders[/code] 這樣的陣列稱為[b]佇列[/b]：我們先加入的元素會是最先被移除的。

source: What does #... mean?
cs: Co znamená #...?
de: Was bedeutet #...?
es: ¿Qué significa #...?
it: Cosa significa "#..."?
ja: どういう意味？
ru: Что значит #..?
ta: #... என்றால் என்ன?
uk: Що означає #...?
zh_hant: 這裡的 #... 是什麼意思？

source: We write [code]#...[/code] to represent ellipses in the code. It means "we're completing the function's code." We use that to break down code examples and make them easier to learn from.
de: Wir fügen [code]#... [/code] an manchen Stellen im Code ein, wo normalerweise noch mehr Code wäre, der aber für unser Beispiel nicht wichtig ist. Es bedeutet: "Her wäre noch weiterer Code, der irgendetwas anderes macht." Den Code so zu vereinfachen macht es einfacher die Beispiele zu verstehen.
es: Escribimos [code]#...[/code] para representar los puntos suspensivos en el código. Significa "estamos completando el código de la función". Lo utilizamos para desglosar los ejemplos de código y hacerlos más fáciles de aprender.
it: Scriviamo [code]#...[/code] per rappresentare dei punti di sospensione. Significa "stiamo completando il codice della funzione". Lo usiamo per spiegare gli esempi di codice e per renderli più facili da comprendere.
ja: コード内で省略記号を表すには、[code]#...[/code] と記述します。 これは、「関数のコードが完成している」ことを意味します。 これを使用してコード例を細分化し、学習しやすくしています。
ru: Мы используем [code]#...[/code] для сокращения. Это значит «тут может быть какой-то код функции». Такой подход помогает нам разбивать примеры кода на кусочки, удобные для усвоения при обучении.
ta: குறியீட்டில் நீள்வட்டங்களைக் குறிக்க [குறியீடு]#... [/குறியீடு] எழுதுகிறோம். இதன் பொருள் "நாங்கள் செயல்பாட்டின் குறியீட்டை முடிக்கிறோம்." குறியீடு எடுத்துக்காட்டுகளை உடைத்து அவற்றைக் கற்றுக்கொள்வதை எளிதாக்க நாங்கள் அதைப் பயன்படுத்துகிறோம்.

source: The hash sign itself marks the start of a code comment. It's a line the computer will ignore, which is why it typically appears in grey.
de: Das Hashzeichen selbst markiert den Anfang eines Codekommentars. Es ist eine Zeile, die der Computer ignoriert, weshalb sie normalerweise grau erscheint.
es: El signo de numeral en sí mismo marca el inicio de un comentario de código. Es una línea que la computadora ignorará, por lo que suele aparecer en gris.
it: Il simbolo di hash segnala l'inizio di una riga commentata. Questa è una riga che il computer ignorerà, questo è il motivo per cui tipicamente viene colorata in grigio.
ja: ハッシュ記号自体がコード コメントの開始を示します。 これはコンピュータが無視する行であるため、通常は灰色で表示されます。
ru: Сам по себе значок хеша помечает начало комментария в коде. Эта строка будет проигнорирована компьютером, именно поэтому обычно она помечается серым цветом.
ta: ஆச் அடையாளம் ஒரு குறியீடு கருத்தின் தொடக்கத்தைக் குறிக்கிறது. இது கணினி புறக்கணிக்கும் ஒரு வரி, அதனால்தான் இது பொதுவாக சாம்பல் நிறத்தில் தோன்றும்.

source: Using arrays as stacks
cs: Použití polí jako zásobníků
de: Verwenden von Arrays als Stapel (Stacks)
es: Utilizar matrices como pilas
it: Usando gli array come delle pile
ja: 配列をスタックとして使用する
ru: Использование массивов в качестве стека
ta: வரிசைகளை அடுக்குகளாகப் பயன்படுத்துதல்
uk: Використання масивів як стеків
zh_hant: 使用陣列作為堆疊(stack)

source: Another common use of arrays is [i]stacks[/i] of data.
de: Eine weitere häufige Verwendung von Arrays sind [i]Stacks[/i] von Daten.
es: Otro uso común de las matrices es el de las [i]pilas[/i] de datos.
it: Un altro uso comune per gli array sono le [i]pile[/i] di dati.
ja: 配列のもう 1 つの一般的な用途は、データの[i]スタック[/i]です。
ru: Другой типичный пример использования массивов — [i]стеки[/i] данных.
ta: வரிசைகளின் மற்றொரு பொதுவான பயன்பாடு [i] தரவுகளின் அடுக்குகள் [/i] ஆகும்.

source: Take a factory management game where you need to retrieve materials from stacks of crates. They arrive at the factory piled up vertically, and you need to take them from top to bottom.
de: Nehmen Sie ein Fabrikverwaltungsspiel, bei dem Du Materialien aus Stapeln von Kisten abrufen musst. Sie kommen vertikal gestapelt in der Fabrik an, und Du musst sie von oben nach unten bringen.
es: Por ejemplo, un juego de gestión de fábricas en el que tengas que recuperar materiales de pilas de cajas. Estas llegan a la fábrica apiladas verticalmente, y tienes que tomarlas de una en una de arriba a abajo.
it: Prendi un gioco gestionale riguardo ad una fabbrica in cui devi prelevare i materiali da pile di casse. Arrivano alla fabbrica impilate verticalmente e devi prenderle dall'alto verso il basso.
ja: 山積みの木箱から材料を取り出す必要がある工場管理ゲームを考えてみましょう。 工場では縦に積まれた状態で届くので、上から下へ持っていく必要があります。
ru: Рассмотрим игру про управление заводом, где вам нужно использовать материалы, сложенные в сундуки. Материалы складываются в сундук сверху и брать их из сундука вы можете только сверху.
ta: ஒரு தொழிற்சாலை மேலாண்மை விளையாட்டை எடுத்துக் கொள்ளுங்கள், அங்கு நீங்கள் கிரேட்சுகளின் அடுக்குகளிலிருந்து பொருட்களை மீட்டெடுக்க வேண்டும். அவை செங்குத்தாக குவிந்த தொழிற்சாலைக்கு வருகின்றன, நீங்கள் அவற்றை மேலிருந்து கீழாக எடுத்துச் செல்ல வேண்டும்.

source: To take a crate from the back of the array, this time, we use the [code]pop_back()[/code] array function.
de: Um eine Kiste von der Rückseite des Arrays zu nehmen, verwenden wir diesmal die Array-Funktion [code]pop_back()[/code].
es: Para tomar una caja de la parte de atrás de la matriz, esta vez, utilizamos la función de matriz [code]pop_back()[/code].
it: Per prendere una cassa dalla fine dell'array, questa volta, usiamo la funzione dell'array [code]pop_back()[/code].
ja: 配列の後ろからクレートを取得するには、今回は [code]pop_back()[/code] 配列関数を使用します。
ru: Для создания сундука из массива, в этот раз мы будем использовать функцию массива [code]pop_back()[/code].
ta: வரிசையின் பின்புறத்திலிருந்து ஒரு கூட்டை எடுக்க, இந்த நேரத்தில், நாங்கள் [குறியீடு] POP_BACK () [/code] வரிசை செயல்பாட்டைப் பயன்படுத்துகிறோம்.

source: This function removes (pops) the last value from the array and returns it to you.
de: Diese Funktion entfernt (poppt) den letzten Wert aus dem Array und gibt ihn an Dich zurück.
es: Esta función elimina el último valor de la matriz y te lo devuelve.
it: Questa funzione rimuove l'ultimo valore dell'array e te lo ritorna.
ja: この関数は、配列から最後の値を削除 (ポップ) し、それを返します。
ru: Эта функция удаляет последний элемент из массива и возвращает его вам.
ta: இந்த செயல்பாடு வரிசையிலிருந்து கடைசி மதிப்பை நீக்கி (பாப்ச்) செய்து அதை உங்களுக்கு வழங்குகிறது.
