Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-12-using-variables.po
Languages: cs, da, de, fr, it, ja, pt_br, ru, ta, uk, zh_hant

source: In this lesson, we'll make our code easier to follow and understand at a glance.
da: I denne lektion gør vi vores kode nemmere at følge og forstå på et øjeblik.
fr: Dans cette leçon, nous allons rendre notre code plus facile à suivre et à comprendre.
it: In questa lezione, renderemo il nostro codice più facile da seguire e da comprendere a primo sguardo.
ja: このレッスンでは、コードを簡単に理解しやすくし、一目で理解できるようにします。
pt_br: Nessa lição, vamos tornar nosso código mais fácil de seguir e entender rapidamente.
ru: В этом уроке мы сделаем наш код более простым и понятным с первого взгляда.

source: Take a look at this example.
da: Tag et kig på dette eksempel.
fr: Jetez un œil à cet exemple.
it: Guarda quest'esempio.
ja: この例を見てください。
pt_br: Observe esse exemplo.
ru: Взгляните на этот пример.

source: In the above example, what does the number 4 mean?
cs: Co ve výše uvedeném příkladu znamená číslo 4?
da: Hvad betyder tallet 4 i ovenstående eksempel?
de: Was bedeutet im obigen Beispiel die Zahl 4?
fr: Dans l'exemple ci-dessus, que signifie le chiffre 4 ?
it: Nell'esempio qui sopra, per cosa significa il numero 4?
ja: 上記の例で、数字の4はどういう意味ですか?
pt_br: No exemplo acima, o que significa o número 4?
ru: Что в приведённом выше примере означает число 4?
ta: மேலே உள்ள எடுத்துக்காட்டில், எண் 4 என்றால் என்ன?
uk: Що в наведеному вище прикладі означає число 4?
zh_hant: 在上面的例子中，數字 4 是什麼意思？

source: The code above rotates the character [code]4[/code] radians per second.
cs: Výše uvedený kód otáčí postavu [code]4[/code] radiány za sekundu.
da: Koden her over roterer karakteren [code]4[/code] radianer per sekund.
de: Der obige Code dreht den Charakter um [code]4[/code] Bogenmaß pro Sekunde.
fr: Le code ci-dessus fait tourner le personnage de [code]4[/code] radians par seconde.
it: Il codice sopra citato ruota il personaggio di [code]4[/code] radianti al secondo.
ja: 上記のコードは、キャラクターを 1 秒あたり [code]4[/code] ラジアン回転させます。
pt_br: O código acima rotaciona o personagem [code]4[/code] radianos por segundo.
ru: Код приведённый выше вращает персонажа со скоростью [code]4[/code] радиана в секунду.
ta: மேலே உள்ள குறியீடு நொடிக்கு [குறியீடு] 4 [/குறியீடு] ரேடியன்களை சுழற்றுகிறது.
uk: У наведеному вище коді персонаж обертається зі швидкістю [code]4[/code] радіани за секунду.
zh_hant: 在上述程式碼中，數字 [code]4[/code] 代表角色每秒旋轉的角度，單位是弧度(radians)。

source: It's how fast the character rotates.
cs: Jde o to, jak rychle se postava otáčí.
da: Det er, hvor hurtigt figuren roterer.
de: Es bestimmt, wie schnell sich der Charakter dreht.
fr: C'est la vitesse à laquelle le personnage tourne.
it: Rappresenta quanto velocemente il personaggio si ruota.
ja: キャラクターの回転速度です。
pt_br: É o quão rápido o personagem rotaciona.
ru: Это насколько быстро вращается персонаж.
ta: பாத்திரம் எவ்வளவு வேகமாக சுழல்கிறது.
uk: Це те, наскільки швидко обертається персонаж.
zh_hant: 它代表腳色旋轉的速度。

source: It's how far the character moves in pixels.
cs: Jde o to, jak daleko se postava pohybuje v pixelech.
da: Det er hvor langt figuren bevæger sig i pixels.
de: Es bestimmt, wie weit sich der Charakter in Pixeln bewegt.
fr: C'est la distance à laquelle le personnage se déplace en pixels.
it: Rappresenta quanto lontano il personaggio di muove in pixel.
ja: これは、キャラクターがピクセル単位で移動する距離です。
pt_br: É o quão longe o personagem se move em pixels.
ru: Это расстояние, на которое перемещается персонаж в пикселях.
ta: பாத்திரம் பிக்சல்களில் எவ்வளவு தூரம் நகர்கிறது.
uk: Це відстань, на яку переміщається персонаж у пікселях.
zh_hant: 它代表腳色移動的距離，以像素為單位。

source: It's how long the rotation takes.
cs: Jde o to, jak dlouho trvá rotace.
da: Det er hvor lang tid rotationen tager.
de: Es kommt darauf an, wie lange die Rotation dauert.
fr: C'est le temps que prend la rotation.
it: Rappresenta quanto tempo impiega la rotazione.
ja: これは、回転にかかる時間です。
pt_br: É a quantidade de tempo que leva a rotação.
ru: Это время, которое занимает вращение.
ta: சுழற்சி எவ்வளவு நேரம் ஆகும்.
uk: Це скільки часу триває обертання.
zh_hant: 它代表旋轉耗費的時間。

source: We can guess what a number represents by looking at the function names, but it's harder to recall what this number does by quickly looking at the code.
da: Vi kan gætte, hvad et tal repræsenterer, ved at se på funktionsnavnene, men det er sværere at huske, hvad dette tal gør, ved hurtigt at se på koden.
fr: Nous pouvons deviner ce que représente un nombre en regardant les noms des fonctions, mais il est plus difficile de se rappeler ce que fait ce nombre en regardant rapidement le code.
it: Possiamo indovinare un numero cosa rappresenta guardando al nome della funzione, ma è più difficile capire cosa questo numero fa solamente guardando il codice.
ja: 関数名を見れば数値が何を表しているかを推測できますが、コードをすばやく見ても、この数値が何を意味するかを思い出すのは困難です。
pt_br: Podemos adivinhar o que um número representa observando os nomes das funções, mas é mais difícil de se lembrar o que esse número faz só olhando rapidamente para o código.
ru: Мы можем догадаться, что представляет собой число, по названию функций, но при беглом осмотре кода понять его назначение будет сложно.

source: We've seen how different functions have their own names. Using these names communicates to developers what the functions do.
da: Vi har set, hvordan forskellige funktioner har deres egne navne. Brug af disse navne kommunikerer til udviklere, hvad funktionerne gør.
fr: Nous avons vu comment les différentes fonctions ont leurs propres noms. L'utilisation de ces noms permet de communiquer aux développeurs ce que font les fonctions.
it: Abbiamo visto come diverse funzioni hanno il loro nome. Usare questi nomi comunica agli sviluppatori cosa fanno le funzioni.
ja: さまざまな関数に独自の名前がある方法を見てきました。これらの名前を使用すると、関数の機能が開発者に伝わります。
pt_br: Nós vimos como diferentes funções têm seus próprios nomes. O uso desses nomes diz aos desenvolvedores o que as funções fazem.
ru: Мы уже видели названия различных функций. Правильно подобранное название даёт разработчикам информацию о том, что именно делает функция.

source: As we learned in lesson 8, we can also assign labels to numbers to help us remember what they do.
da: Som vi lærte i lektion 8, kan vi også tildele tal etiketter for at hjælpe os med at huske, hvad de gør.
fr: Comme nous l'avons appris dans la leçon 8, nous pouvons également assigner des étiquettes aux nombres pour nous aider à nous souvenir de ce qu'ils font.
it: Come abbiamo imparato nella lezione 8, possiamo pure assegnare etichette a numeri per aiutarci a ricordare cosa vanno.
ja: レッスン 8 で学んだように、数値にラベルを割り当てて、その機能を覚えやすくすることもできます。
pt_br: Como aprendemos na lição 8, também podemos atribuir rótulos (nomes) aos números para nos ajudar a lembrar o que eles fazem.
ru: В уроке 8 мы узнали, что мы также можем присвоить метки числам, чтобы запомнить, для чего они нужны.

source: We call these labels [i]variables[/i].
da: Vi kalder disse etiketter [i]variabler[/i].
fr: Nous appelons ces étiquettes [i]variables[/i].
it: Chiamiamo queste etichette [i]variabili[/i].
ja: これらのラベルを[i]変数[/i]と呼びます。
pt_br: Chamamos esses nomes de [i]variáveis[/i].
ru: Мы называем эти метки [i]переменными[/i].

source: [b]A variable is a label for a value we can save, change, and read later.[/b]
da: [b]En variabel er en etiket for en værdi, vi kan gemme, ændre og læse senere.[/b]
fr: [b]Une variable est une étiquette pour une valeur que nous pouvons enregistrer, modifier et lire plus tard.[/b]
it: [b]Una variabile è un'etichetta per un valore che possiamo salvare, cambiare e leggere quando vogliamo.[/b]
ja: [b]変数は、後で保存、変更、および読み取ることができる値のラベルです。[/b]
pt_br: [b]Uma variável é um nome que damos para um valor que podemos salvar, alterar e ler mais tarde.[/b]
ru: [b]Переменная — это метка для значения, дающая возможность сохранить, изменить и прочитать его позже.[/b]

source: Let's recap how to define a variable.
da: Lad os opsummere, hvordan man definerer en variabel.
fr: Récapitulons comment définir une variable.
it: Ripassiamo come definire una variabile.
ja: 変数を定義する方法をおさらいしましょう。
pt_br: Vamos revisar como definir uma variável.
ru: Давайте вспомним как определить переменную.

source: We improve the first example to make it clear what the number [code]4[/code] does.
cs: Vylepšíme první příklad, aby bylo jasné, co dělá číslo [code]4[/code].
da: Vi forbedrer det første eksempel for at gøre det tydeligt, hvad tallet [code]4[/code] gør.
de: Wir verbessern das erste Beispiel, um deutlich zu machen, was die Zahl [code]4[/code] bewirkt.
fr: Nous améliorons le premier exemple pour clarifier ce que fait le nombre [code]4[/code].
it: Miglioriamo il primo esempio per rendere più chiaro cosa fa il numero [code]4[/code].
ja: 最初の例を改善して、数値 [code]4[/code] が何をするのかを明確にします。
pt_br: Nós melhoramos o primeiro exemplo para deixar claro o que o número [code]4[/code] faz.
ru: Мы улучшим первый пример, чтобы предназначение числа [code]4[/code] стало более очевидным.
ta: [குறியீடு] 4 [/குறியீடு] என்ன செய்கிறது என்பதை தெளிவுபடுத்துவதற்கான முதல் எடுத்துக்காட்டுக்கு நாங்கள் மேம்படுத்துகிறோம்.
uk: Ми вдосконалюємо перший приклад, щоб було зрозуміло, що робить число [code]4[/code].
zh_hant: 我們改善了第一個範例，使數字 [code]4[/code] 的作用變得更清楚。

source: Labeling a value makes the code easier for us to read now [i]and[/i] in the future.
cs: Označení hodnoty nám usnadňuje čtení kódu nyní [i] a [/i] v budoucnu.
da: At putte en etikette på en værdi gør det nemmere for os at læse koden nu [i]og[/i] i fremtiden.
de: Das Beschriften eines Werts erleichtert uns das Lesen des Codes jetzt [i]und[/i] in der Zukunft.
fr: Nommer une valeur rend le code plus facile à lire maintenant [i]et[/i] à l'avenir.
it: Etichettare un valore rende il codice più facile per noi da leggere ora [i]e[/i] in futuro.
ja: 値にラベルを付けると、現在[i]および[/i]将来にわたってコードを読みやすくなります。
pt_br: Nomear um valor facilita a leitura do código agora [i]e[/i] no futuro.
ru: Маркировка значения делает код более лёгким для чтения сейчас [i]и[/i] в будущем.
ta: ஒரு மதிப்பை லேபிளிடுவது எதிர்காலத்தில் இப்போது [i] மற்றும் [/i] ஐப் படிக்க குறியீட்டை எளிதாக்குகிறது.
uk: Позначання значень робить код легшим для читання зараз [i]і[/i] в майбутньому.
zh_hant: 給一個值貼上標籤使得程式碼在現在[b]和[/b]未來更容易閱讀。

source: In the above example, which line defines the angular speed variable?
cs: Který řádek ve výše uvedeném příkladu definuje proměnnou pro úhlová rychlost?
da: Hvilken linje definerer vinkelhastighedsvariablen i ovenstående eksempel?
de: Welche Linie definiert im obigen Beispiel die Winkelgeschwindigkeit-Variable?
fr: Dans l'exemple ci-dessus, quelle ligne définit la variable de vitesse angulaire ?
it: Nell'esempio qua sopra, quale riga definisce la variabile della velocità angolare?
ja: 上記の例では、どの行が角速度変数を定義していますか?
pt_br: No exemplo acima, qual linha define a variável de velocidade angular?
ru: Какая строка определяет переменную угловой скорости в приведённом выше примере?
ta: மேலே உள்ள எடுத்துக்காட்டில், கோண வேக மாறியை எந்த வரி வரையறுக்கிறது?
uk: Який рядок у наведеному вище прикладі визначає змінну для кутової швидкості?
zh_hant: 在上面的例子中，哪一行定義了角速度變數？

source: We create the [code]angular_speed[/code] variable, then assign it the value of [code]4[/code].
cs: Vytvoříme proměnnou [code]angular_speed[/code] a přiřadíme jí hodnotu [code]4[/code].
da: Vi opretter variablen [code]angular_speed[/code] og tildeler den derefter værdien [code]4[/code].
de: Wir erstellen die Variable [code]angular_speed[/code](Winkelgeschwindigkeit) und weisen ihr dann den Wert von [code]4[/code] zu.
fr: Nous créons la variable [code]angular_speed[/code], puis nous lui attribuons la valeur [code]4[/code].
it: Creiamo la variabile [code]angular_speed[/code], poi assegnagli il valore [code]4[/code].
ja: [code]angular_speed[/code] 変数を作成し、それに [code]4[/code] の値を割り当てます。
pt_br: Nós criamos a variável [code]angular_speed[/code] e atribuímos nela ela o valor [code]4[/code].
ru: Мы создаём переменную [code]angular_speed[/code], а затем присваиваем ей значение [code]4[/code].
ta: நாங்கள் [குறியீடு] கோண_ச்பீட் [/குறியீடு] மாறியை உருவாக்குகிறோம், பின்னர் அதை [குறியீடு] 4 [/குறியீடு] இன் மதிப்பை ஒதுக்குகிறோம்.
uk: Ми створюємо змінну [code]angular_speed[/code], а потім присвоюємо їй значення [code]4[/code].
zh_hant: 我們創建了 [code]angular_speed[/code] 變數，並將它的值設為 [code]4[/code]。

source: If we define variables outside of functions, we can re-use them in different functions.
da: Hvis vi definerer variabler uden for funktioner, kan vi genbruge dem i forskellige funktioner.
fr: Si nous définissons des variables en dehors des fonctions, nous pouvons les réutiliser dans différentes fonctions.
it: Se definiamo variabili fuori dalle funzioni, possiamo riutilizzarle in diverse funzioni.
ja: 関数の外部で変数を定義すると、それらを別の関数で再利用できます。
pt_br: Se definirmos variáveis fora das funções, podemos reutilizá-las em funções diferentes.
ru: Определение переменных снаружи функций позволяет нам использовать их в разных функциях.

source: Because any function can use variables we define outside of them, we call these variables [b]script-wide[/b].
da: Fordi enhver funktion kan bruge variabler, vi definerer uden for dem, kalder vi disse variabler [b]script-dækkende[/b].
fr: Comme toute fonction peut utiliser les variables que nous définissons en dehors des fonctions, nous appelons ces variables [b]script-wide[/b] (c'est-à-dire valables pour tout le script).
it: Questo poiché ogni funzione può usare variabili che definiamo fuori da essere, chiamiamo queste variabili [b]script-globali[/b].
ja: どの関数でも外部で定義した変数を使用できるため、これらの変数を[b]スクリプト全体[/b]で呼び出します。
pt_br: Como qualquer função pode usar variáveis que definimos fora delas, chamamos essas variáveis de [b]script-wide[/b] (ou variáveis de script, ou seja, são variáveis que fazem parte de todo o script, não apenas de um só bloco de código).
ru: Поскольку любая функция может использовать переменные определённые снаружи, мы называем эти переменные [b]переменными скрипта[/b].

source: Here we use the [code]angular_speed[/code] script-wide variable in both the [code]_process()[/code] function and the [code]set_angular_speed()[/code] function.
da: Her bruger vi den script-dækkende variable [code]angular_speed[/code] i både [code]_process()[/code]-funktionen og [code]set_angular_speed()[/code]-funktionen.
fr: Ici, nous utilisons la variable script-wide [code]angular_speed[/code] dans la fonction [code]_process()[/code] et la fonction [code]set_angular_speed()[/code].
it: Qui usiamo la variabile script-globale [code]angular_speed[/code] sia nella funzione [code]_process()[/code] ché nella funzione [code]set_angular_speed()[/code].
ja: ここでは、[code]angular_speed[/code] 関数と [code]set_angular_speed()[/code] 関数の両方で [code]_process[/code] スクリプト全体の変数を使用します。
pt_br: Aqui usamos a variável de script [code]angular_speed[/code] na função [code]_process()[/code] e na função [code]set_angular_speed()[/code].
ru: Здесь мы используем переменную скрипта [code]angular_speed[/code] в обеих функциях: функции [code]_process()[/code] и функции [code]set_angular_speed()[/code].

source: We can also define variables inside of functions.
da: Vi kan også definere variabler inde i funktioner.
fr: Nous pouvons également définir des variables à l'intérieur des fonctions.
it: Possiamo anche definire le variabili all'interno delle funzioni.
ja: 関数内で変数を定義することもできます。
pt_br: Também podemos definir variáveis dentro de funções.
ru: Также мы может определять переменные внутри функций.

source: We align the variable assignment by indenting to make it part of the function body. Make sure to create the variable before using it!
da: Vi justerer variabeltildelingen ved at indrykke den for at gøre den til en del af funktionens indhold. Sørg for at oprette variablen, før du bruger den!
fr: Nous alignons l'assignation de la variable en utilisant une indentation pour qu'elle fasse partie du corps de la fonction. Assurez-vous de créer la variable avant de l'utiliser !
it: Allineiamo l'assegnazione della variabile indentandola per renderla parte del corpo della funzioni. Assicurati di creare la variabile prima di usarla!
ja: インデントによって変数の代入を整列させ、関数本体の一部にします。使用する前に、必ず変数を作成してください。
pt_br: Alinhamos a atribuição de variável recuando ela (fazendo uma indentação) para torná-la parte do corpo da função. Certifique-se de criar a variável antes de usá-la!
ru: При помощи отступов мы помечаем, что место использования переменной является частью тела функции. Убедитесь что создали переменную перед её использованием!

source: If we define a variable inside of a function, only that function can use it.
da: Hvis vi definerer en variabel inde i en funktion, er det kun den funktion, der kan bruge den.
fr: Si nous définissons une variable à l'intérieur d'une fonction, seule cette fonction peut l'utiliser.
it: Se definiamo una variabile dentro una funzione, solo la funzione può usarla.
ja: 関数内で変数を定義すると、その関数のみがそれを使用できます。
pt_br: Se definirmos uma variável dentro de uma função, somente essa função vai poder usar ela.
ru: Если мы определим переменную внутри функции, только эта функция сможет её использовать.

source: The [code]angular_speed[/code] variable only exists inside [code]_process()[/code], because we defined it there. The [code]set_angular_speed()[/code] function can't use it.
da: Variablen [code]angular_speed[/code] findes kun i [code]_process()[/code], fordi vi definerede den der. Funktionen [code]set_angular_speed()[/code] kan ikke bruge den.
fr: La variable [code]angular_speed[/code] n'existe que dans [code]_process()[/code], car nous l'avons définie là. La fonction [code]set_angular_speed()[/code] ne peut pas l'utiliser.
it: La variabile [code]angular_speed[/code] esiste soltanto dentro [code]_process()[/code], poiché la abbiamo definita lì. La funzione [code]set_angular_speed()[/code] non può usarla.
ja: [code]angular_speed[/code] 変数は [code]_process()[/code] 内でのみ存在します。[code]set_angular_speed()[/code]関数では使用できません。
pt_br: A variável [code]angular_speed[/code] só existe dentro da função [code]_process()[/code], porque a definimos lá. A função [code]set_angular_speed()[/code] não pode usá-la.
ru: Переменная [code]angular_speed[/code] существует только внутри [code]_process()[/code], потому что она определена внутри этой функции. Функция [code]set_angular_speed()[/code] не может её использовать.

source: Trying to use it there will result in an error.
da: Forsøg på at bruge den der vil resultere i en fejl.
fr: Essayer de l'utiliser dans cette fonction entraînera une erreur.
it: Provare ad usarla può risultare in un errore.
ja: そこで使用しようとすると、エラーが発生します。
pt_br: Tentar usar ela vai resultar em um erro.
ru: Попытка использовать переменную в ней приведёт к ошибке.

source: Here's what this error might look like.
da: Sådan kan denne fejl se ud.
fr: Voici à quoi cette erreur pourrait ressembler.
it: Ecco come questo errore potrebbe essere.
ja: このエラーは次のようになります。
pt_br: Veja aqui como pode ser esse erro.
ru: Вот как может выглядеть эта ошибка.

source: Where can we define variables?
cs: Kde můžeme definovat proměnné?
da: Hvor kan vi definere variabler?
de: Wo können wir Variablen definieren?
fr: Où pouvons-nous définir les variables ?
it: Dove possiamo definire le variabili?
ja: 変数はどこで定義できますか?
pt_br: Onde podemos definir variáveis?
ru: Где мы можем определять переменные?
ta: மாறிகள் எங்கே வரையறுக்கலாம்?
uk: Де ми можемо оголошувати змінні?
zh_hant: 我們可以在哪裡定義變數？

source: Functions can use any variables defined outside of functions. These variables are [b]script-wide[/b].
da: Funktioner kan bruge alle variabler, der er defineret uden for funktioner. Disse variabler gælder for hele scriptet.
fr: Les fonctions peuvent utiliser n'importe quelle variable définie en dehors des fonctions. Ces variables sont [b]script-wide[/b].
it: Le funzioni possono usare tutte le variabili definite fuori da esse. Queste variabili sono [b]script-globali[/b].
ja: 関数は、関数の外部で定義された任意の変数を使用できます。これらの変数は[b]スクリプト全体[/b]です。
pt_br: As funções podem usar quaisquer variáveis definidas fora das funções. Essas variáveis são [b]script-wide[/b] (variáveis de script).
ru: Функции могут использовать любые переменные определённые снаружи функций. Эти переменные называются [b]переменными скрипта[/b].

source: Outside of functions.
cs: Mimo funkce.
da: Uden for funktioner.
de: Außerhalb von Funktionen.
fr: En dehors des fonctions.
it: Fuori dalle funzioni.
ja: 関数の外部。
pt_br: Fora das funções.
ru: За пределами функций.
ta: செயல்பாடுகளுக்கு வெளியே.
uk: Поза функціями.
zh_hant: 函式外部。

source: Inside of functions.
cs: Uvnitř funkcí.
da: Inde i funktioner.
de: Innerhalb von Funktionen.
fr: A l'intérieur des fonctions.
it: Dentro le funzioni.
ja: 関数の内部。
pt_br: Dentro das funções.
ru: Внутри функций.
ta: செயல்பாடுகளின் உள்ளே.
uk: Всередині функцій.
zh_hant: 函式內部。

source: Variables are also great at grouping values that control how a character behaves.
da: Variabler er også gode til at gruppere værdier, der styrer, hvordan en karakter opfører sig.
fr: Les variables sont également très utiles pour regrouper des valeurs qui contrôlent le comportement d'un personnage.
it: Le variabili sono pure utili per raggruppare valori che controllano come il personaggio si comporta.
ja: 変数は、キャラクターの動作を制御する値をグループ化するのにも優れています。
pt_br: As variáveis também são ótimas para agrupar valores que controlam como um personagem se comporta.
ru: Также переменные отлично подходят для группировки значений, управляющих поведением персонажа.

source: Grouping them in this way allows us to easily change them.
da: Ved at gruppere dem på denne måde kan vi nemt ændre dem.
fr: Les regrouper de cette manière nous permet de les changer facilement.
it: Raggruppandoli in questo modo ci permette di cambiarli facilmente.
ja: この方法でグループ化すると、簡単に変更できます。
pt_br: Agrupá-las dessa maneira nos permite alterá-las facilmente.
ru: Такая группировка позволит нам легко изменять их.

source: In the following practices, we'll define variables and use them with some familiar functions to make our code more readable.
cs: V následujících postupech budeme definovat proměnné a používat je s některými známými funkcemi, aby byl náš kód čitelnější.
da: I de følgende øvelser vil vi definere variabler og bruge dem sammen med nogle velkendte funktioner for at gøre vores kode mere læsbar.
de: In den folgenden Übungen definieren wir Variablen und verwenden sie mit einigen vertrauten Funktionen, um unseren Code lesbarer zu machen.
fr: Dans les exercices suivants, nous allons définir des variables et nous allons les utiliser avec certaines fonctions que nous connaissons pour rendre notre code plus lisible.
it: Nelle seguente pratiche, definiremo variabili e le useremo con alcune funzioni già utilizzate per rendere il nostro codice più leggibile.
ja: 次の演習では、変数を定義し、使い慣れた関数でそれらを使用して、コードを読みやすくします。
pt_br: Nas práticas a seguir, vamos definir variáveis e as usaremos com algumas funções familiares para tornar nosso código mais legível.
ru: В последующих упражнениях мы будем определять переменные и использовать их в некоторых знакомых функциях, чтобы сделать наш код более читабельным.
ta: பின்வரும் நடைமுறைகளில், நாங்கள் மாறிகளை வரையறுத்து, சில பழக்கமான செயல்பாடுகளுடன் அவற்றைப் பயன்படுத்துவோம்.
uk: У наступних практиках ми визначимо змінні та використаємо їх із деякими знайомими функціями, щоб зробити наш код більш читабельним.
zh_hant: 在接下來的練習中，我們將定義變數並將它們與一些熟悉的函式一起使用，以使我們的程式碼更加易讀。

source: Clarifying Code Using Variables
cs: Zpřehlednění kódu pomocí proměnných
da: Gør kode mere læsbart ved hjælp af variabler
de: Erläuterung von Code mithilfe von Variablen
fr: Clarifier le code en utilisant des variables
it: Chiarificando Il Codice Usando Variabili
ja: 変数を使用したコードの明確化
pt_br: Esclarecendo o Código Usando Variáveis
ru: Улучшаем читабельность кода с помощью переменных
ta: மாறிகளைப் பயன்படுத்தி குறியீட்டை தெளிவுபடுத்துதல்
uk: Пояснення коду за допомогою змінних
zh_hant: 使用變數使程式碼更清晰
