Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-19-creating-arrays.po
Languages: cs, da, de, es, fr, it, nl, pt_br, ru, ta, tr, uk, zh_hant

source: A list of values, numbers or otherwise, has a precise name in code: we call it an [i]array[/i]. So we can say calling the [code]range()[/code] function produces an [i]array[/i] of numbers. We could directly write and use that array inside our [code]for[/code] loop instead of the [code]range()[/code] function. You can run the next function step-by-step to see how it works.
cs: Seznam hodnot, ať už číselných nebo jiných, má v kódu přesný název: říkáme jim [i]arrays (pole)[/i]. Můžeme tedy říci, že voláním funkce [code]range()[/code] vznikne [i]pole[/i] čísel. Toto pole bychom mohli přímo zapsat a použít uvnitř našeho cyklu [code]for[/code] místo funkce [code]range()[/code]. Následující funkci si můžete spustit krok za krokem, abyste viděli, jak funguje.
de: Eine Liste von Werten, Zahlen oder Ähnlichem, hat einen genauen Namen im Code: Wir nennen sie [i]Array[/i]. Wir sagen also, dass der Aufruf der Funktion [code]range()[/code] ein [i]Array[/i] von Zahlen erzeugt. Wir könnten dieses Array, anstelle der [code]range()[/code]-Funktion, direkt in unsere [code]for[/code]-Schleife schreiben und verwenden. Du kannst die nächste Funktion Schritt-für-Schritt durchlaufen, um zu sehen wie das funktioniert.
es: Una lista de valores, numéricos o no, tiene un nombre preciso en código: la llamamos [i]matriz[/i] (o [code]array[/code]). Así que podemos decir que llamar a la función [code]range()[/code] produce una [i]matriz[/i] de números. Podríamos escribir y utilizar directamente esa matriz dentro de nuestro bucle [code]for[/code] en lugar de la función [code]range()[/code].
ta: மதிப்புகளின் பட்டியல், எண்கள் அல்லது வேறுவிதமாக, குறியீட்டில் துல்லியமான பெயரைக் கொண்டுள்ளது: நாங்கள் இதை [i] வரிசை [/i] என்று அழைக்கிறோம். எனவே [குறியீடு] வரம்பு () [/குறியீடு] செயல்பாட்டை அழைப்பது எண்களின் [i] வரிசை [/i] ஐ உருவாக்குகிறது என்று நாங்கள் கூறலாம். [குறியீடு] வரம்பு () [/குறியீடு] செயல்பாட்டிற்கு பதிலாக [/குறியீடு] வளையத்திற்கான எங்கள் [குறியீட்டிற்குள் அந்த வரிசையை நேரடியாக எழுதலாம் மற்றும் பயன்படுத்தலாம். இது எவ்வாறு இயங்குகிறது என்பதைப் பார்க்க அடுத்த செயல்பாட்டை படிப்படியாக இயக்கலாம்.
zh_hant: 在程式中，數值（無論是數字或其他類型）的列表有一個特定的名稱：我們稱為[b]陣列[/b]。因此我們可以說呼叫 [code]range()[/code] 函式會產生一個數字[b]陣列[/b]。 我們也可以直接在 [code]for[/code] 迴圈中手動寫入並使用這個陣列，而不使用 [code]range()[/code] 函式。你可以逐步執行接下來的函式來看看它是如何運作的。

source: As you can see, the code still works the same. Notice that when we create a [code]for[/code] loop, we also create a local variable to which the loop assigns one value per iteration. Above, we named it [code]number[/code] because the array we loop over contains three numbers (0, 1, and 2). But we could name it anything we'd like!
cs: Jak vidíte, kód funguje stále stejně. Všimněte si, že když vytvoříme cyklus [code]for[/code], vytvoříme také lokální proměnnou, které cyklus přiřadí jednu hodnotu na iteraci. Výše jsme ji pojmenovali [code]number[/code], protože pole, které překračujeme, obsahuje tři čísla (0, 1 a 2). Můžeme ji však pojmenovat jakkoli!
de: Wie du sehen kannst funktioniert der Code noch wie vorher. Beachte, dass sobald wir eine [code]for[/code] Schleife erstellen wir auch gleichzeitig eine lokale Variable erzeugen, der von der Schleife bei jedem Durchlauf ein Wert zugewiesen wird. Oben, haben wir sie [code]number[/code] genannt, weil das Feld, dass wir durchlaufen aus drei Nummern besteht (0, 1 und 2). Aber wir könnten sie auch irgendwie anders nennen!
es: Como puedes ver, el código sigue funcionando igual. Observa que cuando creamos un bucle [code]for[/code], también creamos una variable local a la que el bucle asigna un valor por iteración. Arriba, la hemos llamado [code]number[/code] (número en inglés) porque el array sobre el que hacemos el bucle contiene tres números (0, 1 y 2). Pero podemos ponerle el nombre que queramos.
ta: நீங்கள் பார்க்க முடியும் என, குறியீடு இன்னும் அப்படியே செயல்படுகிறது. [/Code] வளையத்திற்கான [குறியீட்டை] உருவாக்கும்போது, ஒரு உள்ளக மாறியையும் உருவாக்குகிறோம், அதற்கு ஒரு மறு செய்கைக்கு ஒரு மதிப்பை லூப் ஒதுக்குகிறது. மேலே, நாங்கள் அதற்கு [குறியீடு] எண் [/குறியீடு] என்று பெயரிட்டோம், ஏனெனில் நாங்கள் வளரும் வரிசையில் மூன்று எண்கள் (0, 1 மற்றும் 2) உள்ளன. ஆனால் நாங்கள் விரும்பும் எதையும் பெயரிடலாம்!
zh_hant: 正如你所見，這段程式碼的運作結果仍然相同。請注意當我們建立一個 [code]for[/code] 迴圈時，也會建立一個區域(local)變數，在每次迴圈迭代時指定一個值給它。在上方的範例中，我們將其命名為 [code]number[/code]，因為我們迴圈處理的陣列包含三個數字（0、1、和 2）。 但這個變數的名稱可以是任何我們想要的名稱！

source: You start with an opening square bracket. Then, you write comma-separated values that compose the array. Finally, you need a closing square bracket to complete the array. Here are a couple of valid arrays. Notice how you can mix values, and how they don't need to follow one another.
cs: Začínáte otevírací hranatou závorkou. Poté zapíšete hodnoty oddělené čárkami, které tvoří pole. Nakonec je potřeba uzavírací hranatá závorka, která pole doplní. Zde je několik platných polí. Všimněte si, že můžete hodnoty míchat a že nemusí následovat jedna za druhou.
de: Du beginnst mit einer sich öffnenden, eckigen Klammer. Anschließend schreibst Du kommagetrennte Werte, aus denen sich das Array zusammensetzt. Schließlich benötigst Du eine schließende eckige Klammer, um das Array zu vervollständigen. Hier sind ein paar gültige Arrays. Beachte, dass Du die Werte mischen kannst und sie nicht aufeinander folgen müssen.
es: Empiezas con un corchete de apertura. A continuación, escribes los valores que componen la matriz separados por comas. Por último, necesitas un corchete de cierre para completar la matriz. Aquí tienes un par de matrices válidas. Fíjate en que puedes mezclar valores y que no es necesario que estén en sucesión.
ta: நீங்கள் ஒரு தொடக்க சதுர அடைப்புக்குறிக்குள் தொடங்குகிறீர்கள். பின்னர், நீங்கள் வரிசையை உருவாக்கும் கமாவால் பிரிக்கப்பட்ட மதிப்புகளை எழுதுகிறீர்கள். இறுதியாக, வரிசையை முடிக்க உங்களுக்கு ஒரு இறுதி சதுர அடைப்புக்குறி தேவை. இங்கே இரண்டு செல்லுபடியாகும் வரிசைகள் உள்ளன. நீங்கள் மதிப்புகளை எவ்வாறு கலக்கலாம் என்பதையும், அவை எவ்வாறு ஒருவருக்கொருவர் பின்பற்றத் தேவையில்லை என்பதையும் கவனியுங்கள்.
zh_hant: 你需要以左方括號開頭，然後寫上以逗號分隔的值來組成陣列。最後必須使用右方括號來完成陣列。 以下是幾個有效的陣列範例。請注意，你可以混合不同的值，且它們不需要是連續的。

source: Because arrays themselves are a value type, just like numbers or [code]Vector2[/code], we can assign arrays to variables to reaccess them later. That'll come in handy in the next lesson, where we'll use those variables in loops.
cs: Protože samotná pole jsou typ hodnoty, stejně jako čísla nebo [code]Vektor2[/code], můžeme k proměnným přiřadit pole, abychom k nim později mohli znovu přistupovat. To se nám bude hodit v další lekci, kde budeme tyto proměnné používat v cyklech.
de: Da Arrays selbst ein Werttyp sind, genau wie Zahlen oder [code]Vector2[/code], können wir Variablen Arrays zuweisen, um später wieder auf sie zuzugreifen. Das wird sich in der nächsten Lektion als nützlich erweisen, in der wir diese Variablen in Schleifen verwenden werden.
es: Como las propias matrices son un tipo de valor, al igual que los números o los [code]Vector2[/code], podemos asignar matrices a variables para volver a acceder a ellas más adelante. Esto será muy útil en la próxima lección, en la que utilizaremos esas variables en los bucles.
ta: எண்கள் அல்லது [குறியீடு] திசையன் 2 [/குறியீடு] போலவே வரிசைகளும் ஒரு மதிப்பு வகையாக இருப்பதால், அவற்றை மீண்டும் வருவதற்கு மாறிகள் வரிசைகளை ஒதுக்கலாம். அடுத்த பாடத்தில் அது கைக்குள் வரும், அங்கு அந்த மாறிகள் சுழல்களில் பயன்படுத்துவோம்.
zh_hant: 由於陣列本身也是一種類型的值，就像數字或 [code]Vector2[/code] 一樣，我們可以將陣列指派給變數，以便稍後重新存取它們。 這在下堂課會派上用場，屆時我們將在迴圈中使用這些變數。

source: In computer programming, we use arrays [i]all the time[/i]. Precisely, you'll use them whenever you need to store a [i]list of things[/i]. You always need lists of things in games: - The player's party in an RPG. - The items in the player's inventory. - The high scores in an arcade game. - The objects in the game world. All of those and many more rely on arrays.
cs: V počítačovém programování používáme pole [i]pořád[/i]. Přesněji řečeno, použijete je vždy, když potřebujete uložit [i]seznam věcí[/i]. Ve hrách vždy potřebujete seznamy věcí: - Hráčská skupina v RPG. - Předměty v inventáři hráče. - Seznam vysokých skóre v arkádové hře. - Předměty v herním světě. To vše a mnoho dalšího je založeno na polích.
de: In der Computerprogrammierung verwenden wir Arrays [i]die ganze Zeit[/i]. Genau genommen wirst Du sie immer dann verwenden, wenn Du eine [i]Liste von Dingen[/i] speichern musst. Du brauchst immer Listen von Dingen in Spielen: - Die Gruppe des Spielers in einem RPG. - Die Gegenstände im Inventar des Spielers. - Die Highscores in einem Arcade-Spiel. - Die Objekte in der Spielwelt. All diese und viele mehr sind auf Arrays angewiesen.
es: En la programación informática, utilizamos matrices [i]todo el tiempo[/i]. Precisamente, las utilizarás siempre que necesites almacenar una [i]lista de cosas[/i]. En los juegos, siempre se necesitan listas de cosas: - Los miembros del grupo del jugador en un RPG. - Los objetos en el inventario del jugador. - Las puntuaciones altas en un juego de arcade. - Los objetos del mundo del juego. Todos estos y muchos más dependen de las matrices.
ta: கணினி நிரலாக்கத்தில், நாங்கள் எல்லா நேரத்திலும் வரிசைகளைப் பயன்படுத்துகிறோம் [/i]. துல்லியமாக, நீங்கள் [I] விசயங்களின் பட்டியலை சேமிக்க வேண்டிய போதெல்லாம் அவற்றைப் பயன்படுத்துவீர்கள் [/i]. விளையாட்டுகளில் உள்ள விசயங்களின் பட்டியல்கள் உங்களுக்கு எப்போதும் தேவை: - ஒரு ஆர்பிசியில் பிளேயரின் விருந்து. - பிளேயரின் சரக்குகளில் உள்ள உருப்படிகள். - ஒரு ஆர்கேட் விளையாட்டில் அதிக மதிப்பெண்கள். - விளையாட்டு உலகில் உள்ள பொருள்கள். அவை அனைத்தும் மற்றும் இன்னும் பல வரிசைகளை நம்பியுள்ளன.
zh_hant: 在電腦程式設計中，我們[b]經常[/b]使用陣列。 具體來說，每當你需要存儲[b]一組東西[/b]時就會用到陣列。 在遊戲中，總是需要處理各種東西的列表，例如： - RPG 中玩家的隊伍。 - 玩家背包中的物品。 - 街機遊戲中的最高分紀錄。 - 遊戲世界中的物件。 這些例子以及更多其他情況都依賴於陣列。

source: Let's look at a widespread use of arrays in games: finding and following a path. In games, you need allies or monsters to find their way to their target, whether it's the player or some point of interest. To achieve that, we use [i]pathfinding algorithms[/i]. As the name suggests, those algorithms find the path between two points and allow AIs to traverse the game.
cs: Podívejme se na rozšířené použití polí ve hrách: hledání a sledování cesty. Ve hrách je potřeba, aby spojenci nebo příšery našli cestu ke svému cíli, ať už je to hráč nebo nějaký zajímavý bod. K tomu slouží [i] algoritmy pro hledání cest[/i]. Jak už název napovídá, tyto algoritmy vyhledávají cestu mezi dvěma body a umožňují umělé inteligenci procházet hrou.
de: Schauen wir uns eine weit verbreitete Verwendung von Arrays in Spielen an: einen Pfad finden und ihm folgen. In Spielen sollen Verbündete oder Monster ihren Weg zu ihrem Ziel finden, sei es der Spieler oder einen anderen Punkt von Interesse. Um das umzusetzen, verwenden wir [i]Pfadfindungsalgorithmen[/i]. Wie der Name schon sagt, finden diese Algorithmen den Pfad zwischen zwei Punkten und ermöglichen es KIs das Spiel zu durchqueren.
es: Veamos un uso generalizado de las matrices en los juegos: encontrar y seguir un camino. En los juegos, necesitas que los aliados o los monstruos encuentren el camino hacia su objetivo, ya sea el jugador o algún punto de interés. Para conseguir esto, utilizamos [i]algoritmos de búsqueda de rutas[/i] ("pathfinding algorithms" en inglés). Como su nombre lo indica, esos algoritmos encuentran la ruta entre dos puntos y permiten que las IAs recorran el juego.
ta: விளையாட்டுகளில் வரிசைகளின் பரவலான பயன்பாட்டைப் பார்ப்போம்: ஒரு பாதையைக் கண்டுபிடித்து பின்பற்றுங்கள். விளையாட்டுகளில், நீங்கள் நட்பு நாடுகள் அல்லது அரக்கர்கள் தங்கள் இலக்கை நோக்கிச் செல்ல வேண்டும், அது வீரர் அல்லது ஆர்வமுள்ளதாக இருந்தாலும் சரி. அதை அடைய, நாங்கள் [i] பாத்ஃபைண்டிங் வழிமுறைகளைப் பயன்படுத்துகிறோம் [/i]. பெயர் குறிப்பிடுவது போல, அந்த வழிமுறைகள் இரண்டு புள்ளிகளுக்கு இடையிலான பாதையைக் கண்டுபிடித்து, AI களை விளையாட்டைக் கடக்க அனுமதிக்கின்றன.
zh_hant: 讓我們來看看陣列在遊戲中最常見的一種應用：尋找並跟隨路徑。 在遊戲中，盟友或怪物需要找到通往目標的路徑，可能是玩家或是某個感興趣的點。 為了實現它，我們會使用[b]路徑尋找演算法(pathfinding algorithms)[/b]。顧名思義，這些演算法能夠找到兩點之間的最佳路徑，並讓 AI 在遊戲中順利移動。

source: Many of those algorithms use arrays of [code]Vector2[/code] coordinates to represent the path. Take this turtle pet. It wants to follow the robot, but there are rocks in the way. How can we tell it where to walk to reach the robot? With an array!
cs: Mnoho z těchto algoritmů používá k reprezentaci cesty pole souřadnic [code]Vector2[/code]. Vezměte si toto želví zvířátko. Chce následovat robota, ale v cestě jsou kameny. Jak jí můžeme říct, kudy má jít, aby se dostala k robotovi? Pomocí pole!
de: Viele dieser Algorithmen verwenden Arrays von [code]Vector2[/code]-Koordinaten, um den Pfad darzustellen. Nimm dieses Schildkrötenhaustier als Beispiel. Es will dem Roboter folgen, aber sind Felsen im Weg. Wie können wir dem Haustier sagen, wohin es gehen muss, um den Roboter zu erreichen? Mit einem Array!
es: Muchos de esos algoritmos utilizan matrices de coordenadas [code]Vector2[/code] para representar la ruta. Por ejemplo, esta mascota tortuga. Quiere seguir al robot, pero hay rocas en el camino. ¿Cómo podemos decirle por dónde tiene que caminar para llegar al robot? ¡Con una matriz!
ta: அந்த வழிமுறைகளில் பல பாதையை குறிக்க [குறியீடு] திசையன் 2 [/குறியீடு] ஆயங்களின் வரிசைகளைப் பயன்படுத்துகின்றன. இந்த ஆமை செல்லப்பிராணியை எடுத்துக் கொள்ளுங்கள். இது ரோபோவைப் பின்பற்ற விரும்புகிறது, ஆனால் வழியில் பாறைகள் உள்ளன. ரோபோவை அடைய எங்கு நடக்க வேண்டும் என்று நாம் எப்படி சொல்ல முடியும்? ஒரு வரிசையுடன்!
zh_hant: 許多演算法會使用 [code]Vector2[/code] 座標的陣列來表示路徑。 看看這隻寵物烏龜，它想要跟隨機器人，但路上有岩石擋住了它的路。 我們該如何告訴它該走哪條路徑才能到達機器人呢？答案是使用陣列！

source: Every value in the array is a [code]Vector2[/code] and represents a cell the turtle needs to walk through. Together, all the values in the array represent a path we can draw.
cs: Každá hodnota v poli je [code]Vector2[/code] a představuje buňku, kterou musí želva projít. Všechny hodnoty v poli dohromady představují cestu, kterou můžeme nakreslit.
de: Jeder Wert im Array ist ein [code]Vector2[/code] und stellt die Zelle dar, in welche die Schildkröte sich bewegen muss. Zusammen stellen alle Werte im Array einen Pfad dar, den wir zeichnen können.
es: Cada valor de la matriz es un [code]Vector2[/code] y representa la celda que la tortuga debe recorrer. Juntos, todos los valores de la matriz representan un camino que podemos dibujar.
ta: வரிசையில் உள்ள ஒவ்வொரு மதிப்பும் ஒரு [குறியீடு] திசையன் 2 [/குறியீடு] மற்றும் ஆமை நடக்க வேண்டிய ஒரு கலத்தைக் குறிக்கிறது. ஒன்றாக, வரிசையில் உள்ள அனைத்து மதிப்புகளும் நாம் வரையக்கூடிய பாதையை குறிக்கின்றன.
zh_hant: 陣列中的每個值都是一個 [code]Vector2[/code]，代表烏龜需要走過的每個格子。 所有陣列中的值一起構成了一條我們可以描繪的路徑。

source: In upcoming lessons, you will see how we can use arrays to store player inventories or design attack combos. For now, let's practice creating arrays.
cs: V nadcházejících lekcích uvidíte, jak můžeme použít pole k ukládání inventáře hráčů nebo navrhování útočných komb. Prozatím si procvičme vytváření polí.
de: In den kommenden Lektionen wirst Du sehen, wie wir Arrays verwenden können, um Spielerinventare zu speichern oder Angriffskombos zu entwerfen. Lass uns zunächst das Erstellen von Arrays üben.
es: En próximas lecciones, verás cómo podemos utilizar matrices para almacenar inventarios de jugadores o diseñar combos de ataque. Por ahora, vamos a practicar la creación de matrices.
ta: வரவிருக்கும் பாடங்களில், பிளேயர் சரக்குகளை சேமிக்க அல்லது தாக்குதல் காம்போக்களை வடிவமைக்க நாங்கள் வரிசைகளை எவ்வாறு பயன்படுத்தலாம் என்பதை நீங்கள் காண்பீர்கள். இப்போதைக்கு, வரிசைகளை உருவாக்குவதைப் பயிற்சி செய்வோம்.
zh_hant: 在接下來的課程中，你將會學到我們如何使用陣列來儲存玩家的背包或設計攻擊組合。 現在，讓我們練習創建陣列。

source: The turtle wants to meet the robot! But it cannot find it on its own. Fill the [code]turtle_path[/code] array with [code]Vector2[/code] coordinates indicating where the turtle should move to avoid the obstacles and arrive safely to the robot. The turtle can move up, down, left, or right. It cannot move diagonally. We recommend copying and pasting to fill the array with comma-separated [code]Vector2[/code] values quickly.
cs: Želva se chce seznámit s robotem! Sama ho však nemůže najít. Vyplňte pole [code]turtle_path[/code] souřadnicemi [code]Vector2[/code], které udávají, kudy se má želva pohybovat, aby se vyhnula překážkám a bezpečně dorazila k robotovi. Želva se může pohybovat nahoru, dolů, doleva nebo doprava. Nemůže se pohybovat po diagonále. Doporučujeme použit copy/paste (kopírovat/vkládat), abyste pole rychle naplnili čárkami oddělenými hodnotami [code]Vector2[/code].
de: Die Schildkröte will den Roboter treffen! Aber sie kann ihn nicht alleine finden. Fülle das [code]turtle_path[/code]-Array mit [code]Vector2[/code]-Koordinaten, die angeben, wohin sich die Schildkröte bewegen sollte, um den Hindernissen auszuweichen und sicher zum Roboter zu gelangen. Die Schildkröte kann sich nach oben, unten, links oder rechts bewegen. Sie kann sich nicht diagonal bewegen. Wir empfehlen das Kopieren und Einfügen, um das Array schnell mit kommagetrennten [code]Vector2[/code]-Werten zu füllen.
es: ¡La tortuga quiere conocer al robot! Pero no puede encontrarlo por sí misma. Completa la matriz [code]turtle_path[/code] con coordenadas [code]Vector2[/code] que indiquen por dónde debe moverse la tortuga para evitar los obstáculos y llegar sana y salva al robot. La tortuga puede moverse hacia arriba, hacia abajo, hacia la izquierda o hacia la derecha. No puede moverse en diagonal. Recomendamos copiar y pegar para llenar la matriz con valores [code]Vector2[/code] separados por comas más rápidamente.
ta: ஆமை ரோபோவை சந்திக்க விரும்புகிறது! ஆனால் அதை சொந்தமாகக் கண்டுபிடிக்க முடியாது. [குறியீடு] டர்டில்_பாத் [/குறியீடு] வரிசையை [குறியீடு] வெக்டர் 2 [/குறியீடு] ஆயத்தொலைவுகளுடன் நிரப்பவும், தடைகளைத் தவிர்ப்பதற்கு ஆமை எங்கு செல்ல வேண்டும் என்பதைக் குறிக்கும் மற்றும் ரோபோவுக்கு பாதுகாப்பாக வர வேண்டும். ஆமை மேலே, கீழ், இடது அல்லது வலது நகர்த்தலாம். அது குறுக்காக நகர முடியாது. கமாவால் பிரிக்கப்பட்ட [குறியீடு] திசையன் 2 [/குறியீடு] மதிப்புகளுடன் வரிசையை நிரப்ப நகலெடுக்கவும் ஒட்டவும் பரிந்துரைக்கிறோம்.
zh_hant: 海龜想要和機器人見面！但無法自己找到路線。 請將 [code]turtle_path[/code] 陣列填入 [code]Vector2[/code] 座標，指示海龜應該如何移動，來避開障礙物並且安全到達機器人的所在處。 海龜可以上下左右移動，但無法斜向移動。 我們建議你複製並貼上來快速填入以逗號分隔的 [code]Vector2[/code] 值。

source: In this tactical game, the player and computer can select multiple units at once. You need to call the [code]select_units()[/code] function and pass it an array of [code]Vector2[/code] coordinates to know which units to select. Each [code]Vector2[/code] in the array represents a cell with a unit. You can pass arrays in function calls as arguments. As an array is a value type the computer recognizes, you can pass the whole array as a single function argument. Select all units on the board by passing the correct array to the [code]select_units()[/code] function.
cs: V této taktické hře může hráč i počítač vybrat více jednotek najednou. Abyste věděli, které jednotky vybrat, musíte zavolat funkci [code]select_units()[/code] a předat jí pole souřadnic [code]Vector2[/code]. Každý [code]Vector2[/code] v poli představuje buňku s jednotkou. Pole můžete předávat ve volání funkcí jako argumenty. Protože pole je hodnotový typ, který počítač rozpoznává, můžete celé pole předat jako jediný argument funkce. Vyberte všechny jednotky na desce tak, že funkci [code]select_units()[/code] předáte správné pole hodnot.
de: In diesem taktischen Spiel können Spieler und Computer mehrere Einheiten gleichzeitig auswählen. Du musst die Funktion [code]select_units()[/code] aufrufen und ihr ein Array von [code]Vector2[/code]-Koordinaten übergeben, um zu wissen, welche Einheiten ausgewählt werden sollen. Jeder [code]Vector2[/code] im Array stellt eine Zelle mit einer Einheit dar. Du kannst Arrays in Funktionsaufrufen als Argumente übergeben. Da ein Array ein Werttyp ist, den der Computer erkennt, kannst Du das gesamte Array als einzelnes Funktionsargument übergeben. Wähle alle Einheiten auf dem Spielbrett aus, indem Du das richtige Array an die Funktion [code]select_units()[/code] übergibst.
es: En este juego táctico, el jugador y la computadora pueden seleccionar varias unidades a la vez. Debes llamar a la función [code]select_units()[/code] y pasarle una matriz de coordenadas [code]Vector2[/code] para saber qué unidades seleccionar. Cada [code]Vector2[/code] en la matriz representa una celda con una unidad. Puedes pasar matrices en llamadas a funciones como argumentos. Como una matriz es un tipo de valor que la computadora reconoce, puedes pasar toda la matriz como un único argumento de función. Selecciona todas las unidades en el tablero pasando la matriz correcta a la función [code]select_units()[/code].
ta: இந்த தந்திரோபாய விளையாட்டில், பிளேயர் மற்றும் கணினி ஒரே நேரத்தில் பல அலகுகளைத் தேர்ந்தெடுக்கலாம். நீங்கள் [குறியீடு] Select_Units () [/code] செயல்பாட்டை அழைக்க வேண்டும் மற்றும் எந்த அலகுகளைத் தேர்ந்தெடுக்க வேண்டும் என்பதை அறிய [குறியீடு] வெக்டர் 2 [/குறியீடு] ஆயங்களின் வரிசையை அனுப்ப வேண்டும். வரிசையில் உள்ள ஒவ்வொரு [குறியீடு] திசையன் 2 [/குறியீடு] ஒரு அலகு கொண்ட கலத்தைக் குறிக்கிறது. செயல்பாட்டு அழைப்புகளில் நீங்கள் வரிசைகளை வாதங்களாக அனுப்பலாம். கணினி அங்கீகரிக்கும் மதிப்பு வகை என்பதால், நீங்கள் முழு வரிசையையும் ஒற்றை செயல்பாட்டு வாதமாக அனுப்பலாம். சரியான வரிசையை [குறியீடு] Select_Units () [/code] செயல்பாட்டிற்கு அனுப்புவதன் மூலம் பலகையில் உள்ள அனைத்து அலகுகளையும் தேர்ந்தெடுக்கவும்.
zh_hant: 在這個策略遊戲中，玩家和電腦可以一次選擇多個單位。你需要呼叫 [code]select_units()[/code] 函式並傳遞一個 [code]Vector2[/code] 座標陣列，來指定要選擇哪些單位。 每個 [code]Vector2[/code] 代表一個有單位的格子。 你可以將陣列當作引數傳遞給函式。由於陣列是電腦識別的值類型，你可以將整個陣列當作單一函式引數傳遞。 通過將正確的陣列傳遞給 [code]select_units()[/code] 函式，來選擇所有棋盤上的單位。
