Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-27-value-types.po
Languages: cs, da, de, es, fr, it, ja, nl, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: In your code, values have a particular [i]type[/i]. You have already learned about several: whole numbers, decimal numbers, strings, 2D vectors, arrays, and dictionaries.
cs: Ve vašem kódu mají hodnoty určitý [i]typ[/i]. Již jste se jich naučili několik: celá čísla, desetinná čísla, řetězce, 2D vektory, pole a slovníky.
da: I din kode, har værdier en bestemt [i]type[/i]. Du har allerede lært om flere: hele tal, decimaltal, strenge, 2D vektorer, arrays og ordbøger.
de: In Deinem Code haben Werte einen bestimmten [i]type[/i]. Du hast bereits mehrere kennengelernt: ganze Zahlen, Dezimalzahlen, Zeichenfolgen, 2D-Vektoren, Arrays und Dictionaries.
ru: Каждое значение в коде имеет определённый [i]тип[/i]. С несколькими типами вы уже знакомы: целое число, десятичная дробь, строка, 2D вектор, массив, словарь.
ta: உங்கள் குறியீட்டில், மதிப்புகள் ஒரு குறிப்பிட்ட [i] வகை [/i] ஐக் கொண்டுள்ளன. நீங்கள் ஏற்கனவே பலவற்றைப் பற்றி கற்றுக்கொண்டீர்கள்: முழு எண்கள், தசம எண்கள், சரங்கள், 2 டி திசையன்கள், வரிசைகள் மற்றும் அகராதிகள்.
tr: Kodunuzun içinde, her değerin belirli bir [i]tipi[/i] vardır. Birkaç tanesi hakkında zaten bilgi edindiniz: tam sayılar, ondalık sayılar, dizeler, 2B vektörler, diziler ve sözlükler.
uk: У вашому коді значення мають певний [i]тип[/i]. Ви вже дізналися про декілька: цілі числа, десяткові числа, рядки, 2D-вектори, масиви та словники.

source: The computer uses the type of a value to know which operations and functions you can use with them.
cs: Podle typu hodnoty počítač pozná, které operace a funkce u nich můžete použít.
da: Computeren bruger typen af en værdi til at vide, hvilke operationer og funktioner du kan bruge med dem.
de: Der Computer verwendet den Typ eines Werts, um zu wissen, welche Operationen und Funktionen Sie mit ihnen verwenden können.
ru: Компьютер использует тип значения для того, чтобы понять, какие операции вы можете над ним осуществлять.
ta: எந்த செயல்பாடுகள் மற்றும் செயல்பாடுகளை நீங்கள் பயன்படுத்தலாம் என்பதை அறிய கணினி மதிப்பின் வகையைப் பயன்படுத்துகிறது.
tr: Bilgisayar, bunlarla hangi işlemleri yapabileceğiniz ve hangi fonksiyonları kullanabileceğinizi bilmek için değer tiplerini kullanır.
uk: Комп’ютер використовує тип значення, щоб знати, які операції та функції можна використовувати з ним.

source: As a result, it's essential to understand types: they are not fully compatible with one another, and misusing them will cause errors.
cs: Proto je nezbytné porozumět typům: nejsou mezi sebou plně kompatibilní a jejich nesprávné použití způsobí chyby.
da: Som følge heraf er det vigtigt at forstå typer: de er ikke fuldt kompatible med hinanden, og misbruger du dem vil det forårsage fejl.
de: Daher ist es wichtig, Typen zu verstehen: Sie sind nicht vollständig miteinander kompatibel, und ihr Missbrauch führt zu Fehlern.
ru: Поэтому крайне важно понимать типы: они не взаимозаменяемы и неправильное их использование приведёт к ошибкам.
ta: இதன் விளைவாக, வகைகளைப் புரிந்துகொள்வது அவசியம்: அவை ஒருவருக்கொருவர் முழுமையாக பொருந்தாது, அவற்றை தவறாக பயன்படுத்துவது பிழைகளை ஏற்படுத்தும்.
tr: Sonuç olarak, değer tiplerini anlamak önemlidir: birbirleriyle tam olarak uyumlu değildirler ve bunları yanlış kullanmak hatalara neden olur.
uk: Тому дуже важливо розуміти типи: вони не повністю сумісні один з одним, і неправильне їх використання призведе до помилок.

source: A prime example
cs: Ukázkový příklad
da: Et førsteklasses eksempel
de: Ein Paradebeispiel
es: Un buen ejemplo
fr: Un bon exemple
it: Un buon esempio
ja: その代表例
nl: Een goed voorbeeld
pt_br: Um exemplo primordial
ru: Наглядный пример
ta: ஒரு முதன்மையான சான்று
tr: En iyi örnek
uk: Яскравий приклад
zh_hans: 一个典型的例子
zh_hant: 一個典型的例子

source: You want to display the player's health in the interface. Your code tracks health as a whole number, a value of type [code]int[/code] (short for integer).
cs: V rozhraní chcete zobrazit stav hráče. Váš kód sleduje zdraví jako celé číslo, hodnotu typu [code]int[/code] (zkratka pro integer - celé číslo).
da: Du ønsker at vise spillerens liv i interfacet. Din kode holder styr på liv som et helt nummer, en værdi af typen [code]int[/code] (heltal).
de: Du möchtest den Zustand des Spielers in der Benutzeroberfläche anzeigen. Dein Code verfolgt das Leben als ganze Zahl, einen Wert vom Typ [code]int[/code] (kurz für Integer).
es: Quieres mostrar la salud del jugador en la interfaz. Tu código registra la salud como un número entero, un valor de tipo [code]int[/code] (abreviatura del inglés [i]integer[/i] que significa "entero").
fr: Vous souhaitez afficher la santé du joueur dans l'interface. Votre code suit la santé sous la forme d'un nombre entier, une valeur de type [code]int[/code] (abréviation du terme en anglais [i]integer[/i] qui signifie « entier »).
it: Vuoi mostrare la vita del giocatore nell'interfaccia. Il tuo codice rappresenta la vita come un numero intero, un valore di tipo [code]int[/code] (abbreviazione di intero).
ja: プレイヤーの体力をインターフェースに表示したい。コードは、正常性を整数、型 [code]int[/code] (整数) の値として追跡します。
nl: Je wilt de gezondheid van de speler weergeven in de interface. Je code houdt gezondheid bij als een geheel getal, een waarde van het type [code]int[/code] (afkorting voor integer).
pt_br: Você deseja exibir a vida do jogador na tela. Seu código rastreia a vida como um número inteiro, um valor do tipo [code]int[/code] (abreviação de integer).
ru: Вы хотите отобразить здоровье игрока в интерфейсе. В вашем коде здоровье представлено целым числом, значением типа [code]int[/code] (сокращение от integer).
ta: பிளேயரின் ஆரோக்கியத்தை இடைமுகத்தில் காட்ட விரும்புகிறீர்கள். உங்கள் குறியீடு ஆரோக்கியத்தை முழு எண்ணாக கண்காணிக்கிறது, வகை [குறியீடு] int [/code] (முழு எண்ணுக்கு குறுகியது) வகை.
tr: Oyuncunun sağlığını arayüzde görüntülemek istiyorsunuz. Yazdığınız kod, sağlık durumunu [code]int[/code] (integer'ın kısaltması) tipinde bir değer olan tam sayı olarak izler.
uk: Ви хочете відобразити здоров'я гравця в інтерфейсі. Ваш код відстежує здоров’я як ціле число, значення типу [code]int[/code] (скорочення від integer).
zh_hans: 假设你想在游戏界面中显示玩家的生命值。你的代码将生命值作为一个整数追踪，一个[code]int[/code]类型的值（整数integer的缩写）。
zh_hant: 你想在介面上顯示玩家的血量。你的程式碼將血量儲存為整數類型的值，[code]int[/code]（integer 的縮寫）。

source: However, to display it on the player's screen, the computer wants text: it needs a value of type [code]String[/code].
cs: Aby se však zobrazil na obrazovce hráče, počítač chce zadat text: potřebuje hodnotu typu [code]String[/code].
da: For at vise det på spillerens skærm skal computeren dog bruge tekst: den skal bruge en værdi af typen [code]String[/code].
de: Um es jedoch auf dem Bildschirm des Spielers anzuzeigen, benötigt der Computer Text: Er benötigt einen Wert vom Typ [code]String[/code].
ru: Однако, для отображения его на экране игрока, компьютеру нужен текст — значение типа [code]String[/code].
ta: இருப்பினும், அதை பிளேயரின் திரையில் காண்பிக்க, கணினி உரையை விரும்புகிறது: இதற்கு வகை [குறியீடு] சரம் [/குறியீடு] மதிப்பு தேவை.
tr: Ancak, oyuncunun ekranında görüntülemek için, bilgisayar bir metin ister: [code]Dize[/code] tipinde bir değere ihtiyacı vardır.
uk: Однак, щоб відобразити його на екрані гравця, комп’ютеру потрібен текст: йому потрібне значення типу [code]String[/code].

source: You can concatenate two strings with the [code]+[/code] operator.
cs: Dva řetězce můžete spojit pomocí operátoru [code]+[/code].
da: Du kan sammenkæde to strenge med operatoren [code]+[/code].
de: Du kannst zwei Zeichenfolgen mit dem Operator [code]+[/code] verketten.
ru: Вы можете объединить две строки с помощью оператора [code]+[/code].
ta: [குறியீடு]+[/குறியீடு] ஆபரேட்டருடன் நீங்கள் இரண்டு சரங்களை இணைக்க முடியும்.
tr: İki dizeyi [code]+[/code] işleciyle birleştirebilirsiniz.
uk: Ви можете об’єднати два рядки за допомогою оператора [code]+[/code].

source: So the following code looks like it could work at first glance.
cs: Následující kód na první pohled vypadá, že by mohl fungovat.
da: Så følgende kode ser ud til at kunne virke ved første øjekast.
de: Der folgende Code sieht auf den ersten Blick so aus, als könnte er funktionieren.
es: Así que el siguiente código parece que podría funcionar a primera vista.
fr: Ainsi, le code suivant semble pouvoir fonctionner à première vue.
it: Il seguente codice sembra che possa funzionare, a prima vista.
ja: したがって、次のコードは一見うまくいくように見えます。
nl: Dus de volgende code ziet er op het eerste gezicht uit alsof het zou kunnen werken.
pt_br: Portanto, o código a seguir parece funcionar à primeira vista.
ru: Поэтому следующий код на первый взгляд выглядит рабочим..
ta: எனவே பின்வரும் குறியீடு முதல் பார்வையில் வேலை செய்யக்கூடும் என்று தெரிகிறது.
tr: Bu yüzden aşağıdaki kod, ilk bakışta işe yarayabilecek gibi görünüyor.
uk: Отже, на перший погляд, наведений нижче код може працювати.
zh_hans: 举一反三，下面的代码乍一看似乎可以工作。
zh_hant: 所以以下的程式碼乍看之下似乎可行。

source: But when running the code, we get this strange error.
cs: Při spuštění kódu se však objeví tato podivná chyba.
da: Men når vi kører koden, får vi denne mærkelige fejl.
de: Aber wenn wir den Code ausführen, erhalten wir diesen seltsamen Fehler.
es: Pero al ejecutar el código, obtenemos este extraño error.
fr: Mais lors de l'exécution du code, nous obtenons cette étrange erreur.
it: Ma quando il codice viene eseguito, otteniamo questo strano errore.
ja: しかし、コードを実行すると、この奇妙なエラーが発生します。
nl: Maar bij het uitvoeren van de code krijgen we deze vreemde foutmelding.
pt_br: Mas ao executar o código, recebemos esse erro estranho.
ru: Но при его выполнении мы получим эту странную ошибку.
ta: ஆனால் குறியீட்டை இயக்கும் போது, இந்த விசித்திரமான பிழையைப் பெறுகிறோம்.
tr: Ancak kodu çalıştırınca, bu garip hatayı alıyoruz.
uk: Але під час запуску коду ми отримуємо цю дивну помилку.
zh_hans: 但是在运行代码时，我们得到了这个奇怪的报错。
zh_hant: 但是當執行程式碼時，我們會遇到這個奇怪的錯誤。

source: It tells you can't add values of type [code]String[/code] and [code]int[/code]: they're incompatible.
cs: Říká vám, že nemůžete přidat hodnoty typu [code]String[/code] a [code]int[/code]: jsou nekompatibilní.
da: Den fortæller dig, at du ikke kan tilføje værdier af typen [code]String[/code] og [code]int[/code]: de er inkompatible.
de: Es sagt Dir, dass Du keine Werte vom Typ [code]String[/code] und [code]int[/code] addieren können: Sie sind inkompatibel.
ru: Она говорит вам о том, что вы не можете складывать значения типов [code]String[/code] и [code]int[/code]: они несовместимы.
ta: வகை [குறியீடு] சரம் [/குறியீடு] மற்றும் [குறியீடு] இன்ட் [/குறியீடு] ஆகியவற்றின் மதிப்புகளை நீங்கள் சேர்க்க முடியாது என்று இது கூறுகிறது: அவை பொருந்தாது.
tr: Bu size, [code]String(dize)[/code] ve [code]int(tam sayı)[/code] tipinde değerleri birbirine ekleyemeyeceğinizi söyler: bunlar uyumsuzdur.
uk: Він повідомляє, що ви не можете додавати значення типу [code]String[/code] і [code]int[/code]: вони несумісні.

source: In that case, you need to convert the [code]health[/code] number into a [code]String[/code].
cs: V takovém případě musíte převést číslo [code]health[/code] na [code]String[/code].
da: I så fald skal du konvertere [code]health[/code]-tallet til en [code]String[/code].
de: In diesem Fall musst Du die [code]health[/code]-Nummer in eine [code]String[/code]-Nummer konvertieren.
ru: В этом случае вам нужно преобразовать число [code]health[/code] в строку ([code]String[/code]).
ta: அவ்வாறான நிலையில், நீங்கள் [குறியீடு] உடல்நலம் [/குறியீடு] எண்ணை [குறியீடு] சரம் [/குறியீடு] ஆக மாற்ற வேண்டும்.
tr: Bu durumda, [code]health[/code] sayısını alıp [code]String[/code] tipine dönüştürmeniz gerekir.
uk: У такому випадку вам потрібно перетворити число [code]здоров’я[/code] на [code]рядок[/code].

source: Converting values into strings
cs: Převod hodnot na řetězce
da: Konvertering af værdier til strenge
de: Werte in Zeichenfolgen umwandeln
es: Convertir valores en cadenas
fr: Convertir des valeurs en chaînes de caractères
it: Convertire i valori in stringhe
ja: 値を文字列に変換する
nl: Waarden omzetten in strings
pt_br: Convertendo valores em strings
ru: Преобразование значений в строки
ta: மதிப்புகளை சரங்களாக மாற்றுகிறது
tr: Değerleri dizelere dönüştürmek
uk: Перетворення значень у рядки
zh_hans: 将其他类型的值转换为字符串
zh_hant: 將值轉換為字串

source: You can get the text representation of a value by calling the [code]str()[/code] function (short for "string"). The function returns its argument as a new [code]String[/code].
cs: Textovou reprezentaci hodnoty získáte zavoláním funkce [code]str()[/code] (zkratka pro "string"). Funkce vrátí svůj argument jako nový [code]String[/code].
da: Du kan få tekstrepræsentationen af en værdi ved at kalde funktionen [code]str()[/code] (forkortelse for "string"). Funktionen returnerer sit argument som en ny [code]String[/code].
de: Du kannst die Textdarstellung eines Werts abrufen, indem Du die Funktion [code]str()[/code] (kurz für "string") aufrufst. Die Funktion gibt ihr Argument als neues [code]String[/code] zurück.
ru: Вы можете получить текстовую репрезентацию значения при помощи вызова функции [code]str()[/code] (сокращение от "string"). Эта функция возвращает аргумент, преобразованный в значение типа [code]String[/code].
ta: [குறியீடு] str () [/code] செயல்பாட்டை ("சரம்" க்கு குறுகிய) அழைப்பதன் மூலம் மதிப்பின் உரை பிரதிநிதித்துவத்தை நீங்கள் பெறலாம். செயல்பாடு அதன் வாதத்தை புதிய [குறியீடு] சரம் [/குறியீடு] என வழங்குகிறது.
tr: [code]str()[/code] fonksiyonunu ("string" ifadesinin kısaltması) çağırarak bir değerin metin karşılığını alabilirsiniz. Fonksiyon, girdi değişkenini yeni bir [code]String[/code] olarak döndürür.
uk: Ви можете отримати текстове представлення значення, викликавши функцію [code]str()[/code] (скорочення від "string"). Функція повертає свій аргумент як новий [code]Рядок[/code].

source: You can use this function whenever you want to turn some number or vector into text.
cs: Tuto funkci můžete použít vždy, když chcete nějaké číslo nebo vektor převést na text.
da: Du kan bruge denne funktion, når du vil omdanne et tal eller en vektor til tekst.
de: Du kannst diese Funktion immer dann verwenden, wenn Du eine Zahl oder einen Vektor in Text umwandeln möchtest.
ru: Использовать эту функцию для превращения чисел или векторов в текст вы можете где угодно.
ta: நீங்கள் சில எண் அல்லது திசையனை உரையாக மாற்ற விரும்பும் போதெல்லாம் இந்த செயல்பாட்டைப் பயன்படுத்தலாம்.
tr: Bir sayıyı veya vektörü metne dönüştürmek istediğinizde bu fonksiyonu kullanabilirsiniz.
uk: Ви можете використовувати цю функцію.

source: In this case, it turns the number [code]100[/code] into the string [code]"100"[/code]. Or whatever number [code]health[/code] is currently.
cs: V tomto případě změní číslo [code]100[/code] na řetězec [code]"100"[/code]. Nebo jakékoliv číslo, které [code]health[/code] právě má.
da: I dette tilfælde ændres tallet [code]100[/code] til strengen [code]"100"[/code]. Eller hvilket tal [code]health[/code] nu er.
de: In diesem Fall wandelt es die Zahl [code]100[/code] in die Zeichenfolge [code]"100"[/code] um. Oder welche Zahl [code]health[/code] gerade ist.
es: En este caso, la función convierte el número [code]100[/code] en la cadena [code]"100"[/code]. O el número que sea [code]health[/code] actualmente.
fr: Dans ce cas, elle transforme le nombre [code]100[/code] en la chaîne [code]"100"[/code]. Ou quel que soit le nombre de [code]health[/code] actuellement.
it: In questo caso, trasforma il numero [code]100[/code] nella stringa [code]"100"[/code]. O qualsiasi numero [code]health[/code] sia correntemente.
ja: この場合、数値 [code]100[/code] を文字列 [code]"100"[/code] に変換します。または、現在の [code]health[/code] の番号。
nl: In dit geval verandert het getal [code]100[/code] in de string [code]"100"[/code]. Of welk getal [code]health[/code] op dat moment ook is.
pt_br: Nesse caso, ele transforma o número [code]100[/code] na string [code]"100"[/code]. Ou qualquer número que a variável [code]health[/code] tenha atualmente.
ru: В нашем случае, он превращает число [code]100[/code] в строку [code]"100"[/code]. Или любое другое число, которому равно [code]health[/code] в текущий момент.
ta: இந்த வழக்கில், இது எண்ணை [குறியீடு] 100 [/குறியீடு] சரம் [குறியீடு] "100" [/குறியீடு] ஆக மாற்றுகிறது. அல்லது எந்த எண் [குறியீடு] உடல்நலம் [/குறியீடு] தற்போது உள்ளது.
tr: Bu durumda, [code]100[/code] sayısını [code]"100"[/code] dizesine çevirir. Veya şu anda [code]health[/code] değeri her ne ise.
uk: У цьому випадку він перетворює число [code]100[/code] на рядок [code]"100"[/code]. Або будь-який інший номер [code]здоров'я[/code] на даний момент.
zh_hans: 在这个例子中，str()能将数字 [code]100[/code] 转换为字符串 [code]"100"[/code]。 或者[code]health[/code]变量代表的任何数字。
zh_hant: 在這種情況下，它會將數字 [code]100[/code] 轉換為字串 [code]"100"[/code]，或是將當前的 [code]health[/code] 數值轉換為對應的字串。

source: Converting strings into numbers
cs: Převod řetězců na čísla
da: Konvertering af strenge til tal
de: Zeichenfolgen in Zahlen umwandeln
es: Convertir cadenas en números
fr: Convertir des chaînes de caractères en nombres
it: Convertire stringhe in numeri
ja: 文字列を数値に変換する
nl: Strings omzetten in getallen
pt_br: Convertendo strings em números
ru: Преобразование строк в числа
ta: சரங்களை எண்களாக மாற்றுகிறது
tr: Dizeleri sayılara dönüştürmek
uk: Перетворення рядків у числа
zh_hans: 将字符串转换为数字
zh_hant: 將字串轉換為數字

source: You can also convert strings into whole numbers or decimal numbers using respectively the [code]int()[/code] and [code]float()[/code] functions.
cs: Řetězce můžete také převést na celá nebo desetinná čísla pomocí funkcí [code]int()[/code] a [code]float()[/code].
da: Du kan også konvertere strenge til hele tal eller decimaltal ved hjælp af henholdsvis funktionerne [code]int()[/code] og [code]float()[/code].
de: Du kannst Zeichenfolgen auch mit den Funktionen [code]int()[/code] bzw. [code]float()[/code] in ganze Zahlen oder Dezimalzahlen konvertieren.
ru: Также вы можете преобразовывать строки в целые числа или десятичные дроби, при помощи функций [code]int()[/code] и [code]float()[/code] соответственно.
ta: நீங்கள் முறையே [குறியீடு] எண்ணாக () [/குறியீடு] மற்றும் [குறியீடு] மிதவை () [/குறியீடு] செயல்பாடுகளைப் பயன்படுத்தி சரங்களை முழு எண்களாக அல்லது தசம எண்களாக மாற்றலாம்.
tr: Ayrıca, [code]int()[/code] ve [code]float()[/code] fonksiyonlarını kullanarak dizeleri sırasıyla tam sayılara veya ondalık sayılara dönüştürebilirsiniz.
uk: Ви також можете конвертувати рядки в цілі чи десяткові числа за допомогою функцій [code]int()[/code] і [code]float()[/code].

source: Those functions can convert what the player writes in a text field into a number. For example, the number of potions to sell at once in a shop.
cs: Tyto funkce mohou převést to, co hráč napíše do textového pole, na číslo. Například počet lektvarů, které se mají prodat najednou v obchodě.
da: Disse funktioner kan konvertere det, spilleren skriver i et tekstfelt, til et tal. For eksempel antallet af eliksirer, der skal sælges på én gang i en butik.
de: Diese Funktionen können das, was der Spieler in ein Textfeld schreibt, in eine Zahl umwandeln. Zum Beispiel die Anzahl der Tränke, die gleichzeitig in einem Geschäft verkauft werden sollen.
ru: Эти функции могут преобразовать текст, написанный игроком в текстовом поле. Например, число зелий для продажи за раз в магазине.
ta: அந்த செயல்பாடுகள் ஒரு உரை புலத்தில் பிளேயர் எழுதுவதை ஒரு எண்ணாக மாற்ற முடியும். உதாரணமாக, ஒரு கடையில் ஒரே நேரத்தில் விற்க வேண்டிய போசன்களின் எண்ணிக்கை.
tr: Bu fonksiyonlar, oyuncunun bir metin girişi alanına yazdıklarını bir sayıya dönüştürebilir. Örneğin, bir dükkanda bir kerede satılacak iksir sayısı.
uk: Ці функції можуть перетворювати те, що гравець пише в текстовому полі, на число. Наприклад, кількість зілля, яке потрібно відразу продати в магазині.

source: Some types are partially compatible
cs: Některé typy jsou částečně kompatibilní
da: Nogle typer er delvist kompatible
de: Einige Typen sind teilweise kompatibel
es: Algunos tipos son parcialmente compatibles
fr: Certains types sont partiellement compatibles
it: Alcuni tipi sono parzialmente compatibili
ja: 一部の型は部分的に互換性があります
nl: Sommige types zijn deels compatibel
pt_br: Alguns tipos são parcialmente compatíveis
ru: Некоторые типы частично совместимы
ta: சில வகைகள் ஓரளவு இணக்கமானவை
tr: Bazı tipler kısmen uyumludur
uk: Деякі типи частково сумісні
zh_hans: 某些值类型能部分兼容
zh_hant: 某些值類型能部分相容

source: Most types are incompatible. For example, you can't directly add or multiply an array with a number.
cs: Většina typů je nekompatibilní. Například nelze přímo sčítat nebo násobit pole s číslem.
da: De fleste typer er inkompatible. For eksempel kan du ikke direkte addere eller gange et array med et tal.
de: Die meisten Typen sind nicht kompatibel. Beispielsweise kannst Du ein Array nicht direkt mit einer Zahl addieren oder multiplizieren.
ru: Большинство типов несовместимы. Например, вы не можете прямо добавить или умножить массив на число.
ta: பெரும்பாலான வகைகள் பொருந்தாது. எடுத்துக்காட்டாக, நீங்கள் ஒரு வரிசையை நேரடியாக ஒரு வரிசையைச் சேர்க்கவோ பெருக்கவோ முடியாது.
tr: Çoğu değer tipi birbiriyle uyumsuzdur. Örneğin, bir dizi ile bir sayı doğrudan toplayamaz veya çarpamazsınız.
uk: Більшість типів несумісні. Наприклад, ви не можете безпосередньо додати чи помножити масив на число.

source: However, some types are [i]partially[/i] compatible. For example, you can multiply or divide a vector by a number.
cs: Některé typy jsou však [i]částečně[/i] kompatibilní. Například vektor můžete násobit nebo dělit číslem.
da: Nogle typer er dog [i]delvist[/i] kompatible. For eksempel kan du gange eller dividere en vektor med et tal.
de: Einige Typen sind jedoch [i]teilweise[/i] kompatibel. Beispielsweise kannst Du einen Vektor mit einer Zahl multiplizieren oder dividieren.
ru: При этом, некоторые типы [i]частично[/i] совместимы. Например, вы можете умножить или разделить вектор на число.
ta: இருப்பினும், சில வகைகள் [i] ஓரளவு [/i] இணக்கமானவை. எடுத்துக்காட்டாக, நீங்கள் ஒரு திசையனை ஒரு எண்ணால் பெருக்கலாம் அல்லது பிரிக்கலாம்.
tr: Ancak, bazı tipler [i]kısmen[/i] uyumludur. Örneğin, bir vektörü bir sayı ile çarpabilir veya bölebilirsiniz.
uk: Однак деякі типи [i]частково[/i] сумісні. Наприклад, ви можете помножити або поділити вектор на число.

source: It is possible because other developers defined that operation for you under the hood.
cs: Je to možné, protože tuto operaci pro vás definovali jiní vývojáři.
da: Det er muligt, fordi andre udviklere har defineret den operation for dig under motorhjelmen.
de: Es ist möglich, weil andere Entwickler diese Operation für Dich unter der Haube definiert haben.
ru: Это возможно благодаря тому, что другие разработчики определили эту операцию для вас под капотом.
ta: மற்ற உருவாக்குபவர்கள் உங்களுக்காக அந்த செயல்பாட்டை ஊட்டின் கீழ் வரையறுத்துள்ளதால் இது சாத்தியமாகும்.
tr: Bu işlem mümkündür, çünkü diğer geliştiriciler bu işlemi sizin için sistemin içinde tanımladılar.
uk: Це можливо тому, що інші розробники визначили цю операцію для вас під капотом.
