Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-8-defining-variables.po
Languages: cs, da, de, es, fr, it, nl, pt_br, ta, tr, uk, zh_hant

source: The code above will display the number [code]100[/code] to some output window.
da: Ovenstående kode vil vise tallet [code]100[/code] i et outputvindue.
es: El código anterior mostrará el número [code]100[/code] en alguna ventana de salida.
fr: Le code ci-dessus affichera le nombre [code]100[/code] dans une fenêtre de sortie.
it: Il codice qua sopra mostrerà il numero [code]100[/code] a qualche schermata di output.
pt_br: O código acima exibirá o número [code]100[/code] em alguma janela de saída.
ta: மேலே உள்ள குறியீடு சில வெளியீட்டு சாளரத்திற்கு [குறியீடு] 100 [/குறியீடு] எண்ணைக் காண்பிக்கும்.
tr: Yukarıdaki kod, [code]100[/code] sayısını bir çıktı penceresinde gösterecektir.
uk: Наведений вище код виведе у вікно виведення число [code]100[/code].

source: Notice we don't use the [code]var[/code] keyword anymore as we only need it to [i]define[/i] a variable.
da: Bemærk, at vi ikke længere bruger nøgleordet [code]var[/code], da vi kun skal bruge det til at [i]definere[/i] en variabel.
es: Observa que ya no utilizamos la palabra clave [code]var[/code], ya que sólo la necesitamos para [i]definir[/i] una variable.
fr: Remarquez que nous n'utilisons plus le mot-clé [code]var[/code] car nous n'en avons besoin que pour [i]définir[/i] une variable.
it: Nota che non usiamo più la parola chiave [code]var[/code] dato che serve solo per [i]definire[/i] una variabile.
pt_br: Observe que não usamos mais a palavra-chave [code]var[/code] pois só precisamos dela para [i]definir[/i] uma variável.
ta: [குறியீடு] var [/code] முக்கிய சொல்லை நாங்கள் இனி பயன்படுத்த மாட்டோம் என்பதைக் கவனியுங்கள், ஏனெனில் [i] ஒரு மாறியை வரையறுக்க வேண்டும்.
tr: [code]var[/code] anahtar sözcüğünü, daha sonra kullanmadığımıza dikkat edin, çünkü buna yalnızca bir değişkeni [i]tanımlamak[/i] için ihtiyacımız var.
uk: Зверніть увагу, що ми більше не використовуємо ключове слово [code]var[/code], оскільки воно потрібне тільки для того, щоб [i]оголосити[/i] змінную.

source: Also, once you define a variable, you can change its value anytime with the equal sign.
da: Når du først har defineret en variabel, kan du også ændre dens værdi når som helst med lighedstegnet.
es: Además, una vez que hayas definido una variable, puedes cambiar su valor en cualquier momento con el signo igual.
fr: De plus, une fois que vous avez défini une variable, vous pouvez changer sa valeur à tout moment avec le signe égal.
it: Inoltre, appena definisci una variabile, puoi cambiare il suo valore quando vuoi con il segno uguale.
pt_br: Além disso, depois de definir uma variável, você pode alterar seu valor a qualquer momento com o sinal de igual.
ta: மேலும், நீங்கள் ஒரு மாறியை வரையறுத்தவுடன், சமமான அடையாளத்துடன் எப்போது வேண்டுமானாலும் அதன் மதிப்பை மாற்றலாம்.
tr: Ayrıca, bir değişkeni tanımladıktan sonra, eşittir işareti ile değerini istediğiniz zaman değiştirebilirsiniz.
uk: Крім того, оголосивши змінну, ви можете будь-якої миті змінити її значення за допомогою знака рівності.

source: About the print function
cs: O funkci tisku (print)
da: Om udskriftsfunktionen
es: Acerca de la función de impresión
fr: À propos de la fonction « print »
it: Riguardo la funzione print
nl: Over de functie print
pt_br: Sobre a função chamada print
ta: அச்சு செயல்பாடு பற்றி
tr: Yazdırma (print) fonksiyonu hakkında
uk: Про функцію print
zh_hant: 關於 print 函式

source: The [code]print()[/code] function is generally the first function you learn in academic programming courses.
da: Funktionen [code]print()[/code] er generelt den første funktion, du lærer i akademiske programmeringskurser.
es: La función [code]print()[/code] es generalmente la primera función que se aprende en los cursos académicos de programación.
fr: La fonction [code]print()[/code] (« imprimer » en anglais) est généralement la première fonction que vous apprenez dans les cours de programmation académiques.
it: La funzione [code]print()[/code] è in genere la prima funzione che impari nei corsi di programmazione accademici.
pt_br: A função [code]print()[/code] é geralmente a primeira função que você aprende em cursos acadêmicos de programação.
ta: [குறியீடு] அச்சு () [/குறியீடு] செயல்பாடு பொதுவாக கல்வி நிரலாக்க படிப்புகளில் நீங்கள் கற்றுக் கொள்ளும் முதல் செயல்பாடாகும்.
tr: [code]print()[/code] fonksiyonu genellikle, akademik programlama derslerinde öğrenilen ilk fonksiyondur.
uk: Функція [code]print()[/code] зазвичай є першою функцією, яку ви вивчаєте на академічних курсах програмування.

source: It sends ("prints") the message or value you give it to some output window, often a black window with plain white text.
da: Den sender ("printer") den besked eller værdi, du giver den, til et outputvindue, ofte et sort vindue med almindelig hvid tekst.
es: Esta envía ("imprime") el mensaje o valor que le das a alguna ventana de salida, a menudo una ventana negra con texto simple en blanco.
fr: Elle envoie (« imprime ») le message ou la valeur que vous lui donnez à une fenêtre de sortie, souvent une fenêtre noire avec du texte brut blanc.
it: Manda ("stampa") il messaggio o il valore gli dai in qualche schermata di output, spesso una finestra nera con nel semplice testo in bianco.
pt_br: Ela ("imprime na tela") mensagens ou valores que você fornece para alguma janela de saída, essa janela geralmente é uma tela preta com texto branco simples.
ta: இது நீங்கள் கொடுக்கும் செய்தி அல்லது மதிப்பை சில வெளியீட்டு சாளரத்திற்கு அனுப்புகிறது ("அச்சிடுகிறது), பெரும்பாலும் வெற்று வெள்ளை உரையுடன் கூடிய கருப்பு சாளரம்.
tr: Verdiğiniz mesajı veya değeri, genellikle düz beyaz metin içeren siyah bir pencereye (ekrana), bir çıktı olarak gönderir ("yazdırır").
uk: Вона надсилає ("друкує") повідомлення або значення, яке ви передаєте їй, у деяке вікно виведення, часто це чорне вікно з білим текстом.

source: Programmers often use [code]print()[/code] to quickly check the value of their variables when their game runs.
da: Programmører bruger ofte [code]print()[/code] til hurtigt at tjekke værdien af deres variabler, når deres spil kører.
es: Los programadores a menudo utilizan [code]print()[/code] para comprobar rápidamente el valor de sus variables cuando se ejecuta su juego.
fr: Les programmeurs utilisent souvent [code]print()[/code] pour vérifier rapidement la valeur de leurs variables lorsque leur jeu s'exécute.
it: I programmatori spesso usano [code]print()[/code] per controllare rapidamente il valore delle loro variabili quando il loro gioco è in esecuzione.
pt_br: Os programadores costumam usar a função [code]print()[/code] para verificar rapidamente o valor de suas variáveis quando o jogo é executado.
ta: புரோகிராமர்கள் பெரும்பாலும் [குறியீடு] அச்சு () [/குறியீடு] ஐப் பயன்படுத்தி தங்கள் விளையாட்டு இயங்கும் போது அவற்றின் மாறிகளின் மதிப்பை விரைவாக சரிபார்க்க.
tr: Programcılar, oyunları çalışırken, değişkenlerinin değerini hızlıca kontrol etmek için genellikle [code]print()[/code] kullanırlar.
uk: Програмісти часто використовують [code]print()[/code] для швидкої перевірки значень змінних у процесі гри.

source: In the app, we made a special output window that captures calls to [code]print()[/code] and displays a card to make it friendlier for you.
da: I appen har vi lavet et særligt outputvindue, der registrerer kald til [code]print()[/code] og viser et kort for at gøre det mere brugervenligt for dig.
es: En la aplicación, hemos creado una ventana de salida especial que captura las llamadas a [code]print()[/code] y muestra una tarjeta para hacerlo más amigable para ti.
fr: Dans l'application, nous avons créé une fenêtre de sortie spéciale qui capture les appels à [code]print()[/code] et affiche une carte pour la rendre plus convivial pour vous.
it: In questa applicazione, abbiamo creato una speciale finestra di output che cattura le chiamate di [code]print()[/code] e mostra una carta che la rende più facile per te.
pt_br: No aplicativo, nós criamos uma janela de saída especial que captura chamadas da função [code]print()[/code] e exibe um cartão na tela, para tornar as coisas mais amigável para você.
ta: பயன்பாட்டில், ஒரு சிறப்பு வெளியீட்டு சாளரத்தை நாங்கள் உருவாக்கியுள்ளோம், இது [குறியீடு] அச்சு () [/குறியீடு] க்கு அழைப்புகளைப் பிடிக்கிறது மற்றும் ஒரு கார்டைக் காண்பிக்கும்.
tr: Uygulama içinde sizin için, [code]print()[/code] fonksiyonuna yapılan çağrıları yakalayıp, daha arkadaş canlısı bir hale getirmek için, bir çıktı penceresi yaptık.
uk: У застосунку ми зробили спеціальне вікно виведення, яке перехоплює виклики [code]print()[/code] та показує результат виконання на картці, щоб зробити його зручнішим для вас.

source: Here, the verb [i]print[/i] means "to send information to display on the screen."
da: Her betyder verbet [i]print[/i] "at sende information til visning på skærmen".
es: Aquí, el verbo [i]imprimir[/i] significa "enviar información para mostrarla en la pantalla"
fr: Ici, le verbe [i]print[/i] signifie « envoyer des informations à afficher sur l'écran ».
it: Qui, il verbo [i]print[/i] significa "inviare informazioni da mostrare sullo schermo".
pt_br: Aqui, o verbo [i]print[/i] (imprimir em inglês) significa "enviar informações para serem exibidas na tela".
ta: இங்கே, வினைச்சொல் [i] அச்சிடுக [/i] என்றால் "திரையில் காண்பிக்க தகவல்களை அனுப்ப வேண்டும்."
tr: Burada, [i]print[/i] (yazdır) fiili "ekranda görüntülenmek üzere bilgi göndermek" anlamına gelmektedir.
uk: Тут дієслово [i]print[/i] (друкувати) означає "надіслати інформацію для показу на екрані".

source: The function "prints" things on your computer display; It does not relate to printers.
da: Funktionen "udskriver" ting på din computerskærm; den har ikke noget med printere at gøre.
es: La función "imprime" cosas en la pantalla de tu computadora; no se relaciona con las impresoras.
fr: La fonction « imprime » des choses sur l'écran de votre ordinateur ; elle ne concerne pas les imprimantes.
it: La funzione "stampa" cose sul tuo schermo del computer; Non ha a che fare con le stampanti.
pt_br: A função "imprime" coisas na tela do seu computador; Não tem nada a ver com impressoras.
ta: உங்கள் கணினி காட்சியில் "அச்சிடும்" செயல்பாடு; இது அச்சுப்பொறிகளுடன் தொடர்புபடுத்தவில்லை.
tr: Bu fonksiyon, bilgisayarının ekranına bir şeyler "yazdırır"; yazıcılarla ilgisi yoktur.
uk: Функція друкує на дисплеї комп'ютера; вона не пов'язана з принтерами.

source: Variables are like labels
cs: Proměnné jsou jako štítky nebo popisky
da: Varer er som etiketter
es: Las variables son como etiquetas
fr: Les variables sont comme des étiquettes
it: Le variabili sono come delle etichette
nl: Variabelen zijn net labels
pt_br: Variáveis são como rótulos
ta: மாறிகள் லேபிள்கள் போன்றவை
tr: Değişkenler etiketler gibidir
uk: Змінні схожі на етикетки
zh_hant: 變數就像標籤

source: As we hinted above, in GDScript, variables work a bit like labels.
da: Som vi antydede ovenfor, fungerer variabler i GDScript lidt ligesom etiketter.
es: Como dijimos anteriormente, en GDScript, las variables funcionan un poco como etiquetas.
fr: Comme nous l'avons indiqué ci-dessus, dans GDScript, les variables fonctionnent un peu comme des étiquettes.
it: Come abbiamo accennato sopra, in GDScript, le variabili operano un po' come delle etichette.
pt_br: Como sugerimos acima, no GDScript, as variáveis funcionam um pouco como rótulos.
ta: நாம் மேலே சுட்டிக்காட்டியபடி, சி.டி.எச்.ச்கிரிப்டில், மாறிகள் லேபிள்களைப் போலவே செயல்படுகின்றன.
tr: Yukarıda işaret ettiğimiz gibi, GDScript'te, değişkenler biraz etiketlere benzer çalışır.
uk: Як ми зазначили вище, за принципом роботи змінні GDScript трохи схожі на етикетки.

source: Assigning a value to a variable is like taking your label (the variable) and sticking it onto some item (the value).
da: At tildele en værdi til en variabel er som at tage din etiket (variablen) og sætte den på et element (værdien).
es: Asignar un valor a una variable es como tomar tu etiqueta (la variable) y pegarla en algún elemento (el valor).
fr: Assigner une valeur à une variable revient à prendre votre étiquette (la variable) et à la coller sur un élément (la valeur).
it: Assegnare un valore ad una variabile è come prendere la tua etichetta (la variabile) e appiccicarla su qualche prodotto (il valore).
pt_br: Atribuir um valor a uma variável é como pegar o rótulo dela (da variável) e colá-lo em algum item (o valor).
ta: ஒரு மாறிக்கு ஒரு மதிப்பை ஒதுக்குவது உங்கள் லேபிளை (மாறி) எடுத்து சில உருப்படிகளில் (மதிப்பு) ஒட்டிக்கொள்வது போன்றது.
tr: Bir değişkene değer atamak, etiketini (değişken) alıp bir öğenin (değer) üzerine yapıştırmak gibidir.
uk: Присвоїти значення змінній - це все одно що взяти етикетку (змінну) і наклеїти її на якийсь предмет (значення).

source: Like a supermarket has a database of product labels, the computer keeps a list of all variables in your code.
da: Ligesom et supermarked har en database med produktetiketter, opbevarer computeren en liste over alle variabler i din kode.
es: Al igual que un supermercado tiene una base de datos de las etiquetas de los productos, la computadora guarda una lista de todas las variables de tu código.
fr: Comme un supermarché dispose d'une base de données des étiquettes des produits, l'ordinateur conserve une liste de toutes les variables de votre code.
it: Come un supermercato possiede il suo database di etichette di prodotti, il computer tiene una lista di tutte le variabili nel tuo codice.
pt_br: Assim como um supermercado tem um banco de dados de rótulos dos produtos, o computador mantém uma lista de todas as variáveis no seu código.
ta: ஒரு சூப்பர் மார்க்கெட்டில் தயாரிப்பு லேபிள்களின் தரவுத்தளம் இருப்பதைப் போல, கணினி உங்கள் குறியீட்டில் உள்ள அனைத்து மாறிகளின் பட்டியலையும் வைத்திருக்கிறது.
tr: Bir süpermarketin ürün etiketlerinden oluşan bir veri tabanına sahip olması gibi, bilgisayar da kodun içindeki tüm değişkenlerin bir listesini tutar.
uk: Як у магазині є база даних етикеток товарів, так і комп'ютер зберігає список усіх змінних у вашому коді.

source: Given the variable name, the computer can look up the attached value.
da: Med variabelnavnet kan computeren slå den tilknyttede værdi op.
es: Dado el nombre de la variable, la computadora puede buscar el valor adjunto.
fr: En donnant le nom de la variable, l'ordinateur peut rechercher la valeur jointe.
it: Dato il nome della variabile, il computer può guardare il valore collegato.
pt_br: Depois de dar um nome para a variável, o computador pode procurar o valor anexado.
ta: மாறி பெயரைக் கொண்டு, கணினி இணைக்கப்பட்ட மதிப்பைக் காணலாம்.
tr: Bir değişkenin adı verildiğinde, bilgisayar onunla ilişkili değeri arayabilir.
uk: Використовуючи задану назву змінної, комп'ютер може знайти прикріплене до неї значення.

source: It has an important consequence. In GDScript, you can stick that label to any other value.
da: Det har en vigtig konsekvens. I GDScript kan du hæfte denne etiket til enhver anden værdi.
es: Esto tiene una consecuencia importante. En GDScript, puedes pegar esa etiqueta a cualquier otro valor.
fr: Cela a une conséquence importante. Dans GDScript, vous pouvez coller cette étiquette à n'importe quelle autre valeur.
it: Questo ha un'importante conseguenza. In GDScript, puoi attaccare quell'etichetta ad ogni altro valore.
pt_br: Tem uma consequência importante nisso. No GDScript, você pode colar esse rótulo em qualquer outro valor.
ta: இது ஒரு முக்கியமான விளைவைக் கொண்டுள்ளது. GDSCRIPT இல், நீங்கள் அந்த லேபிளை வேறு எந்த மதிப்பிலும் ஒட்டலாம்.
tr: Bunun önemli bir sonucu vardır. GDScript'te, bu etiketi başka herhangi bir değere yapıştırabilirsiniz.
uk: З цього випливає важливий наслідок — у GDScript ви можете приклеїти цю етикетку до будь-якого іншого значення.

source: The above code is like taking a label from the appropriate item and sticking it to the wrong thing:
da: Ovenstående kode er som at tage en etiket fra den relevante genstand og sætte den på den forkerte ting:
es: El código anterior es como coger una etiqueta del artículo apropiado y pegarla en el objeto equivocado:
fr: Le code ci-dessus revient à prendre une étiquette de l'article approprié et à la coller sur le mauvais article :
it: Il codice precedente è come se prendesse un'etichetta dall'elemento appropriato e la attaccasse a quello sbagliato:
pt_br: O código acima é como pegar um rótulo de um item que já estava certo e colá-lo na coisa errada:
ta: மேலே உள்ள குறியீடு பொருத்தமான உருப்படியிலிருந்து ஒரு லேபிளை எடுத்து தவறான விசயத்தில் ஒட்டிக்கொள்வது போன்றது:
tr: Yukarıdaki kod, uygun bir üründen etiketini alıp, yanlış bir şeye yapıştırmak gibidir:
uk: Наведений вище код схожий на те, якби ви зняли етикетку з доречного елемента і приклеїли її до хибного:

source: - At line 2, the [code]health[/code] variable holds a number. - From line 3, [code]health[/code] holds text.
da: - På linje 2 indeholder variablen [code]health[/code] et tal. - Fra linje 3 indeholder [code]health[/code] tekst.
es: - En la línea 2, la variable [code]health[/code] contiene un número. - A partir de la línea 3, [code]health[/code] contiene texto.
fr: - Sur la ligne 2, la variable [code]health[/code] contient un nombre. - À partir de la ligne 3, [code]health[/code] contient du texte.
it: - Alla riga 2, la variabile [code]health[/code] contiene un numero. - Alla riga 3, [code]health[/code] contiene un testo.
pt_br: - Na linha 2, a variável [code]health[/code] contém um número. - A partir da linha 3, [code]health[/code] passar a ter um texto.
ta: - வரி 2 இல், [குறியீடு] உடல்நலம் [/குறியீடு] மாறி ஒரு எண்ணைக் கொண்டுள்ளது. - வரியிலிருந்து, [குறியீடு] உடல்நலம் [/குறியீடு] உரையை வைத்திருக்கிறது.
tr: - 2. satırda, [code]health[/code] değişkeni bir sayı tutuyor. - 3. satırdan itibaren, [code]health[/code] metin tutmaya başlıyor.
uk: - У рядку 2 змінна [code]health[/code] містить число. - Після виконання рядка 3, змінна [code]health[/code] міститиме текст.

source: The computer will let you do that! The code's syntax and "grammar" are correct, but it's not good.
da: Computeren lader dig gøre det! Kodens syntaks og "grammatik" er korrekt, men den er ikke god.
es: ¡La computadora te permitirá hacer eso! La sintaxis y la "gramática" del código son correctas, pero sabemos que esto no está bien.
fr: L'ordinateur vous permettra de le faire ! La syntaxe et la « grammaire » du code sont correctes, mais ce n'est pas bon.
it: Il computer vi permetterà di farlo! La sintassi e la "grammatica" del codice sono corrette, ma non vanno bene.
pt_br: O computador vai deixar você fazer isso! A sintaxe e a "gramática" do código estão corretas, mas não são boas.
ta: கணினி அதை செய்ய உங்களை அனுமதிக்கும்! குறியீட்டின் தொடரியல் மற்றும் "இலக்கணம்" சரியானவை, ஆனால் அது நல்லதல்ல.
tr: Bilgisayar bunu yapmanıza izin verir! Çünkü kodun sözdizimi ve "dilbilgisi" doğrudur, ama bu iyi bir şey değil.
uk: Комп'ютер дозволить вам так зробити! Синтаксис та "граматика" коду правильні, але робити так – погано.

source: Variable names should describe the value they contain, so a [code]health[/code] variable with a text value will confuse your future self and other coders. It can also cause errors in your game.
da: Variabelnavne bør beskrive den værdi, de indeholder, så en [code]health[/code]-variabel med en tekstværdi vil forvirre dit fremtidige jeg og andre kodere. Det kan også forårsage fejl i dit spil.
es: Los nombres de las variables deberían de describir el valor que contienen, por lo que una variable [code]health[/code] (salud) con un valor de texto confundirá a tu futuro yo y a otros programadores. También puede causar errores en tu juego.
fr: Les noms de variables devraient décrire la valeur qu'elles contiennent, donc une variable [code]health[/code] avec une valeur texte va embrouiller votre futur moi et les autres codeurs. Cela peut également provoquer des erreurs dans votre jeu.
it: I nomi delle variabili devono descrivere il valore che contengono, quindi una variabile [code]health[/code] con un valore di testo confonderà il vostro futuro io e gli altri codificatori. Può anche causare errori nel gioco.
pt_br: É boa prática dar um nome que descreve bem o valor de uma variável. Uma variável [code]health[/code] com um valor de texto pode confundir você e outros programadores no futuro. Também pode causar erros no seu jogo.
ta: மாறி பெயர்கள் அவற்றில் உள்ள மதிப்பை விவரிக்க வேண்டும், எனவே உரை மதிப்பைக் கொண்ட ஒரு [குறியீடு] உடல்நலம் [/குறியீடு] மாறி உங்கள் எதிர்கால தன்வய மற்றும் பிற குறியீட்டாளர்களைக் குழப்பிவிடும். இது உங்கள் விளையாட்டிலும் பிழைகளையும் ஏற்படுத்தும்.
tr: Değişkenlerin isimleri, içerdikleri değeri tanımlamalıdır, bu nedenle metin içeriği olan bir [code]health[/code] değişkeni gelecekteki sizin ve diğer kodlayıcıların kafasını karıştıracaktır. Ayrıca oyununda hatalara da neden olabilir.
uk: Назви змінних повинні описувати значення, яке міститься в них, тому змінна [code]health[/code] із текстовим значенням заплутає у майбутньому вас та інших програмістів. Це також може викликати помилки у вашій грі.

source: Later on, we'll see how to avoid this issue with [i]variable types[/i]. For now, let's practice creating variables!
da: Senere vil vi se, hvordan man undgår dette problem med [i]variabeltyper[/i]. Lad os nu øve os i at oprette variabler!
es: Más adelante, veremos cómo evitar este problema con los [i]tipos de variables[/i]. Por ahora, ¡vamos a practicar la creación de variables!
fr: Plus tard, nous verrons comment éviter ce problème avec les [i]types de variables[/i]. Pour l'instant, exerçons-nous à créer des variables !
it: Più avanti vedremo come evitare questo problema con i [i]tipi di variabili[/i]. Per ora, esercitiamoci a creare le variabili!
pt_br: Mais tarde, veremos como evitar esse problema com [i]tipos de variável[/i]. Por enquanto, vamos praticar a criação de variáveis!
ta: பின்னர், [i] மாறி வகைகளுடன் [/i] இந்த சிக்கலை எவ்வாறு தவிர்ப்பது என்று பார்ப்போம். இப்போதைக்கு, மாறிகளை உருவாக்குவோம்!
tr: İleride, [i]değişken tipleri[/i] ile bu sorundan nasıl kaçınacağımızı göreceğiz. Şimdilik, değişkenleri oluşturma alıştırması yapalım!
uk: Пізніше ми побачимо, як уникнути цієї проблеми за допомогою [i] типів змінних [/i]. А поки що попрактикуймося у створенні змінних!

source: Define a health variable
cs: Definice proměnné health
da: Definer en livsvariabel
de: Definieren einer Lebensvariable
es: Definir una variable de salud
fr: Définir une variable de santé
it: Definisci una variabile di vita
nl: Definieer een gezondheidsvariabele
pt_br: Defina uma variável de vida
ta: சுகாதார மாறியை வரையறுக்கவும்
tr: Bir sağlık değişkeni tanımlayın
uk: Визначте змінну health (здоров'я)
zh_hant: 定義一個 health 變數

source: Define a variable named [code]health[/code] with a starting value of [code]100[/code].
da: Definer en variabel med navnet [code]health[/code] med en startværdi på [code]100[/code].
es: Define una variable llamada [code]health[/code] con un valor inicial de [code]100[/code].
fr: Définissez une variable nommée [code]health[/code] avec une valeur de départ de [code]100[/code].
it: Definisci una variabile chiamata [code]health[/code] con un valore iniziale di [code]100[/code].
pt_br: Defina uma variável chamada [code]health[/code] com um valor inicial de [code]100[/code].
ta: [குறியீடு] 100 [/குறியீடு] இன் தொடக்க மதிப்புடன் [குறியீடு] உடல்நலம் [/குறியீடு] என்ற மாறியை வரையறுக்கவும்.
tr: Başlangıç değeri [code]100[/code] olan, [code]health[/code] isminde bir değişken tanımlayın.
uk: Визначте змінну з назвою [code]health[/code] (здоров'я) і початковим значенням [code]100[/code].
