Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-3-standing-on-shoulders-of-giants.po
Languages: cs, da, de, es, fr, it, ja, nl, pt_br, ru, ta, uk, zh_hant

source: As programmers, we rely on a lot of code created by others before us.
cs: Jako programátoři se spoléháme na spoustu kódu, který před námi vytvořili jiní.
da: Som programmører, vi er afhængige af en masse kode skabt af andre før os.
fr: En tant que programmeurs, nous nous appuyons sur beaucoup de code créé par d'autres avant nous.
ja: プログラマーは他の人によって作成された多くのコードに依存しています。
nl: Als programmeurs maken we gebruik van veel code die anderen voor ons hebben geschreven.
pt_br: Como programador, nós contamos muito com códigos feitos por outros programadores que vieram antes de nós.
ru: Как программисты, мы полагаемся на большое количество кода, созданного другими программистами до нас.
ta: புரோகிராமர்களாக, எங்களுக்கு முன் மற்றவர்களால் உருவாக்கப்பட்ட நிறைய குறியீடுகளை நாங்கள் நம்பியுள்ளோம்.
uk: Як програмісти ми покладаємося на велику кількість коду, який раніше створили інші програмісти.
zh_hant: 身為程式設計師，我們依靠許多前人創造的程式碼。

source: Every programming language comes with a wealth of features created by other programmers to save you time.
cs: Každý programovací jazyk je vybaven množstvím funkcí vytvořených jinými programátory, které vám šetří čas.
da: Hvert programmeringssprog kommer med et væld af funktioner skabt af andre programmører for at spare dig tid.
fr: Chaque langage de programmation est livré avec une multitude de fonctionnalités créées par d'autres programmeurs pour vous faire gagner du temps.
ja: 多くのプログラミング言語には、時間を節約するために他のプログラマーによって作成された豊富な機能が付属しています。
nl: Elke programmeertaal wordt geleverd met een schat aan functies die door andere programmeurs zijn geschreven om jou tijd te besparen.
pt_br: Toda linguagem de programação vem com uma grande variedade de recursos criados por outros programadores que servem para ajudar a economizar seu tempo.
ru: Каждый язык программирования поставляется со множеством полезностей созданных другими программистами, для экономии вашего времени.
ta: ஒவ்வொரு நிரலாக்க மொழியும் உங்கள் நேரத்தை மிச்சப்படுத்த மற்ற புரோகிராமர்களால் உருவாக்கப்பட்ட அம்சங்களின் செல்வத்துடன் வருகிறது.
uk: Кожна мова програмування постачається з багатьма засобами, які, для економії вашого часу, створили інші програмісти.
zh_hant: 所有程式語言都包含了許多其他程式設計師創造的功能來節省你的時間。

source: We call a bundle of code created by fellow developers a [i]library[/i].
cs: Balíč kódu vytvořený jinými vývojáři nazýváme [i]knihovnou (library)[/i] .
da: Vi kalder et bundt kode skabt af andre udviklere et [i]bibliotek[/i].
fr: Nous appelons un ensemble de code créé par d'autres développeurs une [i]bibliothèque[/i].
ja: そういった他の開発者によって作成されたコードのバンドルを[i]ライブラリ[/i]と呼びます。
nl: We noemen een bundel code gemaakt door collega-ontwikkelaars een [i]bibliotheek[/i].
pt_br: Nós chamamos esses códigos criados por outros programadores de [i]biblioteca[/i].
ru: Мы называем пакет кода, написанный другими разработчиками, [i]библиотекой[/i].
ta: தம உருவாக்குபவர்கள் ஒரு [i] நூலகத்தால் உருவாக்கப்பட்ட குறியீட்டின் மூட்டை அழைக்கிறோம் [/i].
uk: Ми називаємо пакунок коду, який написали інші розробники, [i]бібліотекою[/i].
zh_hant: 我們稱呼這些開發者創作的程式碼集合為[b]函式庫[/b]。

source: It's a bunch of code sitting there, waiting for you to use it.
cs: Je to spousta kódu, který tam sedí a čeká, až ho použijete.
da: Det er en masse kode der sidder der og venter på at du skal bruge det.
fr: C'est un tas de code qui est là prêt à être utilisé.
ja: それはあなたがそれを使うのを待っている、そこに存在する沢山のコード達です。
nl: Het is een verzameling code die klaar ligt om door jou gebruikt te worden.
pt_br: É um monte de código que estão guardados lá, esperando que você use eles.
ru: Это куча кода, ожидающего, когда вы его используете.
ta: இது ஒரு சில குறியீடு அங்கே உட்கார்ந்து, நீங்கள் அதைப் பயன்படுத்தக் காத்திருக்கிறது.
uk: Це купа коду, який очікує, коли ви його використаєте.
zh_hant: 它是一大堆現成的程式碼，等著你去用它。

source: Game engines like Godot bundle many libraries together. They provide a massive toolset to save you time when making games.
cs: Herní enginy jako Godot sdružují mnoho knihoven dohromady. Poskytují rozsáhlou sadu nástrojů, které vám při tvorbě her ušetří čas.
da: Spil motorer som Godot indeholder mange biblioteker. De giver et massivt værktøjssæt til at spare dig tid, når du laver spil.
fr: Les moteurs de jeu comme Godot regroupent de nombreuses bibliothèques. Ils fournissent un ensemble d'outils énorme pour vous faire gagner du temps lors de la création de jeux.
ja: Godotのようなゲームエンジンは多くのライブラリをバンドルしています。 それらはゲームを作成する時間を節約するための大規模なツールセットを提供します。
nl: Game engines zoals Godot zijn bundels van vele bibliotheken. Ze bieden een enorme verzameling hulpmiddelen om je tijd te besparen bij het maken van games.
pt_br: Motores de jogos (as engines) como a Godot juntam muitas bibliotecas. Elas fornecem para você um conjunto enorme de ferramentas que te ajudam a economizar tempo quando for fazer seus jogos.
ru: Игровые движки, такие как Godot, содержат в себе множество таких библиотек. Они предоставляют огромный набор инструментов, чтобы сэкономить ваше время при создании игр.
ta: கோடோட் போன்ற விளையாட்டு இயந்திரங்கள் பல நூலகங்களை ஒன்றாக இணைக்கிறது. விளையாட்டுகளை உருவாக்கும் போது உங்கள் நேரத்தை மிச்சப்படுத்த அவை ஒரு பெரிய கருவித்தொகுப்பை வழங்குகின்றன.
uk: Ігрові рушії, такі як Godot, містять багато таких бібліотек. Вони надають величезний набір засобів, щоб заощадити час у процесі створення ігор.
zh_hant: 像 Godot 這樣的遊戲引擎將許多函式庫打包在一起。它們提供了龐大的工具集，幫助你在製作遊戲時節省時間。

source: You'll always use a lot of existing code
cs: Vždy budete používat velké množství existujícího kódu
da: Du vil altid bruge en masse eksisterende kode
de: Du wirst immer schon existierenden Code verwenden
es: Siempre utilizarás una gran cantidad de código existente
fr: Vous utiliserez toujours beaucoup de code existant
it: Userai sempre molto codice pre-esistente
ja: 常に多くの既にあるコードを使用します
nl: Je zult altijd veel bestaande code gebruiken
pt_br: Você sempre vai usar muitos códigos que já estão prontos
ru: Вы всегда будете использовать больше количество существующего кода
ta: நீங்கள் எப்போதும் இருக்கும் நிறைய குறியீடுகளைப் பயன்படுத்துவீர்கள்
uk: Ви завжди будете використовувати багато готового коду
zh_hant: 你永遠會使用大量已存在的程式碼

source: When coding, you always use a lot of code from developers who came before you.
cs: Při kódování vždy používáte spoustu kódu od vývojářů, kteří přišli před vámi.
da: Når du koder, bruger du altid en masse kode fra udviklere, der kom før dig.
fr: Lorsque vous codez, vous utilisez toujours beaucoup de code des développeurs qui vous ont précédé.
ja: コーディングするときは常に他の開発者が書いた多くのコードを使用します。
nl: Tijdens het programmeren gebruik je altijd veel code van ontwikkelaars die je voorgingen.
pt_br: Quando você programa, você sempre usa um monte de código de desenvolvedores que vieram antes de você.
ru: При написании кода вы всегда используете много кода от разработчиков, которые писали код до вас.
ta: குறியீட்டு முறை, உங்களுக்கு முன் வந்த டெவலப்பர்களிடமிருந்து நீங்கள் எப்போதும் நிறைய குறியீடுகளைப் பயன்படுத்துகிறீர்கள்.
uk: Під час написання коду ви завжди використовуєте багато коду від розробників, які писали код до вас.
zh_hant: 撰寫程式時，你總是會用到許多先前程式設計師的程式碼。

source: In a moment, you'll write your first code. You'll use [i]functions[/i] created by the Godot developers.
cs: Za chvíli napíšete svůj první kód. Budete používat [i]funkce[/i] vytvořené vývojáři Godot.
da: Om et øjeblik vil du skrive din første kode. Du vil bruge [i]funktioner[/i] skabt af Godot udviklere.
fr: Dans un instant, vous allez écrire votre premier code. Vous utiliserez des [i]fonctions[/i] créées par les développeurs de Godot.
ja: 誰でもすぐに最初のコードを記述できます。 Godot開発者によって作成された[i]関数[/i]を使用します。
nl: Zometeen schrijf je je eerste code. Je zult [i]functies[/i] gebruiken die gemaakt zijn door de ontwikkelaars van Godot.
pt_br: Daqui a pouco, você vai escrever seu primeiro código. Você vai usar [i]funções[/i] criadas pelos desenvolvedores da Godot.
ru: Очень скоро вы напишите свой первый кусочек кода. При этом вы будете использовать [i]функции[/i], созданные разработчиками Godot.
ta: ஒரு கணத்தில், உங்கள் முதல் குறியீட்டை எழுதுவீர்கள். கோடோட் டெவலப்பர்களால் உருவாக்கப்பட்ட [/i] செயல்பாடுகளை நீங்கள் பயன்படுத்துவீர்கள்.
uk: Незабаром ви напишете свій перший шматочок коду. При цьому ви будете використовувати [i]функції[/i], які створили розробники Godot.
zh_hant: 不用多久，你會寫下你的第一行程式碼。你會使用 Godot 開發者們創造的[b]函式[/b]。

source: A function is a list of instructions with an exact name. We can tell the computer to execute all the instructions in sequence with that name.
cs: Funkce je seznam instrukcí s jednoznačným názvem. Můžeme říci počítači, aby provedl všechny instrukce v pořadí s tímto jménem.
da: En funktion er en liste over instruktioner med et præcist navn. Vi kan sige til computeren at den skal udføre alle instruktionerne i sekvens med det navn.
fr: Une fonction est une liste d'instructions avec un nom exact. Avec ce nom, nous pouvons dire à l'ordinateur d'exécuter toutes ces instructions en séquence.
ja: 関数とは名前を持つ命令の集まりです。 その名前を使って、関数内の命令を順番に実行するようにコンピューターに指示できます。
nl: Een functie is een lijst instructies met een exacte naam. We kunnen de computer met deze naam vertellen om alle instructies na elkaar uit te voeren.
pt_br: Uma função é uma lista de instruções com um nome exato. Nós podemos falar pro computador para executar todas as instruções em sequencia com aquele nome.
ru: Функция — это именованный список инструкций. Мы можем приказать компьютеру последовательно выполнить все инструкции содержащиеся в функции.
ta: ஒரு செயல்பாடு என்பது சரியான பெயருடன் அறிவுறுத்தல்களின் பட்டியல். எல்லா வழிமுறைகளையும் அந்த பெயருடன் வரிசையில் இயக்க கணினியிடம் சொல்லலாம்.
uk: Функція — це іменований перелік інструкцій. Ми можемо наказати комп'ютеру послідовно виконати всі інструкції, які містить функція.
zh_hant: 函式是個有著精確名字的指令列表。我們能使用那個名字來告訴電腦照順序執行所有的指令。

source: Calling functions
cs: Volání funkcí
da: Funktionskald
de: Aufrufen von Funktionen
es: Llamar a las funciones
fr: Appeler des fonctions
it: Chiamare le funzioni
ja: 関数の呼び出し
nl: Functies aanroepen
pt_br: Chamando funções
ru: Вызов функций
ta: அழைப்பு செயல்பாடுகள்
uk: Виклик функцій
zh_hant: 呼叫函式

source: When you tell the computer to execute a function, we say you [i]call[/i] the function.
cs: Když chcete po počítači, aby provedl funkci, říkáme, že [i]zavoláte [/i] funkci.
da: Når du beder computeren om at udføre en funktion, siger vi, at du [i]kalder[/i] funktionen.
fr: Lorsque vous dites à l'ordinateur d'exécuter une fonction, on dit que vous [i]appelez[/i] la fonction.
ja: コンピューターに関数を実行するように指示するときは、関数を[i]呼び出す[/i]と言います。
nl: Wanneer je de computer vertelt om een functie uit te voeren, zeggen we dat je de functie [i]aanroept[/i].
pt_br: Quando você fala pro computador para ele executar uma função, nós dizemos que você [i]chama[/i] a função.
ru: Когда вы указываете компьютеру выполнить функцию, мы говорим, что вы [i]вызываете[/i] функцию.
ta: ஒரு செயல்பாட்டை இயக்க கணினியிடம் நீங்கள் கூறும்போது, நீங்கள் [நான்] அழைக்கிறோம் [/i] செயல்பாட்டை அழைக்கிறோம்.
uk: Коли ви вказуєте комп'ютеру виконати функцію, ми кажемо, що ви [i]викликаєте[/i] функцію.
zh_hant: 當你叫電腦執行一個函式，我們會說你呼叫了函式。

source: To call a function, you write its [i]exact[/i] name followed by an open and closed parenthesis. To call the function named "show", you would write [code]show()[/code].
cs: Chcete-li volat funkci, napište její [i]přesný[/i] název následovaný otevřenou a zavřenou závorkou. Chcete-li volat funkci s názvem "show", napište [code]show()[/code].
da: For at kalde en funktion skriver du dens [i]nøjagtige[/i] navn efterfulgt af en åben og en lukket parentes. For at kalde funktionen med navnet "show", skal du skrive [code]show()[/code].
fr: Pour appeler une fonction, vous écrivez son nom [i]exact[/i] suivi d'une parenthèse ouverte et d'une parenthèse fermée. Pour appeler la fonction nommée « show » (« montrer » en anglais), vous écririez [code]show()[/code].
ja: 関数を呼び出すには、[i]正確な関数名[/i]の後に開き括弧と閉じ括弧を記述します。 "show"という名前の関数を呼び出すには、[code] show() [/code]と記述します。
nl: Om een functie aan te roepen, schrijf je de [i]exacte[/i] naam gevolgd door een openend en een sluitend haakje. Om de functie met de naam "show" aan te roepen, schrijf je [code]show()[/code].
pt_br: Para chamar uma função, você escrevo o nome [i]exato[/i] dela seguido por uma abertura e um fechamento de parêntese. Para chamar uma função chamada "show", você deve escrever [code]show()[/code].
ru: Чтобы вызвать функцию, вам нужно написать её [i]точное[/i] имя, а следом за ним поставить открывающую и закрывающую скобки. Чтобы вызвать функцию с именем «show», вы должны написать [code]show()[/code].
ta: ஒரு செயல்பாட்டை அழைக்க, நீங்கள் அதன் [i] துல்லியமான [/i] பெயரை எழுதுகிறீர்கள், அதைத் தொடர்ந்து திறந்த மற்றும் மூடிய அடைப்புக்குறிப்பு. "காட்டு" என்ற பெயரில் அழைக்க, நீங்கள் [குறியீடு] காட்டு () [/குறியீடு] ஐ எழுதுவீர்கள்.
uk: Щоб викликати функцію, потрібно написати її [i]точну[/i] назву, а після неї поставити відкриту і закриту дужки. Щоб викликати функцію з назвою «show», слід написати [code]show()[/code].
zh_hant: 要呼叫函式，你要一字不差地寫下名字並加上左右小括號。要呼叫名為「show」的函式，你會寫下 [code]show()[/code]。

source: In Godot, calling [code]show()[/code] makes something visible, like a character or item. The complementary [code]hide()[/code] function hides the entity.
cs: Voláním [code]show()[/code] v Godotovi se něco zviditelní, například postava nebo položka. Doplňková funkce [code]hide()[/code] entitu skryje.
da: I Godot gør kaldet af [code]show()[/code] noget synligt, f.eks. et tegn eller en genstand. Den komplementære [code]hide()[/code]-funktion skjuler enheden.
fr: Dans Godot, appeler [code]show()[/code] rend quelque chose visible, comme un personnage ou un objet. La fonction complémentaire [code]hide()[/code] (« cacher » en anglais) cache l'entité.
ja: Godotでは、[code] show() [/code]を呼び出すと、キャラクターやアイテムなどのエンティティが表示されます。 もう1つの[code] hide() [/code]関数はエンティティを非表示にします。
nl: In Godot maakt het aanroepen van [code]show()[/code] iets zichtbaar, zoals een personage of een voorwerp. De complementaire [code]hide()[/code] functie verbergt het juist.
pt_br: Na Godot, chamar [code]show()[/code] faz com que algo fique visível, como um personagem ou um item. Já a função [code]hide()[/code] esconde a entidade.
ru: В Godot вызов [code]show()[/code] делает что-то видимым, например персонажа или предмет. Дополнительная функция [code]hide()[/code] скрывает объект.
ta: கோடோட்டில், அழைப்பை [குறியீடு] காண்பி () [/குறியீடு] ஒரு பாத்திரம் அல்லது பொருளைப் போல ஏதாவது காணக்கூடியதாக இருக்கும். நிரப்பு [குறியீடு] மறை () [/குறியீடு] செயல்பாடு நிறுவனத்தை மறைக்கிறது.
uk: В Godot виклик [code]show()[/code] робить щось видимим, наприклад, персонажа або предмет. Додаткова функція [code]hide()[/code] приховує об'єкт.
zh_hant: 在 Godot 裡面呼叫 [code]show()[/code] 會讓東西變得可見，例如角色或物品。相對的 [code]hide()[/code] 函式則會隱藏實體。

source: Once an entity is visible, calling [code]show()[/code] again doesn't have any effect.
cs: Jakmile je entita viditelná, opětovné volání [code]show()[/code] nemá žádný účinek.
da: Når en enhed er synlig, har det ingen effekt at kalde [code]show()[/code] igen.
fr: Une fois qu'une entité est visible, appeler à nouveau [code]show()[/code] n'a aucun effet.
ja: エンティティが表示されたら、再度[code] show() [/code]呼び出しても効果はありません。
nl: Als een object eenmaal zichtbaar is, heeft het opnieuw aanroepen van [code]show()[/code] geen effect.
pt_br: Uma vez que a entidade está visível, chamar novamente [code]show()[/code] não tem mais efeito nenhum.
ru: Если объект уже видимый, вызов [code]show()[/code] не окажет никакого эффекта
ta: ஒரு நிறுவனம் தெரிந்தவுடன், [குறியீடு] காண்பி () [/குறியீடு] மீண்டும் எந்த விளைவையும் ஏற்படுத்தாது.
uk: Якщо об'єкт уже видно, виклик [code]show()[/code] не матиме ніякого ефекту.
zh_hant: 一旦實體變得可見，再度呼叫 [code]show()[/code] 不會有任何效果。

source: Similarly, once you hide something, calling [code]hide()[/code] again doesn't change anything.
cs: Podobně, jakmile něco skryjete, opětovným voláním [code]hide()[/code] se nic nezmění.
da: På samme måde ændrer det ikke noget, når du skjuler noget, at kalde [code]hide()[/code] igen.
fr: De même, une fois que vous avez caché quelque chose, appeler à nouveau [code]hide()[/code] ne change rien.
ja: 同様にエンティティを非表示にした後、再度[code] hide() [/code]呼び出しても何も変更されません。
nl: Op dezelfde manier verandert er niets als je iets verbergt en [code]hide()[/code] opnieuw aanroept.
pt_br: Da mesma forma, uma vez que você escondeu algo, chamar [code]hide()[/code] novamente não muda nada.
ru: Аналогично, если вы уже скрыли объект, повторный вызов [code]hide()[/code] ничего не поменяет.
ta: இதேபோல், நீங்கள் எதையாவது மறைத்தவுடன், [குறியீடு] மறை () [/குறியீடு] மீண்டும் எதையும் மாற்றாது.
uk: Аналогічно, якщо ви вже приховали об'єкт, повторний виклик [code]hide()[/code] нічого не змінить.
zh_hant: 同樣地，一旦你隱藏了東西，再次呼叫 [code]hide()[/code] 也不會有所改變。

source: [i]Click the Run button on any example below to execute the code listing.[/i]
cs: [i]Kliknutím na tlačítko Spustit na libovolném příkladu níže spustíte výpis kódu.[/i]
da: [i]Klik på knappen Kør i et hvilket som helst eksempel nedenfor for at kører kodelisten.[/i]
fr: [i]Cliquez sur le bouton Exécuter sur n'importe quel exemple ci-dessous pour exécuter le listing de code.[/i]
ja: [i]以下の実行ボタンをクリックして、このコードを実行します。[/i]
nl: [i]Klik op de knop Uitvoeren op een van de onderstaande voorbeelden om de code uit te voeren.[/i]
pt_br: [i]Clique no botão Executar em qualquer exemplo abaixo para executar o código listado.[/i]
ru: [i]Нажмите кнопку «Run» в любом примере ниже, чтобы выполнить листинг кода.[/i]
ta: [i] குறியீடு பட்டியலை இயக்க கீழே உள்ள எந்த எடுத்துக்காட்டில் ரன் பொத்தானைக் சொடுக்கு செய்க. [/i]
uk: [i]Натисніть кнопку «Виконати» в будь-якому прикладі нижче, щоб виконати лістинг коду.[/i]
zh_hant: [b]點擊下面任意範例中的執行按鈕來執行程式碼。[/b]

source: In the code listing above, we write the function call [code]hide()[/code] in a new function named [code]run()[/code] to execute the code. Creating a new function is necessary to execute instructions in GDScript.
cs: Ve výše uvedeném seznamu kódu zapíšeme volání funkce [code]hide()[/code] do nové funkce s názvem [code]run()[/code], aby se kód spustil. Funkce [code]run()[/code] se postará o spuštění kódu.
da: I kodelisten ovenfor skriver vi funktionskaldet [code]hide()[/code] i en ny funktion med navnet [code]run()[/code] for at kører koden. Det er nødvendigt at oprette en ny funktion for at kører instruktioner i GDScript.
de: Im obigen Code-Listing schreiben wir den Funktionsaufruf [code]hide()[/code] in eine neue Funktion namens [code]run()[/code], um den Code auszuführen. Das Erstellen einer neuen Funktion ist notwendig, um Anweisungen in GDScript auszuführen.
es: En el listado de código anterior, escribimos la llamada a la función [code]hide()[/code] en una nueva función llamada [code]run()[/code] para ejecutar el código. La creación de una nueva función es necesaria para ejecutar instrucciones en GDScript.
fr: Dans le listing de code ci-dessus, nous écrivons l'appel de fonction [code]hide()[/code] dans une nouvelle fonction nommée [code]run()[/code] pour exécuter le code. La création d'une nouvelle fonction est nécessaire pour exécuter les instructions en GDScript.
it: Nell'insieme di codice visibile sopra, chiamiamo la funzione [code]hide()[/code] in una nuova funzione chiamata [code]run()[/code] necessaria per eseguire il codice in GDScript.
ja: 上記のコードリストでは、関数コール [code]hide()[/code]を[code]run()[/code]という新しい関数に記述してコードを実行するようにしています。GDScriptで命令を実行するには、新しい関数を作成する必要があります。
nl: In de codefragment hierboven schrijven we de functieaanroep [code]hide()[/code] in een nieuwe functie met de naam [code]run()[/code] om de code uit te voeren. Het maken van een nieuwe functie is nodig om instructies uit te voeren in GDScript.
pt_br: No código listado acima, nós escrevemos a chamada de função [code]hide()[/code] em uma nova função chamada [code]run()[/code] para executar o código. A criação de uma nova função é necessária para executar instruções no GDScript.
ru: В приведённом выше листинге мы записали вызов функции [code]hide()[/code] в новую функцию с именем [code]run()[/code] для того чтоб код выполнился. Создание новой функции необходимо для выполнения инструкций в GDScript.
ta: மேலே உள்ள குறியீடு பட்டியலில், குறியீட்டை இயக்க [குறியீடு] இயங்கும் () [/குறியீடு] என்ற புதிய செயல்பாட்டில் செயல்பாட்டு அழைப்பை [குறியீடு] மறை () [/குறியீடு] எழுதுகிறோம். GDSCRIPT இல் வழிமுறைகளை இயக்க புதிய செயல்பாட்டை உருவாக்குவது தேவை.
uk: У наведеному вище лістингу, для того, щоб код було виконано, ми записали виклик функції [code]hide()[/code] у нову функцію з назвою [code]run()[/code]. Створення нової функції необхідне для виконання інструкцій у GDScript.
zh_hant: 在上面的程式碼中，我們將函式 [code]hide()[/code] 寫入了新的函式 [code]run()[/code] 來執行。在 GDScript 裡必需創造新的函式才能執行指令。

source: Can you tell me more about that "run()" function?
cs: Můžete mi říct více o funkci "run()"?
da: Kan du fortælle mig mere om funktionen "run()"?
de: Kannst du mir mehr über diese "run()" -Funktion erzählen?
es: ¿Puedes decirme más sobre esa función "run()"?
fr: Pouvez-vous m'en dire plus sur la fonction « run() » ?
it: Puoi dirmi di più sulla funzione "run()"?
ja: "run()"という関数について？
nl: Kun je me meer vertellen over die "run()" functie?
pt_br: Você pode me falar algo mais sobre aquela função "run()"?
ru: Можете рассказать мне больше о функции «run()»?
ta: அந்த "ரன் ()" செயல்பாட்டைப் பற்றி மேலும் சொல்ல முடியுமா?
uk: Чи можете мені розповісти більше про функцію «run()»?
zh_hant: 可以告訴我更多「run()」函式的事嗎？

source: In GDScript, unlike in some other languages, we must write our code inside of custom functions.
cs: V jazyce GDScript musíme na rozdíl od některých jiných jazyků psát kód uvnitř vlastních funkcí.
da: I modsætning til nogle andre sprog skal vi i GDScript skrive vores kode inde i brugerdefinerede funktioner.
fr: Dans GDScript, contrairement à d'autres langages, nous devons écrire notre code à l'intérieur de fonctions nouvelles.
ja: GDScriptは他のいくつかの言語とは異なり、カスタム関数内にコードを記述する必要があります。
nl: In GDScript, in tegenstelling tot sommige andere talen, moeten we onze code schrijven in zelfgemaakte functies.
pt_br: No GDScript, diferente de outras linguagens, nós precisamos escrever nossos códigos dentro de uma função personalizada.
ru: В GDScript, в отличие от некоторых других языков, мы обязаны помещать весь наш код внутрь функций
ta: GDSCRIPT இல், வேறு சில மொழிகளைப் போலல்லாமல், தனிப்பயன் செயல்பாடுகளுக்குள் எங்கள் குறியீட்டை எழுத வேண்டும்.
uk: В GDScript, на відміну від деяких інших мов, ми зобов'язані поміщати весь наш код усередину функцій.
zh_hant: 在 GDScript 中，不像某些其他語言，我們一定得將程式碼寫在自定義函式中。

source: You'll learn what functions are and how they work in great detail in the course, but here's a quick look at them if you're curious.
cs: Co jsou to funkce a jak fungují se podrobně dozvíte v tomto kurzu, ale pokud jste zvědaví, zde je stručný popis.
da: Du lærer, hvad funktioner er, og hvordan de fungerer, i detaljer i kurset, men her er et hurtigt kig på dem, hvis du er nysgerrig.
fr: Vous apprendrez ce que sont les fonctions et comment elles fonctionnent en détail dans le cours, mais voici un bref aperçu si vous êtes curieux ou curieuse.
ja: このコースでは関数とは何か、およびそれらがどのように機能するかを詳細に学習しますが、ここでそれらを簡単に説明します。
nl: Wat functies zijn en hoe ze werken leer je in detail in de cursus, maar hier is een vlugge blik als je nieuwsgierig bent.
pt_br: Você vai aprender o que são funções e como elas funcionam em detalhes no curso, mas aqui está um breve exemplo caso você esteja curioso.
ru: В ходе курса вы подробно узнаете, что такое функции и как они работают, но вот их краткий обзор, если вам любопытно.
ta: என்ன செயல்பாடுகள் மற்றும் அவை எவ்வாறு விரிவாக செயல்படுகின்றன என்பதை நீங்கள் கற்றுக் கொள்வீர்கள், ஆனால் நீங்கள் ஆர்வமாக இருந்தால் அவற்றை விரைவாகப் பார்ப்பது இங்கே.
uk: У ході курсу ви докладно дізнаєтеся, що таке функції і як вони працюють, але ось їх короткий огляд, якщо вам цікаво.
zh_hant: 你會在課程中學到函式是什麼、它們運作上的各種細節，但如果你好奇的話，在這邊先做簡介。
