Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-3-standing-on-shoulders-of-giants.po
Languages: cs, da, de, es, fr, it, ja, nl, pt_br, ru, ta, uk, zh_hant

source: In GDScript, unlike in some other languages, we must write our code inside of custom functions. You'll learn what functions are and how they work in great detail in the course, but here's a quick look at them if you're curious. A function is a bundle of code you can execute anytime. It's a named list of instructions. To define a function, you need to write the [code]func[/code] keyword, the function's name, parentheses, and a colon: [code]func run():[/code] defines a function named [code]run()[/code]. You then go to the next line to write the function's body. That's the instructions of the function. Notice how each instruction starts with a leading [code]Tab[/code] character. The computer uses that to know which lines are part of the function. Throughout the course, you'll see many functions called [code]run()[/code]. Those are functions we created to give you interactive examples.
de: In GDScript müssen wir im Gegensatz zu einigen anderen Sprachen unseren Code innerhalb benutzerdefinierter Funktionen schreiben. Du wirst im Kurs erfahren, was Funktionen sind und wie sie genau im Detail funktionieren, aber hier ist ein kurzer Blick auf sie, wenn Du neugierig bist. Eine Funktion ist ein Codeblock, den Du jederzeit ausführen kannst. Es ist eine benannte Liste von Anweisungen. Um eine Funktion zu definieren, musst Du das Schlüsselwort [code]func[/code], den Namen der Funktion, Klammern und einen Doppelpunkt schreiben: [code]func run():[/code] definiert eine Funktion mit dem Namen [code]run()[/code]. In der nächsten Zeile musst du den Textkörper der Funktion schreiben. Das sind die Anweisungen der Funktion. Beachte, dass jede Anweisung mit einem führenden [code]Tab[/code]-Zeichen beginnt. Der Computer verwendet dies, um zu wissen, welche Zeilen Teil der Funktion sind. Im Laufe des Kurses wirst Du viele Funktionen namens [code]run()[/code] sehen. Das sind Funktionen, die wir erstellt haben, um interaktive Beispiele zu erstellen.
es: En GDScript, a diferencia de otros lenguajes, debemos escribir nuestro código dentro de funciones personalizadas. Aprenderás lo que son las funciones y cómo funcionan con gran detalle en el curso, pero aquí tienes un vistazo rápido de ellas si tienes curiosidad. Una función es un conjunto de código que puedes ejecutar en cualquier momento. Es una lista de instrucciones con un nombre. Para definir una función, tienes que escribir la palabra clave [code]func[/code], el nombre de la función, paréntesis y dos puntos: [code]func run():[/code] define una función llamada [code]run()[/code]. Luego, pasas a la siguiente línea para escribir el cuerpo de la función. Esas son las instrucciones de la función. Observa cómo cada instrucción comienza con un carácter [code]Tab[/code] inicial. La computadora lo utiliza para saber qué líneas forman parte de la función. A lo largo del curso, verás muchas funciones llamadas [code]run()[/code]. Esas son funciones que hemos creado para darte ejemplos interactivos.
it: In GDScript, a differenza degli altri linguaggi, dobbiamo scrivere il nostro codice in funzioni personalizzate. Imparerai cosa sono e come operano le funzioni in grande dettaglio in questo corso, per ora diamo un'occhiata veloce se sei curioso. Una funzione è un insieme di codice che puoi eseguire in qualsiasi momento. Puoi vederla come una lista di istruzioni con un nome. Per definire una funzione, si usano la parola chiave [code]func[/code], il suo nome, le parentesi tonde ed infine i due punti: [code]func run():[/code] definisce una funzione chiamata [code]run()[/code]. Dopodiché si va a capo per scrivere il corpo della funzione. Ciò che scrivi al suo interno sono le istruzioni di quella funzione. Fa attenzione a come ogni istruzione comincia con il carattere [code]Tab[/code]. Il computer lo utilizza per capire quali linee sono parte della funzione. Durante questo corso, vedrai molto spesso funzioni chiamate [code]run()[/code]. Sono funzioni che abbiamo creato per darti esempi interattivi.

source: We use parentheses to call functions because you can give the function [i]arguments[/i] inside the parentheses when calling it. Here's a [i]sprite[/i] standing straight. If we call the [code]rotate(0.3)[/code] function, the character [i]sprite[/i] turns by 0.3 radians.
de: Wir verwenden Klammern, um Funktionen aufzurufen. Dies liegt daran, dass Du Funktions[i]argumente[/i] innerhalb der Klammern angeben kannst, wenn Du sie aufrufst. Hier ist ein [i]Sprite[/i] (ein Grafikobjekt, das auf dem Bildschirm dargestellt werden kann), das aufrecht steht. Wenn wir die Funktion [code]rotate(0.3)[/code] aufrufen, dreht sich das [i]Sprite[/i] um 0,3 Einheiten.
es: Usamos paréntesis para llamar a funciones porque puedes darle a la función [i]argumentos[/i] dentro de los paréntesis al llamarla. Aquí tenemos un [i]sprite[/i] que está completamente recto. Si llamamos a la función [code]rotate(0.3)[/code], el personaje [i]sprite[/i] gira 0.3 unidades.
it: Usiamo le parentesi per chiamare le funzioni, perché si possono dare alla funzione [i]argomenti[/i] all'interno delle parentesi quando la si chiama. Ecco uno [i]sprite[/i] che sta dritto. Se chiamiamo la funzione [code]rotate(0,3)[/code], il carattere [i]sprite[/i] ruota di 0,3 radianti.

source: The [code]0.3[/code] part between the parentheses is the function's [i]argument[/i]. Arguments are values (numbers, bits of text, and more) that change how the function behaves. Arguments let you fine-tune the effect of the function call. They can be optional at times, but functions often require arguments in order to work. For example, calling [code]rotate()[/code] without any argument would result in an error. Without an argument, Godot doesn't know by [i]how much[/i] you intend to rotate the [i]sprite[/i]. Don't worry about memorizing what arguments each function requires or accepts! As a programmer, the documentation will always be close by for you to refer to. Finally, notice how we use a dot in the number [code]0.3[/code] above: you need to use a dot like this to represent decimal numbers. You can't use commas as they have a different purpose in code.
de: Der [code]0.3[/code]-Teil zwischen den Klammern ist der [i]Parameter[/i] der Funktion. Parameter sind Werte (Zahlen, Text und mehr), die das Verhalten der Funktion ändern. Mit Parametern kannst Du die Wirkung des Funktionsaufrufs fein abstimmen. Sie können manchmal optional sein, aber Funktionen erfordern oft Parameter, um zu funktionieren. Wenn Du beispielsweise [code]rotate()[/code] ohne Parameter aufrufst, wird ein Fehler angezeigt. Ohne einen Parameter weiß Godot nicht, um [i]welchen Wert[/i] Du beabsichtigst, das [i]Sprite[/i] zu drehen. Mach Dir keine Sorgen darüber, welche Parameter jede Funktion benötigt oder akzeptiert! Als Programmierer kannst Du immer auf die Dokumentation zurückgreifen. Beachte schließlich, wie wir einen Punkt in der Zahl [code]0.3[/code] oben verwenden: Du musst einen Punkt wie diesen verwenden, um Dezimalzahlen darzustellen. Du kannst keine Kommas verwenden, da sie einen anderen Zweck im Code haben.
es: La parte [code]0.3[/code] entre los paréntesis es el [i]argumento[/i] de la función. Los argumentos son valores (números, bits de texto, etc.) que cambian el comportamiento de la función. Los argumentos te permiten afinar el efecto de la llamada de una función. A veces pueden ser opcionales, pero las funciones a menudo requieren argumentos para funcionar. Por ejemplo, llamar a [code]rotate()[/code] sin ningún argumento provocaría un error. Sin un argumento, Godot no sabe por [i]cuánto[i] pretendes rotar el [i]sprite[/i]. ¡No te preocupes por memorizar qué argumentos requiere o acepta cada función! Como programador, la documentación siempre estará cerca para que puedas consultarla. Por último, fíjate en que utilizamos un punto en el número [code]0.3[/code] anterior: tienes que utilizar un punto de esta forma para representar números decimales. No puedes utilizar comas, ya que tienen un propósito diferente en el código.
it: Questo [code]0.3[/code] tra parentesi è [i]l'argomento[/i] della funzione. Gli argomenti sono valori (numeri, porzioni di testo e molto altro) che cambiano il comportamento di una funzione. Gli argomenti ti permettono di regolare gli effetti della funzione chiamata. Possono essere opzionali, ma spesso le funzioni hanno bisogno di argomenti per funzionare. Per esempio, chiamando [code]rotate()[/code] senza alcun argomento, otterresti un errore. Senza un argomento, Godot non può sapere [i]di quanto[/i] vuoi ruotare lo [i]sprite[/i]. Non devi preoccuparti di memorizzare quali argomenti ogni funzione richiede o accetta! Potrai sempre fare riferimento alla documentazione. Infine, hai notato che abbiamo usato un punto per il numero [code]0.3[/code]? Il punto serve a rappresentare numeri decimali. Non usiamo la virgola in quanto prende un significato diverso nel codice.

source: The value of [code]0.3[/code] is an angle in [i]radians[/i]. In daily life, we're used to measuring angles in degrees. The radian is another scale commonly used in video games and math. You can convert radians into degrees by multiplying them by 180 and dividing them by PI: [code]degrees = radians * 180 / PI[/code] An angle of [code]PI[/code] radians corresponds to [code]180[/code] degrees. And [code]2 * PI[/code] is a full turn: [code]360[/code] degrees. [b]How do radians work exactly?[/b] Radians are a way to measure angles based on the radius of a circle. To get the angle in radians, you take the circle's radius and wrap it around the circle. That angle is [code]1[/code] radian because you are wrapping the radius [code]1[/code] time around the circle. Because the perimeter of a circle is [code]2 * PI * radius[/code], a full turn (360°) corresponds to [code]2 * PI[/code] radians: you need to wrap the radius of a circle [code]2 * PI[/code] times around the circle to make a full circle.
de: Der Wert [code]0.3[/code] ist ein Winkel in [i]Radianten[/i]. Im Alltag sind wir es gewohnt, Winkel in Grad zu messen. Der Radiant ist eine andere Maßeinheit, die häufig in Videospielen und der Mathematik verwendet wird. Du kannst Radianten in Grad umrechnen, indem du sie mit 180 multiplizierst und durch PI teilst: [code]degrees = radians * 180 / PI[/code] Ein Winkel von [code]PI[/code] Radianten entspricht [code]180[/code] Grad. Und [code]2 * PI[/code] ist eine volle Umdrehung: [code]360[/code] Grad. [b]Wie funktionieren Radianten genau?[/b] Radianten sind eine Möglichkeit, Winkel basierend auf dem Radius eines Kreises zu messen. Um den Winkel in Radianten zu erhalten, nimmst du den Radius des Kreises und wickelst ihn um den Kreis. Dieser Winkel ist [code]1[/code] Radiant, da du den Radius [code]1[/code] Mal um den Kreis wickelst. Da der Umfang eines Kreises [code]2 * PI * Radius[/code] beträgt, entspricht eine volle Umdrehung (360°) [code]2 * PI[/code] Radianten: Du musst den Radius eines Kreises [code]2 * PI[/code] Mal um den Kreis wickeln, um einen vollständigen Kreis zu machen.
es: El valor de [code]0.3[/code] es un ángulo en [i]radianes[/i]. En la vida cotidiana, estamos acostumbrados a medir los ángulos en grados. El radián es otra escala muy utilizada en los videojuegos y en las matemáticas. Puedes convertir los radianes en grados multiplicándolos por 180 y dividiéndolos por PI (π): [code]grados = radianes * 180 / PI[/code] Un ángulo de [code]PI[/code] radianes corresponde a [code]180[/code] grados. Y [code]2 * PI[/code] es una vuelta completa: [code]360[/code] grados. [b]¿Cómo funcionan exactamente los radianes?[/b] Los radianes son una forma de medir ángulos que está basada en el radio de un círculo. Para obtener el ángulo en radianes, tomas el radio del círculo y lo envuelves alrededor del círculo. Ese ángulo es [code]1[/code] radián porque estás envolviendo el radio [code]1[/code] vez alrededor del círculo. Como el perímetro de un círculo es [code]2 * PI * radio[/code], una vuelta completa (360º) corresponde a [code]2 * PI[/code] radianes: necesitas envolver el radio de un círculo [code]2 * PI[/code] veces alrededor del círculo para hacer un círculo completo.
it: Il valore [code]0.3[/code] è un angolo in [i]radianti[/i]. Nella vita di tutti i giorni, siamo abituati a misurare gli angolo in gradi. I radianti non solo altro che un altro metodo di misurazione usato comunemente nei videogiochi e in matematica. Puoi convertire i radianti in gradi moltiplicandoli per 180 e dividendoli per Pi Greco: [code]gradi = radianti * 180 / PI[/code] Un angolo di radianti [code]PI[/code] corrisponde a [code]180[/code] gradi. E [code]2 * PI[/code] corrisponde ad un giro completo: [code]360[/code] gradi. [b]Come funzionano esattamente i radianti?[/b] I radianti sono usati per misurare angoli basati sul raggio di un cerchio. Per ottenere un angolo in radianti, bisogna prendere il raggio del cerchio e distenderlo sulla circonferenza del cerchio. Questo angolo è [code]1[/code] radiante perché distendi il raggio [code]1[/code] volta attorno al cerchio. Dato che il perimetro di un cerchio equivale a [code]2 * PI * raggio[/code], un giro completo (360°) corrisponde a [code]2 * PI[/code] radianti: dovresti distendere il raggio di un cerchio [code]2 * PI[/code] volte per ottenere un cerchio completo.

source: Another example: With the [code]move_local_x()[/code] function, you can move the character to its left and right. The function takes one argument: a number of pixels to offset the entity. The complementary function [code]move_local_y()[/code] makes the character move up and down. This is one way to move a character in a game, although we'll see more powerful ways to do this later.
de: Ein weiteres Beispiel: Mit der Funktion [code]move_local_x()[/code] kannst du die Figur nach links und rechts verschieben. Die Funktion verwendet ein Argument: Die Anzahl von Pixeln, um die die Figur zu bewegt werden soll. Die ergänzende Funktion [code]move_local_y()[/code] bewirkt, dass sich der Charakter auf und ab bewegt. Dies ist eine Möglichkeit, einen Charakter in einem Spiel zu bewegen. Wir werden später auch noch mächtigere Möglichkeiten kennen lernen.
es: Otro ejemplo: Con la función [code]move_local_x()[/code], puedes mover el personaje a su izquierda y a su derecha. La función toma un argumento: un número de pixeles para desplazar la entidad. La función complementaria [code]move_local_y()[/code] hace que el [i]sprite[/i] se mueva hacia arriba y hacia abajo. Esta es una forma de mover un personaje en un juego, aunque veremos formas más potentes de hacer esto más adelante.
it: Un altro esempio: Con la funzione [code]move_local_x()[/code], è possibile spostare il carattere a sinistra e a destra. La funzione accetta un solo argomento: un numero di pixel per spostare l'entità. La funzione complementare [code]move_local_y()[/code] fa muovere il carattere verso l'alto e verso il basso. Questo è un modo per muovere un personaggio in un gioco, anche se in seguito vedremo modi più potenti per farlo.

source: With positive values ([code]20[/code]), the code above moves the robot to the right and down. This is probably different than what you studied at school: in math classes, the horizontal axis points to the right, like here, but the vertical axis points up. In video games, and generally in 2D computer graphics, the vertical axis points down instead. So whenever you move something on the Y-axis with a positive value, it'll move [i]down[/i].
de: Bei positiven Werten ([code]20[/code]) bewegt der obige Code den Roboter nach rechts und unten. Dies ist wahrscheinlich anders als das, was Du in der Schule gelernt hast: Im Mathematikunterricht zeigt die horizontale Achse nach rechts, wie hier, aber die vertikale Achse zeigt nach oben. In Videospielen und im Allgemeinen in der 2D-Computergrafik zeigt die vertikale Achse stattdessen nach unten. Wann immer Du also etwas auf der Y-Achse mit einem positiven Wert bewegst, bewegt es sich [i]runter[/i].
es: Con valores positivos ([code]20[/code]), el código anterior mueve el robot hacia la derecha y hacia abajo. Esto es probablemente diferente de lo que estudiaste en la escuela: en las clases de matemáticas, el eje horizontal apunta hacia la derecha, como aquí, pero el eje vertical apunta hacia arriba. En los videojuegos, y en general en los gráficos por computadora en 2D, el eje vertical apunta hacia abajo. Así que cuando muevas algo en el eje Y con un valor positivo, se moverá hacia [i]abajo[/i].
it: Con valori positivi ([code]20[/code]), il codice qui sopra muove il robot a destra poi in basso. Questo probabilmente è diverso da ciò che hai imparato a scuola: in matematica l'asse orizzontale punta a destra, come in questo esempio, e l'asse verticale punta in alto. Nei videogiochi, e generalmente quando si tratta di computer grafica in 2D, l'asse verticale punta verso il basso. Quindi ogni volta che muovi qualcosa sull'asse Y con un valore positivo, questo si muoverà verso il [i]basso[/i].

source: To call a function, you need to write its exact name followed by an opening and a closing parenthesis. If the function requires one or more [i]arguments[/i], you add them inside the parentheses. Whether you need to do that or not depends on the function.
de: Um eine Funktion aufzurufen, musst Du ihren genauen Namen gefolgt von einer öffnenden und einer schließenden Klammer schreiben. Wenn die Funktion einen oder mehrere [i]Parameter[/i] erfordert, füge diese in den Klammern hinzu. Ob Du das tun musst oder nicht, hängt von der Funktion ab.
es: Para llamar a una función, tienes que escribir su nombre exacto seguido de un paréntesis de apertura y otro de cierre. Si la función requiere uno o más [i]argumentos[/i], los añades dentro de los paréntesis. Tener que hacer esto o no depende de la función.
it: Per chiamare una funzione, devi scrivere il suo nome esatto seguito da parentesi tonde aperte e chiuse. Se la funzione ha bisogno di uno o più [i]argomenti[/i], devi inserirli all'interno delle parentesi. L'inserimento o meno di argomenti dipende interamente dalla funzione.

source: Our robot character's invisible! Call the [code]show()[/code] function to make it appear. Please call [code]show()[/code] inside the [code]run()[/code] function, on line [code]2[/code], and keep the [code]Tab[/code] character at the start of the line. The computer needs that to understand your code.
de: Unser Robotercharakter ist unsichtbar! Rufe die Funktion [code]show()[/code] auf, damit er angezeigt wird. Bitte rufe [code]show()[/code] innerhalb der Funktion [code]run()[/code] in der Zeile [code]2[/code] auf und behalte das [code]Tab[/code]-Zeichen am Anfang der Zeile bei. Der Computer benötigt das, um deinen Code zu verstehen.
es: ¡Nuestro personaje robot es invisible! Llama a la función [code]show()[/code] para que aparezca. Llama a [code]show()[/code] dentro de la función [code]run()[/code], en la línea [code]2[/code], y mantén el carácter [code]Tab[/code] al comienzo de la línea. La computadora lo necesita para entender tu código.
it: Il nostro robot è invisibile! Chiama la funzione [code]show()[/code] per farlo apparire. Chiama la funzione [code]show()[/code] all'interno della funzione [code]run()[/code], alla linea [code]2[/code] e ricordati di usare [code]Tab[/code] all'inizio della riga. Serve per far capire al computer il tuo codice.

source: The robot was turned by [code]-0.5[/code] radians. You need to make it upright by calling the [code]rotate()[/code] function. Please call [code]rotate()[/code] inside the [code]run()[/code] function, on line [code]2[/code], and keep the [code]Tab[/code] character at the start of the line. The computer needs that to understand your code.
de: Der Roboter wurde durch [code]-0.5[/code] Bogenmaß gedreht. Du musst ihn aufrecht stellen, indem du die Funktion [code]rotate()[/code] aufrufst. Bitte rufe [code]rotate()[/code] innerhalb der Funktion [code]run()[/code] in der Online-Funktion [code]2[/code] auf und behalte das [code]Tab[/code]-Zeichen am Anfang der Zeile bei. Der Computer benötigt das, um Ihren Code zu verstehen.
es: El robot se ha girado en [code]-0.5[/code] radianes. Tienes que ponerlo en posición vertical llamando a la función [code]rotate()[/code]. Llama a [code]rotate()[/code] dentro de la función [code]run()[/code], en la línea [code]2[/code], y mantén el carácter [code]Tab[/code] al comienzo de la línea. La computadora lo necesita para entender tu código.
it: Il robot è stato ruotato di [code]-0.5[/code] radianti. Prova a metterlo in posizione dritta chiamando la funzione [code]rotate()[/code]. Chiama la funzione [code]rotate()[/code] all'interno della funzione [code]run()[/code] alla linea [code]2[/code], e ricordati di utilizzare [code]Tab[/code] all'inizio della linea. Serve al computer per comprendere il tuo codice.

source: It calls the function named "show."
es: Llama a la función llamada "show".
it: Chiama la funzione chiamata "show".
