Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-28-specifying-types.po
Languages: cs, da, de, ru, ta, uk, zh_hant

source: There's an incredible third benefit for you: by using type hints, you will learn types much faster. It's excellent for learning.
da: Der er en utrolig tredje fordel for dig: Ved at bruge typehints lærer du typer meget hurtigere. Det er fremragende til læring.
de: Es gibt noch einen unglaublichen dritten Vorteil für Dich: Durch die Verwendung von Typ-Hinweisen lernst Du Typen viel schneller. Das ist hervorragend zum Lernen.
ru: Ещё одно мощное дополнительное преимущество: осмысленное использование типов позволит вам освоить их гораздо быстрее. Это великолепно для обучения.
ta: உங்களுக்கு நம்பமுடியாத மூன்றாவது நன்மை இருக்கிறது: வகை குறிப்புகளைப் பயன்படுத்துவதன் மூலம், நீங்கள் வகைகளை மிக வேகமாகக் கற்றுக்கொள்வீர்கள். இது கற்றலுக்கு சிறந்தது.
uk: Для вас є неймовірна третя перевага: використовуючи підказки щодо типів, ви вивчатимете типи набагато швидше. Це чудово для навчання.

source: In the following practices, you will write the correct type hints to make the code error-free.
da: I de følgende øvelser skal du skrive de korrekte typehints for at gøre koden fejlfri.
de: In den folgenden Übungen wirst Du die richtigen Typ-Hinweise einfügen, um den Code fehlerfrei zu machen.
ru: В следующих упражнениях вы будете обозначать правильные типы для уменьшения количества ошибок в коде.
ta: பின்வரும் நடைமுறைகளில், குறியீட்டை பிழையில்லாமல் செய்ய சரியான வகை குறிப்புகளை எழுதுவீர்கள்.
uk: У наступних вправах ви будете писати правильні підказки щодо типу, щоб зробити код без помилок.

source: Add the correct type hints to variables
cs: Přidání správných typových nápověd k proměnným
da: Tilføj de korrekte typehints til variabler
de: Füge den Variablen die richtigen Typ-Hinweise hinzu
ru: Строгая типизация переменных
ta: மாறிகள் சரியான வகை குறிப்புகளைச் சேர்க்கவும்
uk: Додайте підказки правильного типу до змінних
zh_hant: 向變數增加正確的型別提示

source: Our variables get the correct values but not the right hints. Using your type-fu, add the correct type names in the variable definitions.
da: Vores variabler får de korrekte værdier, men ikke de korrekte hints. Brug din type-fu til at tilføje de korrekte typenavne i variabeldefinitionerne.
de: Unsere Variablen erhalten die richtigen Werte, aber nicht die richtigen Typ-Hinweise. Füge die richtigen Typnamen in den Variablendefinitionen hinzu.
ru: Наши переменные получают правильные значения, но имеют неправильные типы. Используйте ваши знания и добавьте правильные имена типов в определения переменных.
ta: எங்கள் மாறிகள் சரியான மதிப்புகளைப் பெறுகின்றன, ஆனால் சரியான குறிப்புகள் அல்ல. உங்கள் வகை-FU ஐப் பயன்படுத்தி, மாறி வரையறைகளில் சரியான வகை பெயர்களைச் சேர்க்கவும்.
uk: Наші змінні отримують правильні значення, але не правильні підказки. Використовуючи type-fu, додайте правильні назви типів у визначеннях змінних.

source: You need to write the type name between the colon and the equal sign.
da: Du skal skrive typenavnet mellem kolon og lighedstegnet.
de: Du musst den Typnamen zwischen den Doppelpunkt und das Gleichheitszeichen schreiben.
ru: Вам нужно написать имя типа между двоеточием и знаком равенства.
ta: பெருங்குடலுக்கும் சம அடையாளத்திற்கும் இடையில் நீங்கள் வகை பெயரை எழுத வேண்டும்.
uk: Назву типу потрібно писати між двокрапкою та знаком рівності.

source: Note: You cannot use type inference in this practice. You need to write the type name in full.
da: Bemærk: Du kan ikke bruge typeinferens i denne øvelse. Du skal skrive typenavnet fuldt ud.
de: Hinweis: Ziel dieser Übung ist es, die richtigen Typen herauszufinden. Deshalb musst du hier die Typen explizit angeben und kannst keine Typ-Inferenz verwenden.
ru: Замечание: использовать механизм вывода типов в этом упражнении нельзя. Вы должны написать имена типов целиком.
ta: குறிப்பு: இந்த நடைமுறையில் நீங்கள் வகை அனுமானத்தைப் பயன்படுத்த முடியாது. நீங்கள் வகை பெயரை முழுமையாக எழுத வேண்டும்.
uk: Примітка. Ви не можете використовувати висновок типу в цій практиці. Назву типу потрібно писати повністю.

source: Our variables have the wrong type hints, causing errors. Correct them to make the code run.
cs: Naše proměnné mají nesprávné nápovědy typu, což způsobuje chyby. Opravte je, aby se kód spustil.
da: Vores variabler har forkerte typehints, hvilket forårsager fejl. Ret dem for at få koden til at køre.
de: Unsere Variablen haben die falschen Typhinweise, was zu Fehlern führt. Korrigiere sie, damit der Code ausgeführt wird.
ru: Наши переменные имеют неправильные типы, что приводит к ошибкам. Исправьте их, чтобы починить код.
ta: எங்கள் மாறிகள் தவறான வகை குறிப்புகளைக் கொண்டுள்ளன, இதனால் பிழைகள் உள்ளன. குறியீட்டை இயக்க அவற்றை சரிசெய்யவும்.
uk: Наші змінні мають підказки неправильного типу, що спричиняє помилки. Виправте їх, щоб код запустився.
zh_hant: 我們的變數有錯誤的型別提示，造成錯誤。請修正它們來讓程式碼正常執行。

source: Fix the values to match the type hints
cs: Opravte hodnoty tak, aby odpovídaly nápovědám typu
da: Ret værdierne, så de matcher typehintsene
de: Korrigiere die Werte, so dass sie den Typ-Hinweisen entsprechen
ru: Исправьте значения
ta: வகை குறிப்புகளுடன் பொருந்தக்கூடிய மதிப்புகளை சரிசெய்யவும்
uk: Виправте значення відповідно до підказок типу
zh_hant: 修正變數的值，使其與型別提示相符

source: It is the other way around in this practice: the type hints are fine, but the values are not.
da: Det er omvendt i denne praksis: typehints er fine, men værdierne er ikke.
de: Bei dieser Übung ist es umgekehrt: Die Typ-Hinweise sind in Ordnung, die Werte jedoch nicht.
ru: В коде этого упражнения типы переменных обозначены правильно, а вот их значения — неверны.
ta: இந்த நடைமுறையில் இது வேறு வழி: வகை குறிப்புகள் நன்றாக உள்ளன, ஆனால் மதிப்புகள் இல்லை.
uk: У цій практиці все навпаки: підказки типів у порядку, але значення ні.

source: Your task is to fix the values after the equal sign, so they match the type hint of each variable.
da: Din opgave er at rette værdierne efter lighedstegnet, så de matcher typehintet for hver variabel.
de: Deine Aufgabe besteht darin, die Werte nach dem Gleichheitszeichen so zu korrigieren, dass sie mit dem Typ-Hinweis der Variablen übereinstimmen.
ru: Ваша задача — заменить значения после знаков равенства на значения правильных типов.
ta: சம அடையாளத்திற்குப் பிறகு மதிப்புகளை சரிசெய்வதே உங்கள் பணி, எனவே அவை ஒவ்வொரு மாறியின் வகை குறிப்பையும் பொருத்துகின்றன.
uk: Ваше завдання — виправити значення після знака рівності, щоб вони відповідали підказці типу кожної змінної.

source: This time, it's the other way around: variables have the correct type hints but the wrong values. Change the values to make the code run.
cs: Tentokrát je to naopak: proměnné mají správné typové nápovědy, ale špatné hodnoty. Změňte hodnoty, aby se kód spustil.
da: Denne gang er det omvendt: variabler har de korrekte typehints, men de forkerte værdier. Skift værdierne for at få koden til at køre.
de: Diesmal ist es umgekehrt: Variablen haben die richtigen Typhinweise, aber die falschen Werte. Änder die Werte, damit der Code ausgeführt wird.
ru: В этот раз типы переменных обозначены корректно, но их значения — ошибочны. Исправьте их, чтобы починить код.
ta: இந்த நேரத்தில், இது வேறு வழி: மாறிகள் சரியான வகை குறிப்புகளைக் கொண்டுள்ளன, ஆனால் தவறான மதிப்புகள். குறியீட்டை இயக்க மதிப்புகளை மாற்றவும்.
uk: Цього разу все навпаки: змінні мають правильні підказки типу, але неправильні значення. Змініть значення, щоб запустити код.
zh_hant: 這次是相反的：變數有正確的型別提示，但值不正確。請修改值讓程式碼能正常執行。

source: Specifying types with type hints
cs: Zadávání typů pomocí typových nápověd (deklarací)
da: Angivelse af typer med typehints
de: Typen mit Typ-Hinweisen spezifizieren
ru: Обозначение типов
ta: வகை குறிப்புகளுடன் வகைகளைக் குறிப்பிடுகிறது
uk: Визначення типів за допомогою підказок типів
zh_hant: 用型別提示指定類型

source: By default, GDScript is what we call a dynamically-typed language. That means that you can just write variables, assign them a value with a number, and assign them another value with a different type. Unlike in some other languages, in GDScript, the following code is valid.
cs: Ve výchozím nastavení je GDScript tzv. dynamicky typovaný jazyk (dynamically-typed language). To znamená, že stačí zapsat proměnné, přiřadit jim hodnotu s číslem a v jiné části kódu jim prostě přiřadit jinou hodnotu s jiným typem. Na rozdíl od některých jiných jazyků si GDScript s následujícím kódem poradí.
zh_hant: 預設情況下，GDScript 是一種動態型別語言。這表示你可以直接宣告變數，先賦予它一個數值，然後再賦予它另一個不同型別的值也可以。 與其他一些語言不同，在 GDScript 中以下程式碼是合法的。

source: Games use grids all the time, be it for grid-based gameplay or to make algorithms faster. When working with grids, you need to convert grid coordinates into positions in the game world all the time. To do so, you give each cell a size in pixels. You'll likely pick one of two types for that: [code]float[/code] or [code]Vector2[/code], because pixel positions on the screen use [code]Vector2[/code] coordinates. Either of those two values would be fine:
zh_hant: 遊戲經常使用網格，無論是用於基於網格的遊戲玩法，還是為了讓演算法運行得更快。 在處理網格時，你需要經常將網格座標轉換為遊戲世界中的位置。為了達到這個目標，你需要為每個網格指定一個以像素為單位的大小。 你通常會選擇以下兩種類型之一來表示這個大小：[code]float[/code] 或 [code]Vector2[/code]，因為螢幕上的像素座標使用 [code]Vector2[/code] 來表示。 這兩種數值類型都是可行的選擇：

source: In this example, because both [code]cell[/code] and [code]cell_size[/code] are [code]Vector2[/code] values, we can add them. However, if [code]cell_size[/code] is a [code]float[/code], we will get a type error.
cs: Protože v tomto příkladu jsou obě hodnoty [code]cell[/code] a [code]cell_size[/code] [code]Vector2[/code], můžeme je sečíst. Pokud však [code]cell_size[/code] je [code]float[/code], dostaneme typovou chybu.
zh_hant: 在這個例子中，因為 [code]cell[/code] 和 [code]cell_size[/code] 都是 [code]Vector2[/code] 值，所以我們可以將它們相加。 然而如果 [code]cell_size[/code] 是 [code]float[/code]，則會產生型別錯誤。

source: Worse: due to dynamic typing, we won't get an error [i]right away[/i]. We will only get the error when calling [code]grid_to_world(Vector2(1, 1))[/code]. And that's a big problem.
cs: Horší je, že díky dynamickým typům se nám chyba [i] hned tak neobjeví[/i]. Chybu dostaneme až při volání [code]grid_to_world(Vector2(1, 1))[/code]. A to je problém.
zh_hant: 更糟糕的是：由於動態型別的關係，我們不會[b]立即[/b]收到錯誤訊息。只有在呼叫 [code]grid_to_world(Vector2(1, 1))[/code] 時才會出錯。 這是一個大問題。

source: Because we're learning, we only have small code examples in this course. But your games' code will get long and split into many files. When coding, you often forget about the code you wrote several weeks ago. And with a lot of code, it could take [i]hours[/i] of play before players trigger a type error in your code.
cs: Protože se učíme, máme v tomto kurzu jen malé příklady kódu. Ale kód vašich her bude dlouhý a rozdělený do mnoha souborů. Při kódování často zapomínáte na kód, který jste napsali před několika týdny. A se spoustou kódu může trvat [i]hodiny[/i] hraní, než hráči narazí na chybu typu hodnoty ve vašem kódu.
zh_hant: 因為我們還在學習，所以本課程中的範例程式碼都很簡短。但在製作遊戲時，程式碼會變得很長，並拆分成多個檔案。在開發過程中，你常常會忘記幾週前寫過的程式碼。 而當程式碼變多時，可能需要[b]數小時[/b]的遊玩時間，玩家才會觸發程式碼中的型別錯誤。

source: Fortunately, GDScript has optional [i]type hints[/i]. Type hints let the computer know the value type you want for variables and report errors before running the code. To specify the type a variable can accept, you can write a colon and a type after the name when defining a new variable.
cs: Naštěstí má GDScript volitelné [i]nápovědy (deklarace) typu[/i]. Typové nápovědy umožňují počítači zjistit, jaký typ hodnoty chcete u proměnných nastavit, a před spuštěním kódu hlásí chyby. Chcete-li určit typ, který může proměnná přijmout, můžete při definování nové proměnné za její název napsat dvojtečku a typ.
zh_hant: 幸運的是 GDScript 提供了可選的[b]型別提醒(type hints)[/b]。 型別提醒可讓電腦知道變數應該接受的值類型，並在執行程式碼之前回報錯誤。 要指定變數可以接受的型別，可以在在定義新變數時，變數名稱後加上冒號和型別。

source: GDScript comes with a feature called [i]type inference[/i]. In many cases, but not all, the computer can figure out the type of a variable for you. To do so, you write [code]:=[/code], without the type. The computer will set the type using the value after the equal sign. We could make [code]cell_size[/code] a variable of type [code]Vector2[/code] like so:
cs: GDScript obsahuje funkci nazvanou [i]odvozování typu[/i]. V mnoha případech, ale ne ve všech, může počítač zjistit typ proměnné za vás. Za tímto účelem napíšete [code] : =[/code], bez uvedení typu. Počítač nastaví typ pomocí hodnoty za znaménkem rovnosti. Mohli bychom vytvořit z [code]cell_size[/code] proměnnou typu [code]Vector2[/code] takto:
zh_hant: GDScript 有一個叫做[b]型別推斷(type inference)[/b]的功能。在許多情況下，但不是所有情況，電腦可以幫你推斷出變數的型別。 為了讓電腦推斷型別，你只需要寫 [code]:=[/code]，並且不用寫型別。電腦會根據等號後的值來設定型別。我們可以這樣讓 [code]cell_size[/code] 變數的型別是 [code]Vector2[/code]，像下面這樣：

source: When you give the language hints like that, it will [i]prevent[/i] major type errors. When you work in Godot, you will see that the computer can report issues as you write the code. It makes the benefit even greater. Type hints can also help improve the readability of your code. It can help to put more information directly in the code. As we saw, types are essential when coding, and when using type hints, the computer will add them to the engine's built-in code documentation system. There's an incredible third benefit for you: by using type hints, you will learn types much faster. It's excellent for learning. In the following practices, you will write the correct type hints to make the code error-free.
cs: Když dáte jazyku takovéto nápovědy, zabrání to [i]závažným typovým chybám[/i]. Při práci v Godotu uvidíte, že počítač může hlásit problémy v průběhu psaní kódu. Díky tomu je přínos ještě větší. Typové nápovědy mohou také pomoci zlepšit čitelnost vašeho kódu. Může pomoci umístit více informací přímo do kódu. Jak jsme viděli, typy jsou při kódování nezbytné a při použití typových nápověd je počítač přidá do vestavěného systému dokumentace kódu. A třetí výhoda: používáním typových nápověd se naučíte typy mnohem rychleji. V následujících postupech budete psát správné typové nápovědy, aby byl kód bez chyb.
zh_hant: 當你給語言提供這樣的提示時，它將[b]防止[/b]重大的型別錯誤。在使用 Godot 時，你會發現電腦能夠在你寫程式碼時即時報告問題，這樣的好處會變得更大。 型別提示還有助於提高程式碼的可讀性。它可以幫助你將更多的資訊直接放在程式碼中。如我們所見，型別在編程中非常重要，而使用型別提示時，電腦會將它們添加到引擎內建的程式碼文件系統中。 還有一個驚人的第三個好處：通過使用型別提示，你會更快學會型別。對學習來說，這是非常有幫助的。 在接下來的練習中，你將寫出正確的型別提示來讓程式碼遠離錯誤。

source: Our variables get the correct values but not the right hints. Using your type-fu, add the correct type names in the variable definitions. You need to write the type name between the colon and the equal sign. Note: You cannot use type inference in this practice. You need to write the type name in full.
cs: Naše proměnné dostávají správné hodnoty, ale ne správné nápovědy (deklarace) typů. Pomocí typové funkce doplňte do definic proměnných správné názvy typů. Název typu musíte napsat mezi dvojtečku a znaménko rovnosti. Poznámka: V tomto cvičení nelze použít typovou inferenci (automatické odvození typu). Název typu musíte napsat celý.
zh_hant: 我們的變數獲得了正確的值，但沒有正確的型別提示。運用你的型別技巧，在變數定義中添加正確的型別名稱。 你需要將型別名稱寫在冒號和等號之間。 注意：在這個練習中，你不能使用型別推斷。你需要將型別名稱寫完整。

source: It is the other way around in this practice: the type hints are fine, but the values are not. Your task is to fix the values after the equal sign, so they match the type hint of each variable.
cs: V tomto cvičení je to naopak: typové nápovědy jsou v pořádku, ale hodnoty nikoli. Vaším úkolem je opravit hodnoty za znaménkem rovnosti tak, aby odpovídaly typovým nápovědám jednotlivých proměnných.
zh_hant: 在這個練習中，型別提示是正確的，但變數的值不對。 你的任務是修正等號後的變數值，使它們與每個變數的型別提示相符。
