Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-27-value-types.po
Languages: cs, da, de, es, fr, it, ja, nl, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: We need to know the number of items as an [code]int[/code], but the computer reads the player's input as a [code]String[/code].
cs: Potřebujeme znát počet položek jako [code]int[/code], ale počítač čte vstup hráče jako [code]String[/code].
da: Vi skal kende antallet af varer som en [code]int[/code], men computeren læser spillerens input som en [code]String[/code].
de: Wir müssen die Anzahl der Elemente als [code]int[/code] kennen, aber der Computer liest die Eingabe des Players als [code]String[/code].
ru: Нам нужно знать число предметов в виде [code]int[/code], но компьютер считывает пользовательский ввод, как [code]String[/code].
ta: உருப்படிகளின் எண்ணிக்கையை ஒரு [குறியீடு] எண்ணாக [/குறியீடு] என்று நாம் அறிந்து கொள்ள வேண்டும், ஆனால் கணினி பிளேயரின் உள்ளீட்டை [குறியீடு] சரம் [/குறியீடு] எனப் படிக்கிறது.
tr: Öğelerin sayısını [code]int[/code] olarak bilmemiz gerekir, ancak bilgisayar oyuncunun girişini [code]dize[/code] olarak okur.
uk: Нам потрібно знати кількість елементів у вигляді [code]int[/code], але комп’ютер читає введені гравцем дані як [code]String[/code].

source: Your task is to convert the player's input into numbers for the shop's code to work.
cs: Vaším úkolem je převést vstup hráče na čísla, aby kód obchodu fungoval.
da: Din opgave er at konvertere spillerens input til tal, for at butikkens kode kan fungere.
de: Deine Aufgabe ist es, die Eingabe des Spielers in Zahlen umzuwandeln, damit der Code des Shops funktioniert.
ru: Ваша задача — преобразовать пользовательский ввод в числа, для того, чтобы код магазина мог работать правильно.
ta: உங்கள் பணி, பிளேயரின் உள்ளீட்டை கடையின் குறியீடு வேலை செய்வதற்கான எண்களாக மாற்றுவதாகும்.
tr: Göreviniz, oyuncunun girdisini, mağaza kodunun çalışması için sayılara dönüştürmektir.
uk: Ваше завдання — перетворити введені гравцем цифри, щоб код магазину працював.

source: Using the [code]int()[/code] function, convert the player's input into a whole number and store the result in the [code]item_count[/code] variable.
cs: Pomocí funkce [code]int()[/code] převeďte vstup přehrávače na celé číslo a výsledek uložte do proměnné [code]item_count[/code].
da: Ved hjælp af funktionen [code]int()[/code] skal du konvertere spillerens input til et helt tal og gemme resultatet i variablen [code]item_count[/code].
de: Konvertiere mit der Funktion [code]int()[/code] die Eingabe des Players in eine ganze Zahl und speicher das Ergebnis in der Variablen [code]item_count[/code].
ru: При помощи функции [code]int()[/code], преобразуйте пользовательский ввод в целое число и сохраните результат в переменной [code]item_count[/code].
tr: [code]int()[/code] fonksiyonunu kullanarak, oyuncunun girişini bir tam sayıya dönüştürün ve sonucu [code]item_count[/code] değişkeninde saklayın.
uk: Використовуючи функцію [code]int()[/code], перетворите введене гравцем у ціле число та збережіть результат у змінній [code]item_count[/code].

source: We want the player to choose the number of items they buy or sell in our game's shops. But right now, all we get are type errors.
cs: Chceme, aby si hráč vybral počet položek, které kupuje nebo prodává v našich herních obchodech. Ale právě teď dostáváme pouze chyby typu.
da: Vi vil have, at spilleren kan vælge antallet af varer, de køber eller sælger i spillets butikker. Men lige nu er alt, hvad vi får, type fejl.
de: Wir möchten, dass der Spieler die Anzahl der Gegenstände auswählt, die er in den Geschäften unseres Spiels kauft oder verkauft. Aber im Moment bekommen wir nur Typefehler.
es: Queremos que el jugador elija el número de objetos que compra o vende en las tiendas de nuestro juego. Pero en este momento, todo lo que obtenemos son errores de tipo.
fr: Nous voulons que le joueur puisse choisir le nombre d'articles qu'il achète ou vend dans les boutiques de notre jeu. Mais pour l'instant, nous n'obtenons que des erreurs de type.
it: Vogliamo far scegliere al giocatore la quantità di oggetti da comprare o vendere nel negozio. Ma adesso, l'unica cosa che otteniamo sono errori di tipo.
ja: 私たちは、プレイヤーがゲームのショップで購入または販売するアイテムの数を選択できるようにしたいと考えています。しかし、今のところ、私たちが得るのは型エラーだけです。
nl: We willen dat de speler het aantal artikelen kan kiezen dat hij koopt of verkoopt in de winkels van ons spel. Maar op dit moment krijgen we alleen typefoutmeldingen.
pt_br: Queremos que o jogador escolha a quantidade de itens que compra ou vende nas lojas do nosso jogo. Mas agora, tudo o que temos são erros de tipo.
ru: Мы хотим позволить игроку выбирать количество предметов для продажи или покупки в нашем игровом магазине. Но сейчас это приводит к ошибкам типов.
ta: எங்கள் விளையாட்டின் கடைகளில் வீரர் அவர்கள் வாங்கும் அல்லது விற்கும் பொருட்களின் எண்ணிக்கையைத் தேர்வு செய்ய வேண்டும் என்று நாங்கள் விரும்புகிறோம். ஆனால் இப்போது, நமக்கு கிடைப்பது வகை பிழைகள்.
tr: Oyuncunun, oyunumuzun mağazalarında satın aldığı veya sattığı eşya sayısını seçmesini istiyoruz. Ancak şu anda aldığımız tek şey değer tipi hataları.
uk: Ми хочемо, щоб гравець вибирав кількість предметів, які він купує або продає в магазинах нашої гри. Але зараз ми отримуємо лише помилки типу.
zh_hans: 我们想让玩家决定他们在游戏商店中购买或出售的物品的数量。但是现在，我们有的只是类型错误。
zh_hant: 我們希望玩家在遊戲的商店中選擇想要購買或販賣的物品數量。但是現在我們遇到了型別錯誤(type errors)。

source: Value types
cs: Typy hodnot
da: Værdityper
de: Typen der Werte
es: Tipos de valores
fr: Types de valeurs
it: Tipi di valori
ja: 値の型
nl: Waardentypes
pt_br: Tipos de valor
ru: Типы значений
ta: மதிப்பு வகைகள்
tr: Değer Tipleri
uk: Типи значень
zh_hans: 值类型
zh_hant: 值的類型

source: In your code, values have a particular [i]type[/i]. You have already learned about several: whole numbers, decimal numbers, strings, 2D vectors, arrays, and dictionaries. The computer uses the type of a value to know which operations and functions you can use with them. As a result, it's essential to understand types: they are not fully compatible with one another, and misusing them will cause errors.
es: En tu código, los valores tienen un [i]tipo[/i] determinado. Ya has conocido varios: números enteros, números decimales, cadenas, vectores 2D, matrices (arrays) y diccionarios. La computadora utiliza el tipo de un valor para saber qué operaciones y funciones puedes utilizar con ellos. Por ello, es esencial entender los tipos: no son totalmente compatibles entre sí y su uso incorrecto provocará errores.
fr: Dans votre code, les valeurs ont un [i]type[/i] particulier. Vous en avez déjà appris plusieurs : les nombres entiers, les nombres décimaux, les chaînes de caractères, les vecteurs 2D, les tableaux et les dictionnaires. L'ordinateur utilise le type d'une valeur pour savoir quelles opérations et fonctions vous pouvez utiliser avec elle. Par conséquent, il est essentiel de comprendre les types : ils ne sont pas entièrement compatibles les uns avec les autres et leur mauvaise utilisation entraînera des erreurs.
it: Nel tuo codice, i valori hanno un particolare [i]tipo[/i]. Ne hai già imparati vari: numeri interi, numeri decimali, stringhe, vettori 2D, array e dizionari. Il computer usa i tipi di valore per sapere quali operazioni e funzioni puoi usare su di essi. Per questo, è dunque necessario capire i tipi di valore: spesso non sono compatibili l'un l'altro e usarli male può causare errori.
ja: コードでは、値には特定の[i]型[/i]があります。整数、10進数、文字列、2Dベクトル、配列、辞書など、いくつかのものについてはすでに学習しました。 コンピューターは、値の型を使用して、使用できる操作と関数を認識します。 そのため、型は互いに完全に互換性があるわけではなく、誤用するとエラーの原因となります。
nl: In je code hebben waarden een bepaald [i]type[/i]. Je hebt er al verschillende leren kennen: gehele getallen, kommagetallen, strings, 2D vectoren, arrays en dictionaries. De computer gebruikt het type van een waarde om te weten welke bewerkingen en functies je ermee kunt gebruiken. Daarom is het essentieel om types te begrijpen: ze zijn niet volledig compatibel met elkaar en verkeerd gebruik zal fouten veroorzaken.
pt_br: Em seu código, os valores têm um [i]tipo[/i] específico. Você já aprendeu sobre vários tipos: números inteiros, números decimais, strings, vetores 2D, arrays e dicionários. O computador usa o tipo de um valor para saber quais operações e quais funções você pode usar com eles. Logo, é essencial que você entenda os tipos: eles não são totalmente compatíveis uns com os outros, e o uso indevido deles causará erros.
zh_hans: 在你的代码中，不同的值是有特定的[i]类型[/i]的。 其实你已经见过了这几种：整数、小数、字符串、二维向量、数组还有字典。 计算机用值类型才能分清楚，可以对这些值使用哪些操作和函数。 因此，了解值类型至关重要：它们彼此不完全兼容，滥用乱用会导致错误。
zh_hant: 在你的程式碼中，值有特定的[b]類型[/b]。你已經學過幾種：整數、浮點數、字串、2D 向量、陣列、和字典。 電腦會根據值的類型來決定可以對它們執行哪些操作和函式。 因此理解類型至關重要：它們之間並非完全相容，不當地使用會導致程式錯誤。

source: However, to display it on the player's screen, the computer wants text: it needs a value of type [code]String[/code]. You can concatenate two strings with the [code]+[/code] operator.
es: Sin embargo, para mostrarlo en la pantalla del jugador, la computadora quiere texto: necesita un valor de tipo [code]String[/code]. Puedes concatenar dos cadenas con el operador [code]+[/code].
fr: Cependant, pour l'afficher sur l'écran du joueur, l'ordinateur veut du texte : il a besoin d'une valeur de type [code]String[/code]. Vous pouvez concaténer deux chaînes de caractères avec l'opérateur [code]+[/code].
it: Tuttavia, per mostrarlo sullo schermo del giocatore, il computer vuole del testo: necessita un valore di tipo [code]String[/code]. Puoi concatenare due stringhe con l'operatore [code]+[/code].
ja: しかし、プレイヤーの画面に表示するには、コンピュータはテキストを必要とします。[code]String[/code] 型の値が必要です。 2 つの文字列は [code]+[/code] 演算子で連結できます。
nl: Maar om het weer te geven op het scherm van de speler, wil de computer tekst: hij heeft een waarde nodig van het type [code]String[/code]. Je kunt twee strings aan elkaar rijgen met de [code]+[/code] operator.
pt_br: No entanto, para exibir a vida na tela do jogador, o computador precisa de texto: ele precisa de um valor do tipo [code]String[/code]. Você pode concatenar duas strings com o operador [code]+[/code].
zh_hans: 但是呢，为了在玩家的屏幕上显示它，计算机需要的是字符文本：它需要一个[code]String[/code]（字符串）类型的值。 你可以用 [code]+[/code] 运算符连接两个字符串。
zh_hant: 然而為了在玩家的螢幕上顯示，電腦需要文字，也就是 [code]String[/code] 類型的值。 你可以使用 [code]+[/code] 運算子來連接兩個字串。

source: It tells you can't add values of type [code]String[/code] and [code]int[/code]: they're incompatible. In that case, you need to convert the [code]health[/code] number into a [code]String[/code].
es: Te dice que no puedes sumar valores de tipo [code]String[/code] e [code]int[/code] entre sí: son incompatibles. En ese caso, tienes que convertir el número de [code]health[/code] en una [code]String[/code].
zh_hant: 它告訴你不能將 [code]String[/code] 和 [code]int[/code] 類型的值相加：因為它們是不相容的。 在這種情況下，你需要將 [code]health[/code] 數值轉換成 [code]String[/code]。

source: You can get the text representation of a value by calling the [code]str()[/code] function (short for "string"). The function returns its argument as a new [code]String[/code]. You can use this function whenever you want to turn some number or vector into text.
es: Puedes obtener la representación textual de un valor llamando a la función [code]str()[/code] (abreviatura del término en inglés [i]string[/i], en español "cadena"). La función devuelve su argumento como una nueva [code]String[/code]. Puedes utilizar esta función siempre que quieras convertir algún número o vector en texto.
fr: Vous pouvez obtenir la représentation textuelle d'une valeur en appelant la fonction [code]str()[/code] (abréviation du terme en anglais [i]string[/i], en français « chaîne de caractères »). La fonction renvoie son argument sous la forme d'une nouvelle [code]String[/code]. Vous pouvez utiliser cette fonction chaque fois que vous souhaitez transformer un nombre ou un vecteur en texte.
it: Puoi ottenere la rappresentazione a testo di un valore chiamando la funzione [code]str()[/code] (abbreviazione di stringa). La funzione ritorna il suo argomento come una nuova [code]String[/code]. Puoi usare questa funzione quando vuoi trasformare un numero o un vettore in testo.
ja: [code]str()[/code] 関数 ("string" の略) を呼び出すことで、値のテキスト表現を取得できます。この関数は、引数を新しい [code]String[/code] として返します。 この関数は、数値またはベクトルをテキストに変換したいときにいつでも使用できます。
nl: Je kunt de tekstrepresentatie van een waarde krijgen door de functie [code]str()[/code] (afkorting voor "string") aan te roepen. De functie geeft haar argument terug als een nieuwe [code]String[/code]. Je kunt deze functie gebruiken wanneer je een getal of vector in tekst om wilt zetten.
pt_br: Você pode obter a representação de texto de um valor chamando a função [code]str()[/code] (abreviação de "string"). A função retorna seu argumento como um novo [code]String[/code]. Você pode usar esta função sempre que quiser transformar algum número ou vetor em texto.
zh_hans: 可以通过调用 [code]str()[/code] 函数（“String”的缩写）来获取其他类型的值的文本形式。 该函数将其参数转成一个新的 [code]String[/code] 返回。 每当你想把某个数字或向量转换为文本时，都可以使用此功能。
zh_hant: 你可以透過呼叫 [code]str()[/code] 函式（string 的縮寫）來獲取數值的文字表示形式。此函式會將其引數轉換為新的 [code]String[/code]。 當你想將數字或向量轉換為文字時，都可以使用這個函式。

source: You can also convert strings into whole numbers or decimal numbers using respectively the [code]int()[/code] and [code]float()[/code] functions. Those functions can convert what the player writes in a text field into a number. For example, the number of potions to sell at once in a shop.
es: También puedes convertir cadenas en números enteros o números decimales utilizando respectivamente las funciones [code]int()[/code] y [code]float()[/code]. Estas funciones pueden convertir lo que el jugador escribe en un campo de texto en un número. Por ejemplo, el número de pociones que quiere vender el jugador a la vez en una tienda.
fr: Vous pouvez également convertir des chaînes de caractères en nombres entiers ou en nombres décimaux en utilisant respectivement les fonctions [code]int()[/code] et [code]float()[/code]. Ces fonctions peuvent convertir ce que le joueur écrit dans un champ de texte en un nombre. Par exemple, le nombre de potions que le joueur veut vendre en une seule fois dans une boutique.
it: Puoi pure convertire stringhe in numeri interi o numeri decimali usando rispettivamente le funzioni [code]int()[/code] e [code]float()[/code]. Queste funzioni possono convertire ciò che il giocatore scrive in una casella di testo in un numero. Per esempio, il numero di pozioni da vendere tutte insieme in un negozio.
ja: [code]int()[/code] 関数と [code]float()[/code] 関数をそれぞれ使用して、文字列を整数または 10 進数に変換することもできます。 これらの関数は、プレーヤーがテキストフィールドに書き込んだものを数値に変換できます。たとえば、ショップで一度に販売するポーションの数。
nl: Je kunt ook strings omzetten in gehele getallen of kommagetallen met respectievelijk de functies [code]int()[/code] en [code]float()[/code]. Deze functies kunnen wat de speler in een tekstveld schrijft omzetten in een getal. Bijvoorbeeld het aantal drankjes dat je in één keer kunt verkopen in een winkel.
pt_br: Você também pode converter strings em números inteiros ou números decimais usando, respectivamente, as funções [code]int()[/code] e [code]float()[/code]. Essas funções podem converter o que o jogador escreve em um campo de texto em número. Por exemplo, o número de poções para vender de uma vez em uma loja.
zh_hans: 你还可以分别使用 [code]int()[/code]或[code]float()[/code]函数将字符串转换为整数或小数。 这些函数可以将玩家在文本字段中写入的内容转换为数字。 例如，玩家在商店中一次性出售的药水数量。
zh_hant: 你也可以使用 [code]int()[/code] 和 [code]float()[/code] 函式，分別將字串轉換為整數或小數。 這些函式可以將玩家在文字欄位輸入的內容轉換為數字，例如在商店中一次要賣出的藥水數量。

source: Most types are incompatible. For example, you can't directly add or multiply an array with a number. However, some types are [i]partially[/i] compatible. For example, you can multiply or divide a vector by a number.
es: La mayoría de los tipos son incompatibles. Por ejemplo, no puedes sumar o multiplicar directamente una matriz con un número. Sin embargo, algunos tipos son [i]parcialmente[/i] compatibles. Por ejemplo, puedes multiplicar o dividir un vector por un número.
fr: La plupart des types sont incompatibles. Par exemple, vous ne pouvez pas additionner ou multiplier directement un tableau avec un nombre. Cependant, certains types sont [i]partiellement[/i] compatibles. Par exemple, vous pouvez multiplier ou diviser un vecteur par un nombre.
it: La maggior parte dei tipi sono incompatibili. Per esempio, non puoi direttamente aggiungere o moltiplicare un array con un numero. Tuttavia, alcuni tipi sono [i]parzialmente[/i] compatibili. Per esempio, puoi moltiplicare o dividere un vettore per un numero.
ja: ほとんどの型は互換性がありません。たとえば、配列に数値を直接加算または乗算することはできません。 ただし、一部の型は[i]部分的[/i]に互換性があります。たとえば、ベクトルに数値を乗算または除算できます。
nl: De meeste types zijn niet compatibel. Je kunt bijvoorbeeld een array niet direct optellen bij of vermenigvuldigen met een getal. Sommige types zijn echter [i]gedeeltelijk[/i] compatibel. Je kunt bijvoorbeeld een vector vermenigvuldigen met of delen door een getal.
pt_br: A maioria dos tipos são incompatíveis. Por exemplo, você não pode adicionar ou multiplicar diretamente um array por um número. No entanto, alguns tipos são [i]parcialmente[/i] compatíveis. Por exemplo, você pode multiplicar ou dividir um vetor por um número.
zh_hans: 大多数值类型互不兼容。 例如，不能直接将数组与数字相加或相乘。 但是，某些值类型能[i]部分[/i]兼容。例如，你可以将向量乘以或除以一个数字。
zh_hant: 大多數類型彼此不相容。例如你無法直接將陣列與數字相加或相乘。 然而某些類型是[b]部分[/b]相容的。例如，你可以將向量乘以或除以一個數字。

source: It is possible because other developers defined that operation for you under the hood. However, you cannot directly add or subtract a number to a vector. You'll get an error. That's why, in earlier lessons, you had to access the sub-variables of [code]position[/code] to add numbers to them.
es: Esto es posible porque otros desarrolladores definieron esa operación por ti tras bambalinas. Sin embargo, no puedes sumar o restar directamente un número a un vector. Obtendrás un error. Es por eso que, en lecciones anteriores, tenías que acceder a las subvariables de [code]position[/code] para sumarles números.
fr: C'est possible parce que d'autres développeurs ont défini cette opération pour vous sous le capot. Cependant, vous ne pouvez pas ajouter ou soustraire directement un nombre à un vecteur. Vous obtiendrez une erreur. C'est pourquoi, dans les leçons précédentes, vous deviez accéder aux sous-variables de [code]position[/code] pour leur ajouter des nombres.
it: Questo è possibile perchè altri sviluppatori hanno definito quell'operazione per te sotto sotto. Tuttavia, non puoi direttamente aggiungere o sottrarre un numero ad un vettore. Otterrai un errore. Questo è il motivo per cui, in delle lezioni precedenti, hai dovuto accedere alle sotto-variabili della [code]position[/code] per aggiungere numeri ad essa.
ja: これは、他の開発者が内部でその操作を定義しているから可能です。 ただし、ベクトルに数値を直接加算または減算することはできません。エラーが表示されます。そのため、以前のレッスンでは、[code]position[/code]のサブ変数にアクセスして数値を追加する必要がありました。
nl: Dit is mogelijk omdat andere ontwikkelaars deze bewerking onder de motorkap voor je hebben gedefinieerd. Je kunt echter niet direct een getal toevoegen aan of aftrekken van een vector. Je zou een foutenmelding krijgen. Daarom moest je in eerdere lessen de deelvariabelen van [code]position[/code] gebruiken om er getallen bij op te tellen.
pt_br: É possível porque outros desenvolvedores definiram essa operação para você antes. No entanto, você não pode adicionar ou subtrair diretamente um número em um vetor. Você receberá um erro. É por isso que, nas lições anteriores, você tinha que acessar as sub-variáveis de [code]position[/code] para adicionar números a elas.
zh_hans: 这是可行的，因为其他开发人员已经在后台帮你定义了这种操作。 但是，不能直接让向量和数字加减。会报错。 这就是为什么在前面的课程中，你必须访问 [code]position[/code] 的子变量x和y来分别为它们加上数字。
zh_hant: 這是可能的，因為其他開發者已經在背後為你定義了這些操作。 然而，你不能直接將數字與向量相加或相減。這樣會導致錯誤。這就是為什麼在之前的課程中，你需要訪問 [code]position[/code] 的子變數來對它們進行加法操作的原因。

source: Well, for the computer, the result of [code]3/2[/code] is [code]1[/code]. Wait, what?! That's because, for the computer, the division of two whole numbers should always result in a whole number. When you divide decimal numbers instead, you will get a decimal number as a result.
es: Pues bien, para la computadora, el resultado de [code]3/2[/code] es [code]1[/code]. Espera, ¿qué? Eso es porque, para la computadora, la división de dos números enteros debe dar siempre como resultado un número entero. En cambio, cuando divides números decimales, obtendrás como resultado un número decimal.
fr: Eh bien, pour l'ordinateur, le résultat de [code]3/2[/code] est [code]1[/code]. Attendez, quoi ?! C'est parce que, pour l'ordinateur, la division de deux nombres entiers doit toujours donner un nombre entier. Lorsque vous divisez des nombres décimaux à la place, vous obtiendrez un nombre décimal comme résultat.
it: Beh, per il computer, il risultato di [code]3/2[/code] è [code]1[/code]. Aspetta, cosa? Questo è perché, per il computer, la divisione di due numeri interi dovrebbe sempre essere un numero intero. Quando dividi numeri decimali invece, otterrai un numero decimale come risultato.
ja: さて、コンピューターの場合、[code]3/2[/code] の結果は [code]1[/code] になります。 待って、何?! それは、コンピューターにとって、2 つの整数を除算すると常に整数が得られるはずだからです。 代わりに 10 進数を除算すると、結果として 10 進数が得られます。
nl: Voor de computer is het resultaat van [code]3/2[/code] echter [code]1[/code]. Wacht, wat?! Dat komt doordat, voor de computer, de deling van twee gehele getallen altijd een geheel getal moet opleveren. Als je in plaats daarvan kommagetallen deelt, krijg je een kommagetal als resultaat.
pt_br: Bem, para o computador, o resultado de [code]3/2[/code] é [code]1[/code]. Espera aí, o que?! Isso porque, para o computador, a divisão de dois números inteiros deve sempre resultar em um número inteiro. Ao dividir números decimais, você vai obter um número decimal como resultado.
zh_hans: 嘿嘿（意味深长），对于计算机来说，[code]3/2[/code] 的结果是 [code]1[/code]。 啊，啊？！ 那是因为，对于计算机来说，两个整数相除结果只应该是一个整数。 将小数相除的话，结果才会是一个小数。
zh_hant: 揭曉答案，對電腦來說，[code]3/2[/code] 的結果是 [code]1[/code]。 等等，怎麼會這樣？！ 這是因為對電腦來說，兩個整數相除的時候，出來的結果也應該要是整數。 當你用小數進行除法時，最後的結果才會是小數。
