Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-16-2d-vectors.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: Suppose we want to increase the size of the robot when it levels up.
cs: Předpokládejme, že chceme zvětšit velikost robota, když se dostane na vyšší úroveň.
da: Antag, vi ønsker at øge størrelsen af robotten, når det stiger i level.
de: Angenommen, wir möchten die Größe des Roboters erhöhen, wenn er im Level aufsteigt.
es: Supongamos que queremos aumentar el tamaño del robot cuando sube de nivel.
fr: Supposons que nous voulions augmenter la taille du robot lorsqu'il monte de niveau.
ja: ロボットがレベルアップしたときにサイズを大きくしたいとします。
pt: Vamos supor que queremos aumentar o tamanho do robô quando ele sobe de nível.
tr: Robotun seviyesi yükseldiğinde, boyutunun artmasını istediğimizi varsayalım.
uk: Припустімо, ми хочемо збільшити розмір робота, коли він підвищиться.

source: As you may recall, we do this by using the following code.
cs: Jak si možná vzpomínáte, uděláme to pomocí následujícího kódu.
da: Som du måske husker, gør vi dette ved at bruge følgende kode.
de: Du erinnerst dich vielleicht, dass wir dies tun, indem wir den folgenden Code verwenden.
es: Como recordarás, hacemos esto con el siguiente código.
fr: Comme vous vous en souviendrez, nous le faisons en utilisant le code suivant.
ja: 覚えているかもしれませんが、これは次のコードを使用して行います。
pt: Podemos fazê-lo através do código a seguir.
tr: Hatırlarsanız, bunu aşağıdaki kodu kullanarak yapıyoruz.
uk: Як ви пам'ятаєте, ми робимо це за допомогою наступного коду.

source: As we talked about in lesson 7, the [code]scale[/code] variable has two sub-variables to it: [code]x[/code] and [code]y[/code].
cs: Jak jsme si řekli v lekci 7, proměnná [code]scale[/code] má dvě dílčí proměnné: [code]x[/code] a [code]y[/code].
da: Som vi talte om i lektion 7, har variablen [code]scale[/code] to undervariabler: [code]x[/code] og [code]y[/code].
de: Wie wir in Lektion 7 besprochen haben, hat die [code]scale[/code] Variable zwei Untervariablen: [code]x[/code] und [code]y[/code].
es: Como hablamos en la lección 7, la variable de escala ([code]scale[/code]) tiene dos subvariables: [code]x[/code] y [code]y[/code].
fr: Comme nous en avons parlé dans la leçon 7, la variable [code]scale[/code] a deux sous-variables : [code]x[/code] et [code]y[/code].
ja: レッスン 7 で説明したように、[code]scale[/code] 変数には [code]x[/code] と [code]y[/code] の 2 つのサブ変数があります。
pt: Como dissemos na lição 7, a variável [code]scale[/code] tem duas sub-variáveis: [code]x[/code] e [code]y[/code].
tr: 7. derste bahsetmiştik, ölçekleme değişkeninin, [code]scale[/code], iki alt değişkeni var: [code]x[/code] ve [code]y[/code].
uk: Як ми говорили в уроці 7, змінна [code]scale[/code] має дві підзмінні: [code]x[/code] і [code]y[/code].

source: This is because [code]scale[/code] is a [code]Vector2[/code], which stands for two-dimensional vector. A [code]Vector2[/code] represents 2D coordinates.
cs: Je to proto, že [code]scale[/code] je [code]Vector2[/code], což znamená dvourozměrný vektor. A [code]Vector2[/code] představuje 2D souřadnice.
da: Dette skyldes, at [code]scale[/code] er en [code]Vector2[/code], som står for todimensionel vektor. En [code]Vector2[/code] repræsenterer 2D-koordinater.
de: Dies liegt daran, dass [code]scale[/code] ein [code]Vector2[/code] ist, was ein zweidimensionaler Vektor ist. Ein [code]Vector2[/code] stellt 2D-Koordinaten dar.
es: Esto se debe a que [code]scale[/code] es un [code]Vector2[/code], lo cual significa "vector bidimensional". Un [code]Vector2[/code] representa coordenadas 2D.
fr: Cela est dû au fait que [code]scale[/code] est un [code]Vector2[/code], ce qui signifie « vecteur bidimensionnel ». Un [code]Vector2[/code] représente des coordonnées 2D.
ja: これは、[code]scale[/code] が 2 次元ベクトルを表す [code]Vector2[/code] であるためです。[code]Vector2[/code] は 2D 座標を表します。
pt: Isso ocorre porque [code]scale[/code] é um [code]Vector2[/code], que significa vetor bidimensional. Um [code]Vector2[/code] representa coordenadas em 2D.
tr: Bunun nedeni, [code]scale[/code]'in iki-boyutlu vektör anlamına gelen bir [code]Vector2[/code] nesnesi olmasıdır. Bir [code]Vector2[/code] 2B koordinatları temsil eder. (2B:2-Boyut, İngilizcesi 2D:2-Dimension).
uk: Це тому, що [code]scale[/code] є [code]Vector2[/code], що означає двовимірний вектор. [code]Вектор2[/code] представляє двовимірні координати.

source: What are vectors?
cs: Co jsou to vektory?
da: Hvad er vektorer?
de: Was sind Vektoren?
es: ¿Qué son los vectores?
fr: Que sont les vecteurs ?
it: Cosa sono i vettori?
ja: ベクトルとは何ですか?
nl: Wat zijn vectoren?
pt: O que são vetores?
pt_br: O que são vetores?
ru: Что такое векторы?
ta: திசையன்கள் என்றால் என்ன?
tr: Vektörler neyin nesidir?
uk: Що таке вектори?
zh_hans: 什么是向量？
zh_hant: 什麼是向量？

source: A vector, in physics, is a quantity with a magnitude and a direction. For example, a force applied to some object, the velocity (speed and direction) of a character, and so on.
cs: Vektor je ve fyzice veličina, která má velikost a směr. Například síla působící na nějaký objekt, pohyb (rychlost a směr) postavy atd.
da: En vektor, i fysik, er en mængde med en størrelse og en retning. For eksempel, en kraft der påvirker et objekt, hastigheden (hastighed og retning) af en figur, og så videre.
de: Ein Vektor ist in der Physik eine Größe mit einer Länge und einer Richtung. Zum Beispiel eine Kraft, die auf ein Objekt angewendet wird, die Geschwindigkeit (Schnelligkeit und Richtung) eines Charakters und so weiter.
es: Un vector, en física, es una cantidad con una magnitud y una dirección. Por ejemplo, una fuerza aplicada a un objeto, la velocidad (rapidez y dirección) de un personaje, etc.
fr: Un vecteur, en physique, est une quantité avec une magnitude et une direction. Par exemple, une force appliquée à un objet, la vélocité (vitesse et direction) d'un personnage, etc.
ja: 物理学におけるベクトルは、大きさと方向を持つ量です。たとえば、あるオブジェクトに加えられた力、キャラクタの速度(速度と方向)などです。
pt: Um vetor, em física, é uma quantidade com uma magnitude (tamanho) e uma direção. Por exemplo, um vetor pode representar uma força aplicada a algum objeto, a velocidade (quantidade de deslocamento do objeto e a direção) de um personagem e assim por diante.
tr: Fizikte, bir vektör, bir büyüklüğü ve bir yönü olan bir niceliktir. Örneğin, bir nesneye uygulanan bir kuvvet, bir karakterin hızı (sürati ve yönü), ve benzeri.
uk: Вектор у фізиці — це величина з величиною та напрямком. Наприклад, сила, прикладена до якогось об’єкта, (швидкість і напрямок) персонажа тощо.

source: We often represent this quantity with an arrow.
cs: Tuto veličinu často znázorňujeme šipkou.
da: Vi repræsenterer ofte denne mængde med en pil.
de: Wir stellen Vektoren oft mit einem Pfeil dar.
es: A menudo lo representamos con una flecha.
fr: On représente souvent cette quantité par une flèche.
ja: 多くの場合、この数量を矢印で表します。
pt: Muitas vezes representamos essa quantidade com uma seta.
tr: Böyle bir niceliği, genellikle bir ok ile temsil ederiz.
uk: Ми часто представляємо цю величину стрілкою.

source: In Godot, 2D vectors are a common value type named [code]Vector2[/code],
cs: V Godotu jsou 2D vektory běžným typem hodnoty s názvem [code]Vector2[/code],
da: I Godot, 2D vektorer er en normal værdi type kaldet [code]Vector2[/code],
de: In Godot sind 2D-Vektoren ein allgemeiner Werttyp mit dem Namen [code]Vector2[/code],
es: En Godot, los vectores 2D son un tipo de valor común llamado [code]Vector2[/code],
fr: Dans Godot, les vecteurs 2D sont un type de valeur commun appelé [code]Vector2[/code],
ja: Godotでは、2Dベクトルは[code]Vector2[/code]という名前の一般的な値型です。
pt: Na Godot, vetores 2D são um tipo de valor comum chamado [code]Vector2[/code],
tr: Godot'da, 2B vektörler [code]Vector2[/code] adlı yaygın bir değer tipidir.
uk: У Godot двовимірні вектори є загальним типом значень під назвою [code]Вектор2[/code],

source: Unlike plain numbers, they store [i]two[/i] decimal numbers: one for the X coordinate and one for the Y coordinate.
cs: Na rozdíl od obyčejných čísel uchovávají [i]dvě[/i] desetinná čísla: jedno pro souřadnici X a druhé pro souřadnici Y.
da: I modsætning til almindeligt tal gemmer de [i]to[/i] decimaltal: et til X-koordinatet og et til Y-koordinatet.
de: Im Gegensatz zu einfachen Zahlen speichern sie [i]zwei[/i] Dezimalzahlen: eine für die X-Koordinate und eine für die Y-Koordinate.
es: A diferencia de los números simples, almacenan [i]dos[/i] números decimales: uno para la coordenada X y otro para la coordenada Y.
fr: Contrairement aux nombres simples, ils stockent [i]deux[/i] nombres décimaux : un pour la coordonnée X et un pour la coordonnée Y.
ja: プレーンな数値とは異なり、X 座標と Y 座標の [i]2 つ[/i]の 10 進数を格納します。
pt: Ao contrário de números simples, os vetores armazenam [i]dois[/i] números decimais: um para a coordenada X e outro para a coordenada Y.
tr: Düz sayıların aksine, içlerinde [i]iki[/i] ondalık sayı depolarlar: biri X eksenindeki değeri ve diğeri Y eksenindeki değeri için.
uk: На відміну від простих чисел, вони зберігають [i]два[/i] десяткових числа: одне для координати X і одне для координати Y.

source: So far, you've come across two variables in the course which are vectors. Which are they?
cs: Zatím jste se v kurzu setkali se dvěma veličinami, které jsou vektory. Které to jsou?
da: Indtil videre er du stødt på to variabler i kurset, som er vektorer. Hvilke er de?
de: Bisher bist du im Verlauf auf zwei Variablen gestoßen, die Vektoren sind, welche sind das?
es: Hasta ahora, te has encontrado con dos variables en el curso que son vectores. ¿Cuáles son?
fr: Jusqu'à présent, vous avez rencontré deux variables dans le cours qui sont des vecteurs. Lesquelles sont-elles ?
it: Finora, hai incontrato due variabili che sono vettori. Quali sono?
ja: ここまでで、コースでベクトルである2つの変数に出くわしました。それらはどれですか?
nl: Tot nu toe ben je in de cursus twee variabelen tegengekomen die vectoren zijn. Welke zijn dat?
pt: Até agora, deparou-se com duas variáveis no curso que são vetores. Quais são?
pt_br: Até agora, você se deparou com duas variáveis no curso que são vetores. Quais são elas?
ru: На протяжении курса вы уже сталкивались с некоторыми переменными. Какие из них являются векторами?
ta: இதுவரை, நீங்கள் திசையன்களாக இருக்கும் இரண்டு மாறிகள். அவர்கள் யார்?
tr: Şimdiye kadar, kurs sırasında birer vektör olan iki değişkenle karşılaştınız. Bunlar hangileriydi?
uk: Поки що в курсі ви зустріли дві змінні, які є векторами. які вони?
zh_hans: 到目前为止，你在课程中已经遇到过两种是向量的变量。是什么呢？
zh_hant: 到目前為止，你在這門課程中遇過兩個向量變數。是哪些呢？

source: Both [code]scale[/code] and [code]position[/code] have [code]x[/code] and [code]y[/code] sub-variables, so Godot uses a [code]Vector2[/code] to store their values.
cs: Jak [code]měřítko[/code], tak [code]pozice[/code] mají dílčí proměnné [code]x[/code] a [code]y[/code], takže Godot používá [code]Vector2[/code] k uložení jejich hodnoty.
da: Både [code]scale[/code] og [code]position[/code] har [code]x[/code] og [code]y[/code] undervariabler, så Godot bruger en [code]Vector2[/code] til at gemme deres værdier.
de: Sowohl [code]scale[/code] als auch [code]position[/code] haben [code]x[/code] und [code]y[/code] Untervariablen, daher verwendet Godot einen [code]Vector2[/code], um ihre Werte zu speichern.
es: Tanto [code]scale[/code] como [code]position[/code] tienen subvariables [code]x[/code] y [code]y[/code], por lo que Godot utiliza un [code]Vector2[/code] para almacenar sus valores.
fr: Les variables [code]scale[/code] et [code]position[/code] ont des sous-variables [code]x[/code] et [code]y[/code], donc Godot utilise un [code]Vector2[/code] pour stocker leurs valeurs.
it: Sia [code]scale[/code] ché [code]position[/code] posseggono delle sotto-variabili [code]x[/code] e [code]y[/code], quindi Godot usa un [code]Vector2[/code] per conservare i suoi valori.
ja: [code]scale[/code]と[code]position[/code]の両方に[code]x[/code]と[code]y[/code]サブ変数があるため、Godotは[code]Vector2[/code]を使用して値を格納します。
nl: Zowel [code]scale[/code] als [code]position[/code] hebben deelvariabelen [code]x[/code] en [code]y[/code], dus Godot gebruikt een [code]Vector2[/code] om deze waarden op te slaan.
pt: Tanto [code]scale[/code] quanto [code]position[/code] têm sub-variáveis [code]x[/code] e [code]y[/code], por isso a Godot usa um [code]Vector2[/code] para armazenar os valores deles.
pt_br: Tanto [code]scale[/code] quanto [code]position[/code] têm sub-variáveis [code]x[/code] e [code]y[/code], então a Godot usa um [code]Vector2[/code] para armazenar seus valores.
ru: И [code]scale[/code], и [code]position[/code] имеют вложенные переменные [code]x[/code] и [code]y[/code], поэтому Godot использует [code]Vector2[/code] для хранения их значений.
ta: [குறியீடு] அளவு [/குறியீடு] மற்றும் [குறியீடு] நிலை [/குறியீடு] இரண்டும் [குறியீடு] ஃச் [/குறியீடு] மற்றும் [குறியீடு] ஒய் [/குறியீடு] துணை மாறிகள் உள்ளன, எனவே கோடோட் ஒரு [குறியீடு] திசையன் 2 ஐப் பயன்படுத்துகிறார் [/ குறியீடு] அவற்றின் மதிப்புகளை சேமிக்க.
tr: Hem [code]scale[/code] (ölçek) hem de [code]position[/code] (konum), [code]x[/code] ve [code]y[/code] alt değişkenlerine sahiptir, bu nedenle Godot, bunların değerlerini depolamak için bir [code]Vector2[/code] kullanır.
uk: [code]scale[/code] і [code]position[/code] мають підзмінні [code]x[/code] і [code]y[/code], тому Годо використовує [code]Vector2[/code] для збереження їхніх значень.
zh_hans: [code]scale[/code] 和 [code]position[/code] 都有子变量 [code]x[/code] 和 [code]y[/code] ，所以 Godot 用 [code]Vector2[/code] 来存储它们的值。
zh_hant: [code]scale[/code] 和 [code]position[/code] 都包含 [code]x[/code] 和 [code]y[/code] 子變數，因此 Godot 使用 [code]Vector2[/code] 來儲存它們的數值。

source: scale
cs: měřítko
de: Skalierung
es: [code]scale[/code] (escala)
fr: scale (échelle)
ja: 大きさ
ta: அளவு
tr: scale (ölçek)
uk: масштаб
zh_hans: scale（缩放）
zh_hant: 縮放（scale）

source: position
cs: pozice
es: [code]position[/code] (posición)
ja: 位置
ta: நிலை
tr: position (konum)
uk: положення
zh_hans: position（位置）
zh_hant: 位置（position）

source: health
de: Leben
es: [code]health[/code] (salud)
fr: health (santé)
ja: 体力
ta: உடல்நலம்
tr: health (sağlık)
uk: здоров'я
zh_hans: health（生命值/血量）
zh_hant: 血量（health）

source: speed
cs: rychlost
de: Schnelligkeit
es: [code]speed[/code] (rapidez)
fr: speed (vitesse)
ja: スピード
ta: வேகம்
tr: speed (hız)
uk: швидкість
zh_hans: speed （速率/速度大小）
zh_hant: 速率（speed）

source: Vectors are great for games
cs: Vektory jsou pro hry skvělé
da: Vektorer er gode til spil
de: Vektoren eignen sich hervorragend für Spiele
es: Los vectores son geniales para los juegos
fr: Les vecteurs sont parfaits pour les jeux
it: I vettori sono ottimi per i giochi
ja: ベクターはゲームに最適です
nl: Vectoren zijn ideaal voor games
pt: Vetores são ótimos para jogos
pt_br: Vetores são ótimos para jogos
ru: Векторы отлично подходят для игр
ta: விளையாட்டுகளுக்கு திசையன்கள் சிறந்தவை
tr: Vektörler oyunlar için harikadır
uk: Вектори чудово підходять для ігор
zh_hans: 矢量非常适合用在游戏里
zh_hant: 向量很適合用在遊戲

source: Vectors are [i]essential[/i] in video games.
cs: Vektory jsou [i]ve videohrách nezbytné[/i].
da: Vektorer er [i]essentielle[/i] i videospil.
de: Vektoren sind [i]essentiell[/i] in Videospielen.
es: Los vectores son [i]esenciales[/i] en los videojuegos.
fr: Les vecteurs sont [i]essentiels[/i] dans les jeux vidéo.
ja: ベクターはビデオゲームに[i]不可欠[/i]です。
pt: Vetores são [i]essenciais[/i] em jogos.
tr: Vektörler video oyunları için [i]gerekli[/i]'dir.
uk: Вектори [i]необхідні[/i] у відеоіграх.

source: They allow you to represent a character's movement speed and direction, calculate the distance to a target, and more, with little code.
cs: Umožňují znázornit rychlost a směr pohybu postavy, vypočítat vzdálenost k cíli a mnoho dalšího s malým množstvím kódu.
da: De giver dig mulighed for at repræsentere en figurs bevægelseshastighed og -retning, beregne afstanden til et mål og mere med minimal kode.
de: Sie ermöglichen es, die Bewegungsgeschwindigkeit und -richtung eines Charakters darzustellen, die Entfernung zu einem Ziel zu berechnen und vieles mehr mit wenig Code.
es: Te permiten representar la rapidez y la dirección del movimiento de un personaje, calcular la distancia a un objetivo y mucho más, con poco código.
fr: Ils vous permettent de représenter la vitesse et la direction du mouvement d'un personnage, de calculer la distance par rapport à une cible, et bien plus encore, avec peu de code.
ja: キャラクターの移動速度と方向を表現したり、ターゲットまでの距離を計算したりすることができます。
pt: Eles permitem que represente a velocidade e direção do movimento de um personagem, calcule a distância até um alvo e muito mais, com pouca programação.
tr: Bir karakterin hareket hızını ve yönünü temsil etmenize, bir hedefe olan mesafesini hesaplamanıza, ve daha fazlasını çok az kodla yapmanıza olanak tanır.
uk: Вони дозволяють представити швидкість і напрямок руху персонажа, обчислити відстань до цілі тощо за допомогою невеликого коду.

source: Take this turtle AI below. You've probably seen games where enemies move like this.
cs: Vezměte si například tuto želví umělou inteligenci níže. Pravděpodobně jste už viděli hry, kde se nepřátelé pohybují takto.
da: Tag skildpadde-AI'en nedenfor. Du har sikkert set spil, hvor fjender bevæger sig sådan her.
de: Schau Dir diese Schildkröte AI unten an. Du hast wahrscheinlich Spiele gesehen, in denen sich Feinde so bewegen.
es: Por ejemplo, la IA de esta tortuga. Seguro que has visto juegos en los que los enemigos se mueven así.
fr: Prenez comme exemple l'IA de la tortue ci-dessous. Vous avez probablement déjà vu des jeux où les ennemis se déplacent comme ça.
ja: このカメのAIを以下に挙げてみましょう。敵がこんな風に動くゲームを見たことがあるのではないでしょうか。
pt: Veja essa I.A da tartaruga abaixo. Provavelmente já viu jogos em que os inimigos se movem assim.
tr: Aşağıdaki kaplumbağa YZ'sini ele alın (yapay zeka). Muhtemelen düşmanların bu şekilde hareket ettiği oyunlar görmüşsünüzdür.
uk: Візьміть цей ШІ черепахи нижче. Ви, напевно, бачили ігри, де вороги рухаються таким чином.

source: This is done with just seven lines of pure vector calculation code.
cs: K tomu stačí pouhých sedm řádků čistě vektorového výpočetního kódu.
da: Dette gøres med kun syv linjer ren vektorberegningskode.
de: Das wird mit nur 7 Zeilen Vektorkalkulationen erreicht.
es: Son siete líneas de puro código de cálculo vectorial.
fr: Cela se fait avec seulement sept lignes de code de calcul vectoriel pur.
ja: これは、わずか 7 行の純粋なベクトル計算コードで行われます。
pt: Isso é feito com apenas sete linhas de código de cálculo vetorial puro.
tr: Bu, sadece yedi satırlık saf vektör hesaplama kodu ile yapılabiliyor.
uk: Це робиться лише за допомогою семи рядків коду чистого векторного обчислення.

source: The code is a bit too difficult for now, so we'll spare you the details, but this turtle gives you a glimpse of what 2D vectors can do for you and your game projects.
cs: Kód je pro tuto chvíli příliš složitý, takže vás ušetříme detailů, ale tato želva vám poskytne náhled na to, co 2D vektory mohou udělat pro vás a vaše herní projekty.
da: Koden er lidt for vanskelig for nu, så vi skåner dig for detaljerne, men denne skildpadde giver dig et glimt af, hvad 2D-vektorer kan gøre for dig og dine spilprojekter.
de: Der Code ist im Moment etwas zu schwierig, also ersparen wir Dir die Details, aber diese Schildkröte gibt Dir einen Einblick in das, was 2D-Vektoren für Dich und Deine Spielprojekte tun können.
es: El código puede resultar un poco difícil por ahora, así que te ahorraremos los detalles, pero esta tortuga te da una idea de lo que los vectores 2D pueden hacer por ti y tus proyectos de juego.
fr: Le code est peut-être un peu difficile pour l'instant, alors nous vous épargnerons les détails, mais cette tortue vous donne un aperçu de ce que les vecteurs 2D peuvent faire pour vous et vos projets de jeu.
ja: 今のところ、コードは少し難しすぎるので詳細は割愛しますが、このカメは、2D ベクターがあなたとあなたのゲームプロジェクトに何ができるかを垣間見ることができます。
pt: O código é um pouco difícil por enquanto, então vamos poupar os detalhes, mas essa tartaruga já consegue te dar uma ideia do que os vetores 2D podem fazer por si e os seus projetos de jogo.
tr: Kodu anlamanız şimdilik biraz zor, bu yüzden ayrıntıları atlayacağız, ancak bu kaplumbağa size 2B vektörlerin, sizin için ve oyun projeleriniz için neler yapabileceğine dair bir fikir veriyordur.
uk: Наразі код надто складний, тому ми позбавимо вас деталей, але ця черепаха дає вам уявлення про те, що 2D-вектори можуть зробити для вас і ваших ігрових проектів.

source: We scale the robot again, this time by adding to it directly using a [code]Vector2[/code]. The following code has the same effect as the previous example.
cs: Znovu upravíme měřítko robota, tentokrát tak, že přímo změníme [code]Vector2[/code]. Následující kód má stejný účinek jako předchozí příklad.
da: Vi skalerer robotten igen, denne gang ved at tilføje til den, direkte ved hjælp af en [code]Vector2[/code]. Følgende kode har samme effekt som det foregående eksempel.
de: Wir skalieren den Roboter erneut, diesmal indem wir ihm direkt einen [code]Vector2[/code] hinzufügen. Der folgende Code hat die gleiche Wirkung wie im vorherigen Beispiel.
es: Volvemos a modificar la escala del robot, esta vez sumándole directamente los valores deseados usando un [code]Vector2[/code]. El siguiente código tiene el mismo efecto que el ejemplo anterior.
fr: Nous modifions à nouveau l'échelle du robot, cette fois en lui ajoutant directement les valeurs souhaitées à l'aide d'un [code]Vector2[/code]. Le code suivant a le même effet que l'exemple précédent.
it: Ingrandiamo di nuovo il robot, questa volta usando direttamente un [code]Vector2[/code]. Il seguente codice ha lo stesso effetto dell'esempio precedente.
ja: 今度は [code]Vector2[/code] を使用してロボットに直接追加することで、ロボットを再びスケーリングします。次のコードは、前の例と同じ効果があります。
nl: We schalen de robot opnieuw, deze keer door er direct bij op te tellen met behulp van een [code]Vector2[/code]. De volgende code heeft hetzelfde effect als het vorige voorbeeld.
pt: Escalonamos o robô novamente, desta vez adicionando diretamente usando um [code]Vector2[/code]. O código a seguir tem o mesmo efeito que o exemplo anterior.
pt_br: Escalonamos o robô novamente, desta vez adicionando diretamente usando um [code]Vector2[/code]. O código a seguir tem o mesmo efeito que o exemplo anterior.
ru: Мы снова масштабируем робота, на этот раз напрямую используя [code]Vector2[/code]. Следующий код окажет тот же эффект, как и предыдущий пример.
ta: ரோபோவை மீண்டும் அளவிடுகிறோம், இந்த முறை [குறியீடு] திசையன் 2 [/குறியீடு] ஐப் பயன்படுத்தி நேரடியாகச் சேர்ப்பதன் மூலம். பின்வரும் குறியீடு முந்தைய எடுத்துக்காட்டு அதே விளைவைக் கொண்டுள்ளது.
tr: Robotu tekrar ölçeklendiriyoruz, ama bu sefer bir [code]Vector2[/code] kullanarak ona doğrudan ekleme yapıyoruz. Aşağıdaki kod, önceki örnekle aynı etkiye sahiptir.
uk: Ми знову масштабуємо робота, цього разу додаючи його безпосередньо за допомогою [code]Vector2[/code]. Наступний код має той самий ефект, що й попередній приклад.
zh_hans: 重新来缩放机器人，这次直接使用 [code]Vector2[/code] 增加值。下面的代码和一开始的例子效果是一样的。
zh_hant: 我們再次調整機器人的縮放比例，這次直接使用 [code]Vector2[/code] 進行加法運算。以下程式碼的效果與前一個範例相同。

source: Notice how we use parentheses and two arguments inside parentheses, just like other function calls.
cs: Všimněte si, že používáme závorky a dva argumenty uvnitř závorek, stejně jako při volání jiných funkcí.
da: Bemærk, hvordan vi bruger parenteser og to argumenter indeni parenteser, ligesom andre funktionskald.
de: Beachte, wie wir Klammern und zwei Parameter in Klammern verwenden, genau wie bei anderen Funktionsaufrufen.
es: Observa cómo usamos paréntesis y dos argumentos entre los paréntesis, igual que en otras llamadas a funciones.
fr: Remarquez comment nous utilisons des parenthèses et deux arguments à l'intérieur des parenthèses, tout comme les autres appels de fonction.
ja: 他の関数呼び出しと同じように、括弧と括弧内の 2 つの引数をどのように使用しているかに注目してください。
pt: Observe como usamos parênteses e dois argumentos dentro dos parênteses, assim como outras chamadas de função.
tr: Parantezleri ve parantez içindeki iki bağımsız değişkeni nasıl kullandığımıza dikkat edin, diğer fonksiyon çağrılarında yaptığımıza benziyor.
uk: Зверніть увагу, як ми використовуємо дужки та два аргументи в дужках, як і інші виклики функцій.
