Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-6-multiple-function-parameters.po
Languages: cs, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, zh_hans, zh_hant

source: We want a function to draw squares of any size.
cs: Chceme funkci, která kreslí čtverce libovolné velikosti.
de: Wir wollen eine Funktion, um Quadrate beliebiger Größe zu zeichnen.
fr: Nous voulons une fonction pour dessiner des carrés de n'importe quelle taille.
it: Vogliamo una funzione che disegni quadrati di ogni grandezza.
nl: We willen een functie om vierkanten van willekeurige grootte te tekenen.
pt: Queremos uma função para desenhar quadrados de qualquer tamanho.
ru: Нам нужна функция для рисования квадратов любого размера.
ta: எந்த அளவிலான சதுரங்களையும் வரைய ஒரு செயல்பாடு வேண்டும்.

source: We could use these squares as outlines when selecting units in a tactical game, as a frame for items in an inventory, and more.
cs: Tyto čtverce bychom mohli použít jako obrysy při výběru jednotek v taktické hře, jako rámeček pro položky v inventáři a další.
de: Wir könnten diese Quadrate als Umrisse bei der Auswahl von Einheiten in einem taktischen Spiel, als Rahmen für Gegenstände in einem Inventar und mehr verwenden.
fr: Nous pourrions utiliser ces carrés comme contours lors de la sélection des unités dans un jeu tactique, comme cadre pour les objets d'un inventaire, etc.
it: Potremmo usare questi quadrati come contorni quando selezioniamo delle unità in un gioco tattico, come cornice per oggetti in un inventario e molto altro.
nl: We kunnen deze vierkanten gebruiken als omtreklijnen bij het selecteren van eenheden in een tactisch spel, als omlijsting voor voorwerpen in een inventaris, en meer.
pt: Poderíamos usar esses quadrados como contornos ao selecionar unidades num jogo tático, como moldura para itens num inventário e muito mais.
ru: Мы можем использовать эти квадраты как контуры при выборе юнитов в тактической игре, как рамку для предметов в инвентаре и т.д.
ta: ஒரு தந்திரோபாய விளையாட்டில் அலகுகளைத் தேர்ந்தெடுக்கும்போது, ஒரு சரக்குகளில் உள்ள பொருட்களுக்கான சட்டகமாகவும், பலவற்றிலும் இந்த சதுரங்களை திட்டவட்டமாகப் பயன்படுத்தலாம்.

source: Create a function named [code]draw_square()[/code] that takes one parameter: the [code]length[/code] of the square's sides.
cs: Vytvořte funkci s názvem [code]draw_square()[/code], která má jeden parametr: [code]length[/code] - délka strany čtverce.
de: Erstelle eine Funktion mit dem Namen [code]draw_square()[/code], die einen Parameter annimmt: die Länge([code]length[/code]) der Seiten des Quadrats.
fr: Créez une fonction appelée [code]draw_square()[/code] qui prend un paramètre représentant la [code]length[/code], ou la longueur, des côtés du carré.
it: Crea una funzione chiamata [code]draw_square()[/code] che prende un parametro: la [code]length[/code] dei lati del quadrato.
nl: Maak een functie met de naam [code]draw_square()[/code] met één parameter: de [code]length[/code] van de zijden van het vierkant.
pt: Crie uma função chamada [code]draw_square()[/code] que receba um parâmetro: o [code]length[/code] (comprimento) dos lados do quadrado.
ru: Создай функцию [code]draw_square()[/code], принимающую один параметр: [code]length[/code] — длину стороны квадрата.
ta: ஒரு அளவுருவை எடுக்கும் [குறியீடு] டிரா_ச்குவேர் () [/குறியீடு] என்ற செயல்பாட்டை உருவாக்கவும்: சதுரத்தின் பக்கங்களின் [குறியீடு] நீளம் [/குறியீடு].

source: [b]The turtle should face towards the right when starting or completing a square.[/b]
cs: [b] Želva by měla směřovat doprava při zahájení a po dokončení čtverce. [/b]
de: [b]Die Schildkröte soll zu Beginn und am Ende der Zeichnung nach rechts schauen.[/b]
fr: [b]La tortue doit être orientée vers la droite lorsqu'elle commence ou termine un rectangle.[/b]
it: [b] La tartaruga dovrebbe essere star guardando a destra quando inizi o completi un quadrato.[/b]
nl: [b]De schildpad moet naar rechts kijken wanneer hij een vierkant begint of voltooit.[/b]
pt: [b]A tartaruga deve ficar virada para a direita ao iniciar ou completar um quadrado.[/b]
ru: [b]Черепаха должна быть повёрнута вправо перед началом или после завершения рисования квадрата.[/b]
ta: [b] ஒரு சதுரத்தைத் தொடங்கும்போது அல்லது முடிக்கும்போது ஆமை வலதுபுறத்தை நோக்கி எதிர்கொள்ள வேண்டும். [/b]

source: Be sure to call [b]turn_right(90)[/b] enough times in your function to do so.
cs: Nezapomeňte proto zavolat [b]turn_right(90)[/b] ve vaší funkci dostatečně často.
de: Stelle sicher dafür oft genug [b]turn_right(90)[/b] aufzurufen.
fr: Veillez à appeler [b]turn_right(90)[/b] suffisamment de fois dans votre fonction pour que ce soit le cas.
it: Assicurati di chiamare [b]turn_right(90)[/b] abbastanza volte nella tua funzione per far ciò.
nl: Zorg ervoor dat je [b]turn_right(90)[/b] vaak genoeg aanroept in je functie om dit te doen.
pt: Certifique-se de chamar [b]turn_right(90)[/b] vezes suficientes na sua função para fazê-lo.
ru: Убедитесь что [b]turn_right(90)[/b] вызывается достаточное количество раз в вашей функции, чтобы выполнить это условие.
ta: [B] டர்ன்_ரைட் (90) [/b] அவ்வாறு செய்ய போதுமான நேரங்களை அழைக்க மறக்காதீர்கள்.

source: In the previous lesson, your function would draw squares of a fixed size. Using a parameter, code a function to draw squares of any size.
cs: V předchozí lekci vaše funkce vykreslovala čtverce s pevnou velikostí. Pomocí parametru nakódujte funkci, která vykreslí čtverce libovolné velikosti.
de: In der vorherigen Lektion zeichnete deine Funktion Quadrate einer festen Größe. Programmiere mithilfe eines Parameters eine Funktion, um Quadrate beliebiger Größe zu zeichnen.
es: En la lección anterior, tu función dibujaba cuadrados de un tamaño fijo. Utilizando un parámetro, codifica una función para dibujar cuadrados de cualquier tamaño.
fr: Dans la leçon précédente, votre fonction dessinait des carrés d'une taille fixe. En utilisant un paramètre, codez une fonction pour dessiner des carrés de n'importe quelle taille.
it: Nella lezione precedente, la tua funzione disegnava quadrati di grandezza fissa. Usando un parametro, scrivi una funzione che disegni quadrati di ogni grandezza.
ja: 前のレッスンでは、関数は固定サイズの正方形を描画します。 パラメーターを使用して、任意のサイズの正方形を描画する関数をコーディングします。
nl: In de vorige les tekende je functie vierkanten van een vaste grootte. Gebruik een parameter en schrijf een functie om vierkanten van willekeurige grootte te tekenen.
pt: Na lição anterior, a sua função podia desenhar quadrados de tamanho fixo. Usando um parâmetro, programe uma função para desenhar quadrados de qualquer tamanho.
pt_br: Na lição anterior, sua função podia desenhar quadrados de tamanho fixo. Usando um parâmetro, programe uma função para desenhar quadrados de qualquer tamanho.
ru: В предыдущем уроке ваша функция рисовала квадраты фиксированного размера. Используя параметр, напишите функцию для рисования квадратов любого размера.
ta: முந்தைய பாடத்தில், உங்கள் செயல்பாடு ஒரு நிலையான அளவிலான சதுரங்களை ஈர்க்கும். ஒரு அளவுருவைப் பயன்படுத்தி, எந்த அளவிலான சதுரங்களையும் வரைய ஒரு செயல்பாட்டை குறியிடவும்.
zh_hans: 在上一课中，你的函数能够绘制固定大小的正方形。 通过增加一个参数，编写一个函数来绘制任意大小的正方形。
zh_hant: 在前一課中，你的函式會繪製固定大小的正方形。現在，使用參數來編寫一個能夠繪製任意大小正方形的函式。

source: Drawing rectangles of any size
cs: Kreslení obdélníků libovolné velikosti
de: Zeichnen von Rechtecken beliebiger Größe
es: Dibujar rectángulos de cualquier tamaño
fr: Dessiner des rectangles de n'importe quelle taille
it: Disegnando rettangoli di ogni grandezza
ja: 任意のサイズの長方形を描画する
nl: Rechthoeken van willekeurige grootte tekenen
pt: Desenhando retângulos de qualquer tamanho
pt_br: Desenhando retângulos de qualquer tamanho
ru: Рисование прямоугольников любого размера
ta: எந்த அளவிலான செவ்வகங்களை வரைதல்
zh_hans: 绘制任意大小的矩形
zh_hant: 繪製任意大小的矩形

source: Let's make our square drawing function more flexible to include rectangles of varying sizes.
cs: Udělejme naši funkci čtvercového kreslení flexibilnější, aby zahrnovala obdélníky různých velikostí.
de: Lass uns unsere Zeichenfunktion für das Quadrat flexibler gestalten, um Rechtecke unterschiedlicher Größe zu zeichnen.
fr: Rendons notre fonction de dessin de carrés plus flexible pour inclure des rectangles de différentes tailles.
it: Rendiamo la nostra funzione disegna quadrati più flessibile per includere rettangoli di grandezze variabili.
nl: Laten we onze functie voor het tekenen van vierkanten flexibeler maken zodat ze ook rechthoeken van verschillende groottes kan tekenen.
pt: Vamos tornar nossa função de desenhar quadrados mais flexível para incluir retângulos de tamanhos variados.
ru: Давайте сделаем нашу функцию рисования квадрата более гибкой, чтобы с её помощью можно было рисовать прямоугольники разного размера.
ta: மாறுபட்ட அளவுகளின் செவ்வகங்களைச் சேர்க்க எங்கள் சதுர வரைதல் செயல்பாட்டை மிகவும் நெகிழ்வாக மாற்றுவோம்.

source: Your job is to code a function named [code]draw_rectangle()[/code] that takes two parameters: the [code]length[/code] and the [code]height[/code] of the rectangle.
cs: Vaším úkolem je naprogramovat funkci s názvem [code]draw_rectangle()[/code], která má dva parametry: [code]length[/code] a [code]height[/code] - délka a výška obdélníku.
de: Deine Aufgabe ist es, eine Funktion mit dem Namen [code]draw_rectangle()[/code] zu programmieren, die zwei Parameter akzeptiert: die Länge([code]length[/code]) und die Höhe([code]height[/code]) des Rechtecks.
fr: Votre travail consiste à coder une fonction appelée [code]draw_rectangle()[/code] qui prend deux paramètres : [code]length[/code] et [code]height[/code], qui désignent respectivement la longueur et la hauteur du rectangle.
it: Il tuo obiettivo è quello di scrivere una funzione chiamata[code]draw_rectangle()[/code] che prende due parametri: la [code]length[/code] e l'[code]height[/code] del rettangolo.
nl: Het is jouw taak om een functie te schrijven met de naam [code]draw_rectangle()[/code] met twee parameters: de [code]length[/code] en de [code]height[/code] van de rechthoek.
pt: O seu trabalho é programar uma função chamada [code]draw_rectangle()[/code] que recebe dois parâmetros: o [code]length[/code] (comprimento) e o [code]height[/code] (altura) do retângulo.
ru: Ваша задача - написать функцию [code]draw_rectangle()[/code], принимающую два параметра: длину [code]length[/code] и высоту [code]height[/code] прямоугольника.
ta: [குறியீடு] இரண்டு அளவுருக்களை எடுக்கும் [குறியீடு] டிரா_ரெக்டாங்கல் () [/குறியீடு] என்ற செயல்பாட்டை குறியிடுவதே உங்கள் வேலை: [குறியீடு] நீளம் [/குறியீடு] மற்றும் செவ்வகத்தின் [குறியீடு] உயரம் [/குறியீடு].

source: [b]The turtle should face towards the right when starting or completing a rectangle.[/b]
cs: [b] Želva by měla směřovat doprava při zahájení a po dokončení obdélníku. [/b]
de: [b]Die Schildkröte soll am Anfang oder Ende des Zeichenvorgangs nach rechts schauen.[b]
fr: [b]La tortue doit être orientée vers la droite lorsqu'elle commence ou termine un rectangle.[/b]
it: [b] La tartaruga dovrebbe essere star guardando a destra quando inizi o completi un rettangolo.[/b]
nl: [b]De schildpad moet naar rechts kijken wanneer hij een rechthoek begint of voltooit.[/b]
pt: [b]A tartaruga deve ficar voltada para a direita ao iniciar ou completar um retângulo.[/b]
ru: [b]Черепаха должна быть повёрнута вправо перед началом или после завершения рисования квадрата.[/b]
ta: [ஆ] ஒரு செவ்வகத்தைத் தொடங்கும்போது அல்லது முடிக்கும்போது ஆமை வலதுபுறத்தை நோக்கி எதிர்கொள்ள வேண்டும். [/b]

source: Note that we could still draw a square with [code]draw_rectangle()[/code] by having the [code]length[/code] and [code]height[/code] equal the same value.
cs: Všimněte si, že bychom stále mohli nakreslit čtverec s [code]draw_rectangle()[/code] tím, že [code]length[/code] a [code]height[/code] budou mít stejnou hodnotu.
de: Beachte, dass wir immer noch ein Quadrat mit [code]draw_rectangle()[/code] zeichnen könnten, indem wir Länge([code]length[/code]) und Höhe([code]height[/code]) den gleichen Wert zuweisen.
fr: Notez que nous pourrions toujours dessiner un carré avec [code]draw_rectangle()[/code] en faisant en sorte que [code]length[/code] et [code]height[/code] aient la même valeur.
it: Nota che potremmo disegnare comunque un quadrato con [code]draw_rectangle()[/code] avendo la [code]length[/code] e l'[code]height[/code] uguali.
nl: Merk op dat we nog steeds een vierkant kunnen tekenen met [code]draw_rectangle()[/code] door de [code]length[/code] en [code]height[/code] dezelfde waarde te geven.
pt: Observe que ainda podemos desenhar um quadrado com [code]draw_rectangle()[/code] fazendo com que [code]length[/code] e [code]height[/code] sejam iguais.
ru: Обратите внимание, что мы всё еще можем нарисовать квадрат с помощью [code]draw_rectangle()[/code], если передадим в неё [code]length[/code] и [code]height[/code] равные одному и тому же значению.

source: With one parameter, you can make squares of any size. With two, you can draw any rectangle! You'll do so in this practice.
cs: Pomocí jednoho parametru můžete vytvořit čtverce libovolné velikosti. Se dvěma můžete nakreslit libovolný obdélník! Zkusíte si to v tomto cvičení.
de: Mit einem Parameter kannst Du Quadrate beliebiger Größe erstellen. Mit zwei kannst Du jedes Rechteck zeichnen! Du wirst dies in dieser Übung tun.
es: Con un parámetro, puedes hacer cuadrados de cualquier tamaño. Con dos, ¡puedes dibujar cualquier rectángulo! Así lo harás en esta práctica.
fr: Avec un paramètre, vous pouvez faire des carrés de n'importe quelle taille. Avec deux, vous pouvez dessiner n'importe quel rectangle ! C'est ce que vous ferez dans cet exercice.
it: Con un parametro, puoi creare quadrati di ogni grandezza. Con due, puoi disegnare ogni rettangolo! Farai questo nella seguente pratica.
ja: 1 つのパラメーターを使用して、任意のサイズの正方形を作成できます。 2つあればどんな長方形でも描けます！ この演習ではそれを行います。
nl: Met één parameter kun je vierkanten van elke grootte maken. Met twee kun je elke rechthoek tekenen! Dat zul je in deze oefening doen.
pt: Com um parâmetro, pode fazer quadrados de qualquer tamanho. Com dois, pode desenhar qualquer retângulo! Vai fazer isso nessa prática.
pt_br: Com um parâmetro, você pode fazer quadrados de qualquer tamanho. Com dois, você pode desenhar qualquer retângulo! Você vai fazer isso nessa prática.
ru: Один параметр позволит вам рисовать квадраты любого размера. Два параметра позволят нарисовать любой прямоугольник! Это то, чем вы займётесь в данном упражнении.
ta: ஒரு அளவுருவுடன், நீங்கள் எந்த அளவிலான சதுரங்களையும் செய்யலாம். இரண்டுடன், நீங்கள் எந்த செவ்வகத்தையும் வரையலாம்! இந்த நடைமுறையில் நீங்கள் அவ்வாறு செய்வீர்கள்.
zh_hans: 使用一个参数，你可以制作任意大小的正方形。 有了两个，你可以绘制任何矩形！ 你将在本练习中这样做。
zh_hant: 使用一個參數，你可以繪製任何大小的正方形；使用兩個參數，你就可以繪製任何矩形！你將在這個練習中做到這一點。

source: Your First Function Parameter
cs: Váš první parametr funkce
de: Dein erster Funktionsparameter
es: Tu primer parámetro de función
fr: Votre premier paramètre de fonction
it: La Tua Prima Funzione Parametrizzata
ja: 最初の関数パラメータ
nl: Je eerste functieparameter
pt: O seu Primeiro Parâmetro de Função
pt_br: Seu Primeiro Parâmetro de Função
ru: Ваш первый параметр функции
ta: உங்கள் முதல் செயல்பாட்டு அளவுரு
zh_hans: 你的第一个函数参数
zh_hant: 你的第一個函式參數

source: In previous lessons, you used the [code]rotate()[/code] function and gave it a [i]parameter[/i].
pt: Nas lições anteriores, usou a função [code]rotate()[/code] e deu-lhe um [i]parâmetro[/i].

source: In the previous part, you created a function to draw a square of a fixed size. This function is a bit limiting. Instead, it would be much better if we had a function to draw a square of [i]any[/i] size. Or better: any kind of rectangle (a square is a specific kind of rectangle). In previous lessons, you used the [code]rotate()[/code] function and gave it an [i]argument[/i].
es: En la parte anterior, creaste una función para dibujar un cuadrado de un tamaño fijo. Esta función es un poco limitante. En cambio, sería mucho mejor si tuviéramos una función para dibujar un cuadrado de [i]cualquier[/i] tamaño. O mejor aún: cualquier tipo de rectángulo (un cuadrado es un tipo específico de rectángulo). En las lecciones anteriores, usaste la función [code]rotate()[/code] y le diste un [i]parámetro[/i].
ja: 前のパートでは、固定サイズの正方形を描画する関数を作成しました。 この機能には少し制限があります。 代わりに、[i]任意の[/i]サイズの正方形を描画する関数があればもっと良いでしょう。 さらに良いのは、任意の種類の長方形 (正方形は特定の種類の長方形です) です。 前のレッスンでは、[code]rotate()[/code] 関数を使用し、[i]引数[/i] を与えました。
pt_br: Na parte anterior, você criou uma função para desenhar um quadrado de tamanho fixo. Essa função é um pouco limitada. Seria muito melhor se tivéssemos uma função para desenhar um quadrado de [i]qualquer[/i] tamanho. Ou melhor: qualquer tipo de retângulo (um quadrado é um tipo específico de retângulo). Nas lições anteriores, você usou a função [code]rotate()[/code] e deu a ela um [i]parâmetro[/i].
zh_hans: 在上一部分中，你创建了一个函数来绘制一个固定大小的正方形。 这个功能有点限制。 相反，如果我们有一个函数来绘制一个 [i]任意[/i] 大小的正方形会更好。 或者更好的是：任何类型的矩形（正方形是特殊的矩形）。 在之前的课程中，你使用了 [code]rotate()[/code] 函数并给了它一个 [i] 参数[/i]。
zh_hant: 在上一部分中，你創建了一個畫固定大小正方形的函式。 不過這個函式有點限制。如果我們能夠創建一個可以畫任意大小正方形的函式，那會更好。或者更進一步，能畫任何種類的長方形（因為正方形本身就是長方形的一種特殊情況）。 在之前的課程中，你使用過 [code]rotate()[/code] 函式，並且傳遞了一個[b]引數[/b]給它。

source: For now, please focus on the first line: [code]func rotate(radians)[/code]. When you call [code]rotate(0.5)[/code], the computer binds the value [code]0.5[/code] to the label [code]radians[/code]. Wherever the computer sees the identifier [code]radians[/code] inside the function, it replaces it with the [code]0.5[/code] value. The parameter name is always a label you use to refer to a [i]value[/i]. The value in question can be a number, text, or anything else. For now, we'll stick to numbers as we have yet to see other value types.
es: Por el momento, céntrate en la primera línea: [code]func rotate(radians)[/code]. Cuando llamas a [code]rotate(0.5)[/code], la computadora vincula el valor [code]0.5[/code] a la etiqueta [code]radians[/code]. Siempre que la computadora vea el identificador [code]radians[/code] dentro de la función, lo sustituirá por el valor [code]0.5[/code]. El nombre del parámetro siempre es una etiqueta que se utiliza para referirse a un [i]valor[/i]. El valor en cuestión puede ser un número, un texto o cualquier otra cosa. Por ahora, nos atendremos a los números, ya que aún no hemos visto otros tipos de valores.
ja: ここでは、最初の行 [code]funcrotate(radians)[/code] に注目してください。 [code]rotate(0.5)[/code] を呼び出すと、コンピューターは値 [code]0.5[/code] をラベル [code]radians[/code] にバインドします。 コンピューターは関数内で識別子 [code]radians[/code] を見つけると、それを [code]0.5[/code] 値に置き換えます。 パラメータ名は常に、[i]値[/i]を参照するために使用するラベルです。 問題の値は、数値、テキスト、またはその他のものにすることができます。 現時点では、他の値の種類をまだ見ていないため、数値にこだわります。
pt_br: Por enquanto, concentre-se na primeira linha: [code]func rotate(radiano)[/code]. Quando você chama a função [code]rotate(0.5)[/code], o computador vincula o valor [code]0.5[/code] ao nome [code]radiano[/code]. Sempre que o computador vê o identificador [code]radiano[/code] dentro da função, ele substitui o nome pelo valor [code]0.5[/code]. O nome do parâmetro é sempre um nome que você usa para se referir a um [i]valor[/i]. O valor em questão pode ser um número, texto ou qualquer outra coisa. Por enquanto, vamos continuar a usar números, pois ainda temos que ver outros tipos de valores.
zh_hans: 现在，请关注第一行：[code]func rotate(radians)[/code]。 当你调用 [code]rotate(0.5)[/code] 时，计算机会将值 [code]0.5[/code] 绑定到标签 [code]radians[/code]。 计算机在函数内任何地方看到标识符 [code]radians[/code]，都会将其替换为 [code]0.5[/code] 。 参数名称始终是你用来引用 [i] 值[/i] 的标签。 这些值可以是数字、文本或其他任何内容。 目前，我们只使用数字，因为我们还没有接触到其他类型的值。
zh_hant: 現在，請專注於第一行：[code]func rotate(radians)[/code]。 當你呼叫 [code]rotate(0.5)[/code] 時，電腦會將數值 [code]0.5[/code] 綁定到 [code]radians[/code] 這個標籤上。 當電腦在函式內部看到標識符 [code]radians[/code] 時，它會將其替換為 [code]0.5[/code] 這個數值。 參數名稱始終是你用來指代[b]值[/b]的標籤。這個數值可以是數字、文字或其他任何東西。 目前我們將專注於數字，因為我們還沒有接觸到其他值類型。

source: A parameter is a label that represents a value. The value in question can change: it depends on what you put in parentheses when calling a function.
es: Un parámetro es una etiqueta que representa un valor. El valor en cuestión puede cambiar: depende de lo que pongas entre paréntesis al llamar a una función.
ja: パラメータは値を表すラベルです。 問題の値は変更される可能性があります。関数を呼び出すときに括弧内に何を入れたかによって異なります。
pt_br: Um parâmetro é um nome que representa um valor. O valor em questão pode mudar: depende do que você coloca entre parênteses ao chamar uma função.
zh_hans: 参数是表示值的标签。 调用时值可能会改变：这取决于你在调用函数时放入括号中的内容。
zh_hant: 參數是一個代表值的標籤。 這個值是可以改變的：它取決於你在呼叫函式時，放在括號中的內容。

source: You can give your function parameters when writing its [i]definition[/i] (the line starting with the [code]func[/code] keyword). To do so, you add a name inside of the parentheses.
es: Puedes proporcionar los parámetros de tu función al momento de escribir su [i]definición[/i] (la línea que empieza con la palabra clave [code]func[/code]). Para hacerlo, añade un nombre dentro de los paréntesis.
ja: 関数の[i]定義[/i] ([code]func[/code] キーワードで始まる行) を記述するときに、関数パラメーターを指定できます。 これを行うには、括弧内に名前を追加します。
pt_br: Você pode dar parâmetros para suas funções ao escrever sua [i]definição[/i] (a linha que começa com a palavra-chave [code]func[/code]). Para fazer isso, você adiciona um nome dentro dos parênteses.
zh_hans: 你可以在 写函数的[i]定义[/i]（以 [code]func[/code] 关键字开头的行）时提供函数参数。 为此，要在括号内添加一个名称。
zh_hant: 你可以在寫函式的[b]定義[/b]時，為函式加入參數（即從 [code]func[/code] 關鍵字開始的那一行）。 為此，你需要在括號內加上一個名稱。

source: You can give parameters any name. How you name functions and parameters is up to you. Just remember that names cannot contain spaces. To write parameter names with multiple words, you need to use underscores. The following function definition is exactly equivalent to the previous one.
es: Puedes darles a los parámetros cualquier nombre. El nombre de las funciones y los parámetros depende de ti Sólo recuerda que los nombres no pueden contener espacios. Para escribir nombres de parámetros con varias palabras, debes usar guiones bajos. La siguiente definición de función es exactamente equivalente a la anterior.
ja: パラメータには任意の名前を付けることができます。 関数とパラメータにどのような名前を付けるかはあなた次第です。 名前にスペースを含めることはできないことに注意してください。 パラメータ名を複数の単語で記述するには、アンダースコアを使用する必要があります。 次の関数定義は、前の関数定義とまったく同じです。
pt_br: Você pode dar qualquer nome aos parâmetros. Você decide como nomear suas funções e parâmetros. Lembre-se de que os nomes não podem conter espaços. Para escrever nomes de parâmetros com várias palavras, você precisa usar o sinal de underscore. A definição de função a seguir é exatamente equivalente à anterior.
zh_hans: 你可以为参数指定任何名称。 如何命名函数和参数取决于你。 只不过要留意，名称不能包含空格。 如果要在一个名称里用到多个单词，你需要使用下划线分隔。 下面的函数定义与上一个完全等价。
zh_hant: 你可以隨意為參數命名，函式和參數的命名由你決定。 只要記得，名稱不能包含空格。如果參數名稱包含多個單字，則需要使用底線（"_"）來連接。 以下的函式定義和之前的完全相同。

source: Parameters make your code easier to reuse. Here's an example with a function to draw any square. Use the slider to change the value passed to the function and draw squares of different sizes.
es: Los parámetros hacen que tu código sea más fácil de reutilizar. Aquí hay un ejemplo con una función para dibujar cualquier cuadrado. Utiliza el deslizador para cambiar el valor que se le pasa a la función y dibujar cuadrados de diferentes tamaños.
ja: パラメーターを使用すると、コードを再利用しやすくなります。 以下は、任意の正方形を描画する関数の例です。 スライダーを使用して関数に渡される値を変更し、さまざまなサイズの正方形を描画します。
pt_br: Os parâmetros facilitam a reutilização do seu código. Aqui está um exemplo de uma função para desenhar qualquer quadrado. Use o slider para alterar o valor passado para a função e desenhar quadrados de tamanhos diferentes.
zh_hans: 参数使你的代码更易于重复使用。 这是一个绘制任意正方形的函数的示例。 使用滑块更改传递给函数的值并绘制不同大小的正方形。
zh_hant: 參數讓你的程式碼更容易重複使用。 這裡有一個範例，展示如何使用函式來畫出任何大小的正方形。你可以透過滑桿來改變傳遞給函式的數值，並繪製不同大小的正方形。
