Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-4-drawing-a-rectangle.po
Languages: cs, da, de, es, it, ja, pt, ru, ta, tr, uk, zh_hans, zh_hant

source: The corner is made up of two lines that are [code]200[/code] pixels long. The lines are connected at each end by [code]90[/code] degrees, or right-angle.
da: Hjørnet består af to linjer, der er [code]200[/code] pixels lange. Linjerne er forbundet i hver ende med [code]90[/code] grader, eller retvinklet.
it: L'angolo è composto da due linee lunghe [code]200[/code] pixel. Le linee sono collegate a ciascuna estremità per [code]90[/code] gradi, o angolo retto.
ja: コーナーは長さ[code]200[/code]ピクセルの2本の線で構成されます。線は両端が[code]90[/code]度の直角で結ばれています。
pt: Esse ângulo de 90 graus é feito por duas linhas de [code]200[/code] pixels de comprimento. As linhas são conectadas no final de cada uma delas por [code]90[/code] graus, formando um ângulo reto.
ru: Угол составляется из двух линий длиной в [code]200[/code] пикселей. Эти линии соединены концами под углом в [code]90[/code] градусов, другими словами, под прямым углом.
tr: Bu köşe, [code]200[/code] piksel uzunluğundaki iki çizgiden oluşuyor. Çizgiler birbirlerine birer uçlarından [code]90[/code] derecelik açı ile (dik açı) ile bağlılar.
uk: Кут складається з двох ліній завдовжки [code]200[/code] пікселів. Ці лінії з'єднані кінцями під кутом [code]90[/code] градусів, іншими словами, під прямим кутом.

source: The [code]move_forward()[/code] and [code]turn_right()[/code] functions to the right draw a corner, but they're missing some arguments.
da: Funktionerne [code]move_forward()[/code] og [code]turn_right()[/code] til højre tegner et hjørne, men de mangler nogle argumenter.
it: Le funzioni [code]move_forward()[/code] e [code]turn_right()[/code] a destra disegnano un angolo, ma mancano alcuni argomenti.
ja: 右にある [code]move_forward()[/code] 関数と [code]turn_right()[/code] 関数は角を描画しますが、いくつかの引数が不足しています。
ru: Функции [code]move_forward()[/code] и [code]turn_right()[/code] справа рисуют угол, но в них отсутствуют какие-то параметры.
tr: Sağdaki [code]move_forward()[/code] ve [code]turn_right()[/code] fonksiyonları bir köşe çizecekler, ama girdi değişkenleri eksik durumda.
uk: Функції [code]move_forward()[/code] і [code]turn_right()[/code] праворуч малюють кут, але в них відсутні якісь аргументи.

source: Add the missing arguments so the turtle moves forward [code]200[/code] pixels, turns right [code]90[/code] degrees, then moves forward again [code]200[/code] pixels.
da: Tilføj de manglende argumenter, så skildpadden bevæger sig [code]200[/code] pixels fremad, drejer [code]90[/code] grader til højre og derefter bevæger sig fremad igen [code]200[/code] pixels.
it: Aggiungete gli argomenti mancanti in modo che la tartaruga si sposti in avanti di [code]200[/code] pixel, si giri a destra di [code]90[/code] gradi, quindi si sposti di nuovo in avanti di [code]200[/code] pixel.
ja: 足りない引数を追加して、亀が[code]200[/code]ピクセル前進し、[code]90[/code]度回転し、再び[code]200[/code]ピクセル前進するようにしてください。
ru: Добавьте недостающие параметры чтобы черепаха продвинулась на [code]200[/code] пикселей вперёд, повернулась вправо на [code]90[/code] градусов, а затем продвинулась вперёд ещё раз на [code]200[/code] пикселей.
tr: Kablumbağanın ileriye [code]200[/code] piksel gitmesi, sağa [code]90[/code] derece dönmesi, ve sonra tekrar [code]200[/code] piksel ilerlemesi için, eksik olan girdi değişkenlerini ekleyin.
uk: Додайте пропущені аргументи, щоб черепашка пройшла на [code]200[/code] пікселів уперед, повернулася праворуч на [code]90[/code] градусів, а потім пройшла вперед ще раз на [code]200[/code] пікселів.

source: We added the first argument for you so the turtle moves forward [code]200[/code] pixels.
da: Vi tilføjede det første argument for dig, så skildpadden bevæger sig [code]200[/code] pixels fremad.
it: Abbiamo aggiunto il primo argomento per far sì che la tartaruga si muova in avanti di [code]200[/code] pixel.
ja: 最初の引数は指定されているので、カメは前方に[code]200[/code]ピクセル移動します。
ru: Мы добавили для вас первый аргумент, чтобы черепаха двигалась вперёд на [code]200[/code] пикселей.
tr: İlk girdi değişkenini sizin için biz ekledik, bu sayede kaplumbağa [code]200[/code] piksel ileri gidecektir.
uk: Ми додали для вас перший аргумент, щоб черепашка пройшла вперед на [code]200[/code] пікселів.

source: In the following practices, we'll draw multiple corners to create rectangles.
da: I de følgende øvelser tegner vi flere hjørner for at skabe rektangler.
it: Nei prossimi esercizi, disegneremo più angoli per creare dei rettangoli.
ja: 次の演習では、複数の角を描いて長方形を作ります。
pt: Nas próximas práticas, vamos desenhar vários ângulos de 90 graus para criarmos retângulos.
ru: В дальнейших упражнениях мы будем рисовать углы, чтобы создать из них прямоугольники.
tr: Sıradaki alıştırmalarda, dikdörtgenler çizmek için çoklu köşeler çizeceğiz.
uk: У подальших вправах ми малюватимемо кути, щоб утворити з них прямокутники.

source: Use the turtle to draw a square's corner. You'll then build upon it to draw a rectangle.
cs: Pomocí želvy nakreslete roh čtverce. Poté na něj navážete a nakreslíte obdélník.
da: Brug skildpadden til at tegne et hjørne af en firkant. Du skal derefter bygge videre på det for at tegne et rektangel.
de: Benutze die Schildkröte, um die Ecke eines Quadrats zu zeichnen. Du baust dann darauf auf, um ein Rechteck zu zeichnen.
es: Utiliza la tortuga para dibujar la esquina de un cuadrado. Luego te basarás en ella para dibujar un rectángulo.
it: Usa la tartaruga per disegnare lo spigolo di un quadrato. Dopodiché su quella base, disegnerai un rettangolo.
ja: カメを使って角を描きます。それをベースに四角形を描きます。
pt: Use a tartaruga para desenhar um ângulo de 90 graus de um quadrado. Em seguida, com o que á fez, vai desenhar um retângulo.
ru: Используйте черепашку, чтобы нарисовать прямой угол. В дальнейшем это поможет вам нарисовать прямоугольник.
ta: ஒரு சதுர மூலையை வரைய ஆமையைப் பயன்படுத்தவும். ஒரு செவ்வகத்தை வரைய நீங்கள் அதை உருவாக்குவீர்கள்.
tr: Kaplumbağayı kullanarak karenin bir köşesini çizin. Daha sonra, aynı şeklide devam edip bir dikdörtgen çizeceksiniz.
uk: Скористайтеся черепашкою, щоб намалювати прямий кут. Надалі це допоможе вам намалювати прямокутник.
zh_hans: 使用海龟画一个正方形的角。 然后，你将在它的基础上绘制一个矩形。
zh_hant: 使用小海龜畫出正方形的角。接著，我們會以此為基礎畫出長方形。

source: Drawing a Rectangle
cs: Kreslení obdélníku
da: Tegning af et rektangel
de: Zeichnen eines Rechtecks
es: Dibujar un rectángulo
it: Disegnare un Rettangolo
ja: 四角形を描く
pt: Desenhando um retângulo
ru: Рисуем прямоугольник
ta: ஒரு செவ்வகம் வரைதல்
tr: Bir Dikdörtgen Çizmek
uk: Малюємо прямокутник
zh_hans: 绘制一个矩形
zh_hant: 繪製一個矩形

source: Add the correct arguments to the functions [code]move_forward()[/code] and [code]turn_right()[/code] to draw a rectangle with a width of [code]200[/code] pixels, and a height of [code]120[/code] pixels.
da: Tilføj de korrekte argumenter til funktionerne [code]move_forward()[/code] og [code]turn_right()[/code] for at tegne et rektangel med en bredde på [code]200[/code] pixels og en højde på [code]120[/code] pixels.
it: Aggiungete gli argomenti corretti alle funzioni [code]move_forward()[/code] e [code]turn_right()[/code] per disegnare un rettangolo con una larghezza di [code]200[/code] pixel e un'altezza di [code]120[/code] pixel.
ja: 関数 [code]move_forward()[/code] と [code]turn_right()[/code] に正しい引数を追加して、幅 [code]200[/code] ピクセル、高さ [code]120[/code] ピクセルの四角形を描画します。
ru: Дополните функции [code]move_forward()[/code] и [code]turn_right()[/code] такими параметрами, чтобы в результате их работы получился прямоугольник шириной в [code]200[/code] и высотой в [code]120[/code] пикселей.
tr: [code]move_forward()[/code] ve [code]turn_right()[/code] fonksiyonlarına doğru değerleri girerek, genişliği [code]200[/code] piksel ve yüksekliği [code]120[/code] piksel olan bir dikdörtgen çizin.
uk: Доповніть функції [code]move_forward()[/code] і [code]turn_right()[/code] такими параметрами, щоб результатом їх роботи став прямокутник завширшки [code]200[/code] і заввишки [code]120[/code] пікселів.

source: We wrote the first argument for you.
da: Vi skrev det første argument for dig.
it: Abbiamo scritto il primo argomento per voi.
ja: 最初のパラメータは既に書かれています。
ru: Первый параметр мы написали за вас.
tr: İlk girdi değişkenini sizin için yazdık.
uk: Перший параметр ми написали за вас.

source: In the next practice, you'll use the same functions to draw a bigger rectangle.
da: I den næste øvelse skal du bruge de samme funktioner til at tegne et større rektangel.
it: Nel prossimo esercizio, utilizzerete le stesse funzioni per disegnare un rettangolo più grande.
ja: 次の演習では同じ関数を使って、より大きな四角形を描きます。
pt: Na próxima prática, vai usar as mesmas funções para desenhar um retângulo ainda maior.
ru: В следующем практическом упражнении вы будете использовать те же функции, чтобы нарисовать более крупный прямоугольник.
tr: Sıradaki alıştırmada, aynı fonksiyonları kullanarak daha büyük bir dikdörtgen çizeceksiniz.
uk: У наступній практичній вправі ви використаєте ті самі функції, щоб намалювати більший прямокутник.

source: Based on your rectangle corner, you now need to draw a complete rectangle.
cs: Na základě rohu obdélníku nyní musíte nakreslit celý obdélník.
da: Baseret på dit rektangelhjørne, skal du nu tegne et helt rektangel.
de: Basierend auf Ihrer Rechteckeckecke musst Du nun ein vollständiges Rechteck zeichnen.
es: Basándote en la esquina del rectángulo, ahora tienes que dibujar un rectángulo completo.
it: A partire dallo spigolo che hai creato, ora dovrai disegnare un rettangolo completo.
ja: 四角形の角をベースに、今度は完全な四角形を描きましょう。
pt: Com base no seu ângulo de 90 graus do retângulo, precisa agora desenhar um retângulo completo.
ru: Теперь, основываясь на созданном вами прямом угле, попробуйте нарисовать полноценный прямоугольник.
ta: உங்கள் செவ்வக மூலையின் அடிப்படையில், நீங்கள் இப்போது ஒரு முழுமையான செவ்வகத்தை வரைய வேண்டும்.
tr: Dikdörtgenin köşesinden yola çıkarak, şimdi dikdörtgenin tamamını çizmelisiniz.
uk: Тепер, на основі створеного прямого кута, спробуйте намалювати цілий прямокутник.
zh_hans: 根据你画过的直角，现在需要绘制一个完整的矩形。
zh_hant: 根據你畫出的矩形角，接下來你需要畫出完整的矩形。

source: Drawing a Bigger Rectangle
cs: Kreslení většího obdélníku
da: Tegning af et Større Rektangel
de: Zeichnen eines größeren Rechtecks
es: Dibujar un rectángulo más grande
it: Disegnare un Rettangolo Più Grande
ja: より大きな四角形を描く
pt: Desenhando um Retângulo Ainda Maior
ru: Рисуем большой прямоугольник
ta: ஒரு பெரிய செவ்வகத்தை வரைதல்
tr: Daha Büyük bir Dikdörtgen Çizmek
uk: Малюємо великий прямокутник
zh_hans: 画一个更大的矩形
zh_hant: 畫一個更大的矩形

source: Write out calls to the functions [code]move_forward()[/code] and [code]turn_right()[/code] to draw a rectangle with a width of 220 pixels, and a height of 260 pixels.
da: Skriv kald til funktionerne [code]move_forward()[/code] og [code]turn_right()[/code] for at tegne et rektangel med en bredde på 220 pixels og en højde på 260 pixels.
it: Scrivi le chiamate per le funzioni [code]move_forward()[/code] e [code]turn_right()[/code] per disegnare un rettangolo di larghezza 220 pixel e altezza 260 pixel.
ja: 関数[code]move_forward()[/code]と[code]turn_right()[/code]の呼び出しを書いて、幅220ピクセル、高さ260ピクセルの四角形を描画しましょう。
pt: Escreva as chamadas das funções [code]move_forward()[/code] e [code]turn_right()[/code] para desenhar um retângulo com uma largura de 220 pixels e altura de 260 pixels.
ru: Допишите вызовы функций [code]move_forward()[/code] и [code]turn_right()[/code], чтобы получить прямоугольник шириной в 220 пикселей и высотой в 260 пикселей.
tr: [code]move_forward()[/code] and [code]turn_right()[/code] fonksiyonlarına gerekli çağrıları yaparak, genişliği 220 piksel ve yüksekliği 260 piksel olan bir dikdörtgen çizin.
uk: Допишіть виклики функцій [code]move_forward()[/code] і [code]turn_right()[/code], щоб отримати прямокутник завширшки 220 пікселів і заввишки 260 пікселів.

source: We wrote the first two lines for you.
da: Vi skrev de første to linjer for dig.
it: Abbiamo scritto le prime due linee per te.
ja: 最初の2行は既に書かれています。
pt: Escrevemos as duas primeiras linhas para si.
ru: Мы написали две первых строки за вас.
tr: İlk iki satırı sizin için yazdık.
uk: Ми написали два перші рядки за вас.

source: Be sure to write each instruction on a separate line.
da: Sørg for at skrive hver instruktion på en separat linje.
it: Assicurati di scrivere ogni funzione su una linea diversa.
ja: 各命令は必ず1行にまとめて書いてください。
pt: Certifique-se de escrever cada instrução numa linha separada.
ru: Обязательно удостоверьтесь, что каждая инструкция написана в отдельной строке.
tr: Her bir talimatı ayrı satırlarda yazdığınızdan emin olun.
uk: Обов'язково впевніться, що кожна інструкція написана в окремому рядку.

source: Every line should start with one [code]Tab[/code] character so the computer understands it's part of the [code]draw_rectangle()[/code] function.
da: Hver linje skal starte med et [code]Tab[/code]-tegn, så computeren forstår, at det er en del af [code]draw_rectangle()[/code]-funktionen.
it: Ricorda che ogni linea deve cominciare con il carattere [code]Tab[/code] così da far comprendere al computer che quelle linee sono parte della funzione [code]draw_rectangle()[/code].
ja: どの行も[code]タブ[/code] 文字で始まるようにして、コンピュータが[code]draw_rectangle()[/code]関数の一部であることを認識できるようにしてください。
pt: Toda linha deve começar com um [code]caractere de tabulação[/code] para que o computador entenda que essas linhas fazem parte da função [code]draw_rectangle()[/code].
ru: Каждая строка должна начинаться с символа [code]Tab[/code], чтобы компьютер понял, что содержимое строки является частью функции [code]draw_rectangle()[/code].
tr: Bilgisayarın, yazdığınız kodun [code]draw_rectangle()[/code] fonksiyonunun parçası olduğunu anlaması için, satırın başında bir [code]Sekme[/code] karakteri olmalı (genelde klavyenin en solunda üstünde iki yönlü ok olan tuş).
uk: Кожен рядок має починатися зі символу [code]Tab[/code], щоб комп'ютер зрозумів, що вміст рядка є частиною функції [code]draw_rectangle()[/code].

source: At this point, you're ready to code entirely on your own. Call functions by yourself to draw a complete rectangle.
cs: V tuto chvíli jste připraveni kódovat zcela samostatně. Sami zavolejte funkce pro vykreslení celého obdélníku.
da: På dette tidspunkt er du klar til at kode helt selv. Kald funktioner selv for at tegne et komplet rektangel.
de: An diesem Punkt bist Du bereit, vollständig selbst zu programmieren. Rufe die Funktionen selbst auf, um ein vollständiges Rechteck zu zeichnen.
es: Llegados a este punto, ya tienes los conocimientos necesarios para empezar a codificar por tu cuenta. Llama a las funciones por ti mismo para dibujar un rectángulo completo.
it: A questo punto, sei pronto a scrivere codice da solo. Chiama le funzioni e disegna un rettangolo completo.
ja: この時点で、あなた自身でコーディングする準備が整ったことになります。今度は関数を呼び出して完全な四角形を描画してみましょう。
pt: A partir desse ponto, está pronto para programar por si só. Chame você mesmo as funções para desenhar um retângulo completo.
ru: С этого момента вы готовы программировать самостоятельно. Вызывайте функции чтобы нарисовать полноценный прямоугольник.
ta: இந்த கட்டத்தில், நீங்கள் முற்றிலும் சொந்தமாக குறியிட தயாராக உள்ளீர்கள். ஒரு முழுமையான செவ்வகத்தை வரைய நீங்களே செயல்பாடுகளை அழைக்கவும்.
tr: Bu noktada, artık tamamen kendi başınıza kodlama yapabilecek kadar hazırsınız. Tam bir dikdörtgen çizmek için, fonksiyonları kendiniz yazarak çağırın.
uk: З цієї миті ви готові програмувати самостійно. Викликайте функції, щоб намалювати цілий прямокутник.
zh_hans: 此时，你已准备好完全靠自己写这些代码。请调用函数绘制一个完整的矩形。
zh_hant: 到這個時候，你已經準備好完全靠自己動手寫程式了。請自己呼叫函式來畫出完整的矩形。

source: - [code]move_forward(pixels)[/code] makes the turtle move forward over a given distance in [i]pixels[/i]. - [code]turn_right(degrees)[/code] makes the turtle turn to the right by a precise amount of [i]degrees[/i]. - [code]turn_left(degrees)[/code] works the same as [code]turn_right(degrees)[/code], except the turtle turns to the left.
pt: - [code]move_forward(pixels)[/code] faz com que a tartaruga se mova para frente por uma determinada distancia em [i]pixels[/i]. - [code]turn_right(graus)[/code] faz com que a tartaruga se mova para a direita por um valor preciso em [i]graus[/i]. - [code]turn_left(graus)[/code] funciona igual a função [code]turn_right(graus)[/code], exceto que dessa vez ela se move para a esquerda.

source: The [code]move_forward()[/code] and [code]turn_right()[/code] functions to the right draw a corner, but they're missing some parameters.
pt: As funções [code]move_forward()[/code] e [code]turn_right()[/code] que estão na direita desenham um ângulo de 90 graus, mas estão faltando nelas alguns parâmetros.

source: Add the missing parameters so the turtle moves forward [code]200[/code] pixels, turns right [code]90[/code] degrees, then moves forward again [code]200[/code] pixels.
pt: Adicione os parâmetros que estão faltando para que a tartaruga mova para frente em [code]200[/code] pixels, vire para direita [code]90[/code] graus e mova para frente novamente em [code]200[/code] pixels.

source: We added the first parameter for you so the turtle moves forward [code]200[/code] pixels.
pt: Adicionamos o primeiro parâmetro para si, assim a tartaruga vai mover para frente em [code]200[/code] pixels.

source: Add the correct parameters to the functions [code]move_forward()[/code] and [code]turn_right()[/code] to draw a rectangle with a width of [code]200[/code] pixels, and a height of [code]120[/code] pixels.
pt: Adicione os parâmetros corretos nas funções [code]move_forward()[/code] e [code]turn_right()[/code] para desenhar um retângulo com uma largura de [code]200[/code] pixels e altura de [code]120[/code] pixels.

source: We wrote the first parameter for you.
pt: Escrevemos o primeiro parâmetro para si.

source: The turtle is a little machine that moves forward, turns, and draws lines along its path. To make it draw, you give it a list of instructions: on each code line, you call one specific function. We prepared several functions for you: - [code]move_forward(pixels)[/code] makes the turtle move forward over a given distance in [i]pixels[/i]. - [code]turn_right(degrees)[/code] makes the turtle turn clockwise by a precise amount of [i]degrees[/i]. - [code]turn_left(degrees)[/code] works the same as [code]turn_right(degrees)[/code], except the turtle turns counter-clockwise. You'll use these functions the same way you used [code]rotate()[/code] before. The turtle draws a white line as it moves. We'll use this line to draw shapes. For example, to move the turtle 200 pixels, you would write [code]move_forward(200)[/code].
de: Die Schildkröte ist eine kleine Maschine, die sich vorwärts bewegt, dreht und Linien entlang ihres Weges zeichnet. Um sie zum Zeichnen zu bringen, musst du ihr eine Liste von Anweisungen geben: In jeder Codezeile rufst du eine bestimmte Funktion auf. Wir haben mehrere Funktionen für dich vorbereitet: - [code]move_forward(pixels)[/code] lässt die Schildkröte über eine bestimmte Entfernung, gemessen in [i]Pixeln[/i], vorwärts bewegen. - [code]turn_right(degrees)[/code] dreht die Schildkröte nach rechts, gemessen in [i]Grad[/i] . - [code]turn_left(degrees)[/code] funktioniert genauso wie [code]turn_right(degrees)[/code], nur in die entgegengesetzte Richtung. Verwende diese Funktionen wie zuvor [code]rotate()[/code]. Die Schildkröte zeichnet eine weiße Linie, während sie sich bewegt. Wir verwenden diese Linie, um Formen zu zeichnen. Um die Schildkröte um 200 Pixel geradeaus nach vorne zu bewegen, schreibst du [code]move_forward(200)[/code].
es: La tortuga es una pequeña máquina que avanza, gira y dibuja líneas a lo largo de su trayectoria. Para que dibuje, le das una lista de instrucciones: en cada línea de código, llamas a una función específica. Hemos preparado varias funciones para ti: - [code]move_forward(pixels)[/code] hace que la tortuga avance una distancia determinada en [i]pixeles[/i]. - [code]turn_right(degrees)[/code] hace que la tortuga gire hacia la derecha una cantidad precisa de [i]grados[/i]. - [code]turn_left(degrees)[/code] funciona igual que [code]turn_right(degrees)[/code], excepto que la tortuga gira hacia la izquierda. Utilizarás estas funciones de la misma manera que usaste [code]rotate()[/code] antes. La tortuga dibuja una línea blanca mientras se mueve. Usaremos esta línea para dibujar formas. Por ejemplo, para mover la tortuga 200 pixeles, escribirías [code]move_forward(200)[/code].
ta: ஆமை என்பது ஒரு சிறிய இயந்திரம், அது முன்னோக்கி நகரும், திருப்புகிறது, அதன் பாதையில் கோடுகளை ஈர்க்கிறது. அதை வரைய, நீங்கள் அதற்கு வழிமுறைகளின் பட்டியலைக் கொடுக்கிறீர்கள்: ஒவ்வொரு குறியீடு வரியிலும், நீங்கள் ஒரு குறிப்பிட்ட செயல்பாட்டை அழைக்கிறீர்கள். உங்களுக்காக பல செயல்பாடுகளை நாங்கள் ஆயத்தம் செய்தோம்: -. -. -. இந்த செயல்பாடுகளை நீங்கள் பயன்படுத்தியதைப் போலவே பயன்படுத்துவீர்கள் [குறியீடு] முன்பு சுழற்றுங்கள் () [/குறியீடு]. ஆமை நகரும் போது ஒரு வெள்ளை கோட்டை வரைகிறது. வடிவங்களை வரைய இந்த வரியைப் பயன்படுத்துவோம். எடுத்துக்காட்டாக, ஆமை 200 பிக்சல்களை நகர்த்த, நீங்கள் [குறியீடு] MOVE_FORWARD (200) [/code] ஐ எழுதுவீர்கள்.
zh_hans: 这个小海龟是一个小机器，它能向前移动、转动，并在它走过的路径上画线。 为了让它画起来，你要给它一系列的指令：在每一行代码上，调用一个特定的函数。 这些是我们已经准备好的函数： - [code]move_forward(pixels)[/code] 使海龟向前移动 [i]pixels[/i] 中的给定距离。 - [code]turn_right(degrees)[/code] 使海龟向右转动 [i]degrees[/i]度。 - [code]turn_left(degrees)[/code] 与 [code]turn_right(degrees)[/code] 相同，只是海龟向左转。 你能像以前使用 [code]rotate()[/code] 一样使用这些函数。 小海龟在移动时会画一条白线。 我们将使用这条线来绘制形状。 例如，要将海龟移动 200 像素，你可以写 [code]move_forward(200)[/code]。
zh_hant: 海龜是一個小機器，會向前移動、轉彎並沿著路徑畫線。 要讓它畫畫，你需要給它一系列的指令：在每一行程式碼中，你呼叫一個特定的函式。 我們為你準備了幾個函式： - [code]move_forward(pixels)[/code] 讓海龜向前移動指定距離，單位為[b]像素[/b]。 - [code]turn_right(degrees)[/code] 讓海龜順時針轉動指定角度，單位為[b]度數[/b]。 - [code]turn_left(degrees)[/code] 與 [code]turn_right(degrees)[/code] 相同，但海龜是逆時針轉動。 你將像之前使用 [code]rotate()[/code] 一樣使用這些函式。 當海龜移動時，它會畫出一條白色的線。我們將用這條線來畫出形狀。 例如，要讓海龜移動 200 像素，你可以寫 [code]move_forward(200)[/code]。

source: The functions [code]turn_left()[/code] and [code]turn_right()[/code] work the same. To turn 45 degrees to the right, you would write [code]turn_right(45)[/code]. If we call [code]turn_right(45)[/code], the turtle turns 45 degrees to the right before moving on to the next instruction.
cs: Funkce [code]turn_left()[/code] a [code]turn_right()[/code] fungují stejně. Chcete-li se otočit o 45 stupňů doprava, napíšete [code]turn_right(45)[/code]. Pokud tedy zavoláme [code]turn_right(45)[/code], želva se před přechodem na další instrukci otočí o 45 stupňů doprava.
de: Die Funktionen [code]turn_left()[/code] und [code]turn_right()[/code] funktionieren auf gleiche Art und Weise. Um 45° sie nach rechts zu drehen, müsstest Du [code]turn_right(45)[/code] schreiben. Wenn wir [code]turn_right(45)[/code] aufrufen, dreht sich die Schildkröte um 45° nach rechts, bevor sie zur nächsten Anweisung übergeht.
es: Las funciones [code]turn_left()[/code] y [code]turn_right()[/code] funcionan de la misma forma. Para girar 45 grados a la derecha, escribirías [code]turn_right(45)[/code]. Si llamamos a [code]turn_right(45)[/code], la tortuga gira 45 grados a la derecha antes de pasar a la siguiente instrucción.
ta: செயல்பாடுகள் [குறியீடு] டர்ன்_லெஃப்ட் () [/குறியீடு] மற்றும் [குறியீடு] டர்ன்_ரைட் () [/குறியீடு] ஒரே மாதிரியாக வேலை செய்கின்றன. 45 டிகிரியை வலதுபுறமாக மாற்ற, நீங்கள் [குறியீடு] டர்ன்_ரைட் (45) [/குறியீடு] ஐ எழுதுவீர்கள். நாம் [குறியீடு] டர்ன்_ரைட் (45) [/குறியீடு] என்று அழைத்தால், அடுத்த அறிவுறுத்தலுக்குச் செல்வதற்கு முன் ஆமை 45 டிகிரி வலதுபுறமாக மாறும்.
zh_hans: [code]turn_left()[/code] 和 [code]turn_right()[/code] 功能相同。 要向右转 45 度，可以编写 [code]turn_right(45)[/code]。 如果我们调用 [code]turn_right(45)[/code]，海龟会向右转 45 度，然后继续执行下一条指令。
zh_hant: [code]turn_left()[/code] 和 [code]turn_right()[/code] 這兩個函式的功能相同。 若要讓海龜向右轉 45 度，你可以寫 [code]turn_right(45)[/code]。 當我們呼叫 [code]turn_right(45)[/code] 時，海龜會先向右轉 45 度，然後再繼續執行接下來的指令。
