Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-7-member-variables.po
Languages: cs, da, de, es, fr, nl, pt_br, ru, ta, uk, zh_hans, zh_hant

source: In this lesson, we take a first look at variables.
da: I denne lektion tager vi et første kig på variabler.
es: En esta lección, le damos un primer vistazo a las variables.
fr: Dans cette leçon, nous jetons un premier coup d'œil aux variables.
pt_br: Nessa lição, vamos dar uma primeira olhada em variáveis.
ru: В этом уроке мы впервые рассмотрим переменные.
ta: இந்த பாடத்தில், மாறிகள் முதல் பார்க்கிறோம்.
uk: У цьому уроці ми вперше розглянемо змінні.

source: In games, you need to keep track of many values that change over time:
da: I spil, skal du holde styr på mange værdier, der ændrer sig over tid:
es: En los juegos, tienes que estar al tanto de muchos valores que cambian con el tiempo:
fr: Dans les jeux, vous devez faire un suivi de nombreuses valeurs qui changent au fil du temps :
pt_br: Nos jogos, você precisa acompanhar muitos valores que mudam ao longo do tempo:
ru: В играх вам нужно отслеживать множество значений, которые меняются с течением времени:
ta: விளையாட்டுகளில், காலப்போக்கில் மாறும் பல மதிப்புகளை நீங்கள் கண்காணிக்க வேண்டும்:
uk: В іграх вам потрібно відстежувати безліч значень, які змінюються з часом:

source: - The player's score. - Every character or enemy's health. - The last checkpoint.
da: - Spillerens score. - Hver figur eller fjendes helbred. - Det sidste checkpoint.
es: - La puntuación del jugador. - La salud de cada personaje o enemigo. - El último checkpoint.
fr: - Le score du joueur. - La santé de chaque personnage ou ennemi. - Le dernier point de contrôle.
pt_br: - A pontuação do jogador. - A vida de cada personagem ou inimigo. - O último ponto de controle (checkpoint).
ru: - Счет игрока. - Здоровье каждого персонажа или врага. - Последнюю контрольную точку.
ta: - வீரரின் மதிப்பெண். - ஒவ்வொரு கதாபாத்திரம் அல்லது எதிரியின் ஆரோக்கியம். - கடைசி சோதனைச் சாவடி.
uk: - Рахунок гравця. - Здоров'я кожного персонажа або ворога. - Останню контрольну точку.

source: And so much more. You need to store, retrieve, and update those values.
da: Og så meget mere. Du skal gemme, hente og opdatere disse værdier.
es: Y mucho más. Necesitas almacenar, recuperar y actualizar esos valores.
fr: Et bien d'autres choses encore. Vous devez stocker, récupérer et mettre à jour ces valeurs.
pt_br: E muito mais. Você precisa armazenar, recuperar e atualizar esses valores.
ru: И многие другие. Вам нужно хранить, извлекать и обновлять эти значения.
ta: மேலும் இன்னும் பல. அந்த மதிப்புகளை நீங்கள் சேமிக்க வேண்டும், மீட்டெடுக்க வேண்டும், புதுப்பிக்க வேண்டும்.
uk: І багато іншого. Вам потрібно зберігати, отримувати та оновлювати ці значення.

source: We call those values [i]variables[/i]. Variables are labels you use to keep track of values that vary over time. Here's an example of a variable tracking a character or monster's health.
da: Vi kalder disse værdier [i]variabler[/i]. Variabler er etiketter, du bruger til at holde styr på værdier, der varierer over tid. Her er et eksempel på en variabel der holder styr på en figur eller monsters liv.
es: Llamamos a esos valores [i]variables[/i]. Las variables son etiquetas que utilizas para hacer un seguimiento de los valores que varían con el tiempo. Aquí hay un ejemplo de una variable que registra la salud de un personaje o monstruo.
fr: Nous appelons ces valeurs [i]variables[/i]. Les variables sont des étiquettes que vous utilisez pour faire un suivi des valeurs qui varient dans le temps. Voici un exemple d'une variable qui trace la santé d'un personnage ou d'un monstre.
pt_br: Chamamos esses valores de [i]variáveis[/i]. Variáveis são nomes que você usa para acompanhar os valores que variam ao longo do tempo. Aqui está um exemplo de uma variável rastreando a vida de um personagem ou monstro.
ru: Мы называем эти значения [i]переменными[/i]. Переменные — это метки, которые вы используете для отслеживания значений, изменяющихся во времени. Вот пример переменной, отслеживающей здоровье персонажа или монстра.
ta: நாங்கள் அந்த மதிப்புகளை [i] மாறிகள் என்று அழைக்கிறோம் [/i]. மாறிகள் என்பது காலப்போக்கில் மாறுபடும் மதிப்புகளைக் கண்காணிக்க நீங்கள் பயன்படுத்தும் லேபிள்கள். ஒரு கதாபாத்திரம் அல்லது அசுரனின் ஆரோக்கியத்தைக் கண்காணிக்கும் ஒரு எடுத்துக்காட்டு இங்கே.
uk: Ми називаємо ці значення [i]змінними[/i]. Змінні — це позначки, які ви використовуєте для відстеження значень, які змінюються з часом. Ось приклад змінної, яка відстежує здоров'я персонажа або монстра.

source: The line above defines a new variable named [code]health[/code] and assigns it a starting value of [code]100[/code] (that's what the equal sign does, more on that below).
da: Linjen ovenfor definerer en ny variabel kaldet [code]health[/code] og tildeler den en startværdi på [code]100[/code] (det er hvad ligmed tegnet gør, mere om det nedenfor).
es: La línea anterior define una nueva variable llamada [code]health[/code] y le asigna un valor inicial de [code]100[/code] (eso es lo que hace el signo igual, hablaremos más sobre eso más adelante).
fr: La ligne ci-dessus définit une nouvelle variable appelée [code]health[/code] et lui attribue une valeur de départ de [code]100[/code] (c'est ce que fait le signe égal, nous y reviendrons plus tard).
pt_br: A linha acima define uma nova variável chamada [code]health[/code] e atribui nela um valor inicial de [code]100[/code] (é isso que o sinal de igual faz, vamos falar mais sobre isso mais abaixo).
ru: Строка выше определяет новую переменную с именем [code]health[/code] и присваивает ей начальное значение [code]100[/code] (подробнее о том, что делает знак равно, будет ниже).
ta: மேலே உள்ள வரி [குறியீடு] உடல்நலம் [/குறியீடு] என்ற புதிய மாறியை வரையறுக்கிறது மற்றும் [குறியீடு] 100 [/குறியீடு] இன் தொடக்க மதிப்பை ஒதுக்குகிறது (அதுதான் சமமான அடையாளம், கீழே உள்ளவற்றில் மேலும்).
uk: Рядок угорі визначає нову змінну з назвою [code]health[/code] і надає їй початкове значення [code]100[/code] (докладніше про те, що робить знак дорівнює, буде нижче).

source: Function parameters, which you saw in the previous lesson, are another example of variables.
da: Funktionsparametre, som du så i den tidligere lektion, er et andet eksempel på variabler.
es: Los parámetros de las funciones, que viste en la lección anterior, son otro ejemplo de variables.
fr: Les paramètres de fonction, que vous avez vus dans la leçon précédente, sont un autre exemple de variables.
pt_br: Parâmetros de função, que você viu na lição anterior, são outro exemplo de variáveis.
ru: Параметры функции, которые вы видели в предыдущем уроке, являются ещё одним примером переменных.
ta: முந்தைய பாடத்தில் நீங்கள் பார்த்த செயல்பாட்டு அளவுருக்கள் மாறிகளின் மற்றொரு எடுத்துக்காட்டு.
uk: Параметри функції, які ви бачили в попередньому уроці, є ще одним прикладом змінних.

source: In this lesson, we start using variables built into Godot. They're a particular kind called [i]member variables[/i].
da: I denne lektion begynder vi at bruge variabler bygget ind i Godot. De er en bestemt type kaldet [i]medlemsvariabler[/i].
es: En esta lección, empezaremos a utilizar las variables integradas en Godot. Son un tipo particular llamado [i]variables miembro[/i].
fr: Dans cette leçon, nous commençons à utiliser des variables intégrées à Godot. Il s'agit d'un type particulier appelé [i]variables membres[/i].
pt_br: Nessa lição, vamos começar a usar variáveis que já estão incorporadas na Godot. Elas são um tipo particular de variáveis chamadas [i]variáveis membro[/i].
ru: В этом уроке мы начнем использовать переменные, встроенные в Godot. Они являются особым видом переменных и называются [i]свойствами[/i].
ta: இந்த பாடத்தில், கோடோட்டில் கட்டப்பட்ட மாறிகளைப் பயன்படுத்தத் தொடங்குகிறோம். அவை [I] உறுப்பினர் மாறிகள் [/i] என்று அழைக்கப்படும் ஒரு குறிப்பிட்ட வகை.
uk: У цьому уроці ми почнемо використовувати змінні, вбудовані в Godot. Це особливий вид змінних, їх називають [i]властивостями[/i].

source: Member variables are values attached to a game entity. They're useful properties like the [code]position[/code], [code]rotation[/code], and [code]scale[/code] of a character.
da: Medlemsvariabler er værdier knyttet til en spilenhed. De er nyttige egenskaber som [code]position[/code], [code]rotation[/code], og [code]skala[/code] af en figur.
es: Las variables miembro son valores adjuntos a una entidad del juego. Son propiedades útiles como la [code]position[/code], la [code]rotation[/code] y la [code]scale[/code] de un personaje.
fr: Les variables membres sont des valeurs attachées à une entité du jeu. Ce sont des propriétés utiles comme la [code]position[/code], la [code]rotation[/code] et la [code]scale[/code] (l'échelle) d'un personnage.
pt_br: Variáveis membro são valores anexados a uma entidade de um jogo. São propriedades úteis como [code]position[/code], [code]rotation[/code] e [code]scale[/code] de um personagem.
ru: Свойства — это значения, привязанные к игровому объекту, например ими являются: положение [code]position[/code], вращение [code]rotation[/code], и масштаб [code]scale[/code] персонажа.
ta: உறுப்பினர் மாறிகள் ஒரு விளையாட்டு நிறுவனத்துடன் இணைக்கப்பட்ட மதிப்புகள். அவை [குறியீடு] நிலை [/குறியீடு], [குறியீடு] சுழற்சி [/குறியீடு] மற்றும் [குறியீடு] அளவு [/குறியீடு] போன்ற பயனுள்ள பண்புகள்.
uk: Властивості - це значення, пов'язані з ігровим об'єктом, наприклад, це: положення [code]position[/code], поворот [code]rotation[/code] і масштаб [code]scale[/code] персонажа.

source: In a previous lesson, we saw how we could use the [code]rotate()[/code] function to rotate our character.
da: I en tidligere lektion så vi, hvordan vi kunne bruge [code]rotate()[/code] funktionen til at rotere vores tegn.
es: En una de las lecciones anteriores, vimos cómo podíamos utilizar la función [code]rotate()[/code] para girar nuestro personaje.
fr: Dans une leçon précédente, nous avons vu comment utiliser la fonction [code]rotate()[/code] pour faire pivoter notre personnage.
pt_br: Em uma lição anterior, vimos como poderíamos usar a função [code]rotate()[/code] para rotacionar nosso personagem.
ru: В предыдущем уроке мы видели, как можно использовать функцию [code]rotate()[/code] для поворота персонажа.
ta: முந்தைய பாடத்தில், எங்கள் பாத்திரத்தை சுழற்ற [குறியீடு] சுழற்சி () [/குறியீடு] செயல்பாட்டை எவ்வாறு பயன்படுத்தலாம் என்பதைக் கண்டோம்.
uk: У попередньому уроці ми бачили, як можна використати функцію [code]rotate()[/code] для повороту персонажа.

source: This function increases or decreases the value of the entity's [code]rotation[/code] member variable.
da: Denne funktion øger eller mindsker værdien af enhedens [code]rotation[/code] medlemsvariabel.
es: Esta función aumenta o disminuye el valor de la variable miembro [code]rotation[/code] de la entidad.
fr: Cette fonction augmente ou diminue la valeur de la variable membre [code]rotation[/code] de l'entité.
pt_br: Esta função aumenta ou diminui o valor da variável membro [code]rotation[/code] da entidade.
ru: Эта функция увеличивает или уменьшает значение свойства [code]rotation[/code] объекта.
ta: இந்த செயல்பாடு நிறுவனத்தின் [குறியீடு] சுழற்சி [/குறியீடு] உறுப்பினர் மாறியின் மதிப்பை அதிகரிக்கிறது அல்லது குறைக்கிறது.
uk: Ця функція збільшує або зменшує значення властивості [code]rotation[/code] об'єкта.

source: Say we want to reset the rotation to [code]0[/code] and make the character upright. Using the [code]rotate()[/code] function can prove difficult: you need to know the character's exact current angle to cancel it out.
da: Hvis nu vi vil nulstille rotationen til [code]0[/code] og gøre figuren oprejst. Brug af funktionen [code]rotate()[/code] kan være vanskelig: du skal kende figurens nøjagtige aktuelle vinkel for at annullere den.
es: Supongamos que queremos restablecer la rotación a [code]0[/code] y hacer que el personaje quede en posición vertical. Utilizar la función [code]rotate()[/code] puede resultar difícil: necesitas saber el ángulo actual exacto del personaje para anularlo.
fr: Disons que nous voulons réinitialiser la rotation à [code]0[/code] et redresser le personnage. Utiliser la fonction [code]rotate()[/code] peut s'avérer difficile : vous devez connaître l'angle actuel exact du personnage pour l'annuler.
pt_br: Digamos que nós queremos redefinir a rotação para [code]0[/code] e deixar o personagem na vertical. Usar a função [code]rotate()[/code] para isso pode ser difícil: você precisaria saber o ângulo atual exato do personagem.
ru: Допустим, мы хотим сбросить угол наклона на [code]0[/code] и вернуть персонажа в вертикальное положение. Использование функции [code]rotate()[/code] может оказаться сложным: для отмены поворота необходимо точно знать текущий угол наклона персонажа.
ta: சுழற்சியை [குறியீடு] 0 [/குறியீடு] க்கு மீட்டமைக்க விரும்புகிறோம் என்று கூறி, எழுத்தை நிமிர்ந்து ஆக்கி செய்யுங்கள். [குறியீடு] சுழற்சி () [/குறியீடு] செயல்பாட்டைப் பயன்படுத்துவது கடினம் என்பதை நிரூபிக்க முடியும்: அதை ரத்து செய்ய பாத்திரத்தின் சரியான தற்போதைய கோணத்தை நீங்கள் அறிந்து கொள்ள வேண்டும்.
uk: Припустимо, ми хочемо скинути кут нахилу на [code]0[/code] і повернути персонажа у вертикальне положення. Використання функції [code]rotate()[/code] може виявитися складним: для скасування повороту потрібно точно знати поточний кут нахилу персонажа.

source: It's much easier to use the member variable rather than the function.
da: Det er meget nemmere at bruge medlemsvariablen i stedet for funktionen.
es: Es mucho más fácil usar la variable miembro en lugar de la función.
fr: Il est beaucoup plus facile d'utiliser la variable membre plutôt que la fonction.
pt_br: É muito mais fácil usar a variável membro em vez da função.
ru: Гораздо проще использовать свойство, а не функцию.
ta: செயல்பாட்டைக் காட்டிலும் உறுப்பினர் மாறியைப் பயன்படுத்துவது மிகவும் எளிதானது.
uk: Значно простіше використовувати властивість, а не функцію.

source: The following code assigns the value [code]0[/code] to the character's rotation, resetting its angle and making it upright.
da: Følgende kode tildeler værdien [code]0[/code] til figurens rotation, nulstiller dens vinkel og gør den oprejst.
es: El siguiente código asigna el valor [code]0[/code] a la rotación del personaje, lo cual restablece su ángulo y pone al personaje en posición vertical.
fr: Le code suivant attribue la valeur [code]0[/code] à la rotation du personnage, ce qui réinitialise son angle et le redresse.
pt_br: O código a seguir atribui o valor [code]0[/code] na rotação do personagem, redefinindo seu ângulo e fazendo ele ficar na vertical.
ru: Следующий код присваивает значение [code]0[/code] свойству персонажа, сбрасывая его угол наклона.
ta: பின்வரும் குறியீடு பாத்திரத்தின் சுழற்சிக்கு [குறியீடு] 0 [/குறியீடு] மதிப்பை ஒதுக்குகிறது, அதன் கோணத்தை மீட்டமைத்து அதை நிமிர்ந்து செய்கிறது.
uk: У цьому коді надаємо значення [code]0[/code] для властивості персонажа, скидаючи його кут повороту.

source: Notice how we use the equal sign ([code]=[/code]) to change the value of a variable.
cs: Všimněte si, že pro změnu hodnoty proměnné používáme znaménko rovnosti ([code]=[/code]).
da: Bemærk hvordan vi bruger lighedstegnet ([code]=[/code]) til at ændre værdien af en variabel.
de: Beachte, wie wir das Gleichheitszeichen ([code]=[/code]) verwenden, um den Wert einer Variablen zu ändern.
es: Fíjate en cómo usamos el signo de igual ([code]=[/code]) para cambiar el valor de una variable.
fr: Remarquez comment nous utilisons le signe égal ([code]=[/code]) pour changer la valeur d'une variable.
nl: Merk op hoe we het gelijkheidsteken ([code]=[/code]) gebruiken om de waarde van een variabele te wijzigen.
pt_br: Observe como usamos o sinal de igual ([code]=[/code]) para mudar o valor de uma variável.
ru: Обратите внимание как мы используем знак равенства ([code]=[/code]) для изменения значения переменной.
ta: மாறியின் மதிப்பை மாற்ற சமமான அடையாளத்தை ([குறியீடு] = [/குறியீடு]) எவ்வாறு பயன்படுத்துகிறோம் என்பதைக் கவனியுங்கள்.
uk: Зверніть увагу, як ми використовуємо знак рівності ([code]=[/code]) для змінення значення змінної.
zh_hans: 请注意我们是如何使用等号 ([code]=[/code]) 来更改变量的值的。
zh_hant: 注意我們如何使用等號 ([code]=[/code]) 來改變變數的值。

source: What's a variable?
cs: Co je proměnná?
da: Hvad er en variabel?
es: ¿Qué es una variable?
fr: Qu'est-ce qu'une variable ?
nl: Wat is een variabele?
pt_br: O que é uma variável?
ru: Что такое переменная?
ta: மாறி என்றால் என்ன?
uk: Що таке змінна?
zh_hans: 什么是变量？
zh_hant: 什麼是變數？

source: Variables are labels you use to access values that change over time.
da: Variabler er etiketter, du bruger til at få adgang til værdier, der ændrer sig over tid.
es: Las variables son etiquetas que utilizas para acceder a valores que cambian con el tiempo.
fr: Les variables sont des étiquettes que vous utilisez pour accéder à des valeurs qui changent au fil du temps.
pt_br: Variáveis são nomes que você usa para acessar valores que mudam ao longo do tempo.
ru: Переменные - это метки, которые вы используете для доступа к значениям, изменяющимся со временем.
ta: மாறிகள் என்பது காலப்போக்கில் மாறும் மதிப்புகளை அணுக நீங்கள் பயன்படுத்தும் லேபிள்கள்.
uk: Змінні - це позначки, які ви використовуєте для доступу до значень, що змінюються з часом.

source: You can also use them to put a name on a value you want to reuse throughout your code. It makes your code easier to read and to change.
da: Du kan også bruge dem til at give et navn til en værdi, du vil genbruge i hele din kode. Det gør din kode nemmere at læse og ændre.
es: También puedes utilizarlas para ponerle un nombre a un valor que quieras reutilizar a lo largo de tu código. Esto hace que tu código sea más fácil de leer y de modificar.
fr: Vous pouvez aussi les utiliser pour mettre un nom sur une valeur que vous souhaiter réutiliser au long de votre code. Cela rend votre code plus facile à lire et à modifier.
pt_br: Você também pode usar as variáveis para colocar um nome em um valor que você deseja reutilizar em todo o código. Isso torna seu código mais fácil de ler e alterar.
ru: Вы также можете использовать их, чтобы дать имя значению, которое вы хотите повторно использовать во всем коде. Это облегчает чтение и изменение кода.
ta: உங்கள் குறியீடு முழுவதும் நீங்கள் மீண்டும் பயன்படுத்த விரும்பும் மதிப்பில் ஒரு பெயரை வைக்க அவற்றைப் பயன்படுத்தலாம். இது உங்கள் குறியீட்டை எளிதாக படிக்கவும் மாற்றவும் செய்கிறது.
uk: Також їх можна використати, щоб дати назву значенню, яке ви хочете повторно використовувати в усьому коді. Це полегшує читання та змінювання коду.

source: A label you use to keep track of a value that can change.
cs: Štítek/značka, který se používá ke sledování hodnoty, která se může měnit.
da: En etiket du bruger til at holde styr på en værdi, der kan ændre sig.
de: Eine Bezeichnung, die Du verwendest, um einen Wert nachzuverfolgen, der sich ändern kann.
es: Es una etiqueta que se utiliza para hacer un seguimiento de un valor que puede cambiar.
fr: Une étiquette que vous utilisez pour suivre une valeur qui peut changer.
nl: Een label dat je gebruikt om een waarde bij te houden die kan veranderen.
pt_br: Um nome que você usa para acompanhar um valor que pode mudar.
ru: Метка для отслеживания значения, которое может меняться.
ta: மாற்றக்கூடிய மதிப்பைக் கண்காணிக்க நீங்கள் பயன்படுத்தும் சிட்டை.
uk: Позначка для стеження за значенням, яке може змінюватись.
zh_hans: 一个标签，用于跟踪可更改的值。
zh_hant: 一個用來追蹤可能會變動的值的標籤。

source: A function that varies over time.
cs: Funkce, která se v čase mění.
da: En funktion, der varierer over tid.
es: Una función que varía con el tiempo.
fr: Une fonction qui varie dans le temps.
nl: Een functie die varieert in de tijd.
pt_br: Uma função que varia ao longo do tempo.
ru: Функция, которая изменяется с течением времени.
ta: காலப்போக்கில் மாறுபடும் ஒரு செயல்பாடு.
uk: Функція, яка змінюється з часом.
zh_hans: 随时间变化的函数。
zh_hant: 隨時間變化的函式。

source: A decimal number.
cs: Desetinné číslo.
da: Et decimaltal.
es: Un número decimal.
fr: Un nombre décimal.
nl: Een kommagetal.
pt_br: Um número decimal.
ru: Десятичная дробь.
ta: ஒரு தசம எண்.
uk: Десятковий дріб.
zh_hans: 一个小数。
zh_hant: 一個小數。

source: Accessing sub-variables with the dot
cs: Přístup k dílčím(podřízeným) proměnným pomocí tečky
da: Adgang til undervariabler med punktum
de: Auf Untervariablen mit dem Punkt zugreifen
es: Acceder a subvariables con el punto
fr: Accéder aux sous-variables avec le point
nl: Deelvariabelen gebruiken door middel van de punt
pt_br: Acessando sub-variáveis com o sinal de ponto final
ru: Использование точки для получения доступа ко вложенным переменным
ta: புள்ளியுடன் துணை மாறிகள் அணுகும்
uk: Використання крапки для доступу до вкладених змінних
zh_hans: 使用一个点号访问子变量
zh_hant: 透過點符號（"."）存取子變數

source: In video games, you will see many member variables that have sub-values.
da: I videospil vil du se mange medlemsvariabler, der har underværdier.
es: En los videojuegos, verás muchas variables miembro que tienen subvalores.
fr: Dans les jeux vidéo, vous verrez de nombreuses variables membres qui ont des sous-valeurs.
pt_br: Nos jogos, você vai ver muitas variáveis membro que possuem sub-valores.
ru: В видеоиграх вы увидите множество свойств, которые имеют вложенные значения.
ta: வீடியோ கேம்களில், துணை மதிப்புகளைக் கொண்ட பல உறுப்பினர் மாறிகளைக் காண்பீர்கள்.
uk: У відеоіграх ви побачите багато властивостей, які мають вкладені значення.

source: For example, the [code]position[/code] we mentioned has two coordinates: [code]x[/code] and [code]y[/code].
da: For eksempel, [code]position[/code], vi nævnte, har to koordinater: [code]x[/code] og [code]y[/code].
es: Por ejemplo, la [code]position[/code] que mencionamos tiene dos coordenadas: [code]x[/code] y [code]y[/code].
fr: Par exemple, la [code]position[/code] que nous avons mentionnée a deux coordonnées : [code]x[/code] et [code]y[/code].
pt_br: Por exemplo, a [code]position[/code] que mencionamos tem duas coordenadas: [code]x[/code] e [code]y[/code].
ru: Например, упомянутая нами позиция [code]position[/code] имеет две координаты: [code]x[/code] и [code]y[/code].
ta: எடுத்துக்காட்டாக, நாங்கள் குறிப்பிட்டுள்ள [குறியீடு] நிலை [/குறியீடு] இரண்டு ஒருங்கிணைப்புகளைக் கொண்டுள்ளது: [குறியீடு] ஃச் [/குறியீடு] மற்றும் [குறியீடு] ஒய் [/குறியீடு].
uk: Наприклад, згадане положення [code]position[/code] має дві координати: [code]x[/code] і [code]y[/code].

source: It's the same for the [code]scale[/code]: it has [code]x[/code] and [code]y[/code] sub-variables. They respectively control the horizontal and vertical size of the game entity.
da: Det er det samme for [code]scale[/code]: den har undervariablerne [code]x[/code] og [code]y[/code]. De styrer henholdsvis den vandrette og lodrette størrelse af spillets entitet.
es: Lo mismo ocurre con la [code]scale[/code]: tiene subvariables [code]x[/code] y [code]y[/code]. Controlan respectivamente el tamaño horizontal y vertical de la entidad del juego.
fr: Il en va de même pour la [code]scale[/code] (l'échelle) : elle a les sous-variables [code]x[/code] et [code]y[/code]. Elles contrôlent respectivement la taille horizontale et verticale de l'entité du jeu.
pt_br: É o mesmo para a [code]scale[/code]: tem as sub-variáveis [code]x[/code] e [code]y[/code]. Elas controlam respectivamente o tamanho horizontal e vertical da entidade do jogo.
ru: То же самое касается масштаба [code]scale[/code]: у него есть вложенные переменные [code]x[/code] и [code]y[/code]. Они управляют горизонтальным и вертикальным размером игрового объекта соответственно.
ta: [குறியீடு] அளவுகோல் [/குறியீடு] க்கு இது ஒன்றே: இது [குறியீடு] ஃச் [/குறியீடு] மற்றும் [குறியீடு] ஒய் [/code] துணை மாறுபாடுகளைக் கொண்டுள்ளது. அவை முறையே விளையாட்டு நிறுவனத்தின் கிடைமட்ட மற்றும் செங்குத்து அளவை கட்டுப்படுத்துகின்றன.
uk: Це стосується й масштабу [code]scale[/code]: він має вкладені змінні [code]x[/code] і [code]y[/code]. Вони керують, відповідно, горизонтальним та вертикальним розмірами ігрового об'єкта.
