Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-18-for-loops.po
Languages: da, de, es, it, ja, nl, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: In the last lesson, we looked at [code]while[/code] loops. We found they were useful if we don't know how many times we should repeat code.
da: I den forrige lektion så vi på [code]while[/code] loops. Vi så de var nyttige, hvis vi ikke ved, hvor mange gange vi skal gentage kode.
ja: 前回のレッスンでは、[code]while[/code] ループについて説明しました。コードを何回繰り返すべきかわからない場合に便利であることがわかりました。
nl: In de vorige les hebben we gekeken naar [code]while[/code]-lussen. We ontdekten dat ze handig zijn als we niet weten hoe vaak we code moeten herhalen.
pt_br: Na última lição, vimos os loops [code]while[/code]. Descobrimos que eles são úteis se não soubermos quantas vezes devemos repetir o código.
ta: கடைசி பாடத்தில், [/குறியீடு] சுழலும் போது [குறியீட்டை] பார்த்தோம். குறியீட்டை எத்தனை முறை மீண்டும் செய்ய வேண்டும் என்று எங்களுக்குத் தெரியாவிட்டால் அவை பயனுள்ளதாக இருக்கும் என்று நாங்கள் கண்டறிந்தோம்.
tr: Son derste, [code]while[/code] döngülerine bakmıştık. Kodu kaç kez tekrarlamamız gerektiğini bilmediğimiz durumlarda yararlı olduklarını gördük.
uk: У минулому уроці ми розглянули цикли [code]while[/code]. Ми виявили, що вони корисні, якщо ми не знаємо, скільки разів слід повторювати код.

source: However, they could result in infinite loops if we're not careful.
da: Men de kunne resultere i uendelige loops, hvis vi ikke var forsigtig.
ja: ただし、注意しないと無限ループになる可能性があります。
nl: Ze kunnen echter leiden tot oneindige lussen als we niet voorzichtig zijn.
pt_br: No entanto, eles podem resultar em loops infinitos se a gente não tomar cuidado.
ta: இருப்பினும், நாங்கள் கவனமாக இல்லாவிட்டால் அவை எல்லையற்ற சுழல்களை ஏற்படுத்தக்கூடும்.
tr: Ancak, dikkatli olmazsak sonsuz döngülere neden olabiliyorlar.
uk: Однак вони можуть призвести до нескінченних циклів, якщо ми не будемо обережні.

source: The loop below never ends because we never increment [code]number[/code].
da: Løkken slutter aldrig, fordi vi aldrig forøger [code]nummer[/code].
ja: [code]number[/code]をインクリメントしないため、以下のループは決して終わりません。
nl: De lus hieronder eindigt nooit omdat we [code]number[/code] nooit verhogen.
pt_br: O loop abaixo nunca termina porque nunca incrementamos a variável [code]number[/code].
ta: கீழே உள்ள வளையம் ஒருபோதும் முடிவடையாது, ஏனென்றால் நாங்கள் ஒருபோதும் [குறியீடு] எண்ணை அதிகரிக்கவில்லை [/குறியீடு].
tr: Aşağıdaki döngü asla sona ermez çünkü [code]number[/code] değişkenini arttırmıyoruz.
uk: Наведений нижче цикл ніколи не закінчується, тому що ми ніколи не збільшуємо [code]число[/code].

source: There's a safer and often easier kind of loop: the [code]for[/code] loop.
da: Der findes en sikrere og ofte nemmere type løkke: [code]for[/code]-løkken.
ja: より安全で、多くの場合、より簡単な種類のループがあります: [code]for[/code] ループです。
nl: Er is een veiliger en vaak eenvoudiger soort lus: de [code]for[/code]-lus.
pt_br: Existe um tipo de loop mais seguro e geralmente mais fácil: o loop [code]for[/code].
ta: பாதுகாப்பான மற்றும் பெரும்பாலும் எளிதான வகையான வளையம் உள்ளது: [/குறியீடு] வளையத்திற்கான [குறியீடு].
tr: Daha güvenli ve genellikle daha kolay bir döngü türü vardır: [code]for[/code] (... için) döngüsü.
uk: Існує безпечніший і часто простіший вид циклу: цикл [code]for[/code].

source: We'll look at it in this lesson.
da: Vi vil se på den i denne lektion.
ja: このレッスンで見ていきます。
nl: Daar zullen we in deze les naar kijken.
pt_br: Vamos ver ele nessa lição.
ta: இந்த பாடத்தில் அதைப் பார்ப்போம்.
tr: Bu derste buna bakacağız.
uk: Ми розглянемо це на цьому уроці.

source: Unlike [code]while[/code] loops, [code]for[/code] loops don't run infinitely, so it's much less likely that you'll get bugs in your game. [b]We recommend favoring for loops over while loops because of this[/b].
da: I modsætning til [code]while[/code]-løkker kører [code]for[/code]-løkker ikke uendeligt, så det er meget mindre sandsynligt, at du får fejl i dit spil. [b]Vi anbefaler at foretrække for-løkker frem for while-løkker på grund af dette[/b].
ja: [code]while[/code] ループとは異なり、[code]for[/code] ループは無限に実行されないため、ゲームにバグが発生する可能性がはるかに低くなります。[b]このため、while ループよりも for ループを優先することをお勧めします[/b]。
nl: In tegenstelling tot [code]while[/code]-lussen, lopen [code]for[/code]-lussen niet oneindig door, dus het is veel minder waarschijnlijk dat je bugs in je spel krijgt. [b]We raden daarom aan om for-lussen te verkiezen boven while-lussen[/b].
pt_br: Ao contrário dos loops [code]while[/code], os loops [code]for[/code] não são executados infinitamente, então é muito menos provável que você tenha bugs em seu jogo. [b]Recomendamos que você dê preferência ao loop for ao invés do loop while por causa disso[/b].
ta: [/குறியீடு] ஐப் போலல்லாமல், [/குறியீடு] சுழல்கள், [/குறியீடு] சுழல்களுக்கான [குறியீடு] எண்ணற்ற அளவில் இயங்காது, எனவே உங்கள் விளையாட்டில் பிழைகள் கிடைக்கும் வாய்ப்பு மிகக் குறைவு. [b] இதன் காரணமாக சுழல்களின் போது சுழல்களுக்கு சாதகமாக பரிந்துரைக்கிறோம் [/b].
tr: [code]while[/code] döngülerinin aksine, [code]for[/code] döngüleri sonsuza kadar çalışmaz, bu nedenle oyununda hata oluşma olasılığı çok daha düşüktür. [b]Bu nedenle while döngüleri yerine for döngülerini tercih etmenizi öneririz[/b].
uk: На відміну від циклів [code]while[/code], цикли [code]for[/code] не працюють нескінченно, тому набагато менша ймовірність того, що у вашій грі виникнуть помилки. [b]Ми рекомендуємо віддавати перевагу циклам for замість циклів while через це[/b].

source: Let's change the code above to use a [code]for[/code] loop instead.
da: Lad os ændre koden ovenfor til at bruge en [code]for[/code]-løkke i stedet.
ja: 代わりに [code]for[/code] ループを使用するように上記のコードを変更しましょう。
nl: Laten we de bovenstaande code aanpassen en een [code]for[/code]-lus gebruiken.
pt_br: Vamos alterar o código acima para usar um loop [code]for[/code].
ta: அதற்கு பதிலாக [/குறியீடு] வளையத்திற்கு [குறியீடு] பயன்படுத்த மேலே உள்ள குறியீட்டை மாற்றுவோம்.
tr: Yukarıdaki kodu, [code]for[/code] döngüsünü kullanacak şekilde değiştirelim.
uk: Давайте змінимо наведений вище код, щоб замість нього використовувати цикл [code]for[/code].

source: The loop below will change the [code]cell[/code] three times.
da: Løkken nedenfor vil ændre [code]cell[/code] tre gange.
ja: 以下のループは、[code]cell[/code]を3回変更します。
nl: De onderstaande lus zal de [code]cel[/code] drie keer veranderen.
pt_br: O loop abaixo vai mudar a [code]cell[/code] três vezes.
ta: கீழே உள்ள லூப் [குறியீடு] கலத்தை [/குறியீடு] மூன்று முறை மாற்றும்.
tr: Aşağıdaki döngü hücre değişkenini, [code]cell[/code], üç kez değiştirecektir.
uk: Цикл нижче тричі змінить [code]комірку[/code].

source: Let's explain what's going on here.
da: Lad os forklare, hvad der foregår her.
de: Lass uns erklären, was hier vor sich geht.
es: Vamos a explicar lo que está ocurriendo aquí.
it: Spieghiamo cosa succede qui.
ja: ここで何が起こっているのかを説明しましょう。
nl: Laten we uitleggen wat hier gebeurt.
pt_br: Vamos explicar o que está acontecendo aqui.
ru: Давайте рассмотрим, что здесь происходит.
ta: இங்கே என்ன நடக்கிறது என்பதை விளக்குவோம்.
tr: Burada neler olduğunu açıklayalım.
uk: Давайте пояснимо, що тут відбувається.
zh_hans: 让我们解释一下这里发生了什么。
zh_hant: 讓我們解釋一下這裡發生了什麼。

source: The range() function
da: Funktionen range()
de: Die range() Funktion
es: La función range()
it: La funzione range()
ja: range() 関数
nl: De functie range()
pt_br: A função range()
ru: Функция range()
ta: வரம்பு () செயல்பாடு
tr: range() fonksiyonu
uk: Функція range()
zh_hans: range()函数
zh_hant: range() 函式

source: Godot has the helper function [code]range()[/code]. Calling [code]range(n)[/code] creates a list of numbers from [code]0[/code] to [code]n - 1[/code].
da: Godot har hjælpefunktionen [code]range()[/code]. Kald af [code]range(n)[/code] opretter en liste med tal fra [code]0[/code] til [code]n - 1[/code].
ja: Godotにはヘルパー関数[code]range()[/code]があります。[code]range(n)[/code] を呼び出すと、[code]0[/code] から [code]n - 1[/code] までの数値のリストが作成されます。
nl: Godot heeft de helperfunctie [code]range()[/code]. Het aanroepen van [code]range(n)[/code] levert een lijst op van getallen van [code]0[/code] tot [code]n - 1[/code].
pt_br: A Godot tem a função auxiliar [code]range()[/code]. Chamar [code]range(n)[/code] cria uma lista de números que começa em [code]0[/code] e vai até [code]n - 1[/code].
ta: கோடோட் உதவி செயல்பாடு [குறியீடு] வரம்பு () [/குறியீடு] ஐக் கொண்டுள்ளது. [குறியீடு] வரம்பு (n) [/குறியீடு] ஐ அழைப்பது [குறியீடு] 0 [/குறியீடு] இலிருந்து [குறியீடு] N - 1 [/குறியீடு] வரை எண்களின் பட்டியலை உருவாக்குகிறது.
tr: Godot, [code]range()[/code] yardımcı fonksiyonu ile gelir. [code]range(n)[/code] çağrısı, [code]0[/code] ile [code]n - 1[/code] arasında tam sayılardan oluşan bir liste oluşturur.
uk: Godot має допоміжну функцію [code]range()[/code]. Виклик [code]range(n)[/code] створює список чисел від [code]0[/code] до [code]n - 1[/code].

source: So calling [code]range(3)[/code] outputs the list of numbers [code][0, 1, 2][/code], and [code]range(5)[/code] outputs [code][0, 1, 2, 3, 4][/code].
da: Så kald af [code]range(3)[/code] giver listen med tal [code][0, 1, 2][/code], og [code]range(5)[/code] giver [code][0, 1, 2, 3, 4][/code].
ja: したがって、[code]range(3)[/code]を呼び出すと数値のリストが出力されます[code][0, 1, 2][/code]、[code]range(5)[/code]は[code][0, 1, 2, 3, 4][/code]を出力します。
nl: Dus [code]range(3)[/code] aanroepen geeft de lijst met getallen [code][0, 1, 2][/code], en [code]range(5)[/code] geeft de lijst met getallen [code][0, 1, 2, 3, 4][/code].
pt_br: Então, chamar [code]range(3)[/code] vai gerar a lista de números [code][0, 1, 2][/code] e chamar [code]range(5)[/code] vai gerar [code][ 0, 1, 2, 3, 4][/code].
ta: எனவே [குறியீடு] வரம்பு (3) [/குறியீடு] ஐ அழைப்பது எண்களின் பட்டியலை [குறியீடு] [0, 1, 2] [/குறியீடு], மற்றும் [குறியீடு] வரம்பு (5) [/குறியீடு] வெளியீடுகள் [குறியீடு] [ 0, 1, 2, 3, 4] [/குறியீடு].
tr: Yani, [code]range(3)[/code] çağrısı [code][0, 1, 2][/code] sayı listesi, ve [code]range(5)[/code] çağrısı [code][0, 1, 2, 3, 4][/code] sayı listesi çıktılarını verir.
uk: Отже, виклик [code]range(3)[/code] виводить список чисел [code][0, 1, 2][/code], а [code]range(5)[/code] виводить [code][ 0, 1, 2, 3, 4][/code].

source: What list of numbers would range(6) create?
da: Hvilken liste af tal vil range(6) oprette?
de: Welche Liste von Zahlen würde range(6) erstellen?
es: ¿Qué lista de números crearía range(6)?
it: Quale lista di numeri creerebbe range(6)?
ja: range(6)はどのような数値のリストを作成しますか?
nl: Welke lijst van getallen zou range(6) opleveren?
pt_br: Que lista de números a função range(6) criaria?
ru: Какой список чисел создаст вызов range(6)?
ta: எண்களின் எந்த பட்டியல் வரம்பை உருவாக்கும் (6) உருவாக்கும்?
tr: range(6) hangi sayı listesini oluşturur?
uk: Який список чисел створить діапазон (6)?
zh_hans: range(6) 会创建什么数字列表？
zh_hant: range(6) 會創建什麼數字列表？

source: What would [code]print(range(6))[/code] print to the console?
da: Hvad ville [code]print(range(6))[/code] udskrive til konsollen?
de: Was würde [code]print(range(6))[/code] in der Konsole ausgeben?
es: ¿Qué imprimiría [code]print(range(6))[/code] en la consola?
it: Cosa stamperebbe [code]print(range(6))[/code] sulla console?
ja: [code]print(range(6))[/code]はコンソールに何を出力しますか?
nl: Wat zou [code]print(range(6))[/code] weergeven op de console?
pt_br: O que [code]print(range(6))[/code] imprimiria no console?
ru: Что [code]print(range(6))[/code] выведет в консоль?
ta: [குறியீடு] அச்சு (வரம்பு (6)) [/குறியீடு] கன்சோலுக்கு அச்சிடும்?
tr: [code]print(range(6))[/code] çağrısı, ekrana ne yazdırırdı?
uk: Що [code]print(range(6))[/code] буде друкувати на консолі?
zh_hans: [code]print(range(6))[/code] 会在控制台打印什么？
zh_hant: [code]print(range(6))[/code] 會在控制台顯示什麼？

source: The function [code]range(n)[/code] creates a list of numbers from [code]0[/code] to [code]n - 1[/code]. The output list will start with [code]0[/code] and end with [code]5[/code].
da: Funktionen [code]range(n)[/code] opretter en liste med tal fra [code]0[/code] til [code]n - 1[/code]. Outputlisten starter med [code]0[/code] og slutter med [code]5[/code].
ja: 関数 [code]range(n)[/code] は、[code]0[/code] から [code]n - 1[/code] までの数値のリストを作成します。出力リストは [code]0[/code] で始まり、[code]5[/code] で終わります。
nl: De functie [code]range(n)[/code] produceert een lijst met getallen van [code]0[/code] tot [code]n - 1[/code]. Deze lijst zal beginnen met [code]0[/code] en eindigen met [code]5[/code].
pt_br: A função [code]range(n)[/code] cria uma lista de números que começa com [code]0[/code] e vai até [code]n - 1[/code]. Essa lista vai começar com [code]0[/code] e vai terminar com [code]5[/code].
ta: செயல்பாடு [குறியீடு] வரம்பு (n)[/குறியீடு] [குறியீடு] 0 [/குறியீடு] இலிருந்து [குறியீடு] N - 1 [/குறியீடு] வரை எண்களின் பட்டியலை உருவாக்குகிறது. வெளியீட்டு பட்டியல் [குறியீடு] 0 [/குறியீடு] உடன் தொடங்கி [குறியீடு] 5 [/குறியீடு] உடன் முடிவடையும்.
tr: [code]range(n)[/code] fonksiyonu, [code]0[/code] ile [code]n - 1[/code] arasında bir sayı listesi oluşturur. Çıktı listesi [code]0[/code] ile başlayacak ve [code]5[/code] ile bitecektir.
uk: Функція [code]range(n)[/code] створює список чисел від [code]0[/code] до [code]n - 1[/code]. Список результатів буде починатися з [code]0[/code] і закінчуватися [code]5[/code].

source: So calling [code]range(6)[/code] will output a list of six numbers which are [code][0, 1, 2, 3, 4, 5][/code].
da: Så kald af [code]range(6)[/code] vil generere en liste med seks tal, som er [code][0, 1, 2, 3, 4, 5][/code].
ja: したがって、[code]range(6)[/code]を呼び出すと、[code][0, 1, 2, 3, 4, 5][/code]の6つの数値のリストが出力されます。
nl: Als je dus [code]range(6)[/code] aanroept, krijg je dus een lijst met zes getallen, namelijk [code][0, 1, 2, 3, 4, 5][/code].
pt_br: Então, chamar [code]range(6)[/code] vai produzir uma lista de seis números que são [code][0, 1, 2, 3, 4, 5][/code].
ta: எனவே [குறியீடு] வரம்பு (6) [/குறியீடு] ஐ அழைப்பது [குறியீடு] [0, 1, 2, 3, 4, 5] [/குறியீடு] ஆறு எண்களின் பட்டியலை வெளியிடும்.
tr: Bu nedenle [code]range(6)[/code] çağrısı, [code][0, 1, 2, 3, 4, 5][/code] şeklinde altı sayıdan oluşan bir liste çıktısı verecektir.
uk: Отже, виклик [code]range(6)[/code] виведе список із шести чисел, які є [code][0, 1, 2, 3, 4, 5][/code].

source: How for loops work
da: Hvordan for-løkker virker
de: Funktionsweise von for-Schleifen
es: Cómo funcionan los bucles for
it: Come funziona il ciclo for
ja: for ループのしくみ
nl: Hoe for-lussen werken
pt_br: Como funcionam os loops for
ru: Как работают циклы for
ta: சுழல்கள் எவ்வாறு செயல்படுகின்றன
tr: for döngüleri nasıl çalışır
uk: Як працюють цикли for
zh_hans: for 循环是怎么工作的
zh_hant: for 循環是如何運作的

source: In a [code]for[/code] loop, the computer takes each value inside a list, stores it in a temporary variable, and executes the code in the loop once per value.
da: I et [code]for[/code]-løkke tager computeren hver værdi i en liste, gemmer den i en midlertidig variabel og udfører koden i løkken én gang pr. værdi.
de: In einer [code]for[/code]-Schleife nimmt der Computer jeden Wert in einer Liste, speichert ihn in einer temporären Variable und führt den Code in der Schleife einmal pro Wert aus.
es: En un bucle [code]for[/code], la computadora toma cada valor dentro de una lista, lo almacena en una variable temporal y ejecuta el código del bucle una vez por valor.
it: In un ciclo [code]for[/code], il computer prende ogni valore nella lista, lo conserva in una variabile temporanea ed esegue il codice nel ciclo una volta per ogni valore.
ja: [code]for[/code] ループでは、コンピューターはリスト内の各値を取得し、それを一時変数に格納し、値ごとにループ内のコードを 1 回実行します。
nl: In een [code]for[/code]-lus neemt de computer elke waarde in een lijst, slaat deze op in een tijdelijke variabele en voert de code in de lus één keer per waarde uit.
pt_br: Em um loop [code]for[/code], o computador pega cada valor dentro de uma lista, armazena ele em uma variável temporária e executa o código dentro do bloco do loop uma vez por valor.
ru: При выполнении цикла [code]for[/code] компьютер берёт значение из списка, сохраняет его во временной переменной и выполняет код тела цикла по одному разу для каждого значения.
ta: [/குறியீடு] வளையத்திற்கான [குறியீடு] இல், கணினி ஒவ்வொரு மதிப்பையும் ஒரு பட்டியலுக்குள் எடுத்து, தற்காலிக மாறியில் சேமித்து, ஒரு மதிப்புக்கு ஒரு முறை சுழற்சியில் குறியீட்டை இயக்குகிறது.
tr: Bir [code]for[/code] döngüsünde, bilgisayar bir liste içindeki her değeri alır, geçici bir değişkende saklar ve döngüdeki kodu değer başına bir kez çalıştırır.
uk: У циклі [code]for[/code] комп’ютер приймає кожне значення зі списку, зберігає його в тимчасовій змінній і виконує код у циклі один раз для кожного значення.
zh_hans: 在一个 [code]for[/code] 循环中，计算机获取列表中的每个值，将其存储在临时变量中，并针对每个值都执行一次循环中的代码。
zh_hant: 在 [code]for[/code] 迴圈中，電腦會將列表中的每個值取出，儲存到一個暫時變數中，並針對每個值執行一次迴圈中的程式碼。

source: In the above example, for each item in the list [code][0, 1, 2][/code], Godot sets [code]number[/code] to the item, then executes the code in the [code]for[/code] loop.
da: I ovenstående eksempel, for hvert genstand i listen [code][0, 1, 2][/code] sætter Godot [code]number[/code] til genstanden og udfører derefter koden i [code]for[/code]-løkken.
ja: 上記の例では、リスト[code][0, 1, 2][/code]の各項目について、Godotは[code]number[/code]を項目に設定し、[code]for[/code]ループでコードを実行します。
nl: In het bovenstaande voorbeeld stelt Godot voor elk element in de lijst [code][0, 1, 2][/code] de variabele [code]nummer[/code] in op dat element en voert vervolgens de code uit in de [code]for[/code]-lus.
pt_br: No exemplo acima, para cada item na lista [code][0, 1, 2][/code], a Godot define [code]number[/code] para o item, então executa o código dentro do bloco do loop [code]for[/code].
ta: மேலே உள்ள எடுத்துக்காட்டில், பட்டியலில் உள்ள ஒவ்வொரு பொருளுக்கும் [குறியீடு] [0, 1, 2] [/குறியீடு], கோடோட் [குறியீடு] எண்ணை [/குறியீடு] உருப்படிக்கு அமைக்கிறது, பின்னர் [குறியீட்டில்] குறியீட்டை இயக்குகிறது [/குறியீடு] லூப்.
tr: Yukarıdaki örnekte Godot, [code][0, 1, 2][/code] listesindeki her bir öğe için, [code]number[/code] (sayı) değişkenini o öğeye ayarlar, ve ardından [code]for[/code] döngüsündeki kodu çalıştırır.
uk: У наведеному вище прикладі для кожного елемента в списку [code][0, 1, 2][/code] Годо встановлює [code]номер[/code] для елемента, а потім виконує код у [code]для [/code] цикл.

source: We'll explain arrays more thoroughly in the next lesson, but notice that [code]number[/code] is just a temporary variable. You create it when defining the loop, and the loop takes care of changing its value. Also, you can name this variable anything you want.
da: Vi vil forklare arrays mere grundigt i den næste lektion, men bemærk, at [code]number[/code] blot er en midlertidig variabel. Du opretter den, når du definerer løkken, og løkken sørger for at ændre dens værdi. Du kan navngive denne variabel, hvad du vil.
ja: 配列については次のレッスンで詳しく説明しますが、[code]number[/code] は単なる一時変数であることに注意してください。ループを定義するときに作成し、ループが値の変更を処理します。また、この変数には任意の名前を付けることができます。
nl: We zullen arrays uitgebreider uitleggen in de volgende les, maar merk op dat [code]number[/code] slechts een tijdelijke variabele is. Je maakt hem aan wanneer je de lus definieert en de lus zorgt ervoor dat de waarde verandert. Je kunt de variabelennaam noemen zoals jij wilt.
pt_br: Vamos explicar arrays mais afundo na próxima lição, mas perceba que [code]number[/code] é apenas uma variável temporária. Você a cria ao definir o loop, e o loop muda seu valor por conta própria. Você também pode mudar o nome dessa varável para o que você quiser.
ta: அடுத்த பாடத்தில் வரிசைகளை இன்னும் முழுமையாக விளக்குவோம், ஆனால் [குறியீடு] எண் [/குறியீடு] ஒரு தற்காலிக மாறி என்பதை கவனியுங்கள். வளையத்தை வரையறுக்கும் போது நீங்கள் அதை உருவாக்குகிறீர்கள், மேலும் அதன் மதிப்பை மாற்றுவதை வளையம் கவனித்துக்கொள்கிறது. மேலும், இந்த மாறியை நீங்கள் விரும்பும் எதையும் பெயரிடலாம்.
tr: Dizileri bir sonraki derste daha ayrıntılı olarak açıklayacağız, ancak [code]number[/code] değişkeninin sadece geçici bir değişken olduğuna dikkat ediniz. Onu, döngüyü tanımlarken oluşturursunuz ve onun değerini değiştirmek döngünün görevi olur. Ayrıca, bu değişkene istediğiniz ismi verebilirsiniz.
uk: Ми докладніше пояснимо масиви в наступному уроці, але зауважте, що [code]число[/code] — це лише тимчасова змінна. Ви створюєте його під час визначення циклу, а цикл піклується про зміну свого значення. Крім того, ви можете назвати цю змінну як завгодно.

source: This code behaves the same as the previous example:
da: Denne kode opfører sig på samme måde som det foregående eksempel:
ja: このコードは、前の例と同じように動作します。
nl: Deze code werkt hetzelfde als het vorige voorbeeld:
pt_br: Esse código se comporta da mesma forma que o exemplo anterior:
ta: இந்த குறியீடு முந்தைய எடுத்துக்காட்டு போலவே செயல்படுகிறது:
tr: Bu kod, önceki örnekle aynı şekilde davranır:
uk: Цей код працює так само, як і попередній приклад:

source: In both examples, we print the value of the temporary variable we created: [code]number[/code] in the first example and [code]element[/code] in the second.
da: I begge eksempler udskriver vi værdien af den midlertidige variabel, vi oprettede: [code]number[/code] i det første eksempel og [code]element[/code] i det andet.
ja: どちらの例でも、作成した一時変数の値を出力します: 最初の例では [code]number[/code]、2 番目の例では [code]element[/code]。
nl: In beide voorbeelden tonen we de waarde van de tijdelijke variabele die we hebben gemaakt: [code]number[/code] in het eerste voorbeeld en [code]element[/code] in het tweede.
pt_br: Em ambos os exemplos, nós imprimimos o valor da variável temporária que criamos: [code]number[/code] no primeiro exemplo e [code]element[/code] no segundo.
ta: இரண்டு எடுத்துக்காட்டுகளிலும், நாங்கள் உருவாக்கிய தற்காலிக மாறியின் மதிப்பை அச்சிடுகிறோம்: [குறியீடு] எண் [/குறியீடு] முதல் எடுத்துக்காட்டில் மற்றும் [குறியீடு] உறுப்பு [/குறியீடு] இரண்டாவதாக.
tr: Her iki örnekte de, oluşturduğumuz geçici değişkenin değerini yazdırıyoruz: ilk örnekte [code]number[/code] (sayı) ve ikincisinde [code]element[/code] (öğe).
uk: В обох прикладах ми друкуємо значення створеної нами тимчасової змінної: [code]number[/code] у першому прикладі та [code]element[/code] у другому.

source: As Godot moves through the loop, it assigns each value of the array to that variable. First, it sets the variable to [code]0[/code], then to [code]1[/code], and finally, to [code]2[/code].
da: Når Godot bevæger sig gennem løkken, tildeler den hver værdi i arrayet til den pågældende variabel. Først sætter den variablen til [code]0[/code], derefter til [code]1[/code] og endelig til [code]2[/code].
ja: Godotがループ内を移動すると、配列の各値がその変数に割り当てられます。最初に変数を [code]0[/code] に設定し、次に [code]1[/code] に設定し、最後に [code]2[/code] に設定します。
nl: Terwijl Godot door de lus loopt, wordt elke waarde van de array toegewezen aan die variabele. Eerst stelt hij de variabele in op [code]0[/code], dan op [code]1[/code] en ten slotte op [code]2[/code].
pt_br: Conforme a Godot percorre o loop, ela atribui cada valor da array para esta variável. Primeiro, ela atribui a variável para [code]0[/code], depois para [code]1[/code], e, por fim, para [code]2[/code].
ta: கோடோட் வளையத்தின் வழியாக நகரும்போது, அது வரிசையின் ஒவ்வொரு மதிப்பையும் அந்த மாறிக்கு ஒதுக்குகிறது. முதலில், இது மாறியை [குறியீடு] 0 [/குறியீடு] ஆகவும், பின்னர் [குறியீடு] 1 [/குறியீடு] ஆகவும், இறுதியாக, [குறியீடு] 2 [/குறியீடு] ஆகவும் அமைக்கிறது.
tr: Godot döngüyü yinelerken, dizinin her bir değerini o değişkene atar. İlk olarak değişkeni [code]0[/code], ardından [code]1[/code] ve son olarak [code]2[/code] olarak ayarlar.
uk: Під час проходження циклу Годо присвоює кожне значення масиву цій змінній. Спочатку він встановлює змінну на [code]0[/code], потім на [code]1[/code] і, нарешті, на [code]2[/code].
