Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-15-modulo.po
Languages: es

source: The modulo operation ([code]%[/code]) calculates the remainder of a whole number division. For example, the modulo of [code]5[/code] by [code]3[/code] ([code]5 % 3[/code]) is [code]2[/code]. We typically use this operation to tell if a number is odd or even or to produce a random number within a particular range (like a dice roll). Play around with the modulo widget on the right to see how modulo works visually.
es: La operación módulo ([code]%[/code]) calcula el resto (también llamado "residuo") de una división de números enteros. Por ejemplo, el módulo de [code]5[/code] entre [code]3[/code] ([code]5 % 3[/code]) es [code]2[/code]. Por lo general, usamos esta operación para saber si un número es par o impar o para producir un número aleatorio dentro de un rango determinado (como un lanzamiento de dados). Juega con el widget de módulo de la derecha para ver cómo funciona visualmente el módulo.

source: What's the result of this modulo operation?
es: ¿Cuál es el resultado de esta operación módulo?

source: [code]11[/code] divided by [code]4[/code] is [code]2[/code], and the [b]remainder[/b] of the division is [code]3[/code]. So [code]11 % 4[/code] is [code]3[/code].
es: [code]11[/code] dividido entre [code]4[/code] es [code]2[/code], y el [b]resto[/b] de la división es [code]3[/code]. Así que [code]11 % 4[/code] es [code]3[/code].

source: The modulo operation only works on [b]whole numbers[/b]; Not decimal numbers. Also, just like in regular divisions, the divisor can't be zero. All three examples below will cause an error in your code.
es: La operación módulo sólo funciona con [b]números enteros[/b]; no con números decimales. Además, al igual que en las divisiones normales, el divisor no puede ser cero. Los tres ejemplos a continuación provocarían un error en tu código.

source: Three ways we use the modulo operation
es: Tres formas en que usamos la operación módulo

source: The modulo operation has important uses in programming, like making a number cycle. Take a traffic light, for example.
es: La operación módulo tiene usos importantes en programación, como hacer un ciclo de números. Tomemos un semáforo como ejemplo.

source: We use the number [code]light_index[/code] to represent the traffic light's current state. The lights always cycle in the same way: first, we have the red light, then the yellow, then the green. To represent that cycle, you can periodically add one to the number and use the modulo operator to wrap back to [code]0[/code]. Instead, you could use a condition; In this case, we use the modulo as a shortcut.
es: Utilizamos el número [code]light_index[/code] para representar el estado actual del semáforo. Las luces siempre tienen el mismo ciclo: primero tenemos la luz roja, luego la amarilla y después la verde. Para representar ese ciclo, puedes añadirle periódicamente uno al número y utilizar el operador módulo para volver a [code]0[/code]. En su lugar, podrías usar una condición; en este caso, utilizamos el módulo como atajo.

source: In computer code, we very often count from [code]0[/code]. Every number translates to a precise combination of bits in the machine, starting from [code]0[/code]. We don't want to waste any number, and as the first number the computer knows about is [code]0[/code], we start counting from [code]0[/code].
es: En el código informático, muy a menudo contamos a partir del [code]0[/code]. Cada número se traduce en una combinación precisa de bits en la máquina, comenzando desde el [code]0[/code]. No queremos desperdiciar ningún número, y como el primer número que conoce la computadora es el [code]0[/code], empezamos a contar a partir del [code]0[/code].

source: Using modulo to find even and odd numbers
es: Utilizar el módulo para encontrar números pares e impares

source: We can also use a modulo to check if a number is even or odd. If we divide a number by [code]2[/code] and there's no remainder, then the number is [b]even[/b].
es: También podemos utilizar un módulo para comprobar si un número es par o impar. Si dividimos un número por [code]2[/code] y no queda ningún resto, entonces el número es [b]par[/b].

source: Notice how the modulo can be larger than the number it affects. For example, [code]1 % 2[/code] gives you [code]1[/code]. That's because [code]1[/code] divided by [code]2[/code] equals [code]0[/code], and the remainder is [code]1[/code]. Like with divisions, the only case you can't use modulo is with a divisor of [code]0[/code].
es: Observa que el módulo puede ser mayor que el número al que afecta. Por ejemplo, [code]1 % 2[/code] te da [code]1[/code]. Eso es porque [code]1[/code] dividido entre [code]2[/code] es igual a [code]0[/code], y el resto es [code]1[/code]. Al igual que con las divisiones, el único caso en el que no puedes utilizar el módulo es con un divisor de [code]0[/code].

source: Calculating a random number within a range
es: Calcular un número aleatorio dentro de un rango

source: We can use the modulo to simulate dice rolls. To do so, we generate a large random number and use the modulo operator to limit the number's range. To generate a random whole number, you can call the [code]randi()[/code] function. The name stands for random integer. The number the function generates can be huge: roughly up to 2 billion on an Android device and around 10^18 on a 64-bit computer. You can use the modulo operation to limit the random number's range.
es: Podemos utilizar el módulo para simular tiradas de dados. Para ello, generamos un número aleatorio grande y utilizamos el operador módulo para limitar el rango del número. Para generar un número entero aleatorio, puedes llamar a la función [code]randi()[/code]. El nombre significa número entero aleatorio. El número que genera la función puede ser enorme: aproximadamente hasta 2.000 millones en un dispositivo Android y alrededor de 10^18 en un ordenador de 64 bits. Puede utilizar la operación módulo para limitar el rango del número aleatorio.

source: The result is also random because we use the modulo operation on a random number. In the following practices, you'll use a modulo to advance traffic lights, add maximum health to the robot on every odd level, and learn how to code dice rolls.
es: El resultado también es aleatorio porque utilizamos la operación módulo sobre un número aleatorio. En las siguientes prácticas, utilizarás un módulo para cambiar las luces de los semáforos, añadirle salud máxima al robot en cada nivel impar y aprender cómo codificar un lanzamiento de dados.

source: Advancing Traffic Lights
es: Cambiar las luces de los semáforos

source: Add to the [code]advance_traffic_light()[/code] function so the [code]light_index[/code] variable increments by one, then wraps back to [code]0[/code] if it gets too high. Use the modulo operator [code]%[/code] to make sure the value of [code]light_index[/code] wraps back to [code]0[/code]. The value of [code]light_index[/code] should only ever be [code]0[/code], [code]1[/code], or [code]2[/code].
es: Añade código a la función [code]advance_traffic_light()[/code] para que la variable [code]light_index[/code] aumente en uno, y luego vuelva a [code]0[/code] si sube demasiado. Utiliza el operador módulo [code]%[/code] para asegurarte de que el valor de [code]light_index[/code] vuelva a [code]0[/code]. El valor de [code]light_index[/code] sólo debe ser [code]0[/code], [code]1[/code] o [code]2[/code].

source: Learn how to use modulo to wrap a number back to zero using traffic lights.
es: Aprende a utilizar el módulo para hacer que un número vuelva a cero usando semáforos.

source: Rolling Dice
es: Lanzamiento de dados

source: Our dice rolling function doesn't work! Right now, it always gives the result of how many sides the dice has: 20. Use [code]randi()[/code] to generate a random number and the modulo operation [code]%[/code]. Using the [code]return[/code] keyword inside the function, return a random number between [code]1[/code] and [code]sides[/code].
es: ¡Nuestra función de lanzamiento de dados no funciona! En este momento, siempre da el resultado de cuántos lados tiene el dado: 20. Utiliza [code]randi()[/code] para generar un número aleatorio y la operación módulo [code]%[/code]. Utilizando la palabra clave [code]return[/code] dentro de la función, devuelve un número aleatorio entre [code]1[/code] y [code]sides[/code] (el número de lados).

source: Whether in a board game or video game, getting a random number is always useful. Here, we create a function that simulates a dice roll.
es: Tanto en un juego de mesa como en un videojuego, obtener un número aleatorio siempre es útil. Aquí, creamos una función que simula un lanzamiento de dados.

source: Bonus Health Every Other Level
es: Bonificación de salud cada dos niveles

source: Change the [code]level_up()[/code] function so it does the following: 1) Increment [code]level[/code] by [code]1[/code] 2) Increase [code]max_health[/code] by [code]5[/code] 3) If [code]level[/code] is [b]even[/b], increase [code]max_health[/code] by an additional [code]5[/code] The robot starts with [code]100[/code] maximum health. It will gain three levels when you run the code. At level 4, the robot should have [code]125[/code] maximum health.
es: Cambia la función [code]level_up()[/code] para que haga lo siguiente: 1) Aumente el [code]level[/code] en [code]1[/code] 2) Aumente la [code]max_health[/code] en [code]5[/code] 3) Si el [code]level[/code] es [b]par[/b], aumente la [code]max_health[/code] en [code]5[/code] adicionales El robot comienza con [code]100[/code] de salud máxima. Ganará tres niveles cuando ejecutes el código. En el nivel 4, el robot debería tener [code]125[/code] de salud máxima.

source: There are other ways to increase maximum health. You could use a modulo to give a bonus every even level. Learn how here!
es: Hay otras formas de aumentar la salud máxima. Puedes utilizar un módulo para dar una bonificación cada nivel par. ¡Aprende cómo hacerlo aquí!

source: Modulo
es: Módulo
