Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-5-your-first-function.po
Languages: cs, da, de, es, fr, it, pt, ta, uk, zh_hant

source: Code a function named [code]draw_square()[/code] to draw one square of length 200 pixels. The function should take no parameters. Use the [code]move_forward()[/code] and [code]turn_right()[/code] functions to instruct the turtle. In the following practice, you'll use the [code]draw_square()[/code] function to draw multiple squares by calling your own function.
de: Schreibe eine Funktion mit dem Namen [code]draw_square()[/code], um ein Quadrat mit einer Länge von 200 Pixeln zu zeichnen. Die Funktion sollte keine Parameter annehmen. Verwende die Funktionen [code]move_forward()[/code] und [code]turn_right()[/code], um die Schildkröte zu bewegen. In der folgenden Übung verwendest Du die Funktion [code]draw_square()[/code], um mehrere Quadrate zu zeichnen, indem Du deine eigene Funktion aufrufst.
fr: Codez une fonction nommée [code]draw_square()[/code] pour dessiner un carré de 200 pixels de long. La fonction ne doit prendre aucun paramètre. Utilisez les fonctions [code]move_forward()[/code] et [code]turn_right()[/code] pour donner des instructions à la tortue. Dans l'exercice suivant, vous allez utiliser la fonction [code]draw_square()[/code] pour dessiner plusieurs carrés en appelant votre propre fonction.
ta: ஒரு சதுர நீளம் 200 படப்புள்ளிகள் வரைய [குறியீடு] டிரா_ச்குவேர் () [/குறியீடு] என்ற செயல்பாட்டை குறியீடு. செயல்பாடு அளவுருக்கள் எடுக்கக்கூடாது. ஆமை அறிவுறுத்துவதற்கு [CODE] MOVE_FORWARD () [/code] மற்றும் [குறியீடு] டர்ன்_ரைட் () [/குறியீடு] செயல்பாடுகளைப் பயன்படுத்தவும். பின்வரும் நடைமுறையில், உங்கள் சொந்த செயல்பாட்டை அழைப்பதன் மூலம் பல சதுரங்களை வரைய [குறியீடு] டிரா_ச்குவேர் () [/குறியீடு] செயல்பாட்டைப் பயன்படுத்துவீர்கள்.
uk: Напишіть функцію з назвою [code]draw_square()[/code] щоб намалювати один квадрат зі стороною 200 пікселів. Функція не повинна приймати параметрів. Для керування черепашкою скористайтеся функціями [code]move_forward()[/code] і [code]turn_right()[/code]. У наступній практичній вправі, ви використаєте власну функцію [code]draw_square()[/code] для створення кількох квадратів.
zh_hant: 請寫一個名為 [code]draw_square()[/code] 的函式，讓海龜畫出一個邊長為 200 像素的正方形。該函式不應該接受任何參數。 使用 [code]move_forward()[/code] 和 [code]turn_right()[/code] 函式來控制海龜。 在接下來的練習中，你將透過呼叫自己寫的 [code]draw_square()[/code] 函式來畫出多個正方形。

source: You have a function to draw one square: [code]draw_square()[/code]. Use it to draw three squares. We already created [code]draw_square()[/code] for you. Create a function named [code]draw_three_squares[/code] that calls [code]draw_square()[/code] three times. If you just call the function, all three squares will overlap. To stack them diagonally, call [code]jump(300, 300)[/code] between two calls to [code]draw_square()[/code]. Calling [code]jump(300, 300)[/code] makes the turtle jump by 300 pixels to the right and 300 pixels down without drawing any lines.
de: Du hast eine Funktion, um ein Quadrat zu zeichnen: [code]draw_square()[/code]. Verwende es, um drei Quadrate zu zeichnen. Wir haben bereits [code]draw_square()[/code] für Dich erstellt. Erstelle eine Funktion mit dem Namen [code]draw_three_squares[/code], die [code]draw_square()[/code] dreimal aufruft. Wenn Du nur die Funktion aufrufst, überlappen sich alle drei Quadrate. Um sie diagonal zu stapeln, rufe [code]jump(300, 300)[/code] zwischen zwei Aufrufen von [code]draw_square()[/code] auf. Ruft man [code]jump(300, 300)[/code] auf, springt die Schildkröte um 300 Pixel nach rechts und 300 Pixel nach unten, ohne Linien zu zeichnen.
fr: Vous avez une fonction pour dessiner un carré : [code]draw_square()[/code]. Utilisez-la pour dessiner trois carrés. Nous avons déjà créé [code]draw_square()[/code] pour vous. Créez une fonction appelée [code]draw_three_squares[/code] qui appelle [code]draw_square()[/code] trois fois. Si vous appelez simplement la fonction, les trois carrés se superposeront. Pour les empiler en diagonale, appelez [code]jump(300, 300)[/code] entre deux appels à [code]draw_square()[/code]. En appelant [code]jump(300, 300)[/code], la tortue fait un saut de 300 pixels vers la droite et de 300 pixels vers le bas sans dessiner de lignes.
ta: ஒரு சதுரத்தை வரைய உங்களிடம் ஒரு செயல்பாடு உள்ளது: [குறியீடு] draw_square () [/code]. மூன்று சதுரங்களை வரைய இதைப் பயன்படுத்தவும். உங்களுக்காக [குறியீடு] டிரா_ச்குவேர் () [/குறியீடு] ஐ நாங்கள் ஏற்கனவே உருவாக்கியுள்ளோம். [குறியீடு] [குறியீடு] [குறியீடு] Draw_square () [/code] ஐ மூன்று முறை அழைக்கும் என்ற செயல்பாட்டை உருவாக்கவும். நீங்கள் செயல்பாட்டை அழைத்தால், மூன்று சதுரங்களும் ஒன்றுடன் ஒன்று இருக்கும். அவற்றை குறுக்காக அடுக்கி வைக்க, [குறியீடு] [குறியீடு] சம்ப் (300, 300) [/குறியீடு] ஐ [குறியீடு] Draw_square () [/code] க்கு இரண்டு அழைப்புகளுக்கு இடையில் அழைக்கவும். அழைப்பை [குறியீடு] சம்ப் (300, 300) [/குறியீடு] ஆமை 300 படப்புள்ளிகள் வலதுபுறமாகவும், 300 படப்புள்ளிகள் எந்த வரிகளையும் வரையவில்லை.
uk: Ви маєте функцію для того, щоб намалювати один квадрат: [code]draw_square()[/code]. Скористайтеся нею, щоб намалювати три квадрати. Ми вже створили для вас [code]draw_square()[/code]. Створіть функцію з назвою [code]draw_three_squares[/code], котра тричі викликає [code]draw_square()[/code]. Якщо ви просто викличете функцію, всі три квадрати будуть намальовані один поверх одного. Щоб розмістити їх по діагоналі, між викликами [code]draw_square()[/code] викличте [code]jump(300, 300)[/code]. Виклик [code]jump(300,300)[/code] змушує черепашку стрибнути на 300 пікселів праворуч та 300 пікселів униз, без малювання нових ліній.
zh_hant: 你已經有了一個畫正方形的函式：[code]draw_square()[/code]。現在請用它來畫三個正方形。 我們已經為你創建了[code]draw_square()[/code]。現在，請創建一個名為 [code]draw_three_squares[/code] 的函式，這個函式會呼叫 [code]draw_square()[/code] 三次。 如果你只是直接呼叫這個函式，所有三個正方形會重疊在一起。為了讓它們對角疊放，請在兩次呼叫 [code]draw_square()[/code] 之間，呼叫 [code]jump(300, 300)[/code]。 呼叫 [code]jump(300, 300)[/code] 會讓烏龜跳躍 300 像素到右邊和下移 300 像素，而且不會畫出任何線條。
