Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-21-strings.po
Languages: cs, da, es, it, ja, nl, pt_br, ru, ta, tr, uk, zh_hant

source: In this practice, we'll chain together animations using an array of strings. You might find such combinations in fighting games.
cs: V tomto cvičení budeme řetězit animace pomocí pole řetězců. S takovými kombinacemi se můžete setkat v bojových hrách.
da: I denne øvelse vil vi kæde animationer sammen ved hjælp af en række strenge. Du kan finde sådanne kombinationer i kampspil.
it: In questa pratica, concateneremo le animazioni utilizzando un array di stringhe. Queste combinazioni si possono trovare nei giochi di combattimento.
ja: この演習では、文字列の配列を使用してアニメーションを連鎖させます。格闘ゲームではこのような組み合わせが見られるかもしれません。
nl: In deze oefening rijgen we animaties aan elkaar met behulp van een array van strings. Zulke combinaties vind je misschien in vechtspellen.
pt_br: Nessa prática, vamos encadear animações usando um array de strings. Você pode encontrar esse tipo de combinações em jogos de luta.
ru: В этом упражнении мы объединим анимации вместе, при помощи массива строк. Вы можете встретить такие комбинации в играх — файтингах.
ta: இந்த நடைமுறையில், சரங்களின் வரிசையைப் பயன்படுத்தி அனிமேசன்களை ஒன்றிணைப்போம். சண்டை விளையாட்டுகளில் இதுபோன்ற சேர்க்கைகளை நீங்கள் காணலாம்.
tr: Bu alıştırmada, bir dizeler dizisi kullanarak, hareketli görüntüleri (animasyon) birbirine zincirleyeceğiz. Bu tür birleşik hareketleri dövüş oyunlarında bulabilirsiniz.
uk: У цій практиці ми об’єднаємо анімації за допомогою масиву рядків. Ви можете зустріти такі комбінації в файтингах.

source: The robot has the following animation names:
cs: Robot má následující názvy animací:
da: Robotten har følgende animationsnavne:
it: Il robot ha i seguenti nomi di animazione:
ja: ロボットには、次のアニメーション名があります。
nl: De robot heeft de volgende animatienamen:
pt_br: O robô tem animações com os seguintes nomes:
ru: Робот имеет несколько именованных анимаций:
ta: ரோபோவில் பின்வரும் அனிமேசன் பெயர்கள் உள்ளன:
tr: Robot, aşağıdaki animasyon isimlerine sahiptir:
uk: Робот має такі назви анімації:

source: - [code]jab[/code] (makes the robot perform a quick punch) - [code]uppercut[/code] (the robot uses a powerful jumping punch)
cs: - [code]jab[/code] (robot provede rychlý úder). - [code]uppercut[/code] (robot použije silný úder ve výskoku)
da: - [code]jab[/code] (får robotten til at udføre et hurtigt slag) - [code]uppercut[/code] (robotten bruger et kraftigt hoppende slag)
it: - [code]jab[/code] (fa eseguire al robot un pugno veloce) - [code]uppercut[/code] (il robot esegue un potente pugno in salto)
ja: - [code]jab[/code] (ロボットにクイックパンチを実行させる) - [code]uppercut[/code](ロボットは強力なジャンピングパンチを使用します)
nl: - [code]jab[/code] (laat de robot een snelle stoot uitvoeren) - [code]uppercut[/code] (de robot gebruikt een krachtige springstoot)
pt_br: - [code]jab[/code] (faz o robô dar um soco rápido) - [code]uppercut[/code] (o robô usa um poderoso soco enquanto pula)
ru: - [code]jab[/code] (робот делает быстрый удар рукой) - [code]uppercut[/code] (робот использует мощный удар рукой в прыжке)
ta: - [குறியீடு] சப் [/குறியீடு] (ரோபோ விரைவான பஞ்சைச் செய்ய வைக்கிறது) - [குறியீடு] மேல்நிலை [/குறியீடு] (ரோபோ ஒரு சக்திவாய்ந்த சம்பிங் பஞ்சைப் பயன்படுத்துகிறது)
tr: - [code]jab[/code] (yumruk, robotun hızlı bir yumruk atmasını sağlar) - [code]uppercut[/code] (aparkat, robot güçlü bir zıplama yumruğu kullanır)
uk: - [code]джеб[/code] (змушує робота виконувати швидкий удар) - [code]аперкот[/code] (робот використовує потужний удар у стрибку)

source: Populate the combo array with animation names as strings.
cs: Naplňte pole combo názvy animací jako řetězce.
da: Udfyld kombinationsarrayet med animationsnavne som strenge.
it: Popolare l'array combo con i nomi delle animazioni come stringhe.
ja: コンボ配列にアニメーション名を文字列として設定します。
nl: Vul de combinatie-array met animatienamen als strings.
pt_br: Preencha o array de combos com os nomes das animação como strings.
ru: Заполните массив комбинации строковыми именами анимаций.
ta: அனிமேசன் பெயர்களுடன் காம்போ வரிசையை சரங்களாக விரிவுபடுத்துங்கள்.
tr: Animasyon isimlerini dize şeklinde kullanıp, birleşik hareket dizisini, combo, doldurun.
uk: Заповніть комбінований масив іменами анімацій у вигляді рядків.

source: Then, for each action in the array, call the [code]play_animation()[/code] function to play them.
cs: Pak pro každou akci v poli zavolejte funkci [code]play_animation()[/code], aby se přehrála.
da: For hver handling i arrayet skal du derefter kalde funktionen [code]play_animation()[/code] for at afspille dem.
it: Quindi, per ogni azione nell'array, chiamare la funzione [code]play_animation()[/code] per riprodurla.
ja: 次に、配列内のアクションごとに、[code]play_animation()[/code]関数を呼び出して再生します。
nl: Roep dan voor elke actie in de array de functie [code]play_animation()[/code] aan om ze af te spelen.
pt_br: Em seguida, para cada ação no array, chame a função [code]play_animation()[/code] para reproduzi-las.
ru: Затем, для каждого действия в массиве, вызовите функцию [code]play_animation()[/code] для их запуска.
ta: பின்னர், வரிசையில் உள்ள ஒவ்வொரு செயலுக்கும், அவற்றை இயக்க [குறியீடு] Play_animation () [/code] செயல்பாட்டை அழைக்கவும்.
tr: Ardından, dizideki her eylem için [code]play_animation()[/code] (oynat_animayson) fonksiyonunu çağırarak bunları oynatın.
uk: Потім для кожної дії в масиві викличте функцію [code]play_animation()[/code], щоб відтворити їх.

source: The array should contain three values, so the robot makes these three attacks: two jabs followed by one uppercut.
cs: Pole by mělo obsahovat tři hodnoty, takže robot provede tyto tři útoky: [code]jab, jab, uppercut[/code].
da: Arrayet skal indeholde tre værdier, så robotten udfører disse tre angreb: to jabs efterfulgt af en uppercut.
it: L'array deve contenere tre valori, quindi il robot esegue questi tre attacchi: due diretti seguiti da un montante.
ja: 配列には 3 つの値が含まれている必要があるため、ロボットは 2 つのジャブと 1 つのアッパーカットの 3 つの攻撃を行います。
nl: De array moet drie waarden bevatten, zodat de robot deze drie aanvallen uitvoert: twee snelle stoten gevolgd door een springstoot.
pt_br: O array deve conter três valores, para que o robô faça esses três ataques: dois "jabs" seguidos por um "uppercut".
ru: Массив должен содержать три значения, так робот совершает три атаки: два удара (jab), за которыми следует один апперкот (uppercut).
ta: வரிசையில் மூன்று மதிப்புகள் இருக்க வேண்டும், எனவே ரோபோ இந்த மூன்று தாக்குதல்களையும் செய்கிறது: இரண்டு சப்கள் அதைத் தொடர்ந்து ஒரு மேல்நிலை.
tr: Robotun şu üç saldırıyı yapması için, dizinin içinde üç tane değer olmalıdır: iki yumruk ve ardından bir aparkat.
uk: Масив має містити три значення, тому робот виконує ці три атаки: два удари, а потім один аперкот.

source: Define an array of strings to unleash a powerful combo.
cs: Definujte pole řetězců, abyste mohli spustit silné kombo.
da: Definer et array af strenge for at udløse en kraftfuld kombination.
es: Define una matriz de cadenas para desencadenar un poderoso combo.
it: Definisci un array di stringhe per rilasciare una poderosa combo.
ja: 文字列の配列を定義して、強力なコンボを解き放ちます。
nl: Definieer een array van strings om een krachtige combo te ontketenen.
pt_br: Defina um array de strings para liberar um combo poderoso.
ru: Определите массив строк для выполнения мощного комбо.
ta: ஒரு சக்திவாய்ந்த காம்போவை கட்டவிழ்த்து விட சரங்களின் வரிசையை வரையறுக்கவும்.
tr: Güçlü bir birleşik hareket ortaya çıkarmak için bir dize dizisi tanımlayın.
uk: Визначте масив рядків, щоб розв’язати потужне комбо.
zh_hant: 定義一個字串陣列來發動強力的組合攻擊。

source: Strings
cs: Řetězce
da: Strenge
es: Cadenas
it: Stringhe
ja: 文字列
ru: Строки
ta: சரங்கள்
tr: Dizeler
uk: рядки
zh_hant: 字串

source: Throughout this course, we've mostly stored numbers in variables. But what if we wanted to store a player's name? This is where strings help us. Strings are instrumental in games and applications. We use them to display information such as the description of a spell or the name of a character.
es: A lo largo de este curso, hemos almacenado principalmente números en variables. Pero, ¿y si quisiéramos almacenar el nombre de un jugador? Aquí es donde nos ayudan las cadenas. Las cadenas son fundamentales en los juegos y las aplicaciones. Las utilizamos para mostrar información como la descripción de un hechizo o el nombre de un personaje.
zh_hant: 在前面課程中，我們大多數時間都將數字儲存在變數中。但如果我們想要儲存玩家的名字該怎麼辦？ 這就是字串發揮作用的地方。 字串在遊戲和應用程式中非常重要。我們使用字串來顯示資訊，例如法術的描述或角色的名字。

source: A [code]String[/code] is a value type which holds text. To create a [code]String[/code], you write text wrapped in quotation marks ([code]""[/code]). For example: [code]"This is a text string."[/code] The quotation marks differentiate strings from other value types and function names. You may remember we've used strings before in previous lessons.
es: Una cadena, o [code]String[/code], es un tipo de valor que contiene texto. Para crear una [code]String[/code], escribes un texto entre comillas ([code]""[/code]). Por ejemplo: [code]"Esto es una cadena de texto."[/code] Las comillas diferencian las cadenas de otros tipos de valores y nombres de funciones. Quizá recuerdes que ya hemos utilizado cadenas en lecciones anteriores.
zh_hant: [code]String[/code] 是一種值類型，用來儲存文字。要創建一個 [code]String[/code]，你只需要將文字包裹在引號中 ([code]""[/code])。例如：[code]"這是一個文字字串。"[/code] 引號將字串與其他值類型和函式名稱區分開來。 你可能還記得在之前的課程中我們曾經使用過字串。

source: [code]"1"[/code] and [code]"name"[/code] are strings. [code]"1"[/code] only contains a character and [i]doesn't[/i] represent the number [code]1[/code]. [code]"name"[/code] is made up of four different characters.
es: [code]"1"[/code] y [code]"nombre"[/code] son cadenas. [code]"1"[/code] sólo contiene un carácter y [i]no[/i] representa el número [code]1[/code]. [code]"nombre"[/code] está formado por seis caracteres diferentes.
zh_hant: [code]"1"[/code] 和 [code]"name"[/code] 都是字串。 [code]"1"[/code] 僅包含一個字符，而且[b]不是[/b]代表數字 [code]1[/code]。 [code]"name"[/code] 由四個不同的字符組成。

source: Every piece of text you see in this app is a string that Godot is displaying for us. Much like how [code]Vector2[/code] variables make calculations easier, [code]string[/code] variables come with many helper functions and tricks we can use. We can use arrays to store strings too. This is useful for chaining animations. In this example, the [code]play_animation()[/code] plays a specific animation.
es: Cada trozo de texto que ves en esta aplicación es una cadena que Godot está mostrando para nosotros. Parecido a como las variables [code]Vector2[/code] facilitan los cálculos, las variables de cadena vienen con muchas funciones auxiliares y trucos que podemos utilizar. También podemos usar matrices para almacenar cadenas. Esto es útil para encadenar animaciones. En este ejemplo, la función [code]play_animation()[/code] reproduce una animación específica.
zh_hant: 這個應用程式中所看到的每一段文字都是 Godot 顯示給我們的字串。 就像 [code]Vector2[/code] 變數使計算變得更簡單一樣， [code]string[/code] 變數也提供了許多我們可以使用的輔助函式和技巧。 我們也可以使用陣列來儲存字串。這對於串接動畫非常有用。在這個範例中， [code]play_animation()[/code] 會播放特定的動畫。

source: Currently, the robot has a number stored in the [code]robot_name[/code] variable. Change the [code]robot_name[/code] variable so that it's a string instead. You can give it any name you'd like.
es: Actualmente, el robot tiene un número almacenado en la variable [code]robot_name[/code] Cambia la variable [code]robot_name[/code] para que sea una cadena en su lugar. Puedes darle el nombre que quieras.
zh_hant: 目前，機器人將一個數字儲存在 [code]robot_name[/code] 變數中。 將 [code]robot_name[/code] 變數改為字串。你可以隨便給它一個名字。

source: In this practice, we'll chain together animations using an array of strings. You might find such combinations in fighting games. The robot has the following animation names: - [code]jab[/code] (makes the robot perform a quick punch) - [code]uppercut[/code] (the robot uses a powerful jumping punch) Populate the combo array with animation names as strings. Then, for each action in the array, call the [code]play_animation()[/code] function to play them. The array should contain three values, so the robot makes these three attacks: two jabs followed by one uppercut.
zh_hant: 在這個練習中，我們將使用字串陣列將動畫串接起來。你可能會在格鬥遊戲中看到這樣的組合。 機器人有以下動畫名稱： - [code]jab[/code]（讓機器人使用快速刺拳） - [code]uppercut[/code]（機器人使用強力的上勾拳） 將連續技動畫名稱作為字串放入陣列。 然後對陣列中的每個動作，呼叫 [code]play_animation()[/code] 函式來播放這些動畫。 陣列應包含三個值，讓機器人執行這三個攻擊：兩次 [code]jab[/code] 之後跟著一次 [code]uppercut[/code]。
