Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-22-functions-return-values.po
Languages: cs, da, de, es, it, ja, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: The [code]lerp()[/code] function, short for [i]linear interpolate[/i], calculates and returns a weighted average between two values. It takes three arguments: the two values to average and a value between [code]0.0[/code] and [code]1.0[/code] to skew the result. In game programming, it's used to animate things moving towards a target with a single line of code.
cs: Funkce [code]lerp()[/code], zkratka pro [i]lineární interpolaci[/i], vypočítá a vrátí vážený průměr mezi dvěma hodnotami. Přijímá tři argumenty: dvě krajní hodnoty, které určují rozsah interpolace, a váhový koeficient mezi [code]0.0[/code] a [code]1.0[/code], který určuje, jak blízko má být výsledná hodnota k první nebo druhé krajní hodnotě. V herním programování se používá k animaci pohybu objektů směrem k cíli pomocí jediného řádku kódu.
pt: A função [code]lerp()[/code], abreviação de [i]interpolação linear[/i], calcula e retorna uma média entre dois valores. Três argumentos são necessários: os dois valores para a média e um valor entre [code]0.0[/code] e [code]1.0[/code] para distorcer o resultado. Em programação para jogos, é usado para animar coisas que se movem em direção a um alvo com uma única linha de código.
ta: . இது மூன்று வாதங்களை எடுக்கிறது: இரண்டு மதிப்புகள் சராசரிக்கு மற்றும் [குறியீடு] 0.0 [/குறியீடு] மற்றும் [குறியீடு] 1.0 [/குறியீடு] க்கு இடையிலான மதிப்பு. விளையாட்டு நிரலாக்கத்தில், ஒற்றை வரி குறியீட்டைக் கொண்டு இலக்கை நோக்கி நகரும் விசயங்களை உயிரூட்டுவதற்கு இது பயன்படுகிறது.
uk: Функція [code]lerp()[/code], скорочення від [i]linear interpolate[/i], обчислює та повертає середнє зважене між двома значеннями. Потрібно три аргументи: два значення для усереднення та значення між [code]0.0[/code] і [code]1.0[/code] для спотворення результату. У програмуванні ігор він використовується для анімації речей, що рухаються до цілі, за допомогою одного рядка коду.
zh_hant: [code]lerp()[/code] 函式（線性插值的縮寫）計算並回傳兩個數值之間的加權平均值。 它接受三個引數：要計算平均值的兩個數值，以及一個介於 [code]0.0[/code] 和 [code]1.0[/code] 之間的數值來調整結果的偏向程度。 在遊戲程式設計中，這個函式常用於讓物件以單行程式碼平滑地移動至目標位置。

source: Every frame, the code calculates a position somewhere between the turtle and the mouse cursor. The [code]lerp()[/code] function takes care of everything. It's not the most robust approach for smooth movement, as you'll learn in the future, but it's a helpful function nonetheless.
cs: Každý snímek kód vypočítá pozici někde mezi želvou a kurzorem myši. O vše se postará funkce [code]lerp()[/code]. Není to nejrobustnější přístup pro plynulý pohyb, jak se dozvíte v budoucnu, ale přesto je to užitečná funkce.
pt: A cada frame, o código calcula uma posição em algum lugar entre a tartaruga e o cursor do rato. A função [code]lerp()[/code] faz isso tudo por ela mesma. Não é a abordagem mais robusta para movimentos suaves, como vai aprender no futuro, mas ainda assim é uma função útil.
ta: ஒவ்வொரு சட்டகமும், குறியீடு ஆமை மற்றும் மவுச் கர்சருக்கு இடையில் எங்காவது ஒரு நிலையை கணக்கிடுகிறது. [குறியீடு] லெர்ப் () [/குறியீடு] செயல்பாடு எல்லாவற்றையும் கவனித்துக்கொள்கிறது. இது மென்மையான இயக்கத்திற்கான மிகவும் வலுவான அணுகுமுறை அல்ல, ஏனெனில் நீங்கள் எதிர்காலத்தில் கற்றுக்கொள்வீர்கள், ஆனால் இது ஒரு பயனுள்ள செயல்பாடு.
uk: Кожен кадр код обчислює позицію десь між черепахою та курсором миші. Функція [code]lerp()[/code] подбає про все. Це не найнадійніший підхід для плавного руху, як ви дізнаєтесь у майбутньому, але все ж це корисна функція.
zh_hant: 每一幀，程式碼會計算烏龜與滑鼠游標間的某個位置。[code]lerp()[/code] 函式會處理所有計算。 這並不是最穩定的平滑移動方式，你之後會學到更好的方法，但這仍然是一個實用的函式。

source: You can make [i]your[/i] functions return values. To make a function return a value, you use the [code]return[/code] keyword followed by the value in question. In previous lessons, we had characters walking on grids. And for those practices, you were working directly with cell coordinates. Well, cell coordinates don't correspond to positions on the screen. To find the center of any cell on the screen, we need to convert the cell's coordinates to a position on the screen, in pixels.
cs: Můžete vytvořit [i]své[/i] funkce vracející hodnoty. Chcete-li, aby funkce vracela hodnotu, použijte klíčové slovo [code]return[/code] následované příslušnou hodnotou. V předchozích lekcích jsme měli postavy chodící po mřížkách. A při těchto cvičeních jste pracovali přímo se souřadnicemi buněk. Ale souřadnice buněk neodpovídají souřadnicím na obrazovce, takže musíme převést souřadnice buněk na souřadnice na obrazovce.
ta: நீங்கள் [i] உங்கள் [/i] செயல்பாடுகள் மதிப்புகளைத் தரலாம். ஒரு செயல்பாட்டை ஒரு மதிப்பைத் திரும்பப் பெற, நீங்கள் [குறியீடு] வருவாய் [/குறியீடு] முக்கிய சொல்லைப் பயன்படுத்துகிறீர்கள், அதைத் தொடர்ந்து கேள்விக்குரிய மதிப்பு. முந்தைய பாடங்களில், கட்டங்களில் நடைபயிற்சி கதாபாத்திரங்கள் இருந்தன. அந்த நடைமுறைகளுக்கு, நீங்கள் நேரடியாக செல் ஒருங்கிணைப்புகளுடன் பணிபுரிந்தீர்கள். சரி, செல் ஆயத்தொகுப்புகள் திரையில் உள்ள நிலைகளுக்கு பொருந்தாது. திரையில் எந்த கலத்தின் மையத்தையும் கண்டுபிடிக்க, கலத்தின் ஆயங்களை திரையில், பிக்சல்களில் மாற்ற வேண்டும்.
uk: Ви можете змусити [i]свої[/i] функції повертати значення. Щоб змусити функцію повертати значення, ви використовуєте ключове слово [code]return[/code], за яким слідує відповідне значення. У попередніх уроках у нас були персонажі, які ходили по сітках. І для цих вправ ви працювали безпосередньо з координатами клітинки. Ну, координати комірок не відповідають положенням на екрані. Щоб знайти центр будь-якої комірки на екрані, нам потрібно перетворити координати комірки в позицію на екрані в пікселях.
zh_hant: 你可以讓[b]自己的[/b]函式回傳值。 要讓函式回傳一個值，可以使用 [code]return[/code] 關鍵字，後面接著要回傳的值。 在之前的課程中，我們讓角色在網格上行走。 在那些練習中，你是直接使用網格座標進行操作。 然而，網格座標並不對應於螢幕上的位置。要找到螢幕上任何網格中心的位置，我們需要將網格座標轉換為像素位置。

source: To do so, we use a function. The function does two things: 1. First, it multiplies the cell coordinates by the cell size, which gives us the position of the cell's top-left corner on the screen, in pixels. 2. Then, we add half of the cell size to get the center of the cell. The function returns the result, allowing us to store it in a variable.
cs: K tomu použijeme funkci. Funkce udělá dvě věci: 1. Nejprve vynásobí souřadnice buňky její velikostí, čímž získáme polohu levého horního rohu buňky na obrazovce v pixelech. 2. Poté přičteme polovinu velikosti buňky, abychom získali střed buňky. Funkce vrací výsledek, který můžeme uložit do proměnné.
ta: அவ்வாறு செய்ய, நாங்கள் ஒரு செயல்பாட்டைப் பயன்படுத்துகிறோம். செயல்பாடு இரண்டு விசயங்களைச் செய்கிறது: 1. முதலாவதாக, இது செல் ஒருங்கிணைப்புகளை செல் அளவால் பெருக்குகிறது, இது திரையில் கலத்தின் மேல்-இடது மூலையின் நிலையை பிக்சல்களில் வழங்குகிறது. 2. பின்னர், கலத்தின் மையத்தைப் பெற செல் அளவின் பாதியைச் சேர்க்கிறோம். செயல்பாடு முடிவைத் தருகிறது, அதை ஒரு மாறியில் சேமிக்க அனுமதிக்கிறது.
uk: Для цього ми використовуємо функцію. Функція робить дві речі: 1. По-перше, він множить координати клітинки на розмір клітинки, що дає нам положення верхнього лівого кута клітинки на екрані в пікселях. 2. Потім ми додаємо половину розміру комірки, щоб отримати центр комірки. Функція повертає результат, дозволяючи нам зберегти його в змінній.
zh_hant: 為了達成這個目標，我們使用一個函式。這個函式執行兩個步驟： 1. 首先，將網格座標乘以單個格子的大小，這樣就能得到該格子左上角在螢幕上的像素位置。 2. 接著，加入格子大小的一半，以獲得該格子的中心位置。 函式會回傳這個計算結果，讓我們可以將其存入變數中。

source: Some functions return values, and some do not. During practices, you can learn which functions return a value using the documentation panel. It will display if the practice requires using specific functions or variables. There, functions that start with the term [code]void[/code] do not return a value. Any other term means the function does return a value. You'll learn more about what other terms mean in a couple of lessons when we explore value [i]types[/i]. For now, let's practice returning values from functions!
cs: Některé funkce vracejí hodnoty a některé ne. Během cvičení se můžete pomocí panelu dokumentace dozvědět, které funkce vracejí hodnotu. Zobrazí se, pokud cvičení vyžaduje použití konkrétních funkcí nebo proměnných Funkce, které začínají výrazem [code]void[/code], hodnotu nevracejí. Jakýkoli jiný výraz znamená, že funkce hodnotu vrací. O tom, co znamenají ostatní termíny, se více dozvíte za pár lekcí, až se budeme zabývat hodnotovými [i]typy[/i]. Prozatím si procvičme vracení hodnot z funkcí!
ta: சில செயல்பாடுகள் மதிப்புகளைத் தருகின்றன, சில இல்லை. நடைமுறைகளின் போது, ஆவணக் குழுவைப் பயன்படுத்தி எந்த செயல்பாடுகள் ஒரு மதிப்பைத் தருகின்றன என்பதை நீங்கள் அறியலாம். நடைமுறைக்கு குறிப்பிட்ட செயல்பாடுகள் அல்லது மாறிகள் தேவைப்பட்டால் அது காண்பிக்கப்படும். அங்கு, [குறியீடு] வெற்றிடமான [/குறியீடு] என்ற வார்த்தையுடன் தொடங்கும் செயல்பாடுகள் ஒரு மதிப்பைத் தராது. வேறு எந்த காலமும் செயல்பாடு ஒரு மதிப்பைத் தரும் என்பதாகும். நாங்கள் மதிப்பை ஆராயும்போது இரண்டு பாடங்களில் மற்ற சொற்கள் எதைக் குறிக்கின்றன என்பதைப் பற்றி மேலும் அறிந்து கொள்வீர்கள் [i] வகைகள் [/i]. இப்போதைக்கு, செயல்பாடுகளிலிருந்து மதிப்புகளைத் திரும்பப் பெறுவோம்!
uk: Деякі функції повертають значення, а деякі ні. Під час практики ви можете дізнатися, які функції повертають значення, використовуючи панель документації. Відображатиметься, якщо практика вимагає використання певних функцій або змінних. Там функції, які починаються з терміна [code]void[/code], не повертають значення. Будь-який інший термін означає, що функція повертає значення. Ви дізнаєтеся більше про значення інших термінів у кількох уроках, коли ми досліджуватимемо [i]типи[/i] значень. А поки потренуємося повертати значення з функцій!
zh_hant: 有些函式會回傳值，有些則不會。在練習過程中，你可以透過文檔面板來了解哪些函式會回傳值，它會顯示是否需要使用特定的函式或變數。 在這裡，函式名稱以 [code]void[/code] 開頭的代表不會回傳值，任何其他的詞彙則表示該函式會回傳值。在接下來的幾課中，我們會進一步探討其他詞彙的意義，並學習值的[b]類型[/b]。 現在，讓我們來練習從函式中回傳值吧！

source: Define a function that converts a position on a grid to the screen. The function takes a [code]Vector2[/code] cell coordinate as an argument. It should return the corresponding [code]Vector2[/code] screen coordinates at the center of the cell.
cs: Definujte funkci, která převede pozici v mřížce na pozici na obrazovce. Funkce přijímá jako argument souřadnici buňky mřížky [code]Vector2[/code]. Měla by pro ni vrátit souřadnice [code]Vector2[/code] na obrazovce odpovídající středu buňky.
pt: Defina uma função que converta uma posição de um grid para o ecrã. A função recebe as coordenadas de uma célula do tipo [code]Vector2[/code] como argumento. Ela deve retornar as coordenadas do ecrã do tipo [code]Vector2[/code] no centro da célula.
ta: ஒரு கட்டத்தில் ஒரு நிலையை திரைக்கு மாற்றும் செயல்பாட்டை வரையறுக்கவும். செயல்பாடு ஒரு [குறியீடு] திசையன் 2 [/குறியீடு] செல் ஒருங்கிணைப்பை ஒரு வாதமாக எடுக்கும். இது கலத்தின் மையத்தில் தொடர்புடைய [குறியீடு] வெக்டர் 2 [/குறியீடு] திரை ஆயங்களை திருப்பித் தர வேண்டும்.
uk: Визначте функцію, яка перетворює позицію на сітці на екран. Функція приймає координату клітинки [code]Vector2[/code] як аргумент. Він має повернути відповідні екранні координати [code]Vector2[/code] у центрі клітинки.
zh_hant: 定義一個將格子上位置轉換為螢幕位置的函式。 這函式接收一個 [code]Vector2[/code] 格子座標作為引數。它應該回傳對應的 [code]Vector2[/code] 位於格子中心的螢幕座標。
