Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-1-what-code-*-like.po
Languages: cs, da, de, es, fr, it, ja, nl, ru, ta, tr, uk, zh_hant

source: Learning to program can be daunting.
cs: Naučit se programovat může být náročné.
da: At lære at programmer kan være skræmmende.
de: Programmieren lernen kann entmutigend sein.
es: Aprender a programar puede ser desalentador.
ja: プログラミングの学習はかなり大変です。
ru: Обучение программированию может пугать.
tr: Programlama öğrenmek göz korkutucu olabilir.
uk: Навчання програмуванню може злякати.

source: Yet, you want to make video games, so [b]there is no way around learning to program[/b]. [i]Every[/i] video game is a computer program.
cs: Když ale chcete dělat videohry, [b]není možné programování obejít[/b]. [i]Každá[/i] videohra je počítačový program.
da: Men du ønsker at lave video spil, så [b]der er ingen vej udenom at lære at programmere[/b]. [i]Alle[/i] video spil er et computer program.
de: Dennoch [b]führt daran kein Weg vorbei Programmieren zu lernen[/b], wenn du Spiele entwickeln möchtest. [i]Jedes[/i] Videospiel ist ein Computerprogramm.
es: Sin embargo, quieres hacer videojuegos, así que [b]no hay forma de evitar aprender a programar[/b]. [i]Todo[/i] videojuego es un programa de computadora.
ja: しかしビデオゲームを作りたいのであれば、[b]プログラミングを覚えることは避けて通れません[/b]。[i]全ての[/i]ビデオゲームはコンピュータのプログラムで出来ているのです。
ru: Но если вы все-таки хотите создавать видеоигры, то [b]без умения программировать вам не обойтись[/b]. [i]Каждая[/i] видеоигра — это компьютерная программа.
tr: Ancak video oyunları yapmak istiyorsunuz, bu nedenle [b]programlama öğrenmeniz kaçınılmaz[/b]. [i]Her[/i] video oyunu bir bilgisayar programıdır.
uk: Але якщо ви все-таки хочете створювати відеоігри, то [b]без уміння програмувати ви не обійдетесь[/b]. [i]Кожна[/i] відеогра — це комп'ютерна програма.

source: Telling the computer what to do
cs: Jak říci počítači, co má dělat
da: Fortæl computeren hvad den skal gøre
de: Dem Computer sagen, was er tun soll
es: Decirle a la computadora lo que tiene que hacer
fr: Dire à l'ordinateur ce qu'il doit faire
it: Dire al computer cosa fare
ja: コンピュータに何をするのか指示する
nl: De computer vertellen wat te doen
ru: Объясняем компьютеру, что мы от него хотим
ta: என்ன செய்ய வேண்டும் என்று கணினிக்குச் சொல்கிறது
tr: Bilgisayara ne yapacağını söylemek
uk: Пояснюємо комп'ютеру, що ми від нього хочемо
zh_hant: 告訴電腦要做什麼

source: Programming is the process of writing precise instructions that tell a computer how to perform a task.
cs: Programování je proces psaní přesných instrukcí, které říkají počítači, jak má provést určitý úkol.
da: Programmering er processen med at skrive præcise instruktioner, der fortæller en computer, hvordan man udfører en opgave.
de: Programmieren ist der Prozess des Schreibens präziser Anweisungen, die einem Computer sagen, wie er eine Aufgabe ausführen soll.
es: La programación es el proceso de escribir instrucciones precisas que le dicen a una computadora cómo realizar una tarea.
ja: プログラミングとは、詳細な命令を記述することで作業をどのように実行するのかをコンピュータに指示する行為です。
ru: Программирование — это процесс написания точных инструкций, которые объясняют компьютеру, как выполнить поставленную задачу.
tr: Programlama, bilgisayara bir görevi nasıl gerçekleştireceğini söyleyen titiz ve kesin talimatlar yazma sürecidir.
uk: Програмування це процес написання точних інструкцій, які пояснюють комп'ютеру, як виконати поставлене завдання.

source: A game's instructions are, for example: moving a character, drawing a life bar, or playing a sound.
cs: Instrukce ve hře jsou například: pohyb postavy, vykreslení lišty života nebo přehrání zvuku.
da: Et spils instruktioner er f.eks.: at flytte en figur, tegne en livslinje eller spille en lyd.
de: Die Anweisungen eines Spiels sind zum Beispiel: Bewegen einer Spielfigur, Zeichnen einer Lebensanzeige oder Abspielen eines Geräuschs.
es: Las instrucciones de un juego son, por ejemplo: mover un personaje, dibujar una barra de vida o reproducir un sonido.
ja: ゲームの命令には、例えばキャラクターを移動させる、体力ゲージを描画する、サウンドを再生するなどがあります。
ru: Примерами таких инструкций могут быть: перемещение персонажа, рисование полоски жизни или воспроизведение звука.
tr: Örneğin, bir oyunun talimatları şunlar olabilir: bir karakteri hareket ettirmek, bir can çubuğu çizmek ya da bir ses çalmak.
uk: Прикладами таких інструкцій є: рух персонажа, малювання смужки життя або відтворення звуку.

source: To do any of that, you need to learn a [b]programming language[/b]: a specialized language to tell the computer what to do.
cs: Abyste něco takového mohli dělat, musíte se naučit [b]programovací jazyk[/b]: specializovaný jazyk, který počítači říká, co má dělat.
da: For at gøre noget af det, skal du lære et [b]programmeringssprog[/b]: et specialiseret sprog for at fortælle computeren hvad den skal gøre.
de: Um das zu erreichen, musst du eine [b]Programmiersprache[/b] verwenden: Eine spezialisierte Sprache, mit welcher du dem Computer Befehle geben kannst.
es: Para hacer cualquier cosa de estas, tienes que aprender un [b]lenguaje de programación[/b]: un lenguaje especializado para decirle a la computadora lo que tiene que hacer.
fr: Pour faire tout cela, vous devez apprendre un [b]langage de programmation[/b] : un langage spécialisé pour dire à l'ordinateur ce qu'il doit faire.
it: Per far ciò, vedi imparare un [b]linguaggio di programmazione[/b]: una lingua specializzata a dire al computer cosa fare.
ja: これらを行うためには、[b]プログラミング言語[/b]を学ぶ必要があります。プログラミング言語とは、コンピュータに何をするのか指示するための特殊な言語のことです。
nl: Om dat te doen, moet je een [b]programmeertaal[/b] leren: een gespecialiseerde taal om de computer te vertellen wat hij moet doen.
ru: Чтобы написать какую-нибудь из этих инструкций, вам нужно научиться использовать [b]язык программирования[/b] — специализированный язык, позволяющий указать компьютеру, что ему делать.
ta: அதில் ஏதேனும் செய்ய, நீங்கள் ஒரு [b] நிரலாக்க மொழியைக் கற்றுக்கொள்ள வேண்டும் [/b]: என்ன செய்ய வேண்டும் என்று கணினிக்குச் சொல்ல ஒரு சிறப்பு மொழி.
tr: Bunların herhangi birini yapmak için, bilgisayara ne yapacağını söylemeye yarayan özel bir dil, yani bir [b]programlama dili[/b] öğrenmeniz gerekir.
uk: Щоб написати якусь із цих інструкцій, вам потрібно навчитися використовувати [b]мову програмування[/b] — спеціалізовану мову, яка дає змогу вказати комп'ютеру, що робити.
zh_hant: 要做任何一項，你都必須學習一種[b]程式語言[/b]：一種專門告訴電腦要做什麼的語言。

source: Programming languages are different from natural ones like English or Spanish. The computer does not think. Unlike us, it can't [i]interpret[/i] what you tell it.
cs: Programovací jazyky se liší od přirozených jazyků, jako je angličtina nebo španělština. Počítač nepřemýšlí. Na rozdíl od nás nedokáže [i]interpretovat[/i] to, co mu řeknete.
da: Programmerings sprog er forskellige fra naturlige sprog som engelsk eller spansk. Computeren tænker ikke. I modsætning til os, kan den ikke [i]fortolke[/i] hvad du fortæller den.
de: Programmiersprachen unterscheiden sich von natürlichen Sprachen wie Deutsch oder Englisch. Der Computer denkt nicht. Er kann nicht [i]interpretieren[/i], was du ihm sagst.
es: Los lenguajes de programación son diferentes de los naturales, como el inglés o el español. La computadora no piensa. A diferencia de las personas, la computadora no puede [i]interpretar[/i] lo que le dices.
ja: プログラミング言語は英語やスペイン語などの自然言語とは異なります。コンピュータは考えるということをしません。私たちとは違い、コンピュータはあなたの指示を[i]解釈[/i]できないのです。
ru: Языки программирования отличаются от естественных языков, таких как русский или английский. Компьютер не думает. В отличие от нас, он не может [i]понять суть[/i] того, что вы ему говорите.
tr: Programlama dilleri, İngilizce veya Türkçe gibi doğal dillerden farklıdır. Bilgisayar düşünmez. Bizlerden farklı olarak, ona söylediğiniz şeyleri [i]yorumlayamaz[/i].
uk: Мови програмування відрізняються від природних мов, таких як українська чи англійська. Комп'ютер не думає. На відміну від нас, він не може [i]зрозуміти суть[/i] того, що ви йому кажете.

source: You can't tell it something vague like "draw a circle."
cs: Nemůžete mu říct něco neurčitého jako "nakresli kruh".
da: Du kan ikke fortælle det noget vagt som "tegn en cirkel".
de: Man kann ihm also nicht etwas Vages wie "Zeichne einen Kreis" sagen.
es: No puedes decirle algo impreciso como "dibuja un círculo".
ja: 「円を描く」などの漠然とした指示はできません。
ru: Вы не можете сказать ему что-то неопределенное вроде «нарисуй круг».
tr: Ona, "bir daire çiz" gibi belirsiz bir şey söylemezsiniz.
uk: Ви не можете сказати йому щось невизначене, на зразок «намалюй круг».

source: Which circle? Where? Which color should it be? How big should it be?
cs: Jaký kruh? Kde? Jakou má mít barvu? Jak velký by měl být?
da: Hvilken cirkel? Hvor? Hvilken farve skal det være? Hvor stor skal det være?
de: Welcher Kreis? Wohin? Welche Farbe soll es sein? Wie groß sollte er sein?
es: ¿Qué círculo? ¿Dónde? ¿De qué color debería ser? ¿Qué tamaño debería tener?
ja: どんな円ですか？ どこに描きますか？ 色は？ 大きさは？
ru: Какой круг? Нарисовать где? Какого цвета он должен быть? Насколько большим он должен быть?
tr: Hangi daire? Nerede/Nereye? Hangi renkte olmalı? Ne kadar büyük olmalı?
uk: Який круг? Намалювати де? Якого кольору він має бути? Наскільки великим він має бути?

source: The computer needs exact instructions
cs: Počítač potřebuje přesné instrukce
da: Computeren har brug for nøjagtige instruktioner
de: Der Computer benötigt genaue Anweisungen
es: La computadora necesita instrucciones exactas
fr: L'ordinateur a besoin d'instructions précises
it: Il computer necessita istruzioni esatte
ja: コンピュータには正確な命令が必要
nl: De computer heeft exacte instructies nodig
ru: Компьютеру нужны точные инструкции
ta: கணினிக்கு சரியான வழிமுறைகள் தேவை
tr: Bilgisayar, kesin talimatlara ihtiyaç duyar
uk: Комп'ютеру потрібні точні інструкції
zh_hant: 電腦需要絕對精準的指令

source: To draw a filled circle, the computer needs to know exact drawing coordinates, the radius, the thickness, and color you want.
cs: Chcete-li nakreslit vyplněný kruh, musí počítač znát přesné souřadnice kresby, poloměr, tloušťku a požadovanou barvu.
da: For at tegne en udfyldt cirkel skal computeren vide præcise tegnings koordinater, radius, tykkelsen og den ønskede farve.
de: Um einen gefüllten Kreis zu zeichnen, muss der Computer genaue Koordinaten, den Radius, die Dicke und die Farbe kennen, die du für den Umriss wünschst.
es: Para dibujar un círculo relleno, la computadora necesita conocer las coordenadas exactas del dibujo, el radio, el grosor y el color que quieres.
ja: 塗りつぶされた円を描画するためには、その円の正確な描画座標や、半径、太さ、色をコンピュータが把握する必要があります。
ru: Чтобы нарисовать закрашенный круг, компьютеру необходимо знать точные координаты рисования, радиус, толщину и нужный цвет.
tr: İçi dolu bir daire çizmek için, bilgisayarın kesin koordinatları, yarıçapı, kalınlığı ve istediğiniz rengi bilmesi gerekir.
uk: Щоб намалювати зафарбований круг, комп'ютер має знати точні координати малювання, радіус, товщину та потрібний колір.

source: The code to do so [i]may[/i] look like this.
cs: Kód pro tento účel [i]může[/i] vypadat takto.
da: Koden til at gøre dette ser [i]måske[/i] ud som dette.
de: Der Code dazu [i]könnte[/i] so aussehen.
es: El código para hacerlo [i]podría[/i] verse así.
ja: そのためのコードは以下のようになる[i]かもしれません[/i]。
ru: Код для рисования круга [i]может[/i] выглядеть следующим образом.
tr: Bunu yapacak kod şuna [i]benzeyebilir[/i].
uk: Код для малювання круга [i]може[/i] виглядати так.

source: [i]Click the button to run the code example and see the result.[/i]
cs: [i]Kliknutím na tlačítko spustíte příklad kódu a uvidíte výsledek.[/i]
da: [i]Klik på knappen for at køre kode eksemplet og se resultatet.[/i]
de: [i] Klicke auf den Knopf, um das Codebeispiel auszuführen und das Ergebnis anzuzeigen. [/i]
es: [i]Haz clic en el botón para ejecutar el ejemplo de código y ver el resultado.[/i]
ja: [i]ボタンをクリックすると見本のコードが実行され、その結果を確認できます。[/i]
ru: [i]Нажмите кнопку, чтобы запустить пример кода и увидеть результат.[/i]
tr: [i]Kod örneğini çalıştırmak ve sonucu görmek için düğmeye tıklayın. (draw_circle)[/i]
uk: [i]Натисніть кнопку, щоб запустити приклад коду та побачити результат.[/i]

source: In the following lessons, you'll learn how this code works.
cs: V následujících lekcích se dozvíte, jak tento kód funguje.
da: I de følgende lektioner lærer du, hvordan denne kode fungerer.
de: In den folgenden Lektionen erfährst du, wie dieser Code funktioniert.
es: En las siguientes lecciones, aprenderás cómo funciona este código.
ja: 次のレッスンでは、このコードの仕組みについて説明します。
ru: В следующих уроках вы узнаете, как работает этот код.
tr: İlerleyen derslerde, bu kodun nasıl çalıştığını öğreneceksiniz.
uk: У наступних уроках ви дізнаєтесь, як працює цей код.

source: For now, we want to give you a sense of what computer code looks like. In this example, everything matters: each parenthesis, capital letter, period, and comma.
cs: Prozatím vám chceme přiblížit, jak vypadá počítačový kód. V tomto příkladu záleží na všem: na každé závorce, velkém písmenu, tečce a čárce.
da: For nu vil vi give dig en fornemmelse af, hvordan computerkode ser ud. I dette eksempel, har alt en betydning: hver parentes, stort bogstav, punktum og komma.
de: Im Moment möchten wir dir ein Gefühl dafür geben, wie Computercode aussieht. Wenn wir Code verwenden, ist jede Klammer, jeder Großbuchstabe, jeder Punkt und jedes Komma wichtig.
es: Por ahora, queremos darte una idea de cómo se ve el código de computadora. En este ejemplo, todo importa: cada paréntesis, cada mayúscula, cada punto y cada coma.
ja: ひとまず、コンピュータのコードがどのようなものなのかを理解してもらいたいと思います。上の例では、丸括弧、大文字、ピリオド、コンマの全てが重要です。
ru: А пока мы хотим дать вам представление о том, как он выглядит. В этом примере важно все: каждая скобка, заглавная буква, точка и запятая.
tr: Şimdilik size, bilgisayar kodunun neye benzediğine dair bir fikir vermek istiyoruz. Bu örnekte, her şey önemlidir: her parantez, büyük harf, nokta ve virgül.
uk: А поки що ми хочемо дати вам уявлення про те, як він виглядає. У цьому прикладі важливе все: кожна дужка, велика літера, крапка й кома.

source: The computer always does [b]exactly[/b] what you tell it to. No more, no less. It [i]blindly[/i] follows every instruction.
cs: Počítač vždy udělá [b]přesně[/b] to, co mu řeknete. Nic víc, nic míň. Slepě[i] se řídí[/i] každým pokynem.
da: Computeren gør altid [b]præcis[/b] hvad du beder den om. Ikke mere, ikke mindre. Den følger [i]blindt[/i] enhver instruktion.
de: Der Computer wird immer [i]genau das[/i] tun, was du ihm vorgibst. Nicht mehr und nicht weniger. Er folgt [i]blind[/i] jeder Anweisung.
es: La computadora siempre hace [b]exactamente[/b] lo que le digas. Ni más ni menos. Sigue [i]ciegamente[/i] cada instrucción.
ja: コンピュータは常にあなたの[b]指示通りに[/b]動作します。それ以上でもそれ以下でもありません。[i]盲目的に[/i]全ての命令に従います。
ru: Компьютер всегда делает [b]в точности[/b] то, что вы ему говорите. Ни больше, ни меньше. Он [i]слепо[/i] следует каждой инструкции.
tr: Bilgisayar her zaman [b]tam olarak[/b] ona yapmasını söylediğiniz şeyi yapar. Ne eksik ne fazla. Her talimatı [i]körü körüne[/i] takip eder.
uk: Комп'ютер завжди робить [b]саме[/b] те, що ви йому кажете. Ні більше, ні менше. Він [i]сліпо[/i] дотримується кожної інструкції.

source: [b]When you program, you're the one in charge, and you're free to do [i]anything[/i] you want.[/b]
cs: [b]Když programujete, jste to vy, kdo tomu velí, a můžete si vytvořit [i]cokoli[/i] chcete[/b].
da: [b]Når du programmerer, er du den ansvarlige, og du er fri for at gøre [i]alt[/i] hvad du vil.[/b]
de: [b]Wenn du programmierst, bist du am Ruder und du kannst [i]alles[/i] tun was du willst.[/b]
es: [b]Cuando programas, tú eres el que manda, y eres libre de hacer [i]cualquier cosa[/i] que quieras[/b].
ja: [b]プログラミングをするときは、あなたが責任者であり、あなたは自由に[i]何でも[/i]することができます。[/b]
ru: [b]Когда вы программируете, вы отвечаете за все, и вольны делать [i]все[/i], что захотите.[/b]
tr: [b]Programla yaparken, tüm yetki sizdedir ve istediğiniz [i]herhangi bir şeyi[/i] yapmakta özgürsünüz. [/b]
uk: [b]Коли ви програмуєте, ви відповідальні за все і можете робити [i]все[/i], що завгодно.[/b]

source: How do you give instructions to a computer?
cs: Jak dáváte pokyny počítači?
da: Hvordan giver du instruktioner til en computer?
de: Wie gibt man einem Computer Anweisungen?
es: ¿Cómo le das instrucciones a una computadora?
fr: Comment donner des instructions à un ordinateur ?
it: Cosa bisogna usare per dare delle istruzioni a un computer?
ja: おさらい：コンピュータに命令を出す方法は？
nl: Hoe geef je instructies aan een computer?
ru: Как объяснить компьютеру что делать?
ta: கணினிக்கு எவ்வாறு வழிமுறைகளை வழங்குவது?
tr: Bir bilgisayara, talimatları nasıl verirsiniz?
uk: Як пояснити комп'ютеру, що робити?
zh_hant: 如何給予電腦指令？

source: Computers don't understand natural languages like English. To make them do anything, you need to give them precise instructions they understand, using a programming language.
cs: Počítače nerozumí přirozeným jazykům, jako je angličtina. Abyste je donutili něco udělat, musíte jim dát přesné instrukce, kterým rozumí, a to pomocí programovacího jazyka.
da: Computere forstår ikke naturlige sprog som engelsk. For at få dem til at gøre noget, skal du give dem præcise instruktioner de forstår, ved hjælp af et programmeringssprog.
de: Computer verstehen natürliche Sprachen wie Deutsch nicht. Damit sie das tun, was Du willst, musst du Ihnen genaue Anweisungen in einer Programmiersprache geben.
es: Las computadoras no entienden lenguajes naturales como el inglés. Para que hagan algo, hay que darles instrucciones precisas que entiendan, utilizando un lenguaje de programación.
fr: Les ordinateurs ne comprennent pas les langues naturelles comme l'anglais. Pour leur faire faire quoi que ce soit, vous devez leur donner des instructions précises qu'ils comprennent, en utilisant un langage de programmation.
it: I computer non capiscono i linguaggi naturali come l'italiano. Per fargli fare qualsiasi cosa, devi dargli delle istruzioni ben precise che possano comprendere, tramite un linguaggio di programmazione.
ja: コンピュータは英語のような自然言語を理解できません。何かを実行させるには、プログラミング言語を使用して、コンピュータが理解できる正確な命令を与える必要があります。
nl: Computers begrijpen geen natuurlijke talen zoals Nederlands. Om ze iets te laten doen, moet je ze precieze instructies geven die ze begrijpen, door middel van een programmeertaal.
ru: Компьютеры не понимают естественных языков, таких как английский. Чтобы заставить их что-то делать, вам нужно дать им точные инструкции на языке программирования, которые будут для них понятны.
ta: கணினிகளுக்கு ஆங்கிலம் போன்ற இயற்கை மொழிகள் புரியவில்லை. அவர்கள் எதையும் செய்ய, ஒரு நிரலாக்க மொழியைப் பயன்படுத்தி அவர்கள் புரிந்துகொள்ளும் துல்லியமான வழிமுறைகளை அவர்களுக்கு வழங்க வேண்டும்.
tr: Bilgisayarlar, İngilizce ve Türkçe gibi doğal dilleri anlamazlar. Herhangi bir şey yapmalarını sağlamak için, bir programlama dili kullanarak, onlara anlayacakları kesin talimatlar vermeniz gerekir.
uk: Комп'ютери не розуміють природних мов, таких як українська. Щоб змусити їх щось робити, потрібно дати їм точні інструкції мовою програмування, які будуть для них зрозумілі.
zh_hant: 電腦並不理解英文等自然語言。要讓電腦做任何事，你必須使用程式語言，給予它們能理解的精確指令。

source: Using a programming language and precise instructions
cs: S použitím programovacího jazyka a přesných instrukcí
da: Brug af et programmeringssprog og præcise instruktioner
de: Durch Verwenden einer Programmiersprache und präziser Anweisungen
es: Utilizando un lenguaje de programación e instrucciones precisas
fr: En utilisant un langage de programmation et des instructions précises
it: Un linguaggio di programmazione e delle istruzioni ben precise
ja: プログラミング言語と正確な命令を使用する
nl: Door middel van een programmeertaal en nauwkeurige instructies
ru: Использовать язык программирования и точные инструкции
ta: நிரலாக்க மொழி மற்றும் துல்லியமான வழிமுறைகளைப் பயன்படுத்துதல்
tr: Bir programlama dili ve kesin talimatlar kullanarak
uk: Використати мову програмування та точні інструкції
zh_hant: 使用程式語言與精確指令

source: Using prose in plain English
cs: S použitím prózy v prosté angličtině
da: Ved at bruge almindelig simpel dansk og skrive let læst tekst
de: Durch Verwendung von einfachen Deutschen Texten
es: Utilizando la prosa en español corriente
fr: En utilisant la prose en français courant
it: L'italiano, è più che sufficiente
ja: 簡単な英語の文章を書く
nl: Gewoon in het Nederlands
ru: Использовать прозу на простом английском языке
ta: எளிய ஆங்கிலத்தில் உரைநடை பயன்படுத்துதல்
tr: Sade İngilizce (ve belki Türkçe) ile düz yazı kullanarak
uk: Використати звичайний текст українською мовою
zh_hant: 使用英文寫個散文

source: You'll learn to code with GDScript
cs: Naučíte se kódovat pomocí jazyka GDScript
da: Du lærer at kode med GDScript
de: Du wirst lernen, mit GDScript, zu programmieren
es: Aprenderás a codificar con GDScript
fr: Vous apprendrez à coder avec GDScript
it: Imparerai a programmare con GDScript
ja: GDScriptを使ったプログラミングを学ぶ
nl: Je zult leren programmeren met GDScript
ru: Вы научитесь программировать с помощью GDScript
ta: GDSCRIPT உடன் குறியீட்டைக் கற்றுக்கொள்வீர்கள்
tr: GDScript ile kodlamayı öğreneceksiniz
uk: Ви навчитеся програмувати за допомогою GDScript
zh_hant: 你將用 GDScript 學習程式碼

source: In this course, you'll learn the GDScript programming language (the name stands for "Godot script").
cs: V tomto kurzu se naučíte programovací jazyk GDScript (název znamená "Godot script").
da: I dette kursus, vil du lære GDScript programmering sproget (navnet står for "Godot script").
de: In diesem Kurs werden Sie die GDScript-Programmiersprache lernen (der Name steht für "Godot Script").
es: En este curso, aprenderás el lenguaje de programación GDScript (cuyo nombre significa "script de Godot").
ja: このコースでは、GDScriptプログラミング言語(名前は「Godotスクリプト」の略)を学習します。
ru: В этом курсе вы изучите язык программирования GDScript (название означает "Godot script" — "скриптовый язык Godot").
tr: Bu kursta, GDScript programlama dilini öğreneceksiniz (adı "Godot betik dili" anlamına geliyor).
uk: У цьому курсі ви вивчите мову програмування GDScript (назва означає "Godot script" — "скриптова мова Godot").

source: This is a language by game developers for game developers. You can use it within the Godot game engine to create games and applications.
cs: Jedná se o jazyk od herních vývojářů pro herní vývojáře. Můžete jej používat v rámci herního enginu Godot k vytváření her a aplikací.
da: Dette er et sprog udviklet af spiludviklere for spiludviklere. Du kan bruge det i Godot spil motoren til at skabe spil og applikationer.
de: Dies ist eine Sprache von Spieleentwicklern für Spieleentwickler. Sie können sie innerhalb der Godot-Game-Engine verwenden, um Spiele und Anwendungen zu erstellen.
es: Este es un lenguaje hecho por desarrolladores de juegos para desarrolladores de juegos. Puedes utilizarlo dentro del motor de juegos Godot para crear juegos y aplicaciones.
ja: これは、ゲーム開発者によるゲーム開発者のための言語です。Godotゲームエンジン内で使用して、ゲームやアプリケーションを作成できます。
ru: GDScript — это язык от разработчиков игр для разработчиков игр. Вы можете использовать его в игровом движке Godot для создания игр и приложений.
tr: Bu, oyun geliştiricileri için oyun geliştiricileri tarafından geliştirilen bir dildir. Bunu, Godot oyun motoru içinde oyunlar ve uygulamalar oluşturmak için kullanabilirsiniz.
uk: GDScript — це мова від розробників ігор для розробників ігор. Ви можете використовувати її в ігровому рушії Godot для створення ігор та інших застосунків.
