Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-27-value-types.po
Languages: cs, da, de, es, fr, it, ja, nl, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: Even if it's just a [code]0[/code], adding a decimal place tells the computer we want decimal numbers. This shows you how mindful you need to be with types. Otherwise, you will get unexpected results. It can get pretty serious: number errors can lead to bugs like controls not working as intended or charging the wrong price to players.
es: Incluso si es solo un [code]0[/code], añadir un decimal le indica a la computadora que queremos números decimales. Esto te muestra lo cuidadoso que debes ser con los tipos. De lo contrario, obtendrás resultados inesperados. Y puede llegar a ser bastante grave: los errores numéricos pueden provocar errores como que los controles no funcionen según lo previsto o que se les cobre un precio incorrecto a los jugadores.
fr: Même si ce n'est qu'un [code]0[/code], ajouter une décimale indique à l'ordinateur que nous voulons des nombres décimaux. Cela vous montre à quel point vous devez être attentif(ve) aux types. Sinon, vous obtiendrez des résultats inattendus. Et cela peut devenir assez grave : les erreurs de chiffres peuvent entraîner des bugs tels que des manettes de jeu qui ne fonctionnent pas comme prévu ou des prix erronés facturés aux joueurs.
it: Anche se è semplicemente uno [code]0[/code], aggiungere la parte decimale dice al computer che vogliamo numeri decimali. Questo ti mostra quanto devi essere cosciente con i tipi. Altrimenti, otterrai risultati inaspettati. Potrebbe diventare molto serio: gli errori numerici possono portare a bug come non far funzionare i controlli in modo corretto o attribuire il prezzo sbagliato a degli oggetti.
ja: 単なる [code]0[/code] であっても、小数点以下の桁数を追加すると、10 進数が必要であることがコンピューターに伝わります。 これは、型にどれだけ気を配る必要があるかを示しています。そうしないと、予期しない結果が生じます。数字のエラーは、コントロールが意図したとおりに機能しなかったり、プレイヤーに間違った価格を請求したりするなどのバグにつながる可能性があります。
nl: Zelfs als het gewoon een [code]0[/code] is, laat het toevoegen van een decimaal de computer weten dat we kommagetallen willen. Dit laat zien hoe zorgvuldig je moet zijn met types. Anders krijg je onverwachte resultaten. Dit kan behoorlijk ernstig zijn: getalfouten kunnen leiden tot bugs zoals besturingselementen die niet werken zoals bedoeld of aan spelers de verkeerde prijs in rekening brengen.
pt_br: Mesmo que seja apenas um [code]0[/code], adicionar uma casa decimal informa ao computador que queremos números decimais. Isso mostra o quanto você precisa estar atento aos tipos. Caso contrário, você obterá resultados inesperados. Pode ficar bem sério: erros de número podem levar a bugs como controles que não funcionam como pretendido ou cobram o preço errado dos jogadores.
zh_hans: 就算只是多了一个 [code]0[/code]，添加一个小数位也会告诉计算机我们用的是小数。 这个例子可以看出，你应当对值类型有很高的关注度。否则，你会得到各种意料之外的结果。问题可能会变得非常严重：数字错误会导致各种bug，例如如控件无法正常工作，或商店要价出错让玩家买单等等。
zh_hant: 即使只是 [code]0[/code]，加上小數點也能告訴電腦我們需要小數。 這讓你明白了處理類型時需要多麼小心。否則，你可能會得到預期外的結果。這可能會變得相當嚴重：數字錯誤可能會導致程式錯誤，比如控制無法正常運作或向玩家收取錯誤的價格。

source: Programming beginners often struggle due to the lack of understanding of types. Languages like GDScript hide the types from you by default. As a result, if you don't understand that some are incompatible, you can get stuck when facing type-related errors. You'll want to keep that in mind in your learning journey. When writing code, you will need to understand everything that's happening. That said, let's practice some type conversions.
es: Los principiantes en programación a menudo tienen dificultades por la falta de comprensión de los tipos. Los lenguajes como GDScript te ocultan los tipos de forma predeterminada. Como resultado, si no tienes el conocimiento de que algunos son incompatibles, puedes estancarte cuando te enfrentes a errores relacionados con los tipos. Querrás tener esto en cuenta en tu viaje de aprendizaje. Cuando escribas código, tendrás que entender todo lo que ocurre. Dicho esto, vamos a practicar algunas conversiones de tipos.
fr: Les débutants en programmation ont souvent du mal à cause du manque de compréhension des types. Les langages comme GDScript vous cachent les types par défaut. Par conséquent, si vous ne comprenez pas que certains sont incompatibles, vous pouvez vous retrouver coincé(e) face à des erreurs liées aux types. Vous voudrez garder cela à l'esprit dans votre parcours d'apprentissage. Lors de l'écriture du code, vous aurez besoin de comprendre tout ce qui se passe. Cela dit, exerçons-nous à faire quelques conversions de types.
it: I programmatori alle prime armi spesso faticano per la loro mancata comprensione dei tipi. I linguaggi come GDScript ti nascondono i tipi in automatico. Il risultato è dunque che, se non capisci che alcuni valori sono incompatibili, puoi venire bloccato quando incontri errori correlati al tipo di valore. Ti consigliamo di tenerlo sempre a mente nel tuo percorso di apprendimento. Quando scrivi codice, devi capire tutti quello che succede. Detto ciò, facciamo pratica con qualche conversione.
ja: プログラミングの初心者は、型の理解不足のために苦労することがよくあります。 GDScript などの言語では、既定で型が非表示になります。その結果、一部に互換性がないことを理解していないと、タイプ関連のエラーに直面したときに立ち往生する可能性があります。 学習の旅では、そのことを念頭に置いておく必要があります。コードを記述するときは、起こっていることをすべて理解する必要があります。 そうは言っても、いくつかの型変換を練習しましょう。
nl: Beginnende programmeurs hebben het vaak moeilijk door een gebrek aan begrip van types. Talen zoals GDScript verbergen de types standaard voor je. Als je dus niet begrijpt dat sommige types incompatibel zijn, kun je vast komen te zitten wanneer je te maken krijgt met type-gerelateerde fouten. Hou daar rekening mee tijdens je leerproces. Bij het schrijven van code moet je alles begrijpen wat er gebeurt. Dat gezegd zijnde, laten we wat typeomzettingen oefenen.
pt_br: Iniciantes de programação muitas vezes ficam confusos devido à falta de compreensão dos tipos. Linguagens como GDScript ocultam os tipos de você por padrão. Como resultado, se você não entender que alguns são incompatíveis, poderá ficar perdido ao se deparar com erros relacionados com tipos. Você vai querer manter isso em mente em sua jornada de aprendizado. Ao escrever códigos, você precisa entender tudo o que está acontecendo. Dito isso, vamos praticar algumas conversões de tipo.
zh_hans: 由于缺乏对值类型的理解，编程初学者经常遇到各种困难。 默认情况下，像 GDScript 这样的语言会试着隐藏类型（弱类型语言）。结果是，如果你不了解某些不能兼容的细节，在遇到值类型相关的错误时可能会卡住。 你需要在学习过程中牢记这一点。编写代码时，最好能弄明白正在发生的一切的原理。 总而言之，让我们做点类型转换的练习。
zh_hant: 程式設計初學者經常因為不了解類型而感到困惑。 像 GDScript 這樣的語言預設會隱藏類型。這導致一個結果，如果你不了解某些類型之間不相容，當遇到與類型相關的錯誤時，你可能會陷入困境。 在學習過程中，你需要時刻記住這點。在編寫程式時，你會需要理解一切發生的過程。 總而言之，讓我們來練習一些類型轉換。

source: We want to display the player's energy in the user interface. Currently, our code has a type error. We're trying to display a whole number while the [code]display_energy()[/code] function expects a string. Using the [code]str()[/code] function, clear the type error and make the energy amount display on the interface. You can't change the [code]energy[/code] variable definition: setting it to [code]"80"[/code] would break the rest of the game's code. You must convert the value when calling [code]display_energy()[/code].
es: Queremos mostrar la energía del jugador en la interfaz de usuario. Actualmente, nuestro código tiene un error de tipo. Intentamos mostrar un número entero mientras que la función [code]display_energy()[/code] espera una cadena. Utilizando la función [code]str()[/code], borra el error de tipo y haz que la cantidad de energía se muestre en la interfaz. No puedes cambiar la definición de la variable [code]energy[/code]: ponerla en [code]"80"[/code] rompería el resto del código del juego. Debes convertir el valor al llamar a [code]display_energy()[/code].
fr: Nous voulons afficher l'énergie du joueur dans l'interface utilisateur. Actuellement, notre code a une erreur de type. Nous essayons d'afficher un nombre entier alors que la fonction [code]display_energy()[/code] attend une chaîne de caractères. À l'aide de la fonction [code]str()[/code], supprimez l'erreur de type et affichez la quantité d'énergie sur l'interface. Vous ne pouvez pas modifier la définition de la variable [code]energy[/code] : lui donner la valeur de [code]"80"[/code] casserait le reste du code du jeu. Vous devez convertir la valeur lors de l'appel de [code]display_energy()[/code].
it: Vogliamo mostrare l'energia del giocatore nell'interfaccia utente. Al momento, il nostro codice ha un errore correlato al tipo. Stiamo cercando di mostrare un numero intero mentre la funzione [code]display_energy()[/code] si aspetta una stringa. Usando la funzione [code]str()[/code], risolvi l'errore e fa sì che l'energia sia mostrata nell'interfaccia. Non puoi cambiare la definizione della variabile [code]energy[/code]: impostarla [code]"80"[/code] romperebbe il resto del codice di gioco. Devi convertire il valore quando chiami [code]display_energy()[/code].
ja: プレイヤーのエネルギーをユーザーインターフェースに表示したいのです。 現在、コードに型エラーがあります。[code]display_energy()[/code]関数が文字列を期待している間、整数を表示しようとしています。 [code]str()[/code]関数を使用して、タイプエラーをクリアし、インターフェイスにエネルギー量を表示します。 [code]energy[/code] 変数の定義は変更できません。 [code]"80"[/code] に設定すると、ゲームの残りのコードが壊れます。[code]display_energy()[/code]を呼び出すときに値を変換する必要があります。
nl: We willen de energie van de speler weergeven in de gebruikersinterface. Momenteel heeft onze code een typefout. We proberen een geheel getal weer te geven terwijl de functie [code]display_energy()[/code] een string verwacht. Gebruik de functie [code]str()[/code] om de typefout te verhelpen en de energiehoeveelheid weer te geven in de interface. Je mag de definitie van de variabele [code]energy[/code] niet wijzigen: als je deze instelt op [code]"80"[/code], wordt de rest van de spelcode gebroken. Je moet de waarde omzetten wanneer je [code]display_energy()[/code] aanroept.
pt_br: Queremos exibir a energia do jogador na interface do usuário. Atualmente, nosso código tem um erro de tipo. Estamos tentando exibir um número inteiro enquanto a função [code]display_energy()[/code] espera uma string. Usando a função [code]str()[/code], arrume o erro de tipo e exiba a quantidade de energia na interface. Você não pode alterar a definição da variável [code]energy[/code]: colocar nela o valor [code]"80"[/code] quebraria o resto do código do jogo. Você deve converter o valor ao chamar [code]display_energy()[/code].
zh_hans: 我们希望在UI界面中显示玩家的能量值。 目前，我们的代码存在值类型错误。它试图显示一个整数，而 [code]display_energy()[/code]（显示能量值）函数需要一个字符串。 使用[code]str()[/code]函数，清除类型错误，在界面上显示出能量值。 不能更改 [code]energy[/code] 变量的类型定义：将其设置为 [code]"80"[/code] 会破坏游戏的其它代码。调用 [code]display_energy()[/code] 时必须转换值。
zh_hant: 我們想在使用者介面顯示玩家的能量。 目前，我們的程式碼有一個類型錯誤。我們試圖顯示一個整數，但 [code]display_energy()[/code] 函式卻需要一個字串。 使用 [code]str()[/code] 函式來清除類型錯誤，並將能量數值顯示在介面上。 你不能更改 [code]energy[/code] 變數的定義：將它設為 [code]"80"[/code] 會破壞遊戲其他部分的程式碼。你必須在呼叫 [code]display_energy()[/code] 時將數值轉換為字串。

source: In our game's shops, we want to let the player type numbers to select the number of items they want to buy or sell. We need to know the number of items as an [code]int[/code], but the computer reads the player's input as a [code]String[/code]. Your task is to convert the player's input into numbers for the shop's code to work. Using the [code]int()[/code] function, convert the player's input into a whole number and store the result in the [code]item_count[/code] variable.
es: En las tiendas de nuestro juego, queremos permitirle al jugador escribir números para que seleccione el número de artículos que quiere comprar o vender. Necesitamos saber el número de artículos como un [code]int[/code], pero la computadora lee la entrada del jugador como una [code]String[/code]. Tu tarea es convertir la entrada del jugador en números para que el código de la tienda funcione. Utilizando la función [code]int()[/code], convierte la entrada del jugador en un número entero y almacena el resultado en la variable [code]item_count[/code].
fr: Dans les boutiques de notre jeu, nous voulons permettre au joueur écrire des nombres pour sélectionner le nombre d'articles qu'il veut acheter ou vendre. Nous avons besoin de connaître le nombre d'articles sous la forme d'un [code]int[/code], mais l'ordinateur lit l'entrée du joueur sous la forme d'une [code]String[/code]. Votre tâche consiste à convertir l'entrée du joueur en nombres pour que le code de la boutique fonctionne. À l'aide de la fonction [code]int()[/code], convertissez l'entrée du joueur en un nombre entier et enregistrez le résultat dans la variable [code]item_count[/code].
it: Nei negozi del nostro gioco, vogliamo far si che il giocatore possa selezionare il numero di oggetti che vogliono comprare o vendere. Dobbiamo sapere il numero di oggetti come un [code]int[/code], ma il computer legge gli input del giocatore come una [code]String[/code]. Il tuo compito è quello di convertire gli input del giocatore in numeri per far sì che il codice del negozio funzioni. Usare la funzione [code]int()[/code], converte l'input del giocatore in un numero intero e conserva il risultato nella variabile [code]item_count[/code].
ja: ゲームのショップでは、プレイヤーが数字を入力して、売買するアイテムの数を選択できるようにしたいと考えています。 アイテムの数を [code]int[/code] として知る必要がありますが、コンピューターはプレイヤーの入力を [code]String[/code] として読み取ります。 あなたの仕事は、プレイヤーの入力を数字に変換して、ショップのコードが機能するようにすることです。 [code]int()[/code]関数を使用して、プレーヤーの入力を整数に変換し、結果を[code]item_count[/code]変数に格納します。
nl: In de winkels van ons spel willen we de speler getallen laten typen om het aantal artikelen te selecteren dat ze willen kopen of verkopen. We moeten het aantal artikelen weten als een [code]int[/code], maar de computer leest de invoer van de speler als een [code]String[/code]. Het is jouw taak om de invoer van de speler om te zetten in getallen zodat de code van de winkel werkt. Gebruik de functie [code]int()[/code] om de invoer van de speler om te zetten in een heel getal en sla het resultaat op in de variabele [code]item_count[/code].
pt_br: Nas lojas do nosso jogo, queremos permitir que o jogador digite números para selecionar o número de itens que ele deseja comprar ou vender. Precisamos saber o número de itens como um [code]int[/code], mas o computador lê a entrada do jogador como um [code]String[/code]. Sua tarefa é converter a entrada do jogador em números para que o código da loja funcione. Usando a função [code]int()[/code], converta a entrada do jogador em um número inteiro e armazene o resultado na variável [code]item_count[/code].
zh_hans: 在我们的游戏商店中，我们想让玩家输入数字来选择他们想要购买或出售的物品的数量。 我们需要以 [code]int[/code] 的形式得到物品的数量，但计算机将玩家的输入读取为[code]String[/code]字符。 你的任务是将玩家输入的字符串转换为数字，以便商店的代码能够正常工作。 使用 [code]int()[/code] 函数，将玩家的输入转换为整数并将结果存储在 [code]item_count[/code] （物品数量）变量中。
zh_hant: 在我們遊戲的商店中，我們希望讓玩家輸入數字來選擇他們想要購買或販賣的物品數量。 我們需要將物品數量作為一個 [code]int[/code] 來處理，但電腦將玩家的輸入讀取為 [code]String[/code]。 你的任務是將玩家的輸入轉換為數字，讓商店的程式碼能夠正常運行。 使用 [code]int()[/code] 函式，將玩家的輸入轉換為整數，並將結果儲存在 [code]item_count[/code] 變數中。

source: It tells you you can't add values of type [code]String[/code] and [code]int[/code]: they're incompatible. In that case, you need to convert the [code]health[/code] number into a [code]String[/code].
fr: Il vous indique que vous ne pouvez pas additionner des valeurs de type [code]String[/code] et [code]int[/code] : elles sont incompatibles. Dans ce cas, vous devez convertir le nombre de [code]health[/code] en [code]String[/code].
it: Ti dice che non puoi sommare due valori di tipo [code]String[/code] e [code]int[/code]: sono incompatibili. In questo caso, devi convertire il numero della [code]health[/code] in una [code]String[/code].
ja: [code]String[/code] 型と [code]int[/code] 型の値を追加することはできません。 その場合は、[code]health[/code]番号を[code]String[/code]に変換する必要があります。
nl: Het vertelt je dat je geen waarden van de types [code]String[/code] en [code]int[/code] kunt optellen: ze zijn niet compatibel. In dat geval moet je het getal [code]health[/code] eerst omzetten in een [code]String[/code].
pt_br: Ele diz que você não pode adicionar valores do tipo [code]String[/code] com [code]int[/code]: eles são incompatíveis. Nesse caso, você precisa converter o número de [code]health[/code] em uma [code]String[/code].
zh_hans: 它意思是，不能将 [code]String[/code] 和 [code]int[/code] 类型的值加在一块：它们不兼容。 在这种情况下，需要你先把 [code]health[/code] 数字转换为 [code]String[/code]。
