Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-11-time-delta.po
Languages: cs, da, de, es, fr, it, ja, ru, ta, tr, uk, zh_hant

source: Depending on the game, the computer, and what the game engine needs to calculate, frames take more or less time to display. There will always be milliseconds variations from frame to frame. That is why the [code]_process()[/code] function receives a [code]delta[/code] parameter. Delta represents a time difference. It's the time passed since the previous frame, in seconds. We can use it to ensure that the changes between frames don't make the game's behavior unreliable. This is because different computers run differently, so a fast computer will have more frames per second than a slow computer. If we ignore [code]delta[/code], the game experience will vary, depending on the computer. Delta helps to make the game experience consistent for everyone.
de: Je nach Spiel, Computerleistung und der Rechenaufwand für die Spiel-Engine ändert sich die Anzahl an berechenten Bilder, die Bildwiederholungsrate ist somit höher oder niedriger. Von Frame(Bild) zu Frame wird immer Abweichungen im Millisekundenbereich geben. Aus diesem Grund erhält die Funktion [code]_process()[/code] einen Parameter [code]delta[/code]. Delta ist eine Zeitdifferenz. Es ist die Zeit in Sekunden, die seit der Darstellung des vorherigen Frames vergangen ist.. Damit können wir sicherstellen, dass die Änderungen zwischen den Frames das Verhalten des Spiels nicht beeinflussen. Dies liegt daran, dass verschiedene Computer unterschiedlich schnell sein können. Ein schneller Computer kann somit mehr Bilder pro Sekunde darstellen als ein langsamer Computer. Wenn wir [code]delta[/code] ignorieren, wird das Spielerlebnis auf verschiedenen Computern unterscheiden. Die Berücksichtigung von Delta trägt dazu bei, dass das Spielerlebnis auf allen Computern gleich ist.
ta: விளையாட்டு, கணினி மற்றும் விளையாட்டு இயந்திரம் கணக்கிட வேண்டியதைப் பொறுத்து, பிரேம்கள் காண்பிக்க அதிகமாகவோ அல்லது குறைவாகவோ நேரம் எடுக்கும். பிரேம் முதல் சட்டகம் வரை எப்போதும் மில்லி விநாடிகளின் மாறுபாடுகள் இருக்கும். அதனால்தான் [குறியீடு] _PROCESS () [/குறியீடு] செயல்பாடு [குறியீடு] டெல்டா [/குறியீடு] அளவுருவைப் பெறுகிறது. டெல்டா ஒரு நேர வேறுபாட்டைக் குறிக்கிறது. முந்தைய சட்டகத்திலிருந்து, நொடிகளில் கடந்த நேரம் இது. பிரேம்களுக்கு இடையிலான மாற்றங்கள் விளையாட்டின் நடத்தையை நம்பமுடியாததாக மாற்றாது என்பதை உறுதிப்படுத்த இதைப் பயன்படுத்தலாம். ஏனென்றால், வெவ்வேறு கணினிகள் வித்தியாசமாக இயங்குகின்றன, எனவே வேகமான கணினியை விட வேகமான கணினி நொடிக்கு அதிக பிரேம்களைக் கொண்டிருக்கும். [குறியீடு] டெல்டா [/குறியீடு] ஐ நாம் புறக்கணித்தால், கணினியைப் பொறுத்து விளையாட்டு பட்டறிவு மாறுபடும். விளையாட்டு அனுபவத்தை அனைவருக்கும் சீரானதாக மாற்ற டெல்டா உதவுகிறது.
uk: Залежно від гри, комп'ютера та обсягу обчислень, які має зробити ігровий рушій, приготування кадру до показу може зайняти більше або менше часу. Завжди є різниця на кілька мілісекунд від кадру до кадру. Саме тому функція [code]_process()[/code] приймає параметр [code]delta[/code]. Дельта позначає проміжок часу. Тобто, це час, у секундах, що пройшов від початку опрацювання попереднього кадру. Ми можемо використати його, щоб гарантувати, що відмінність між кадрами не зіпсує враження від гри. Це пов'язано з тим, що різні комп'ютери працюють по-різному, тому на швидкому комп'ютері буде більше кадрів на секунду, ніж на повільному. Якщо ми знехтуємо [code]delta[/code], враження від гри відрізнятимуться, залежно від комп'ютера. Дельта допомагає зробити ігровий процес однаковим для всіх.
zh_hant: 根據遊戲、電腦和遊戲引擎需要計算的內容，顯示每幀所需的時間會有所不同。 每幀之間的時間會有毫秒級的變化。 這就是為什麼 [code]_process()[/code] 函式會接收一個 [code]delta[/code] 參數。 Delta 代表時間差。它是自上一幀以來經過的時間，單位為秒。 我們可以利用它來確保幀之間的變化不會讓遊戲的行為變得不穩定。 這是因為不同的電腦運行速度不同，所以快速的電腦每秒能顯示更多幀，而慢速的電腦則顯示較少。 如果我們忽略 [code]delta[/code]，遊戲體驗會因為電腦不同而有所變化。Delta 幫助確保每個人的遊戲體驗是一致的。

source: [code]delta[/code] is the time it took Godot to complete the previous frame in seconds. It's very small because frames happen many times a second. It varies each frame because Godot needs to process more or less each frame.
de: [code]delta[/code] ist die Zeit in Sekunden, die Godot benötigt, um den vorherigen Frame abzuschließen. Delta ist eine sehr kleine Zahl, weil die Bilder viele Male pro Sekunde berechnet werden. Die Zeit von Frame zu Frame variiert, da Godot pro Frame mehr oder weniger rechnen muss.
es: [code]delta[/code] es el tiempo que le toma a Godot completar el fotograma anterior en segundos. Es muy pequeño porque los fotogramas ocurren muchas veces por segundo. Varía en cada fotograma porque Godot necesita procesar más o menos cada fotograma.
it: [code]delta[/code] è il tempo impiegato da Godot per completare il fotogramma precedente, in secondi. È molto piccolo perché i fotogrammi si susseguono più volte al secondo. Varia a ogni fotogramma perché Godot ha bisogno di elaborare più o meno fotogrammi.
ru: [code]delta[/code] — это время, которое потребовалось Godot для завершения предыдущего кадра в секундах. Это значение очень мало, так как за одну секунду обрабатывается множество кадров. Значение delta отличается от кадра к кадру, так как обработку каждого из них Godot выполняет за различное количество времени.
ta: [குறியீடு] டெல்டா [/குறியீடு] முந்தைய சட்டகத்தை நொடிகளில் முடிக்க கோடோட் எடுத்த நேரம். இது மிகவும் சிறியது, ஏனெனில் பிரேம்கள் ஒரு நொடிக்கு பல முறை நடக்கும். இது ஒவ்வொரு சட்டகத்தையும் மாறுபடும், ஏனெனில் கோடோட் ஒவ்வொரு சட்டகத்தையும் அதிகமாகவோ அல்லது குறைவாகவோ செயலாக்க வேண்டும்.
uk: [code]delta[/code] — цей час, у секундах, який Godot має для завершення попереднього кадру. Це значення дуже мале, оскільки за одну секунду з'являється багато кадрів. Значення delta відрізняється від кадру до кадру, оскільки Godot опрацьовує кожен із них за різний час.
zh_hant: [code]delta[/code] 是 Godot 完成上一幀所花費的時間，單位為秒。 它的數值非常小，因為每秒會有很多幀。 它在每幀之間有所變化，因為 Godot 每幀需要處理的內容多寡不同。

source: The [code]delta[/code] you get in [code]_process()[/code] is a time difference in seconds. It will generally be a tiny decimal number. To apply [code]delta[/code], you need to [i]multiply[/i] your speed values by it.
cs: [code]delta[/code], kterou získáte v [code]_process()[/code], je časový rozdíl v sekundách. Obecně se bude jednat o malé desetinné číslo. Chcete-li použít [code]delta[/code], musíte jím [i]vynásobit[/i] své hodnoty rychlosti.
de: Die Zeitdifferenz([code]delta[/code]), die Du in [code]_process()[/code] erhaltst, ist eine Differenz in Sekunden. Es wird im Allgemeinen eine winzige Dezimalzahl sein. Um die Zeitdifferenz[code]delta[/code] anzuwenden, musst Du deine Geschwindigkeitswerte mit ihr [i]multiplizieren[/i].
es: El [code]delta[/code] que obtienes en [code]_process()[/code] es una diferencia de tiempo en segundos. Por lo general, será un número decimal muy pequeño. Para aplicar [code]delta[/code], tienes que [i]multiplicar[/i] tus valores de velocidad por él.
it: Il [code]delta[/code] che ottieni nella funzione [code]_process()[/code] è una differenza di tempo in secondi. In genere sarà un piccolo numero decimale. Per applicare il [code]delta[/code], devi [i]moltiplicarlo[/i] ai tuoi valori di velocità.
ru: [code]Delta[/code], которую вы получаете в функции [code]_process()[/code] — это разница во времени в секундах. Обычно она представлена очень маленькой десятичной дробью. Чтобы применить параметр [code]delta[/code], вам нужно [i]умножить[/i] все значения скорости на него.
ta: [குறியீடு] டெல்டா [/குறியீடு] நீங்கள் [குறியீடு] _ நடைமுறையில் () [/குறியீடு] பெறும் நொடிகளில் நேர வேறுபாடு. இது பொதுவாக ஒரு சிறிய தசம எண்ணாக இருக்கும். [குறியீடு] டெல்டா [/குறியீடு] ஐப் பயன்படுத்த, உங்கள் வேக மதிப்புகளை நீங்கள் பெருக்க வேண்டும் [/i].
uk: [code]Delta[/code], яку ви отримуєте у функції [code]_process()[/code] — це проміжок часу в секундах. Зазвичай її задають дуже малим десятковим дробом. Щоб застосувати параметр [code]delta[/code], вам потрібно [i]помножити[/i] на нього всі значення швидкості.
zh_hant: 在 [code]_process()[/code] 中取得的 [code]delta[/code] 是以秒為單位的時間差。它通常是個很小的十進位數字。 要應用 [code]delta[/code]，你需要將你的速度值[b]乘以[/b]它。

source: When multiplying by [code]delta[/code], you make motion [i]time-dependent[/i] rather than [i]frame-dependent[/i]. That's essential to make your game consistent and fair.
cs: Vynásobením [code]delta[/code] zařídíte, že pohyb bude [i]časově závislý[/i], nikoli [i]rámcově závislý[/i]. To je nezbytné, aby hra působila plynule a hezky.
de: Wenn Dumit [code]delta[/code] multiplizierst, machst Du die Bewegung [i]zeitabhängig[/i] statt [i]frame-abhängig[/i]. Das ist wichtig, um dein Spiel konsistent und fair zu machen.
es: Al multiplicar por [code]delta[/code], haces que el movimiento sea [i]dependiente del tiempo[/i] en lugar de [i]dependiente del fotograma[/i]. Eso es esencial para que tu juego sea consistente y justo.
it: Quando moltiplichi per [code]delta[/code], rendi il movimento [i]tempo-dipendente[/i] piuttosto ché [i]frame-dipendente[/i]. Questo è essenziale per rendere il tuo gioco costante e onesto.
ru: Умножением на [code]delta[/code] вы делаете движение [i]зависящим от времени[/i] (time-dependent), и стираете его [i]зависимость от кадра[/i] (frame-dependent). Это важно для того, чтобы ваша игра была последовательной и справедливой.
ta: [குறியீடு] டெல்டா [/குறியீடு] ஆல் பெருக்கும்போது, நீங்கள் [i] பிரேம் சார்ந்த [/i] ஐ விட இயக்கத்தை [i] நேரத்தைச் சார்ந்த [/i] செய்கிறீர்கள். உங்கள் விளையாட்டை சீரானதாகவும் நியாயமாகவும் மாற்ற இது தேவை.
uk: Множенням на [code]delta[/code] ви робите рух [i]залежним від часу[/i] (time-dependent), і усуваєте його [i]залежність від кадру[/i] (frame-dependent). Це важливо для того, щоб ваша гра була послідовною та справедливою.
zh_hant: 當你將速度值乘以 [code]delta[/code] 時，你使得運動變為[b]基於時間[/b]而非[b]基於幀[/b]。 這對於保持遊戲的一致性和公平性是至關重要的。

source: At the top of the lesson, we made the robot rotate a fixed amount every frame: [code]0.05[/code] radians. In the example above, we now [i]multiply[/i] the argument by the very small [code]delta[/code] value, a value way below [code]1.0[/code]. It makes the robot turn at a constant speed over time. However, multiplying by a number below [code]1.0[/code] like [code]delta[/code] makes the result smaller. To compensate for that and make the robot turn fast enough, we use a larger number than before, [code]3.0[/code] instead of [code]0.05[/code]. Those numbers have two different [i]units[/i]: [code]0.05[/code] is an [i]angle[/i] in radians, while [code]3.0[/code] is an [i]angular speed[/i] in radians per second. When you multiply a speed by a time delta, it gives you an angle. Don't worry if it's a little confusing for now. It'll eventually click as you deal with speed, acceleration, and motion in your game projects.
cs: Na začátku lekce jsme robota přiměli, aby se každý snímek otočil o pevnou hodnotu: [code]0,05[/code] radiánů. Ve výše uvedeném příkladu nyní [i]vynásobíme[/i] argument velmi malou hodnotou [code]delta[/code], tedy hodnotou hluboko pod [code]1,0[/code]. Díky tomu se robot v průběhu času otáčí konstantní rychlostí. Vynásobení číslem nižším než [code]1,0[/code], například [code]delta[/code], však způsobí, že výsledek bude menší. Abychom toto kompenzovali a robot se otáčel dostatečně rychle, použijeme větší číslo než dříve, [code]3,0[/code] místo [code]0,05[/code]. Tato čísla mají dvě různé [i]jednotky[/i]: [code]0,05[/code] je [i]úhel[/i] v radiánech, zatímco [code]3,0[/code] je [i]úhlová rychlost[/i] v radiánech za sekundu. Když vynásobíte rychlost deltou času, získáte úhel. Asi je to zatím trochu matoucí. Ale časem to rozlousknete, až se budete zabývat rychlostí, zrychlením a pohybem ve svých herních projektech.
de: Zu Beginn der Lektion haben wir den Roboter dazu gebracht, jeden Frame einen festen Betrag zu drehen: [code]0.05[/code]Bogenmaß. Im obigen Beispiel [i]multiplizieren[/i] wir nun das Argument mit dem sehr kleinen [code]delta[/code]-Wert, einem Wert weit unter [code]1.0[/code]. Es lässt den Roboter im Laufe der Zeit mit konstanter Geschwindigkeit drehen. Die Multiplikation mit einer Zahl unterhalb von [code]1.0[/code] wie [code]delta[/code] macht das Ergebnis jedoch kleiner. Um das zu kompensieren und den Roboter schnell genug drehen zu lassen, verwenden wir eine größere Zahl als zuvor, [code]3.0[/code] anstelle von [code]0.05[/code]. Diese Zahlen haben zwei verschiedene [i]Einheiten[/i]: [code]0.05[/code] ist ein [i]Winkel[/i] im Bogenmaß, während [code]3.0[/code] eine [i]Winkelgeschwindigkeit[/i] im Bogenmaß pro Sekunde ist. Wenn Du eine Geschwindigkeit mit einem delta multiplizierst, erhältst Du einen Winkel. Mach dir keine Sorgen, wenn es im Moment ein wenig verwirrend ist. Du wirst es schon noch verstehen, wenn Du dich mit Geschwindigkeit, Beschleunigung und Bewegung in deinen Spielprojekten befassst.
es: Al principio de la lección, hicimos que el robot girara por una cantidad fija en cada fotograma: [code]0.05[/code] radianes. En el ejemplo anterior, ahora [i]multiplicamos[/i] el argumento por el muy pequeño valor de [code]delta[/code], un valor muy inferior a [code]1.0[/code]. Esto hace que el robot gire a una velocidad constante en el tiempo. Sin embargo, multiplicar por un número inferior a [code]1.0[/code] como [code]delta[/code] hace que el resultado sea más pequeño. Para compensar eso y hacer que el robot gire lo suficientemente rápido, utilizamos un número mayor que antes, [code]3.0[/code] en lugar de [code]0.05[/code]. Esos números tienen dos [i]unidades[/i] diferentes: [code]0.05[/code] es un [i]ángulo[/i] en radianes, mientras que [code]3.0[/code] es una [i]velocidad angular[/i] en radianes por segundo. Cuando multiplicas una velocidad por un delta de tiempo, te da un ángulo. No te preocupes si es un poco confuso por ahora. Con el tiempo irá encajando a medida que trates con la velocidad, la aceleración y el movimiento en tus proyectos de juego.
it: All'inizio della lezione, abbiamo fatto ruotare il robot una quantità fissa ogni frame: [code]0.05[/code] radianti. Nell'esempio qua sopra, ora viene [i]moltiplicato[/i] l'argomento con il piccolo valore di [code]delta[/code], un valore molto più basso di [code]1.0[/code]. Questo fa ruotare il robot ad una velocità costante nel tempo. Tuttavia, moltiplicare per un numero sotto [code]1.0[/code] come [code]delta[/code] rende il risultato più piccolo. Per compensare e per far muovere il robot abbastanza velocemente, usiamo un numero più grande di prima, [code]3.0[/code] al posto di [code]0.05[/code]. Quei numeri hanno due [i]unità[/i] differenti: [code]0.05[/code] è un [i]angolo[/i] in radianti, mentre [code]3.0[/code] è una [i]velocità angolare[/i] in radianti al secondo. Quando moltiplichi una velocità per un tempo delta, ricevi un angolo. Non ti preoccupare se sembra un po' confusionario per ora. Ci farai l'abitudine lavorando con velocità, accelerazioni e moti nei tuoi progetti videoludici.
ru: Перед этим уроком мы сделали так, чтобы робот вращался на фиксированное значение ([code]0.05[/code] радиан) каждый кадр. В примере выше мы [i]умножили[/i] аргумент на очень маленькое значение [code]delta[/code], значение, существенно меньшее чем [code]1.0[/code]. Благодаря этому робот поворачивается со скоростью, фиксированной во времени. Однако умножение на число ниже [code]1.0[/code], такое как [code]delta[/code], делает результат меньше. Чтобы компенсировать это и сделать вращение робота достаточно быстрым, мы должны использовать числа, которые больше тех, что мы использовали раньше, [code]3.0[/code] вместо [code]0.05[/code]. Эти числа имеют две разные [i]единицы измерения[/i]: [code]0,05[/code] — это [i]угол[/i] в радианах, а [code]3.0[/code] — это [i]угловая скорость[/i] в радианах в секунду. Когда вы умножаете скорость на дельту времени, в результате вы получаете угол. Не волнуйтесь, если сейчас это несколько обескураживает. В конечном итоге понимание к вам придёт после того, как вы разберётесь со скоростью, ускорением и движением в ваших игровых проектах.
ta: பாடத்தின் மேற்புறத்தில், ரோபோ ஒவ்வொரு சட்டகத்தையும் ஒரு நிலையான தொகையை சுழற்றினோம்: [குறியீடு] 0.05 [/குறியீடு] ரேடியன்கள். மேலே உள்ள எடுத்துக்காட்டில், நாங்கள் இப்போது [i] மிகச் சிறிய [குறியீடு] டெல்டா [/குறியீடு] மதிப்பால் வாதத்தை பெருக்குகிறோம், [குறியீடு] 1.0 [/குறியீடு] கீழே உள்ள மதிப்பு வழி. இது ரோபோவை காலப்போக்கில் நிலையான வேகத்தில் மாற்ற வைக்கிறது. இருப்பினும், [குறியீடு] டெல்டா [/குறியீடு] போன்ற [குறியீடு] 1.0 [/குறியீடு] கீழே உள்ள எண்ணால் பெருக்கி முடிவை சிறியதாக ஆக்குகிறது. அதற்கு ஈடுசெய்யவும், ரோபோவை போதுமான அளவு விரைவாக மாற்றவும், [குறியீடு] 0.05 [/குறியீடு] க்கு பதிலாக [குறியீடு] 3.0 [/குறியீடு] முன்பை விட பெரிய எண்ணைப் பயன்படுத்துகிறோம். அந்த எண்கள் இரண்டு வெவ்வேறு [i] அலகுகளைக் கொண்டுள்ளன [/i]: [குறியீடு] 0.05 [/குறியீடு] என்பது ரேடியன்களில் ஒரு [i] கோணம் [/i], அதே நேரத்தில் [குறியீடு] 3.0 [/குறியீடு] ஒரு [i] கோணமாகும் விரைவு [/i] நொடிக்கு ரேடியன்களில். நீங்கள் ஒரு வேகத்தை டெல்டாவால் பெருக்கும்போது, அது உங்களுக்கு ஒரு கோணத்தை அளிக்கிறது. இப்போது கொஞ்சம் குழப்பமாக இருந்தால் கவலைப்பட வேண்டாம். உங்கள் விளையாட்டு திட்டங்களில் விரைவு, முடுக்கம் மற்றும் இயக்கத்தை நீங்கள் சமாளிக்கும்போது இது இறுதியில் சொடுக்கு செய்யும்.
uk: На початку уроку ми зробили так, щоб робот повертався на фіксоване значення ([code]0.05[/code] радіан) щокадру. У прикладі вище ми [i]помножили[/i] аргумент на дуже маленьке значення [code]delta[/code], суттєво менше, ніж [code]1.0[/code]. Завдяки цьому робот повертається з постійною швидкістю. Однак множення на число, менше від [code]1.0[/code], таке як [code]delta[/code], робить результат меншим. Щоб компенсувати це і зробити обертання робота досить швидким, слід використати числа, більші від тих, що ми використовували раніше, [code]3.0[/code] замість [code]0.05[/code]. Ці числа мають дві різні [i]одиниці вимірювання[/i]: [code]0,05[/code] — це [i]кут[/i] у радианах, а [code]3.0[/code] — це [i]кутова швидкість[/i] в радіанах за секунду. Коли ви множите швидкість на дельту часу, ви отримуєте кут. Не хвилюйтеся, якщо зараз це дещо бентежить. Зрештою, розуміння до вас прийде після того, як ви розберетеся зі швидкістю, прискоренням і рухом у ваших ігрових проєктах.
zh_hant: 在課程的開始，我們讓機器人每幀旋轉固定的角度：[code]0.05[/code] 弧度。 在上面的例子中，我們現在將引數乘以一個非常小的 [code]delta[/code] 值，這個值遠低於 [code]1.0[/code]。這樣做使得機器人以恆定的速度隨時間旋轉。 然而，將數字乘以像 [code]delta[/code] 這樣小於 [code]1.0[/code] 的數值會使結果變得更小。 為了補償這一點並讓機器人足夠快地旋轉，我們使用了比之前更大的數字，[code]3.0[/code] 取代了 [code]0.05[/code]。 這些數字有兩種不同的[b]單位[/b]： [code]0.05[/code] 是[b]角度[/b]（以弧度為單位），而 [code]3.0[/code] 是[b]角速度[/b]（每秒弧度數）。 當你將一個速度與時間差 [code]delta[/code] 相乘時，它會給你一個角度。 如果現在有些混亂也不用擔心，當你在遊戲專案中處理速度、加速度和運動時，這些概念最終會變得更清晰。
