Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-16-2d-vectors.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: We call this a [i]constructor function call[/i]. You can think of it as a special kind of function that creates a particular type of value.
cs: Říkáme tomu [i]volání funkce konstruktoru[/i]. Můžete si to představit jako zvláštní druh funkce, která vytváří hodnotu daného typu (tady Vector2).
da: Vi kalder dette et [i]konstruktørfunktionskald[/i]. Du kan tænke på det som en særlig type funktion, der opretter en bestemt type værdi.
de: Wir nennen dies einen [i]Konstruktorfunktionsaufruf[/i]. Du kannst es Dir als eine spezielle Art von Funktion vorstellen, die eine bestimmte Art von Wert erzeugt.
es: Llamamos a esto una [i]llamada a una función constructora[/i]. Puedes pensar en ella como un tipo especial de función que crea un tipo de valor particular.
fr: Nous appelons cela un [i]appel de fonction constructeur[/i]. Vous pouvez le considérer comme un type spécial de fonction qui crée un type particulier de valeur.
ja: これを[i]コンストラクタ関数呼び出し[/i]と呼びます。これは、特定の種類の値を作成する特殊な種類の関数と考えることができます。
pt: Chamamos isso de [i]chamada de função de construtor[/i]. Pode pensar nisso como um tipo especial de função que cria um tipo específico de valor.
tr: Buna [i]oluşturucu fonksiyon çağrısı [/i] diyoruz. Bunu, belirli bir değer tipini oluşturan özel bir fonksiyon türü olarak düşünebilirsiniz.
uk: Ми називаємо це [i]викликом функції конструктора[/i]. Ви можете думати про це як про особливий вид функції, яка створює певний тип вартості.

source: The code [code]Vector2(0.2, 0.2)[/code] constructs a new [code]Vector2[/code] value with its [code]x[/code] set to [code]0.2[/code] and its [code]y[/code] set to [code]0.2[/code], respectively.
cs: Kód [code]Vector2(0.2, 0.2)[/code] konstruuje novou hodnotu [code]Vector2[/code] s její [code]x[/code] nastavenou na [code]0.2[/code] a jeho [code]y[/code] nastavenou na [code]0,2[/code].
da: Koden [code]Vector2(0.2, 0.2)[/code] konstruerer en ny [code]Vector2[/code]-værdi med dens [code]x[/code] sat til [code]0.2[/code] og dens [code]y[/code] sat til [code]0.2[/code].
de: Der Code [code]Vector2(0.2, 0.2)[/code] erstellt einen neuen [code]Vector2[/code]-Wert, dessen [code]x[/code] auf [code]0.2[/code] bzw. [code]y[/code] auf [code]0.2[/code] festgelegt ist.
es: El código [code]Vector2(0.2, 0.2)[/code] construye un nuevo valor de [code]Vector2[/code] con su [code]x[/code] establecida en [code]0.2[/code] y su [code]y[/code] establecida en [code]0.2[/code], respectivamente.
fr: Le code [code]Vector2(0.2, 0.2)[/code] construit une nouvelle valeur de [code]Vector2[/code] avec son [code]x[/code] défini sur [code]0.2[/code] et son [code]y[/code] défini sur [code]0.2[/code], respectivement.
ja: コード [code]Vector2(0.2, 0.2)[/code] は、[code]x[/code] を [code]0.2[/code] に、 [code]y[/code] を [code]0.2[/code] に設定して、新しい [code]Vector2[/code] 値を構築します。
pt: O código [code]Vector2(0.2, 0.2)[/code] constrói um novo valor de [code]Vector2[/code] com o [code]x[/code] dele definido como [code]0.2[/code] e o [code]y[/code] dele definido como [code]0.2[/code], respetivamente.
tr: [code]Vector2(0.2, 0.2)[/code] kodu, sırasıyla [code]x[/code] üyesinde [code]0.2[/code] ve [code]y[/code] üyesinde [code]0.2[/code] değerleri olan yeni bir [code]Vector2[/code] değeri oluşturur.
uk: Код [code]Vector2(0.2, 0.2)[/code] створює нове значення [code]Vector2[/code] із значенням [code]x[/code] [code]0.2[/code] і його [code]y[/code] встановлено на [code]0.2[/code] відповідно.

source: Using vectors to change the position
cs: Použití vektorů ke změně polohy
da: Brug af vektorer til at ændre positionen
de: Verwenden von Vektoren zum Ändern der Position
es: Usar vectores para cambiar la posición
fr: Utiliser des vecteurs pour changer la position
it: Usando i vettori per cambiare la posizione
ja: ベクトルを使用して位置を変更する
nl: Vectoren gebruiken om de positie te veranderen
pt: Usando vetores para mudar a posição
pt_br: Usando vetores para mudar a posição
ru: Использование векторов для изменения позиции
ta: நிலையை மாற்ற திசையன்களைப் பயன்படுத்துதல்
tr: Konumu değiştirmek için vektörleri kullanmak
uk: Використання векторів для зміни положення
zh_hans: 使用向量改变位置
zh_hant: 使用向量改變位置

source: We can add and subtract vectors to [code]position[/code] because it's a vector. If we wanted to move our robot to a new relative position, we would add a [code]Vector2[/code] to its [code]position[/code].
cs: Můžeme přičítat a odečítat vektory do/z [code]position[/code], protože je typu vektor. Pokud bychom chtěli přesunout našeho robota do nové relativní polohy, přidali bychom [code]Vector2[/code] do jeho [code]position[/code].
da: Vi kan addere og subtrahere vektorer til [code]position[/code], fordi det er en vektor. Hvis vi ville flytte vores robot til en ny relativ position, ville vi tilføje en [code]Vektor2[/code] til dens [code]position[/code].
de: Wir können Vektoren zu [code]position[/code] addieren und subtrahieren, da es sich um einen Vektor handelt. Wenn wir unseren Roboter an eine neue relative Position bewegen wollten, würden wir einen [code]Vector2[/code] zu seiner [code]position[/code] hinzufügen.
es: Podemos sumarle y restarle vectores a [code]position[/code] porque es un vector. Si quisiéramos mover nuestro robot a una nueva posición relativa, le sumaríamos un [code]Vector2[/code] a su [code]position[/code].
fr: Nous pouvons ajouter et soustraire des vecteurs à [code]position[/code] car ceci est un vecteur. Si nous voulions déplacer notre robot vers une nouvelle position relative, nous ajouterions un [code]Vector2[/code] à sa [code]position[/code].
it: Possiamo aggiungere o sottrarre vettori alla [code]position[/code] perchè è un vettore. Se volessimo muovere il nostro robot ad una nuova posizione relativa, potremmo aggiungere un [code]Vector2[/code] alla sua [code]position[/code].
ja: ベクトルであるため、[code]position[/code]にベクトルを加算および減算できます。ロボットを新しい相対位置に移動する場合は、その [code]position[/code] に [code]Vector2[/code] を追加します。
nl: We kunnen vectoren optellen en aftrekken van [code]position[/code] omdat het een vector is. Als we onze robot naar een nieuwe relatieve positie willen verplaatsen, tellen we een [code]Vector2[/code] op bij de [code]position[/code].
pt: Podemos adicionar e subtrair vetores na variável [code]position[/code] porque ela é um vetor. Se quiséssemos mover nosso robô para uma nova posição relativa, adicionaríamos um [code]Vector2[/code] na variável dele [code]position[/code].
pt_br: Podemos adicionar e subtrair vetores na variável [code]position[/code] porque ela é um vetor. Se quiséssemos mover nosso robô para uma nova posição relativa, adicionaríamos um [code]Vector2[/code] na sua variável [code]position[/code].
ru: Мы можем прибавлять и вычитать векторы из [code]position[/code], потому что позиция — это вектор. Если бы мы захотели передвинуть нашего робота в новую позицию относительно текущей, мы могли бы прибавить [code]Vector2[/code] к его [code]position[/code].
ta: திசையன்களை [குறியீடு] நிலைக்கு [/குறியீடு] சேர்க்கலாம் மற்றும் கழிக்கலாம், ஏனெனில் இது ஒரு திசையன். எங்கள் ரோபோவை ஒரு புதிய உறவினர் நிலைக்கு நகர்த்த விரும்பினால், நாங்கள் ஒரு [குறியீடு] திசையன் 2 [/குறியீடு] ஐ அதன் [குறியீடு] நிலைக்கு [/குறியீடு] சேர்ப்போம்.
tr: [code]position[/code] (konum) değişkenine vektör ekleyip çıkarabiliriz çünkü o da bir vektördür. Robotumuzu yeni bir göreceli konuma taşımak isteseydik, [code]position[/code] değişkenine bir [code]Vector2[/code] eklerdik.
uk: Ми можемо додавати та віднімати вектори до [code]position[/code], оскільки це вектор. Якби ми хотіли перемістити нашого робота в нове відносне положення, ми б додали [code]Вектор2[/code] до його [code]положення[/code].
zh_hans: 我们可以在 [code]position[/code] 中加减向量，因为它也是一个向量。如果想将机器人移动到一个新的相对位置上，需要给它的 [code]position[/code] 加上一个 [code]Vector2[/code]。
zh_hant: 我們可以對 [code]position[/code] 進行向量加法或減法，因為它本身就是一個向量。如果我們想將機器人移動到新的相對位置，只需將一個 [code]Vector2[/code] 加到它的 [code]position[/code] 上。

source: How would you move the robot 50 pixels to the left?
cs: Jak byste posunuli robota o 50 pixelů doleva?
da: Hvordan ville du flytte robotten 50 pixels til venstre?
de: Wie würdest Du den Roboter 50 Pixel nach links bewegen?
es: ¿Cómo moverías el robot 50 pixeles a la izquierda?
fr: Comment déplaceriez-vous le robot de 50 pixels vers la gauche ?
it: Come muoveresti il robot di 50 pixel a sinistra?
ja: ロボットを左に 50 ピクセル移動させるにはどうすればよいでしょうか？
nl: Hoe zou je de robot 50 pixels naar links verplaatsen?
pt: Como moveria o robô 50 pixels para a esquerda?
pt_br: Como você moveria o robô 50 pixels para a esquerda?
ru: Как бы вы передвинули робота на 50 пикселей влево?
ta: ரோபோ 50 பிக்சல்களை இடதுபுறமாக எவ்வாறு நகர்த்துவீர்கள்?
tr: Robotu 50 piksel sola nasıl hareket ettirirsiniz?
uk: Як би ви перемістили робота на 50 пікселів ліворуч?
zh_hans: 如何将机器人向左移动 50 像素？
zh_hant: 如何將機器人向左移動 50 像素？

source: [code]position -= Vector2(50, 0)[/code] subtracts [code]50[/code] to the sub-variable [code]x[/code], and [code]0[/code] to [code]y[/code].
da: [code]position -= Vector2(50, 0)[/code] subtraherer [code]50[/code] fra undervariablen [code]x[/code], og [code]0[/code] til [code]y[/code].
de: [code]position -= Vector2(50, 0)[/code] subtrahiert [code]50[/code] zur Untervariablen [code]x[/code] und [code]0[/code] zu [code]y[/code].
es: [code]position -= Vector2(50, 0)[/code] le resta [code]50[/code] a la subvariable [code]x[/code], y [code]0[/code] a [code]y[/code].
fr: [code]position -= Vector2(50, 0)[/code] soustrait [code]50[/code] à la sous-variable [code]x[/code], et [code]0[/code] à [code]y[/code].
ja: [code]position -= Vector2(50, 0)[/code] は、サブ変数 [code]x[/code] に [code]50[/code] を減算し、[code]0[/code] を [code]y[/code] に減算します。
tr: [code]position -= Vector2(50, 0)[/code], [code]x[/code] alt-değişkeninden [code]50[/code] ve [code]y[/code] alt-değişkeninden [code]0[/code] çıkartır.
uk: [code]position -= Vector2(50, 0)[/code] віднімає [code]50[/code] до підзмінної [code]x[/code], а [code]0[/code] до [code]у[/code].

source: [code]position.x -= Vector2(50, 0)[/code] tries to subtract a 2D vector to the sub-variable [code]x[/code], which is a decimal number. The value types are incompatible. If you try to do this, you will get an error.
cs: [code]position.x -= Vektor(50, 0)[/code] se pokusí odečíst 2D vektor k podproměnné [code]x[/code], což je desetinné číslo. Typy hodnot jsou nekompatibilní. Pokud se o to pokusíte, zobrazí se chyba.
da: [code]position.x -= Vector2(50, 0)[/code] forsøger at subtrahere en 2D-vektor til undervariablen [code]x[/code], som er et decimaltal. Værdityperne er inkompatible. Hvis du forsøger at gøre dette, får du en fejl.
de: [code]position.x -= Vector2(50, 0)[/code] versucht, einen 2D-Vektor auf die Untervariable [code]x[/code] zu subtrahieren, die eine Dezimalzahl ist. Die Werttypen sind nicht kompatibel. Wenn Du das versuchst, erhältst Du eine Fehlermeldung.
es: [code]position.x -= Vector2(50, 0)[/code] intenta restarle un vector 2D a la subvariable [code]x[/code], que es un número decimal. Los tipos de valores son incompatibles. Si intentas hacer esto, obtendrás un error.
fr: [code]position.x -= Vecteur(50, 0)[/code] essaie de soustraire un vecteur 2D à la sous-variable [code]x[/code], qui est un nombre décimal. Les types de valeurs sont incompatibles. Si vous essayez de le faire, vous obtiendrez une erreur.
ja: [code]position.x -= Vector2(50, 0)[/code] は、2D ベクトルをサブ変数 [code]x[/code] (10 進数) に減算しようとします。値の型に互換性がありません。これを行おうとすると、エラーが発生します。
tr: [code]position.x -= Vector2(50, 0)[/code], bir ondalık sayı olan [code]x[/code] alt-değişkeninden bir 2B vektör çıkarmaya çalışır. Değer tipleri uyumsuzdur. Bunu yapmaya çalışırsanız bir hata alırsınız.
uk: [code]position.x -= Vector2(50, 0)[/code] намагається відняти двовимірний вектор від підзмінної [code]x[/code], яка є десятковим числом. Типи значень несумісні. Якщо ви спробуєте це зробити, ви отримаєте помилку.

source: In the next few practices, you'll use vectors to change scale and position values.
cs: V několika následujících cvičeních budete používat vektory ke změně hodnot měřítka a polohy.
da: I de næste par øvelser vil du bruge vektorer til at ændre skala- og positionsværdier.
de: In den nächsten Übungen verwendest Du Vektoren, um die Werte von Skalierung und Position zu ändern.
es: En las próximas prácticas, utilizarás vectores para cambiar los valores de escala y posición.
fr: Dans les exercices suivants, vous utiliserez des vecteurs pour modifier les valeurs d'échelle et de position.
it: Nelle prossime pratiche, userai i vettori per cambiare la grandezza e la posizione.
ja: 次のいくつかの演習では、ベクトルを使用してスケールと位置の値を変更します。
nl: In de volgende oefeningen zul je vectoren gebruiken om schaal- en positiewaarden te veranderen.
pt: Nas próximas práticas, irá usar vetores para alterar os valores de escala e posição.
pt_br: Nas próximas práticas, você vai usar vetores para alterar os valores de escala e posição.
ru: В следующих упражнениях мы будем использовать векторы для изменения размера и позиции робота.
ta: அடுத்த சில நடைமுறைகளில், அளவு மற்றும் நிலை மதிப்புகளை மாற்ற திசையன்களைப் பயன்படுத்துவீர்கள்.
tr: Sıradaki birkaç uygulamada, ölçek ve konum değerlerini değiştirmek için vektörleri kullanacaksınız.
uk: У наступних кількох вправах ви будете використовувати вектори для зміни значень масштабу та положення.
zh_hans: 在接下来的几个练习中，你需要使用向量来更改比例和位置变量的值。
zh_hant: 在接下來的幾個練習中，你將使用向量來修改縮放與位置數值。

source: Increasing scale using vectors
cs: Zvětšování měřítka pomocí vektorů
da: Forøgelse af skala ved hjælp af vektorer
de: Erhöhen der Skalierung mithilfe von Vektoren
es: Aumentar la escala mediante vectores
fr: Augmenter l'échelle en utilisant des vecteurs
it: Aumentare la grandezza usando i vettori
ja: ベクトルを使用したスケールの増大
nl: Schaalvergroting met behulp van vectoren
pt: Aumentando a escala usando vetores
pt_br: Aumentando a escala usando vetores
ru: Увеличение размера при помощи векторов
ta: திசையன்களைப் பயன்படுத்தி அளவை அதிகரிக்கும்
tr: Vektörler kullanarak ölçeği artırmak
uk: Збільшення масштабу за допомогою векторів
zh_hans: 使用向量增加缩放变量（scale）的大小
zh_hant: 使用向量增加縮放(scale)大小

source: Add a line of code to the [code]level_up()[/code] function to increase the [code]scale[/code] of the robot by [code]Vector2(0.2, 0.2)[/code] every time it levels up.
cs: Přidejte do funkce [code]level_up()[/code] řádek kódu, který zvýší [code]scale[/code] robota o [code]Vector2(0.2, 0.2)[/code] při každém zvýšení úrovně.
da: Tilføj en linje kode til funktionen [code]level_up()[/code] for at øge robottens [code]skala[/code] med [code]Vector2(0.2, 0.2)[/code] hver gang den stiger i level.
de: Füge der Funktion [code]level_up()[/code] eine Codezeile hinzu, um die [code]Skalierung[/code] des Roboters bei jedem Level um [code]Vector2(0.2, 0.2)[/code] zu erhöhen.
es: Añade una línea de código a la función [code]level_up()[/code] para aumentar la escala ([code]scale[/code]) del robot en [code]Vector2(0.2, 0.2)[/code] cada vez que suba de nivel.
fr: Ajoutez une ligne de code à la fonction [code]level_up()[/code] pour augmenter la [code]scale[/code] du robot de [code]Vector2(0.2, 0.2)[/code] à chaque fois qu'il monte de niveau.
it: Aggiungi una riga di codice alla funzione [code]level_up()[/code] per incrementare la [code]scale[/code] del robot di [code]Vector2(0.2, 0.2)[/code] ogni volta che sale di livello.
ja: [code]level_up()[/code]関数にコード行を追加して、ロボットがレベルアップするたびに[code]Vector2(0.2, 0.2)[/code]ずつ[code]scale[/code]を増やします。
nl: Voeg een regel code toe aan de functie [code]level_up()[/code] om de [code]scale[/code] van de robot te vergroten met [code]Vector2(0.2, 0.2)[/code] telkens wanneer hij een niveau stijgt.
pt: Adicione uma linha de código na função [code]level_up()[/code] para aumentar a [code]scale[/code] do robô em [code]Vector2(0.2, 0.2)[/code] toda vez que ele aumentar de nível.
pt_br: Adicione uma linha de código na função [code]level_up()[/code] para aumentar a [code]scale[/code] do robô em [code]Vector2(0.2, 0.2)[/code] toda vez que ele aumentar de nível.
ru: Добавьте строку кода в функцию [code]level_up()[/code], чтобы [code]scale[/code] робота увеличивался на [code]Vector2(0.2, 0.2)[/code], при каждом получении им нового уровня.
ta: [குறியீடு] VECTER2 (0.2, 0.2) [/code] மூலம் ரோபோவின் [குறியீடு] அளவிலான [/குறியீடு] அதிகரிக்க [குறியீடு] நிலை_அப் () [/குறியீடு] செயல்பாட்டில் குறியீட்டின் வரியைச் சேர்க்கவும் ஒவ்வொரு முறையும் அது நிலைதான் மேலே.
tr: Robotun ölçeğini, [code]scale[/code], her seviye atladığında [code]Vector2(0.2, 0.2)[/code] kadar artırmak için, [code]level_up()[/code] fonksiyonuna bir kod satırı ekleyin.
uk: Додайте рядок коду до функції [code]level_up()[/code], щоб збільшити [code]масштаб[/code] робота на [code]Vector2(0.2, 0.2)[/code] кожного разу, коли він вирівнюється вгору.
zh_hans: 在 [code]level_up()[/code] 函数中添加一行代码，使机器人的 [code]scale[/code] 每次升级都会增加一个 [code]Vector2(0.2, 0.2)[/code]。
zh_hant: 在 [code]level_up()[/code] 函式內新增一行程式碼，使機器人每次升級時，將其 [code]scale[/code] 增加 [code]Vector2(0.2, 0.2)[/code]。

source: To visually show our robot has gained in strength, let's increase its size every time it levels up. Nothing could go wrong!
cs: Abychom názorně ukázali, že náš robot získal na síle, zvětšeme jeho velikost pokaždé, když se dostane na vyšší úroveň. Nic se tím nepokazí!
da: For visuelt at vise, at vores robot er blevet stærkere, lad os øge dens størrelse, hver gang den stiger i level. Det går aldrig galt!
de: Um visuell zu zeigen, dass unser Roboter an Stärke gewonnen hat, lass uns seine Größe jedes Mal erhöhen, wenn er aufsteigt. Nichts kann schief gehen!
es: Para mostrar visualmente que nuestro robot ha ganado fuerza, aumentemos su tamaño cada vez que suba de nivel. ¡Nada puede salir mal!
fr: Pour montrer visuellement que notre robot a gagné en force, augmentons sa taille à chaque fois qu'il monte de niveau. Rien ne peut mal se passer !
it: Per mostrare visivamente che il nostro robot ha aumentato la forza, incrementiamo la sua grandezza ogni volta che sale di livello. Niente può andare storto!
ja: ロボットが強くなったことを視覚的に示すために、レベルアップするたびにサイズを大きくしましょう。何もうまくいかないはずがありません!
nl: Om zichtbaar te maken dat onze robot sterker is geworden, vergroten we de robot elke keer dat hij een niveau stijgt. Er kan niets misgaan!
pt: Para mostrar visualmente que nosso robô ganhou força, vamos aumentar o tamanho todo cada vez que ele sobe de nível. Nada poderia ficar errado!
pt_br: Para mostrar visualmente que nosso robô ganhou força, vamos aumentar seu tamanho toda vez que ele subir de nível. Nada poderia dar errado!
ru: Чтобы визуально показать что наш робот стал сильнее, давайте увеличивать его размер при каждом повышении уровня. Что тут может пойти не так!
ta: எங்கள் ரோபோ வலிமையைப் பெற்றிருப்பதைக் காட்ட, ஒவ்வொரு முறையும் அதன் அளவை அதிகரிப்போம். எதுவும் தவறாக நடக்க முடியாது!
tr: Robotumuzun güçlendiğini görsel olarak göstermek için, her seviye atladığında boyutunu artıralım. Hiçbir şey yanlış gidemez!
uk: Щоб візуально показати, що наш робот став сильнішим, давайте збільшуватимемо його розмір щоразу, коли він піднімається на рівень. Ніщо не могло піти не так!
zh_hans: 为了直观地显示我们的机器人已经变强了，让我们在每次升级时让它变大。这准有用！
zh_hant: 為了直觀地展現機器人的成長，每次升級時我們都讓它變大。絕對不會出問題！

source: Resetting size and position using vectors
cs: Resetování velikosti a polohy pomocí vektorů
da: Nulstilling af størrelse og position ved hjælp af vektorer
de: Zurücksetzen von Größe und Position mithilfe von Vektoren
es: Restablecer el tamaño y la posición usando vectores
fr: Réinitialiser la taille et la position à l'aide de vecteurs
it: Resettare la grandezza e la posizione usando i vettori
ja: ベクトルを使用したサイズと位置のリセット
nl: Grootte en positie resetten met vectoren
pt: Redefinindo tamanho e posição usando vetores
pt_br: Redefinindo tamanho e posição usando vetores
ru: Сбросьте размер и позицию при помощи векторов
ta: திசையன்களைப் பயன்படுத்தி அளவு மற்றும் நிலையை மீட்டமைக்கிறது
tr: Vektörler kullanarak boyut ve konumu sıfırlamak
uk: Скидання розміру та положення за допомогою векторів
zh_hans: 使用向量重置大小和位置
zh_hant: 使用向量重設大小與位置

source: The robot's level has increased a lot, and so has its size!
cs: Úroveň robota se hodně zvýšila, stejně jako jeho velikost!
da: Robottens niveau er steget meget, og det samme er dens størrelse!
de: Die Stufe des Roboters hat sich stark erhöht, ebenso wie seine Größe!
es: El nivel del robot ha aumentado mucho, ¡y también su tamaño!
fr: Le niveau du robot a beaucoup augmenté, et sa taille aussi !
ja: ロボットのレベルが大幅に上がり、サイズも大きくなりました!
pt: O nível do robô aumentou muito, assim como seu tamanho!
tr: Robotun seviyesi çok arttı ve boyutu da çok büyüdü!
uk: Рівень робота значно зріс, а також його розмір!

source: Let's fix this by resetting the robot's [code]scale[/code] and [code]position[/code] values.
cs: Pojďme to napravit resetováním hodnot [code]scale[/code] a [code]position[/code] robota.
da: Lad os løse dette ved at nulstille robottens [code]scale[/code] og [code]position[/code] værdier.
de: Beheben wir dieses Problem, indem wir die [code]Skalierung[/code] und [code]Position[/code] des Roboters zurücksetzen.
es: Arreglemos esto restableciendo los valores de [code]scale[/code] y [code]position[/code] del robot.
fr: Corrigeons cela en réinitialisant les valeurs [code]scale[/code] et [code]position[/code] du robot.
ja: ロボットの [code]scale[/code] と [code]position[/code] の値をリセットして、これを修正しましょう。
pt: Vamos corrigir isso redefinindo os valores de [code]scale[/code] e [code]position[/code] do robô.
tr: Robotun ölçek, [code]scale[/code], ve konum, [code]position[/code], değerlerini sıfırlayarak bunu düzeltelim.
uk: Давайте виправимо це, скинувши значення [code]масштабу[/code] і [code]положення[/code] робота.

source: Create a function named [code]reset_robot()[/code] that sets the [code]scale[/code] and [code]position[/code] of the robot.
cs: Vytvořte funkci s názvem [code]reset_robot()[/code], která nastaví [code]scale[/code] a [code]position[/code] robota.
da: Opret en funktion med navnet [code]reset_robot()[/code], der indstiller robottens [code]scale[/code] og [code]position[/code].
de: Erstelle eine Funktion mit dem Namen [code]reset_robot()[/code], die die [code]Skalierung[/code] und [code]Position[/code] des Roboters festlegt.
es: Crea una función llamada [code]reset_robot()[/code] que establezca la [code]scale[/code] y [code]position[/code] del robot.
fr: Créez une fonction appelée [code]reset_robot()[/code] qui définit les valeurs [code]scale[/code] et [code]position[/code] du robot.
ja: ロボットの [code]scale[/code] と [code]position[/code] を設定する [code]reset_robot()[/code] という名前の関数を作成します。
pt: Crie uma função chamada [code]reset_robot()[/code] que defina as variáveis [code]scale[/code] e [code]position[/code] do robô.
tr: Robotun [code]scale[/code] ve [code]position[/code] değerlerini ayarlayan [code]reset_robot()[/code] isminde bir fonksiyon oluşturun.
uk: Створіть функцію під назвою [code]reset_robot()[/code], яка встановлює [code]масштаб[/code] і [code]положення[/code] робота.
