Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-17-while-loops.po
Languages: cs, da, de, es, fr, it, ta, tr, uk, zh_hant

source: You've seen that you can use functions to [i]reuse[/i] code. In this lesson, you'll learn about [b]loops[/b]. Loops help you [i]repeat[/i] code.
da: Du har set, at du kan bruge funktioner til at [i]genbruge[/i] kode. I denne lektion lærer du om [b]løkker[/b]. Lækker hjælper dig med at [i]gentage[/i] kode.
de: Du hast gesehen, dass Du Funktionen verwenden kannst, um [i]Code wiederzuverwenden[/i]. In dieser Lektion lernst Du [b]Schleifen[/b] kennen. Schleifen helfen Dir, [i]Code zu wiederholen[/i].
fr: Vous avez vu que vous pouvez utiliser des fonctions pour [i]réutiliser[/i] du code. Dans cette leçon, vous allez découvrir les [b]boucles[/b]. Les boucles vous aident à [i]répéter[/i] le code.
it: Abbiamo visto che è possibile utilizzare le funzioni per [i]riutilizzare[/i] il codice. In questa lezione imparerete a conoscere i [b]loop[/b]. I loop aiutano a [i]ripetere[/i] il codice.
ta: [I] மறுபயன்பாடு [/i] குறியீட்டிற்கு நீங்கள் செயல்பாடுகளைப் பயன்படுத்தலாம் என்பதை நீங்கள் பார்த்தீர்கள். இந்த பாடத்தில், நீங்கள் [b] சுழல்களைப் பற்றி அறிந்து கொள்வீர்கள் [/b]. சுழல்கள் உங்களுக்கு உதவுகின்றன [நான்] மீண்டும் [/i] குறியீட்டை மீண்டும் செய்யவும்.
tr: Fonksiyonları, kodunuzu [i]yeniden kullanmak[/i] için kullanabileceğinizi gördünüz. Bu derste, [b]döngüler[/b] hakkında bilgi edineceksiniz. Döngüler, kodunuzu [i]tekrarlamanıza[/i] yardımcı olur.
uk: Ви бачили, що функції можна використовувати для [i]повторного використання[/i] коду. В цьому уроці ви дізнаєтесь про [b]цикли[/b]. Цикли дають змогу [i]повторювати[/i] виконання коду.

source: To illustrate how loops work, let's take a game board split into a grid.
da: For at illustrere, hvordan løkker fungerer, lad os tage et spillebræt delt i et gitter.
de: Um zu veranschaulichen, wie Schleifen funktionieren, nehmen wir ein Spielbrett, das in ein Raster aufgeteilt ist.
fr: Pour illustrer le fonctionnement des boucles, prenons un plateau de jeu divisé en une grille comme exemple.
it: Per illustrare il funzionamento dei loop, prendiamo un tabellone di gioco suddiviso in una griglia.
ta: சுழல்கள் எவ்வாறு செயல்படுகின்றன என்பதை விளக்குவதற்கு, ஒரு விளையாட்டு பலகையை ஒரு கட்டமாகப் பிரிப்போம்.
tr: Döngülerin nasıl çalıştığını göstermek için, ızgaraya bölünmüş bir oyun tahtasını ele alalım.
uk: Щоб проілюструвати роботу циклів, розглянемо ігрову дошку, поділену сіткою.

source: Our robot can move to neighboring cells by changing a [code]Vector2[/code] variable named [code]cell[/code]. It represents the current cell the robot is in.
da: Vores robot kan flytte til omkringliggende celler ved at ændre en [code]Vector2[/code] variabel opkaldt [code]cell[/code]. Det repræsenterer den nuværende celle robotten er i.
de: Unser Roboter kann sich in benachbarte Zellen bewegen, indem er eine [code]Vector2[/code]-Variable mit dem Namen [code]cell[/code] ändert.
fr: Notre robot peut se déplacer vers les cases voisines en modifiant une variable [code]Vector2[/code] appelée [code]cell[/code]. Elle représente la cellule dans laquelle se trouve le robot.
it: Il nostro robot può spostarsi nelle celle vicine cambiando una variabile [code]Vector2[/code] chiamata [code]cell[/code]. Essa rappresenta la cella in cui si trova attualmente il robot.
ta: [குறியீடு] வெக்டர் 2 [/குறியீடு] மாறியை [குறியீடு] செல் [/குறியீடு] மாற்றுவதன் மூலம் எங்கள் ரோபோ அண்டை கலங்களுக்கு செல்ல முடியும். இது ரோபோ இருக்கும் தற்போதைய கலத்தைக் குறிக்கிறது.
tr: Robotumuz, hücre, [code]cell[/code], isimli bir [code]Vector2[/code] değişkenini değiştirerek komşu hücrelere geçebilir. Bu, robotun içinde bulunduğu mevcut hücreyi temsil eder.
uk: При зміненні змінної [code]Vector2[/code] з назвою [code]cell[/code], наш робот переміщується на сусідні клітки. Змінна представляє поточну комірку, в якій знаходиться робот.

source: When we increase [code]cell.x[/code], the robot moves to the right.
da: Når vi øger [code]cell.x[/code], flytter robotten til højre.
de: Wenn wir [code]cell.x[/code] erhöhen, bewegt sich der Roboter nach rechts.
fr: Lorsque nous augmentons [code]cell.x[/code], le robot se déplace vers la droite.
it: Aumentando [code]cell.x[/code], il robot si sposta a destra.
ta: நாம் [குறியீடு] Cell.x [/code] ஐ அதிகரிக்கும் போது, ரோபோ வலதுபுறமாக நகர்கிறது.
tr: [code]cell.x[/code] değerini arttırdığımızda robot sağa doğru hareket eder.
uk: Коли ми збільшуємо [code]cell.x[/code], робот переміщується вправо.

source: Note that we delay the robot's movement in the app to help you visualize how it moves. The following code would normally move the robot instantly.
da: Bemærk, at vi forsinker robotbevægelsen i appen for at hjælpe dig med at visualisere, hvordan den bevæger sig. Den følgende kode vil normalt flytte robotten med det samme.
de: Beachte, dass wir die Bewegung des Roboters in der App verzögern, um Dir zu helfen, zu visualisieren, wie er sich bewegt. Der folgende Code würde den Roboter normalerweise sofort bewegen.
fr: Notez que nous retardons le mouvement du robot dans l'application pour vous aider à visualiser comment il se déplace. Le code suivant devrait normalement déplacer le robot instantanément.
it: Si noti che nell'applicazione ritardiamo il movimento del robot per aiutarvi a visualizzarlo. Il codice seguente normalmente farebbe muovere il robot istantaneamente.
ta: பயன்பாட்டில் உள்ள ரோபோவின் இயக்கத்தை அது எவ்வாறு நகர்கிறது என்பதைக் காண உங்களுக்கு உதவுகிறோம் என்பதை நினைவில் கொள்க. பின்வரும் குறியீடு பொதுவாக ரோபோவை உடனடியாக நகர்த்தும்.
tr: Nasıl hareket ettiğini görselleştirmenize yardımcı olmak için uygulamada robotun hareketini yavaşlattığımızı unutmayın. Aşağıdaki kod normalde robotu anında hareket ettirecektir.
uk: Зверніть увагу, що ми затримуємо рух робота в програмі, щоб допомогти вам побачити, як він рухається. Наведений нижче код зазвичай переміщає робота миттєво.

source: We can move diagonally by adding a [code]Vector2[/code] directly.
cs: Úhlopříčně se můžeme pohybovat přidáním [code]Vector2[/code] přímo.
da: Vi kan flytte diagonalt ved at tilføje en [code]Vector2[/code] direkte.
de: Wir können uns diagonal bewegen, indem wir direkt einen [code]Vector2[/code] angeben.
es: Podemos movernos en diagonal sumando un [code]Vector2[/code] directamente.
fr: Nous pouvons nous déplacer en diagonale en ajoutant un [code]Vector2[/code] directement.
it: Ci possiamo muovere diagonalmente aggiungendo direttamente un [code]Vector2[/code].
ta: [குறியீடு] திசையன் 2 [/குறியீடு] ஐ நேரடியாகச் சேர்ப்பதன் மூலம் நாம் குறுக்காக நகர்த்தலாம்.
tr: Doğrudan bir [code]Vector2[/code] ekleyerek çapraz hareket edebiliriz.
uk: Ми можемо рухатися по діагоналі, додаючи безпосередньо [code]Вектор2[/code].
zh_hant: 我們可以透過加上一個 [code]Vector2[/code] 來實現對角線移動。

source: The above code works for a pre-defined board with a size of [code]Vector2(3, 3)[/code], but the [code]move_to_end()[/code] function wouldn't work if the size of the board was different.
da: Ovenstående kode fungerer for et foruddefineret bræt med størrelsen [code]Vector2(3, 3)[/code], men [code]move_to_end()[/code] funktionen ville ikke virke, hvis størrelsen af brættet var anderledes.
de: Der obige Code funktioniert für ein vordefiniertes Brett mit einer Größe von [code]Vector2(3, 3)[/code], aber die Funktion [code]move_to_end()[/code] würde nicht funktionieren, wenn die Größe des Bretts unterschiedlich wäre.
fr: Le code ci-dessus fonctionne pour un plateau prédéfini avec une taille de [code]Vector2(3, 3)[/code], mais la fonction [code]move_to_end()[/code] ne fonctionnerait pas si la taille du plateau était différente
it: Il codice di sopra è usato per una tavola predefinita con grandezza [code]Vector2(3, 3)[/code], ma la funzione [code]move_to_end()[/code] non funzionerebbe se la grandezza della tavola fosse differente.
ta: மேலே உள்ள குறியீடு [குறியீடு] திசையன் 2 (3, 3) [/குறியீடு] அளவைக் கொண்ட முன் வரையறுக்கப்பட்ட பலகைக்கு வேலை செய்கிறது, ஆனால் [குறியீடு] MOVE_TO_END () [/குறியீடு] செயல்பாடு இயங்காது போர்டு வேறு.
tr: Yukarıdaki kod, [code]Vector2(3, 3)[/code] boyutunda önceden tanımlanmış bir tahta için çalışır, ancak [code]move_to_end()[/code] (ilerle_sona) fonksiyonu, tahtanın boyutu farklı olsaydı çalışmazdı.
uk: Наведений вище код працює для попередньо визначеної дошки з розміром [code]Vector2(3, 3)[/code], але функція [code]move_to_end()[/code] не працюватиме, якщо розмір дошка була іншою.

source: The robot would either stop before the end or go too far.
da: Robotten ville enten stoppe før enden eller gå for langt.
de: Der Roboter würde entweder vor dem Ende anhalten oder zu weit gehen.
fr: Le robot s'arrêterait avant la fin ou irait trop loin.
it: Il robot o si fermerebbe prima della fine o andrebbe troppo in la.
ta: ரோபோ இறுதிக்கு முன்பே நின்றுவிடும் அல்லது வெகுதூரம் செல்லும்.
tr: Robot, ya sona varmadan duracak ya da çok ileri gidecekti.
uk: Робот або зупинився до кінця, або зайшов занадто далеко.

source: To implement a general solution for all board sizes, we can repeat the robot's movement until it gets to the end.
da: For at implementere en generel løsning til alle brædtstørrelser, kan vi gentage robottens bevægels, indtil den når enden.
de: Um eine allgemeine Lösung für alle Brettgrößen zu implementieren, können wir die Bewegung des Roboters wiederholen, bis sie zum Ende kommt.
fr: Pour mettre en place une solution générale pour toutes les tailles de plateau, nous pouvons répéter le mouvement du robot jusqu'à ce qu'il arrive à la fin.
it: Per implementare una soluzione generale per qualsiasi grandezza di tavola, possiamo ripetere i movimenti del robot finché non arriva alla fine.
ta: அனைத்து போர்டு அளவுகளுக்கும் ஒரு பொதுவான தீர்வைச் செயல்படுத்த, ரோபோவின் இயக்கம் இறுதிவரை வரும் வரை மறுநிகழ்வு செய்யலாம்.
tr: Tüm tahta boyutları için genel bir çözüm bulmak için, robotun hareketini sona gelene kadar tekrarlayabiliriz.
uk: Щоб реалізувати загальне рішення для всіх розмірів дошки, ми можемо повторювати рух робота, поки він не дійде до кінця.

source: For code that repeats, we can use [i]loops[/i].
da: For kode, der gentager, kan vi bruge [i]løkker[/i].
de: Für Code, der sich wiederholt, können wir [i]Schleifen[/i] verwenden.
fr: Pour le code qui se répète, nous pouvons utiliser des [i]boucles[/i].
it: Per far ripetere il codice, possiamo usare dei [i]cicli[/i].
ta: மறுநிகழ்வு குறியீட்டிற்கு, நாங்கள் [i] சுழல்களைப் பயன்படுத்தலாம் [/i].
tr: Tekrar eden kodlar için [i]döngüleri[/i] kullanabiliriz.
uk: Для коду, який повторюється, ми можемо використовувати [i]цикли[/i].

source: Using while loops to repeat code
cs: Použití smyček while k opakování kódu
da: Brug af while-løkker til at gentage kode
de: Verwenden von while-Schleifen zum Wiederholen von Code
es: Uso de bucles while para repetir código
fr: Utiliser des boucles while pour répéter du code
it: Usando cicli while per ripetere codice
ta: குறியீட்டை மீண்டும் செய்ய சுழல்களைப் பயன்படுத்துதல்
tr: Kodu yinelemek için "while" döngülerini kullanmak
uk: Використання циклів while для повторення коду
zh_hant: 使用 while 迴圈重複執行程式碼

source: You can use a [code]while[/code] loop to make the computer repeat a block of code until you meet a specific condition or decide to break from the loop.
da: Du kan bruge en [code]while[/code]-løkke til at få computeren til at gentage en kodeblok, indtil du opfylder en bestemt betingelse eller beslutter dig for at afbryde løkken.
de: Du kannst mit [code]while[/code]-Schleifen den Computer dazu bringen, einen Codeblock zu wiederholen, bis Du eine bestimmte Bedingung erfülltst oder Dich entscheiden, aus der Schleife auszubrechen.
fr: Vous pouvez utiliser une boucle [code]while[/code] pour que l'ordinateur répète un bloc de code jusqu'à ce que vous remplissiez une condition spécifique ou que vous décidiez de sortir de la boucle.
it: Puoi usare un ciclo [code]while[/code] per far ripetere al computer un blocco di codice finché non viene raggiunta una determinata condizione o si decide di uscire dal ciclo.
ta: நீங்கள் ஒரு குறிப்பிட்ட நிபந்தனையை நிறைவு செய்யும் வரை அல்லது வளையத்திலிருந்து உடைக்க முடிவு செய்யும் வரை கணினி ஒரு குறியீட்டின் தொகுதியை மீண்டும் செய்ய [/குறியீடு] சுழற்சியைப் பயன்படுத்தலாம்.
tr: Belirli bir koşulu karşılayana kadar, veya döngüden çıkmaya karar verene kadar, bilgisayarın bir kod parçasını yinelemesini sağlamak için bir [code]while[/code] (-iken) döngüsü kullanabilirsiniz.
uk: Ви можете використовувати цикл [code]while[/code], щоб змусити комп’ютер повторювати блок коду, доки ви не виконаєте певну умову або не вирішите вийти з циклу.

source: Here's how we use a [code]while[/code] loop.
da: Sådan bruger vi en [code]while[/code]-løkke.
de: So verwenden wir eine [code]while[/code]-Schleife.
fr: Voici comment utiliser une boucle [code]while[/code].
it: Ecco come usiamo i cicli [code]while[/code].
ta: [/Code] லூப்பை போது [குறியீட்டை] எவ்வாறு பயன்படுத்துகிறோம் என்பது இங்கே.
tr: İşte bir [code]while[/code] döngüsünü nasıl kullandığımızın örneği.
uk: Ось як ми використовуємо цикл [code]while[/code].

source: We use the variable [code]number[/code] to keep track of how many loops the [code]while[/code] loop completes.
da: Vi bruger variablen [code]number[/code] til at holde styr på, hvor mange løkker [code]while[/code]-løkken gennemfører.
de: Wir verwenden die Variable [code]number[/code], um zu verfolgen, wie viele Wiederholungen die [code]while[/code]-Schleife abschließt.
fr: Nous utilisons la variable [code]number[/code] pour garder une trace du nombre de boucles que la boucle [code]while[/code] termine.
it: Usiamo la variabile [code]number[/code] per tener conto di quante volte il ciclo [code]while[/code] completa un ciclo.
ta: [/குறியீடு] லூப் முடிந்ததும் [குறியீடு] எத்தனை சுழல்களைக் கண்காணிக்க மாறி [குறியீடு] எண் [/குறியீடு] ஐப் பயன்படுத்துகிறோம்.
tr: [code]while[/code] döngüsünün, kaç döngü yaptığını takip etmek için [code]number[/code] (sayı) değişkenini kullanıyoruz.
uk: Ми використовуємо змінну [code]number[/code], щоб відстежувати, скільки циклів завершує цикл [code]while[/code].

source: Each time we go through the [code]while[/code] loop, we add [code]1[/code] to [code]number[/code].
da: Hver gang vi går gennem [code]while[/code]-løkken, lægger vi [code]1[/code] til [code]number[/code].
de: Jedes Mal, wenn wir die [code]while[/code]-Schleife durchlaufen, fügen wir [code]1[/code] zu [code]number[/code] hinzu.
fr: Chaque fois que nous exécutons la boucle [code]while[/code], nous ajoutons [code]1[/code] à [code]number[/code].
it: Ogni volta che completiamo un ciclo [code]while[/code], aggiungiamo un [code]1[/code] a [code]number[/code].
ta: ஒவ்வொரு முறையும் [/குறியீடு] சுழற்சியின் போது, [குறியீடு] 1 [/குறியீடு] [குறியீடு] எண்ணில் [/குறியீடு] சேர்க்கிறோம்.
tr: [code]while[/code] döngüsünün her tekrarında, [code]number[/code] değişkenine [code]1[/code] ekleriz.
uk: Щоразу, коли ми проходимо через цикл [code]while[/code], ми додаємо [code]1[/code] до [code]числа[/code].

source: The [code]while[/code] loop keeps running for as long as the condition is true. In this case, it keeps running while [code]number[/code] is less than [code]4[/code].
da: [code]while[/code]-løkken fortsætter med at køre, så længe betingelsen er sand. I dette tilfælde fortsætter den med at køre, mens [code]number[/code] er mindre end [code]4[/code].
de: Die [code]while[/code]-Schleife läuft so lange, wie die Bedingung zutrifft (Wahr ist). In diesem Fall wird sie weiter ausgeführt, während [code]number[/code] kleiner als [code]4[/code] ist.
fr: La boucle [code]while[/code] continue de s'exécuter tant que la condition est vraie. Dans ce cas, elle continue de fonctionner tant que [code]number[/code] est inférieur à [code]4[/code].
it: Il ciclo [code]while[/code] continua ad andare finché la condizione è vera. In questo caso, continua a oltranza finché [code]number[/code] è inferiore a [code]4[/code].
ta: [/குறியீடு] [/குறியீடு] லூப் நிலை உண்மையாக இருக்கும் வரை இயங்குகிறது. இந்த வழக்கில், [குறியீடு] எண் [/குறியீடு] [குறியீடு] 4 [/குறியீடு] ஐ விட குறைவாக இருக்கும்போது இது இயங்குகிறது.
tr: [code]while[/code] döngüsü, koşul doğru olduğu sürece çalışmaya devam eder. Bu durumda, [code]number[/code] değeri, [code]4[/code] sayısından küçük olduğu sürece çalışmaya devam eder.
uk: Цикл [code]while[/code] продовжує працювати до тих пір, поки умова виконується. У цьому випадку він продовжує працювати, поки [code]число[/code] менше ніж [code]4[/code].

source: You can see that the following code is executed four times in the console.
da: Du kan se, at følgende kode udføres fire gange i konsollen.
de: Du kannst sehen, dass der folgende Code viermal in der Konsole ausgeführt wird.
fr: Vous pouvez voir que le code suivant est exécuté quatre fois dans la console.
it: Puoi vedere che il codice seguente è eseguito quattro volte nella console.
ta: பின்வரும் குறியீடு கன்சோலில் நான்கு முறை செயல்படுத்தப்படுவதை நீங்கள் காணலாம்.
tr: Aşağıdaki çıktı ekranında, kodun dört kez çalıştırıldığını görebilirsiniz.
uk: Ви бачите, що наступний код виконується чотири рази в консолі.

source: Let's apply this to our [code]move_to_end()[/code] function.
da: Lad os anvende dette på vores [code]move_to_end()[/code]-funktion.
de: Lass uns das auf unsere [code]move_to_end()[/code]-Funktion anwenden.
fr: Appliquons cela à notre fonction [code]move_to_end()[/code].
it: Applichiamo questo metodo alla nostra funzione [code]move_to_end()[/code].
ta: இதை எங்கள் [குறியீடு] MOVE_TO_END () [/குறியீடு] செயல்பாட்டிற்கு பயன்படுத்துவோம்.
tr: Hadi bunu [code]move_to_end()[/code] fonksiyonumuza uygulayalım.
uk: Давайте застосуємо це до нашої функції [code]move_to_end()[/code].

source: This time, we compare the number of loops to the board's width. We go through the loop until we reach the width of the board.
da: Denne gang sammenligner vi antallet af løkker med brættets bredde. Vi går gennem løkken, indtil vi når brættets bredde.
de: Diesmal vergleichen wir die Anzahl der Wiederholungen mit der Breite des Bretts. Wir wiederholen sie so lange, bis wir die Breite des Bretts erreicht haben.
fr: Cette fois, nous comparons le nombre de boucles à la largeur du plateau. Nous exécutons la boucle jusqu'à atteindre la largeur du plateau.
it: Questa volta, confrontiamo il numero di loop con la larghezza della tavola. Eseguiamo il ciclo fino a raggiungere la larghezza della tavola.
ta: இந்த நேரத்தில், சுழல்களின் எண்ணிக்கையை வாரியத்தின் அகலத்துடன் ஒப்பிடுகிறோம். போர்டின் அகலத்தை அடையும் வரை நாங்கள் வளையத்தின் வழியாக செல்கிறோம்.
tr: Bu kez, döngü sayısını tahtanın genişliğiyle karşılaştırıyoruz. Tahtanın genişliğine ulaşana kadar döngüyü yineliyoruz.
uk: Цього разу ми порівнюємо кількість петель з шириною дошки. Проходимо через петлю, поки не досягнемо ширини дошки.

source: Note that we move the robot until its position is one less than the board's width because we are counting tiles from [code]0[/code].
da: Bemærk, at vi bevæger robotten, indtil dens position er én mindre end brættets bredde, fordi vi tæller felter fra [code]0[/code].
de: Beachte, dass wir den Roboter eine Einheit weniger als die Brettbreite bewegen, da wir die Zellen von [code]0[/code] beginnend zählen.
fr: Notez que nous nous déplaçons d'une case de moins que la largeur du plateau car nous comptons les cases à partir de [code]0[/code].
it: Si noti che il robot si sposta fino a quando la sua posizione è inferiore alla larghezza del tabellone, perché si contano le tessere a partire da [code]0[/code].
ta: ரோபோவை அதன் நிலை வாரியத்தின் அகலத்தை விட குறைவாக இருக்கும் வரை நாங்கள் நகர்த்துகிறோம், ஏனெனில் நாங்கள் [குறியீடு] 0 [/குறியீடு] இலிருந்து ஓடுகளை எண்ணுகிறோம்.
tr: Kareleri saymaya [code]0[/code]'dan başladığımız için, robotun konumu tahtanın genişliğinden bir eksik olana kadar hareket ettirdiğimizi unutmayın.
uk: Зауважте, що ми переміщуємо робота, поки його позиція не стане на одиницю шириною дошки, тому що ми рахуємо плитки від [code]0[/code].

source: A board of [code]3[/code] by [code]3[/code] cells would have cell coordinates going from [code]0[/code] to [code]2[/code] on both the X and Y axes.
da: Et bræt med [code]3[/code] gange [code]3[/code] celler ville have cellekoordinater, der går fra [code]0[/code] til [code]2[/code] på både X- og Y-aksen.
de: Ein Brett mit [code]3[/code] mal [code]3[/code] Zellen hat Koordinaten die von [code]0[/code] bis [code]2[/code] auf sowohl der X als auch der Y Achse gehen.
fr: Un plateau de [code]3[/code] cases par [code]3[/code] aurait des coordonnées de case allant de [code]0[/code] à [code]2[/code] à la fois sur les axes X et Y.
it: Una tavola di [code]3[/code] per [code]3[/code] celle avrebbe coordinate di cella che vanno da [code]0[/code] a [code]2[/code] su entrambi gli assi X e Y.
ta: [குறியீடு] 3 [/குறியீடு] மூலம் [குறியீடு] 3 [/குறியீடு] கலங்கள் ஃச் மற்றும் ஒய் இரண்டிலும் [குறியீடு] 0 [/குறியீடு] இலிருந்து [குறியீடு] 2 [/குறியீடு] க்கு செல்லும் செல் ஆயத்தொகுப்புகளைக் கொண்டிருக்கும் அச்சுகள்.
tr: [code]3[/code] 'e [code]3[/code] hücrelerden oluşan bir tahtanın hücre konumları, hem X hem de Y eksenlerinde [code]0[/code] ile [code]2[/code] arasında değişecektir.
uk: Дошка з клітинок [code]3[/code] на [code]3[/code] матиме координати клітинок від [code]0[/code] до [code]2[/code] як на X, так і на Y сокири.

source: While loops can cause issues
cs: While smyčky mohou způsobovat problémy
da: While-løkker kan forårsage problemer
de: While-Schleifen können Probleme verursachen
es: Los bucles while pueden causar problemas
fr: Les boucles while peuvent causer des problèmes
it: I cicli while possono causare problemi
ta: சுழல்கள் சிக்கல்களை ஏற்படுத்தும்
tr: While döngüleri, sorunlara neden olabilir
uk: Цикли while можуть викликати проблеми
zh_hant: While 迴圈可能會導致問題

source: If you're not careful, your [code]while[/code] loop can run infinitely. In that case, the application will freeze.
da: Hvis du ikke er forsigtig, kan din [code]while[/code]-løkke køre uendeligt. I så fald vil applikationen fryse.
de: Wenn Du nicht vorsichtig bist, kann Deine [code]while[/code]-Schleife unendlich lange laufen. In diesem Fall friert die Anwendung ein.
fr: Si vous ne faites pas attention, votre boucle [code]while[/code] peut s'exécuter à l'infini. Dans ce cas, l'application se bloquera.
it: Se non stai attento, i tuoi cicli [code]while[/code] possono continuare all'infinito. In questi casi, l'applicazione si bloccherà.
ta: நீங்கள் கவனமாக இல்லாவிட்டால், உங்கள் [குறியீடு] [/குறியீடு] லூப் எண்ணற்ற அளவில் இயங்க முடியும். அவ்வாறான நிலையில், விண்ணப்பம் உறைந்துவிடும்.
tr: Eğer dikkatli olmazsanız, [code]while[/code] döngüsü sonsuza kadar çalışabilir. Bu durumda uygulama donacaktır.
uk: Якщо ви не будете обережні, ваш [code]while[/code] цикл може працювати безкінечно. У цьому випадку програма зависне.

source: Take a look at this code example.
da: Se på dette kodeeksempel.
de: Sieh Dir dieses Codebeispiel an.
fr: Jetez un oeil à cet exemple de code.
it: Guarda a questo codice per esempio.
ta: இந்த குறியீடு உதாரணத்தைப் பாருங்கள்.
tr: Bu kod örneğine bir göz atın.
uk: Подивіться на цей приклад коду.

source: What would happen if the computer tried to run the code above?
cs: Co by se stalo, kdyby se počítač pokusil spustit výše uvedený kód?
da: Hvad ville der ske, hvis computeren forsøgte at køre ovenstående kode?
de: Was würde passieren, wenn der Computer versuchen würde, den obigen Code auszuführen?
es: ¿Qué pasaría si la computadora intentara ejecutar el código anterior?
fr: Que se passerait-il si l'ordinateur essayait d'exécuter le code ci-dessus ?
it: Cosa succederebbe se il computer provasse ad eseguire il codice qua sopra?
ta: கணினி மேலே உள்ள குறியீட்டை இயக்க முயற்சித்தால் என்ன நடக்கும்?
tr: Bilgisayar yukarıdaki kodu çalıştırmayı denerse ne olur?
uk: Що станеться, якщо комп’ютер спробує запустити наведений вище код?
zh_hant: 如果電腦試圖執行上面的程式碼會發生什麼？
