Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-9-adding-and-subtracting.po
Languages: cs, da, de, es, fr, it, nl, pt, ru, ta, tr, uk, zh_hant

source: Add to the [code]take_damage()[/code] function so it subtracts the [code]amount[/code] to the predefined [code]health[/code] variable.
da: Læg det til [code]take_damage()[/code]-funktionen, så den trækker [code]amount[/code] fra den foruddefinerede [code]health[/code]-variabel.
de: Füge die Funktion [code]take_damage()[/code] hinzu, sodass die Menge([code]amount[/code]) zur vordefinierten Lebens([code]health[/code])-Variablen subtrahiert wird.
es: Añade código a la función [code]take_damage()[/code] para que reste la [code]amount[/code] a la variable predefinida [code]health[/code].
fr: Ajoutez du code à la fonction [code]take_damage()[/code] pour qu'elle soustraie [code]amount[/code] à la variable prédéfinie [code]health[/code].
it: Aggiungi codice alla funzione [code]take_damage()[/code] cosicché sottragga la [code]amount[/code] dalla variabile predefinita [code]health[/code].
nl: Vul de functie [code]take_damage()[/code] aan zodat deze de [code]amount[/code] aftrekt van de vooraf gedefinieerde variabele [code]health[/code].
pt: Adicione algo na função [code]take_damage()[/code] para que ela subtraia o [code]amount[/code] da variável [code]health[/code] predefinida.
ru: Доработайте функцию [code]take_damage()[/code] таким образом, чтобы при её вызове, значение заранее объявленной переменной [code]health[/code] уменьшалось на [code]amount[/code].
tr: [code]take_damage()[/code] fonksiyonuna ekleme yaparak, [code]amount[/code] miktarını, önceden tanımlı [code]health[/code] değişkeninden çıkarmasını sağlayın.
uk: Доробіть функцію [code]take_damage()[/code] так, щоб при її виклику, значення раніше оголошеної змінної [code]health[/code] зменшувалося на [code]amount[/code].

source: The robot starts with 100 health and will take 50 damage.
da: Robotten starter med 100 liv og vil tage 50 skade.
de: Der Roboter beginnt mit 100 Leben und nimmt 50 Schaden.
es: El robot comienza con 100 de salud y recibirá 50 de daño.
fr: Le robot commence avec 100 de santé et subira 50 de dégâts.
it: Il robot inizia con 100 di vita e prende 50 di danno.
nl: De robot begint met 100 gezondheid en zal 50 schade oplopen.
pt: O robô começa com 100 de vida e vai receber 50 de dano.
ru: Робот должен начать со 100 очками здоровья и получить 50 единиц урона.
tr: Robot 100 sağlıkla başlayacak, ve 50 hasar alacak.
uk: Робот має почати зі 100 очками здоров'я та отримати 50 одиниць ушкоджень.

source: Learn how to deal damage to entities like our robot.
cs: Naučte se způsobovat poškození entitám, jako je náš robot.
da: Lær hvordan du gør skade på enheder som vores robot.
de: Erfahre, wie Du Einheiten wie unserem Roboter Schaden zufügen können.
es: Aprende a infligir daño a entidades como nuestro robot.
fr: Apprenez à infliger des dégâts à des entités comme notre robot.
it: Impara come fare danno agli elementi come il nostro robot.
nl: Leer hoe je schade kunt toebrengen aan objecten zoals onze robot.
pt: Aprenda a causar dano em entidades no jogo como nosso robô.
ru: Научитесь наносить урон объектам вроде робота.
ta: எங்கள் ரோபோ போன்ற நிறுவனங்களுக்கு சேதத்தை எவ்வாறு கையாள்வது என்பதை அறிக.
tr: Robotumuz gibi varlıklara nasıl hasar vereceğinizi öğrenin.
uk: Навчіться завдавати ушкодження об'єктам на зразок робота.
zh_hant: 學習如何對機器人等實體造成傷害的方法。

source: Healing the Robot
cs: Léčení robota
da: Helbredelse af robotten
de: Den Roboter heilen
es: Curar al robot
fr: Guérir le robot
it: Curando il Robot
nl: De robot genezen
pt: Curando o robô
ru: Исцеление робота
ta: ரோபோவை குணப்படுத்துதல்
tr: Robotu İyileştirmek
uk: Лікування робота
zh_hant: 治療這個機器人

source: It's time to heal the robot up to full health!
da: Det er tid til at hele robotten op til fuld liv!
de: Es ist Zeit, den Roboter vollständig zu heilen!
es: ¡Es hora de curar al robot hasta que recupere su salud máxima!
fr: Il est temps de soigner le robot jusqu'à ce qu'il soit en pleine santé !
it: Adesso proviamo a curare il robot a vita piena!
nl: Het is tijd om de robot weer helemaal gezond te maken!
pt: É hora de curar o robô até a vida máxima!
ru: Настало время исцелить нашего робота
tr: Şimdi de, robotu tam sağlığına kavuşturmanın zamanı!
uk: Настав час зцілити нашого робота

source: Write a function called [code]heal()[/code] that takes [code]amount[/code] as a parameter.
da: Skriv en funktion kaldet [code]heal()[/code], der tager [code]amount[/code] som en parameter.
de: Schreibe eine Funktion namens [code]heal()[/code], die [code]amount[/code](Menge) als Parameter akzeptiert.
es: Escribe una función llamada [code]heal()[/code] que tome [code]amount[/code] como parámetro.
fr: Écrivez une fonction appelée [code]heal()[/code] qui prend [code]amount[/code] comme paramètre.
it: Scrivi una funzione chiamata [code]heal()[/code] che prende una [code]amount[/code] come parametro.
nl: Schrijf een functie genaamd [code]heal()[/code] die [code]amount[/code] als parameter neemt.
pt: Escreva uma função chamada [code]heal()[/code] que receba [code]amount[/code] como parâmetro.
ru: Напишите функцию [code]heal()[/code], принимающую [code]amount[/code] в виде параметра.
tr: Alınan değişken olarak [code]amount[/code] (miktar) kullanan, [code]heal()[/code] (iyileştir) adında bir fonksiyon yazın.
uk: Напишіть функцію [code]heal()[/code], яка приймає [code]amount[/code] як параметр.

source: The function should add [code]amount[/code] to [code]health[/code].
da: Funktionen skal lægge [code]amount[/code] til [code]health[/code].
de: Die Funktion sollte [code]amount[/code] zu [code]health[/code] hinzufügen.
es: La función debe sumarle [code]amount[/code] a [code]health[/code].
fr: La fonction doit ajouter [code]amount[/code] à [code]health[/code].
it: La funzione dovrebbe aggiungere [code]amount[/code] alla [code]health[/code].
nl: De functie moet [code]amount[/code] toevoegen aan [code]health[/code].
pt: A função deve adicionar o valor de [code]amount[/code] na variável [code]health[/code].
ru: Функция должна добавлять [code]amount[/code] к [code]health[/code].
tr: Bu fonksiyon, [code]amount[/code] değerini alıp sağlığa, [code]health[/code], eklemelidir.
uk: Функція має додавати [code]amount[/code] до [code]health[/code].

source: The robot starts with 50 health and will heal 50 to get it up to 100.
da: Robotten starter med 50 liv og vil hele 50 for at komme op til 100.
de: Der Roboter beginnt mit 50 Leben und heilt 50, um ihn auf 100 zu bringen.
es: El robot comienza con 50 de salud y se curará 50 para llegar a 100.
fr: Le robot commence avec 50 de santé et il en guérira 50 pour la porter à 100.
it: Il robot inizia con 50 di vita e si curerà di 50 per arrivare a 100.
nl: De robot begint met 50 gezondheid en zal 50 genezen om op 100 te komen.
pt: O robô começa com 50 de vida e cura 50 para chegar a 100.
ru: Робот должен начать с 50 очками здоровья и исцелиться на 50 в результате выполнения функции, чтобы полностью восстановиться до 100.
tr: Robot, 50 sağlıkla başlayıp, 50 iyileşme alarak 100 sağlığa kavuşmalı.
uk: Робот має почати з 50 очками здоров'я та зцілитися на 50 внаслідок виконання функції, щоб повністю відновитись до 100.

source: Our robot needs healing after that practice! Create a function to heal it back to full health.
cs: Náš robot potřebuje po tomto tréninku uzdravit! Vytvořte funkci, která ho uzdraví.
da: Vores robot har brug for helbredelse efter den øvelse! Opret en funktion, der kan helbrede den tilbage til fuldt liv.
de: Unser Roboter benötigt Heilung nach dieser Übung! Erstelle eine Funktion, um ihn wieder zu vollständig zu heilen.
es: ¡Nuestro robot necesita curarse después de esa práctica! Crea una función para que se cure y recupere su salud máxima.
fr: Notre robot a besoin d'être guéri après l'exercice précédant ! Créez une fonction pour le soigner et lui permettre de récupérer sa pleine santé.
it: Il nostro robot necessita di cura dopo questa pratica! Crea una funzione per curare fino a vita piena.
nl: Onze robot heeft genezing nodig na de vorige oefening! Maak een functie om hem weer helemaal gezond te maken.
pt: Nosso robô precisa de cura depois dessa prática! Crie uma função para curar a vida dele de volta para o valor máximo.
ru: После предыдущего упражнения наш робот нуждается в лечении! Создайте функцию, чтобы восстановить его здоровье до максимума.
ta: அந்த நடைமுறைக்குப் பிறகு எங்கள் ரோபோவுக்கு குணப்படுத்த வேண்டும்! முழு ஆரோக்கியத்திற்கும் அதை குணப்படுத்த ஒரு செயல்பாட்டை உருவாக்கவும்.
tr: Robotumuzun bu alıştırmadan sonra iyileşmeye ihtiyacı var! Onu tam sağlığına kavuşturmak için bir fonksiyon oluşturun.
uk: Після попередньої вправи наш робот потребує лікування! Створіть функцію, щоб відновити здоров'я до повного рівня.
zh_hant: 我們的機器人在剛才的練習後需要治療！請創建一個函式來讓它回復到滿血狀態。

source: Adding and Subtracting
cs: Sčítání a odečítání
da: Addition og Subtraktion
de: Addieren und Subtrahieren
es: Sumar y restar
fr: Addition et soustraction
it: Aggiungere e Sottrarre
nl: Optellen en aftrekken
pt: Adicionando e Subtraindo
ru: Сложение и вычитание
ta: சேர்த்தல் மற்றும் கழித்தல்
tr: Ekleme ve Çıkartma Yapma
uk: Додавання та віднімання
zh_hant: 加減法

source: Health that changes adds tension to the game, especially if the player is fighting with low health! It's a resource that that player should manage carefully.
pt: Uma vida que varia adiciona tensão no jogo, especialmente se o jogador lutar com pouca vida! É um recurso que esse jogador deve gerir com cuidado.

source: You can also use a longer form. Both of these lines have the same effect. They both subtract the value of [code]amount[/code] to the [code]health[/code] variable:
pt: Também pode usar uma forma mais longa. Ambas as linhas têm o mesmo efeito. Ambas subtraem o valor de [code]amount[/code] para a variável [code]health[/code]:

source: Our character in our game will have health by defining the [code]health[/code] variable. The higher the character's health, the further away the player is from losing the game. Health that changes adds tension to the game, especially if the player is fighting with low health! It's a resource that the player should manage carefully. The character's health might get low if an enemy attacks them or they fall into a hole. We can create a function to represent damage in these cases.
ta: [குறியீடு] உடல்நலம் [/குறியீடு] மாறியை வரையறுப்பதன் மூலம் எங்கள் விளையாட்டில் எங்கள் கதாபாத்திரம் ஆரோக்கியத்தைக் கொண்டிருக்கும். கதாபாத்திரத்தின் உடல்நலம் அதிகமாக இருப்பதால், வீரர் விளையாட்டை இழப்பதே என்பதுதான். மாற்றும் உடல்நலம் விளையாட்டுக்கு பதற்றத்தை சேர்க்கிறது, குறிப்பாக வீரர் குறைந்த ஆரோக்கியத்துடன் போராடுகிறார் என்றால்! வீரர் கவனமாக நிர்வகிக்க வேண்டிய ஒரு சான்று இது. ஒரு எதிரி அவர்களைத் தாக்கினால் அல்லது அவை ஒரு துளைக்குள் விழுந்தால் கதாபாத்திரத்தின் உடல்நிலை குறைவாக இருக்கும். இந்த நிகழ்வுகளில் சேதத்தைக் குறிக்க ஒரு செயல்பாட்டை உருவாக்கலாம்.
zh_hant: 我們遊戲中的角色將會有生命值，這是通過定義 [code]health[/code] 變數來實現的。角色的生命值越高，玩家就越不容易輸掉遊戲。 變動的生命值會增加遊戲的緊張感，尤其是當玩家在生命值低時與敵人作戰！它是一個玩家需要小心管理的資源。 當敵人攻擊角色或角色掉進洞裡時，角色的生命值可能會變低。 我們可以創建一個函式來代表這些情況下的傷害。

source: We pass the amount of damage the robot should take as a parameter. Line 2 subtracts [code]amount[/code] from [code]health[/code]. Note the [code]-=[/code] syntax which achieves this. It's a shorthand we often use. You can also use a longer form. Both of these lines have the same effect. They both subtract the value of [code]amount[/code] from the [code]health[/code] variable: [code]health -= amount[/code] [code]health = health - amount[/code] You may notice that the health of the robot can go below [code]0[/code]. We'll see how to manage this in a future lesson using [i]conditions[/i].
ta: ரோபோ ஒரு அளவுருவாக எடுக்க வேண்டிய சேதத்தின் அளவை நாங்கள் கடந்து செல்கிறோம். வரி 2 [குறியீடு] ஆரோக்கியத்திலிருந்து [/குறியீடு] [/குறியீடு] [/குறியீடு] கழிக்கிறது. இதை அடைவதற்கான [குறியீடு]-= [/குறியீடு] தொடரியல் கவனியுங்கள். இது நாம் அடிக்கடி பயன்படுத்தும் ஒரு சுருக்கெழுத்து. நீங்கள் நீண்ட வடிவத்தையும் பயன்படுத்தலாம். இந்த இரண்டு வரிகளும் ஒரே விளைவைக் கொண்டுள்ளன. அவை இரண்டும் [குறியீடு] உடல் [/குறியீடு] [குறியீடு] உடல்நலம் [/குறியீடு] மாறியிலிருந்து கழிக்கின்றன: [குறியீடு] உடல்நலம் -= தொகை [/குறியீடு] [குறியீடு] உடல்நலம் = உடல்நலம் - தொகை [/குறியீடு] ரோபோவின் உடல்நலம் [குறியீடு] 0 [/குறியீடு] கீழே செல்லலாம் என்பதை நீங்கள் கவனிக்கலாம். [I] நிபந்தனைகளைப் பயன்படுத்தி எதிர்கால பாடத்தில் இதை எவ்வாறு நிர்வகிப்பது என்று பார்ப்போம் [/i].
zh_hant: 我們將機器人應該承受的傷害量作為參數傳遞。 第 2 行將 [code]health[/code] 減掉 [code]amount[/code] 。 注意 [code]-=[/code] 的語法，它實現了這個操作。這是我們經常使用的簡寫。 你也可以使用較長的寫法，這兩行程式碼效果相同。它們都將 [code]amount[/code] 的值從 [code]health[/code] 變數中減去： [code]health -= amount[/code] [code]health = health - amount[/code] 你可能會注意到，機器人的生命值可以低於 [code]0[/code]。我們會在未來的課程中學習如何使用[b]條件[/b]來管理這個情況。

source: Here again, the health can go beyond [code]100[/code]. Also, once more, the short line [code]health += amount[/code] is equivalent to the longer form [code]health = health + amount[/code].
cs: I zde může zdraví přesáhnout [code]100[/code]. Také ještě jednou, krátký zápis [code]health += amount[/code] je ekvivalentní delší formě [code]health = health + amount[/code].
ta: இங்கே மீண்டும், உடல்நலம் [குறியீடு] 100 [/குறியீடு] க்கு அப்பால் செல்லலாம். மேலும், மீண்டும் ஒரு முறை, குறுகிய வரி [குறியீடு] உடல்நலம் + = தொகை [/குறியீடு] நீண்ட வடிவத்திற்கு சமம் [குறியீடு] உடல்நலம் = உடல்நலம் + அளவு [/குறியீடு].
zh_hant: 同樣地，生命值可能會超過 [code]100[/code]。 此外，簡寫的 [code]health += amount[/code] 等同於較長的寫法 [code]health = health + amount[/code]。

source: health -= amount
ta: உடல்நலம் -= தொகை

source: health += amount
ta: உடல்நலம் += தொகை

source: health = health + amount
ta: உடல்நலம் = உடல்நலம் + தொகை

source: health = health - amount
ta: உடல்நலம் = உடல்நலம் - தொகை

source: In our game, the main character has a certain amount of [code]health[/code]. When it gets hit, the health should go down by a varying [code]amount[/code] of damage. Add to the [code]take_damage()[/code] function so it subtracts the [code]amount[/code] to the predefined [code]health[/code] variable. The robot starts with 100 health and will take 50 damage.
cs: V naší hře má hlavní postava určité množství [code]health[/code] (zdraví). Když dostane zásah, mělo by se zdraví snížit o různé [code]amount[/code] (množství) poškození. Přidejte něco do funkce [code]take_damage()[/code] k tomu, aby odečítala [code]amount[/code] z předdefinované proměnné [code]health[/code]. Robot začíná se zdravím 100 a utrpí poškození 50.
ta: எங்கள் விளையாட்டில், முக்கிய கதாபாத்திரத்தில் ஒரு குறிப்பிட்ட அளவு [குறியீடு] உடல்நலம் உள்ளது [/குறியீடு]. அது பாதிக்கப்படும்போது, சேதத்தின் மாறுபட்ட [குறியீடு] தொகை [/குறியீடு] மூலம் உடல்நலம் குறைக்கப்பட வேண்டும். [குறியீடு] டேக்_டேச் () [/குறியீடு] செயல்பாட்டில் சேர்க்கவும், இது [குறியீடு] அளவு [/குறியீடு] ஐ முன் வரையறுக்கப்பட்ட [குறியீடு] உடல்நலம் [/குறியீடு] மாறிக்கு கழிக்கிறது. ரோபோ 100 ஆரோக்கியத்துடன் தொடங்குகிறது மற்றும் 50 சேதங்களை எடுக்கும்.
zh_hant: 在我們的遊戲中，主角擁有一定的 [code]health[/code]。當它受到攻擊時，生命值應該根據不同的 [code]amount[/code] 受到傷害而減少。 請在 [code]take_damage()[/code] 函式中加入程式碼，使其從預先定義的 [code]health[/code] 變數中減去 [code]amount[/code]。 機器人起始生命值 100，並將受到 50 點傷害。

source: It's time to heal the robot up to full health! Write a function called [code]heal()[/code] that takes [code]amount[/code] as a parameter. The function should add [code]amount[/code] to [code]health[/code]. The robot starts with 50 health and will heal 50 to get it up to 100.
cs: Je čas vyléčit robota až do plného zdraví! Napište funkci s názvem [code]heal()[/code], která jako parametr převezme [code]amount[/code]. Funkce by měla přidat [code]amount[/code] do [code]health[/code]. Robot začíná s 50 zdravím a vyléčí 50, aby se dostal až na 100.
ta: ரோபோவை முழு ஆரோக்கியத்திற்கு குணப்படுத்த வேண்டிய நேரம் இது! [குறியீடு] குணப்படுத்தும் () [/குறியீடு] எனப்படும் செயல்பாட்டை எழுதுங்கள், இது [குறியீடு] தொகை [/குறியீடு] ஒரு அளவுருவாக எடுக்கும். செயல்பாடு [குறியீடு] ஆரோக்கியத்தில் [குறியீடு] ஆரோக்கியத்தில் [/குறியீடு] சேர்க்க வேண்டும். ரோபோ 50 ஆரோக்கியத்துடன் தொடங்குகிறது, மேலும் அதை 100 வரை பெற 50 குணமாகும்.
zh_hant: 是時候讓機器人回復到滿血狀態了！ 請撰寫一個名為 [code]heal()[/code] 的函式，並讓它接受 [code]amount[/code] 作為參數。 該函式應該將 [code]amount[/code] 加到 [code]health[/code] 上。 機器人起始生命值為 50，並將恢復 50 點，使其回復至 100。
