Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-12-using-variables.po
Languages: cs, da, de, fr, it, ja, pt_br, ru, ta, uk, zh_hant

source: Let's give the [code]4[/code] here a label so we know what it does.
da: Lad os give [code]4[/code] her en etiket, så vi ved, hvad den gør.
fr: Donnons une étiquette au [code]4[/code] ici afin que nous sachions ce qu'il fait.
it: Diamo al valore [code]4[/code] un'etichetta così da sapere cosa fa.
ja: ここで[code]4[/code]にラベルを付けて、それが何をするかを理解しましょう。
pt_br: Vamos dar um nome ao valor [code]4[/code] aqui para sabermos o que ele faz.
ru: Давайте дадим значению [code]4[/code] метку, чтобы мы знали что оно обозначает.

source: Create a variable called [code]angular_speed[/code] outside of the [code]_process()[/code] function to make it script-wide. This allows us to use it in other functions too.
da: Opret en variabel kaldet [code]angular_speed[/code] uden for [code]_process()[/code]-funktionen for at gøre den script-dækkende. Dette giver os mulighed for at bruge den i andre funktioner også.
fr: Créez une variable appelée [code]angular_speed[/code] en dehors de la fonction [code]_process()[/code] pour qu'elle s'applique à l'ensemble du script. Cela nous permet de l'utiliser dans d'autres fonctions également.
it: Crea una variabile chiamata [code]angular_speed[/code] fuori dalla funzione [code]_process()[/code] per renderla script-globale. Questo ci consente di usarla pure in altre funzioni.
ja: [code]angular_speed[/code] 関数の外側に [code]_process[/code] という変数を作成して、スクリプト全体にします。これにより、他の機能でも使用できます。
pt_br: Crie uma variável chamada [code]angular_speed[/code] fora da função [code]_process()[/code] para torná-la uma variável de script. Isso nos permite usá-la em outras funções também.
ru: Создайте переменную [code]angular_speed[/code] снаружи функции [code]_process()[/code] чтобы сделать её переменной скрипта. Это позволит нам использовать её в других функциях тоже.

source: Then, replace the [code]4[/code] with [code]angular_speed[/code].
da: Erstat derefter [code]4[/code] med [code]angular_speed[/code].
fr: Ensuite, remplacez le [code]4[/code] par [code]angular_speed[/code].
it: Poi, rimpiazza il [code]4[/code] con [code]angular_speed[/code].
ja: 次に、[code]4[/code]を[code]angular_speed[/code]に置き換えます。
pt_br: Em seguida, substitua o [code]4[/code] por [code]angular_speed[/code].
ru: После, замените цифру [code]4[/code] именем переменной [code]angular_speed[/code].

source: Using variables to store number values makes code easier to read. Tidy up this function by storing a value in a variable.
cs: Používání proměnných k ukládání číselných hodnot usnadňuje čtení kódu. Uspořádejte tuto funkci uložením hodnoty do proměnné.
da: Brug af variabler til at gemme talværdier gør koden nemmere at læse. Ryd op i denne funktion ved at gemme en værdi i en variabel.
de: Die Verwendung von Variablen zum Speichern von Zahlenwerten erleichtert das Lesen von Code. Räume diese Funktion auf, indem Du einen Wert in einer Variablen speicherst.
fr: Utiliser des variables pour stocker des valeurs numériques rend le code plus facile à lire. Mettez de l'ordre dans cette fonction en stockant une valeur dans une variable.
it: Usare le variabili per conservare dei valori numerici rende il codice più facile da leggere. Ordina questa funzione conservando un valore in una variabile.
ja: 変数を使用して数値を格納すると、コードが読みやすくなります。変数に値を格納することで、この関数を整理します。
pt_br: O uso de variáveis para armazenar valores numéricos facilita a leitura do código. Arrume essa função armazenando um valor em uma variável.
ru: Использование переменных для хранения чисел делает код более читабельным. Приведите функцию в порядок при помощи сохранения значений в переменные.
ta: எண் மதிப்புகளைச் சேமிக்க மாறிகளைப் பயன்படுத்துவது குறியீட்டை எளிதாக படிக்க வைக்கிறது. ஒரு மதிப்பை ஒரு மாறியில் சேமிப்பதன் மூலம் இந்த செயல்பாட்டை நேர்த்தியாக மாற்றவும்.
uk: Використання змінних для зберігання числових значень полегшує читання коду. Наведіть порядок у цій функції, зберігаючи значення у змінній.
zh_hant: 使用變數來儲存數值會讓程式碼更容易閱讀。透過將數值儲存在變數中來整理這個函式。

source: Fixing an Out of Scope Error
cs: Oprava chyby mimo rozsah(Out of Scope)
da: Rettelse af en "Out of Scope" fejl
de: Beheben eines Fehlers außerhalb des Gültigkeitsbereichs
fr: Corriger une erreur "Out of Scope" (hors champ d'application)
it: Aggiustare un Errore di Out of Scope
ja: 範囲外エラーの修正
pt_br: Corrigindo um Erro Chamado Fora do Escopo (Out of Scope Error)
ru: Исправьте ошибку «Out of Scope»
ta: நோக்கம் பிழையிலிருந்து ஒரு அவுட் சரிசெய்தல்
uk: Виправлення помилки поза межами області видимості
zh_hant: 修正超出範圍錯誤

source: There's something wrong with the code here. Can you see what it is?
da: Der er noget galt med koden her. Kan du se, hvad det er?
fr: Il y a un problème avec le code ici. Pouvez-vous voir ce que c'est ?
it: C'è qualcosa di strano con il seguente codice. Puoi vedere cos'è?
ja: ここのコードに問題があります。それが何であるかわかりますか?
pt_br: Tem alguma coisa de errado com o código aqui. Você pode ver o que é?
ru: В этом коде что-то не так. Видите ли вы, что именно?

source: Run the code and read the error.
da: Kør koden, og læs fejlen.
fr: Exécutez le code et lisez l'erreur.
it: Esegui il codice e leggi l'errore.
ja: コードを実行し、エラーを読みます。
pt_br: Execute o código e leia o erro.
ru: Запустите код и прочитайте текст ошибки.

source: Correct the code so it works as intended.
da: Ret koden, så den fungerer som tilsigtet.
fr: Corrigez le code pour qu'il fonctionne comme prévu.
it: Correggi il codice cosicché funzioni come inteso.
ja: 意図したとおりに動作するようにコードを修正します。
pt_br: Corrija o código para que funcione como pretendido.
ru: Скорректируйте код, чтобы он стал работать, как задумано.

source: Uh oh! There's something wrong here. Can you fix it?
cs: Uh oh! Něco tu nehraje. Dokážete to opravit?
da: Åh nej! Der er noget galt her. Kan du rette det?
de: Uh oh! Hier stimmt etwas nicht. Kannst Du das Problem beheben?
fr: Oh oh ! Il y a quelque chose qui ne va pas ici. Pouvez-vous le réparer ?
it: Oh oh! C'è qualcosa di sbagliato qui. Puoi sistemarlo?
ja: ああああ!何かがおかしい。修正できますか?
pt_br: Uh oh! Há algo de errado aqui. Você pode consertar isso?
ru: Ой-ёй! Здесь что-то не так. Можете это исправить?
ta: ஓ! இங்கே ஏதோ தவறு இருக்கிறது. அதை சரிசெய்ய முடியுமா?
uk: ой, ой! Тут щось не так. Ви можете це виправити?
zh_hant: 哦不！這裡有些問題。你能修正它嗎？

source: Using Variables to Make Code Easier to Read
cs: Používání proměnných pro snazší čtení kódu
da: Brug af Variabler til at Gøre Kode Lettere at Læse
de: Variablen verwenden um Code besser lesbar zu machen
fr: Utiliser des variables pour rendre le code plus facile à lire
it: Usare Le Variabili per Rendere Il Codice Più Facile da Leggere
ja: 変数を使用してコードを読みやすくする
pt_br: Usando Variáveis para Fazer o Código Mais Fácil de se Ler
ru: Использование переменных для улучшения читабельности кода
ta: குறியீட்டை எளிதாக படிக்க மாறிகளைப் பயன்படுத்துதல்
uk: Використання змінних для полегшення читання коду
zh_hant: 用變數讓程式碼更容易閱讀

source: In this lesson, we'll make our code easier to follow and understand at a glance. Take a look at this example.
cs: V této lekci usnadníme sledování a pochopení našeho kódu na první pohled. Podívejte se na tento příklad.
de: In dieser Lektion machen wir es einfacher, unseren Code auf einen Blick nachzuvollziehen und zu verstehen. Schau dir dieses Beispiel an.
ta: இந்த பாடத்தில், எங்கள் குறியீட்டை ஒரு பார்வையில் பின்பற்றவும் புரிந்துகொள்ளவும் எளிதாக்குவோம். இந்த உதாரணத்தைப் பாருங்கள்.
uk: У цьому уроці ми зробимо наш код простішим і зрозумілим з першого погляду. Розгляньте цей приклад.
zh_hant: 在這一課中，我們將讓程式碼變得更容易閱讀，並能一目瞭然地理解。 看看這個範例。

source: We can guess what a number represents by looking at the function names, but it's harder to recall what this number does by quickly looking at the code. We've seen how different functions have their own names. Using these names communicates to developers what the functions do.
cs: Při pohledu na názvy funkcí můžeme odhadnout, co číslo představuje, ale při rychlém pohledu na kód je těžší si vybavit, co toto číslo dělá. Viděli jsme, jak mají různé funkce svá vlastní jména. Používání těchto názvů sděluje vývojářům, co funkce dělají.
de: Wir können erraten, was eine Zahl darstellt, indem wir uns die Funktionsnamen ansehen, aber es ist schwieriger, sich daran zu erinnern, was diese Zahl tut, wenn wir uns flüchtig den Code ansehen. Wir haben gesehen, wie verschiedene Funktionen ihre eigenen Namen haben. Die Verwendung dieser Namen vermittelt Entwicklern, was die Funktionen tun.
ta: செயல்பாட்டு பெயர்களைப் பார்ப்பதன் மூலம் ஒரு எண் எதைக் குறிக்கிறது என்பதை நாம் யூகிக்க முடியும், ஆனால் குறியீட்டை விரைவாகப் பார்ப்பதன் மூலம் இந்த எண் என்ன செய்கிறது என்பதை நினைவில் கொள்வது கடினம். வெவ்வேறு செயல்பாடுகள் அவற்றின் சொந்த பெயர்களைக் கொண்டுள்ளன என்பதை நாங்கள் பார்த்தோம். இந்த பெயர்களைப் பயன்படுத்துவது டெவலப்பர்களுக்கு செயல்பாடுகள் என்ன செய்கின்றன என்பதைத் தெரிவிக்கிறது.
uk: Ми можемо здогадатися, що означає число, подивившись на назви функцій, але за швидкого перегляду коду призначення цього числа пригадати важче. Ми бачили, що різні функції мають власні назви. Завдяки цим назвам розробники розуміють, що роблять функції.
zh_hant: 我們可以透過函式名稱猜測數字代表的意思，但當快速查看程式碼時，很難立刻記住這個數字的作用。 我們已經看過不同的函式有各自的名稱，使用這些名稱能讓開發者了解函式的功能。

source: As we learned in lesson 8, we can also assign labels to numbers to help us remember what they do. We call these labels [i]variables[/i]. [b]A variable is a label for a value we can save, change, and read later.[/b] Let's recap how to define a variable.
cs: Jak jsme se dozvěděli v lekci 8, můžeme také číslům přiřadit štítky, které nám pomohou zapamatovat si, co dělají. Tyto popisky nazýváme [i]variables[/i] (proměnné). [b] Proměnná je popisek hodnoty, kterou můžeme uložit, změnit a přečíst později. [/b] Pojďme si zrekapitulovat, jak definovat proměnnou.
de: Wie wir in Lektion 8 gelernt haben, können wir auch Nummern Beschriftungen zuweisen, damit wir uns daran erinnern können, was sie tun. Wir nennen diese Bezeichnungen [i]Variablen[/i]. [b]Eine Variable ist eine Bezeichnung für einen Wert, den wir später speichern, ändern und lesen können. [/b] Lass uns noch einmal zusammenfassen, wie man eine Variable definiert.
ta: பாடம் 8 இல் நாங்கள் கற்றுக்கொண்டது போல, அவர்கள் என்ன செய்கிறார்கள் என்பதை நினைவில் வைத்துக் கொள்ள எண்களுக்கு லேபிள்களையும் ஒதுக்கலாம். இந்த லேபிள்களை நாங்கள் அழைக்கிறோம் [i] மாறிகள் [/i]. [b] ஒரு மாறி என்பது நாம் சேமிக்க, மாற்ற மற்றும் பின்னர் படிக்கக்கூடிய மதிப்புக்கான சிட்டை ஆகும். [/b] ஒரு மாறியை எவ்வாறு வரையறுப்பது என்பதை மறுபரிசீலனை செய்வோம்.
uk: Як ми дізналися в уроці 8, ми також можемо призначати етикетки числам, що допоможе нам запам’ятати, що вони роблять. Ми називаємо ці етикетки [i]змінними[/i]. [b]Змінна — це етикетка для значення, яке ми можемо зберегти, змінити та прочитати пізніше.[/b] Давайте повторимо, як визначити змінну.
zh_hant: 如我們在第 8 課學到的，我們也可以將標籤指派給數字，幫助我們記住它們的作用。 我們稱這些標籤為[b]變數[/b]。 [b]變數是我們可以儲存、改變並在之後讀取的值標籤。[/b] 讓我們回顧一下如何定義變數。

source: var angular_speed = 4
ta: var angunal_speed = 4

source: func _process(delta):
ta: FUNC _PROCESS (டெல்டா):

source: rotate(angular_speed * delta)
ta: சுழற்றுங்கள் (கோண_ச்பீட் * டெல்டா)

source: If we define variables outside of functions, we can re-use them in different functions. Because any function can use variables we define outside of them, we call these variables [b]script-wide[/b]. Here we use the [code]angular_speed[/code] script-wide variable in both the [code]_process()[/code] function and the [code]set_angular_speed()[/code] function.
cs: Pokud definujeme proměnné mimo funkce, můžeme je znovu použít v různých funkcích. Protože každá funkce může používat proměnné, které definujeme mimo ni, nazýváme tyto proměnné [b]script-wide[/b]. Zde používáme proměnnou [code]angular_speed[/code] script-wide jak ve funkci [code]_process()[/code], tak ve funkci [code]set_angular_speed()[/code].
de: Wenn wir Variablen außerhalb von Funktionen definieren, können wir sie in verschiedenen Funktionen wiederverwenden. Da jede Funktion Variablen, die wir außerhalb von ihnen definieren, verwenden können nennen wir diese Variablen [b]script-wide[/b](Script übergreifend). Hier verwenden wir die Script übergreifende Variable [code]angular_speed[/code] sowohl in der Funktion [code]_process()[/code] als auch in der Funktion [code]set_angular_speed()[/code]..
ta: செயல்பாடுகளுக்கு வெளியே மாறிகளை நாம் வரையறுத்தால், அவற்றை வெவ்வேறு செயல்பாடுகளில் மீண்டும் பயன்படுத்தலாம். எந்தவொரு செயல்பாடும் அவற்றுக்கு வெளியே நாம் வரையறுக்கும் மாறிகளைப் பயன்படுத்தலாம் என்பதால், இந்த மாறிகள் [b] ச்கிரிப்ட்-பரந்த [/b] என்று அழைக்கிறோம். இங்கே நாம் [குறியீடு] _PROCESS () [/குறியீடு] செயல்பாடு மற்றும் [குறியீடு] set_angular_speed () [/குறியீடு] செயல்பாடு இரண்டிலும் [குறியீடு] கோண_ச்பீட் [/குறியீடு] ச்கிரிப்ட்-அகல மாறியைப் பயன்படுத்துகிறோம்.
uk: Якщо ми визначаємо змінні поза функціями, ми можемо повторно використовувати їх у різних функціях. Оскільки будь-яка функція може використовувати змінні, які ми визначаємо поза ними, ми називаємо ці змінні [b]скриптовими[/b]. Тут ми використовуємо скриптову змінну [code]angular_speed[/code] як у функції [code]_process()[/code], так і у функції [code]set_angular_speed()[/code].
zh_hant: 如果我們在函式外定義變數，就可以在不同的函式中重複使用它們。 由於任何函式都可以使用我們在它們外部定義的變數，我們稱這些變數為[b]腳本範圍內的變數[/b]。 在這裡，我們在 [code]_process()[/code] 函式和 [code]set_angular_speed()[/code] 函式中都使用了 [code]angular_speed[/code] 這個腳本範圍內的變數。

source: We can also define variables inside of functions. We align the variable assignment by indenting to make it part of the function body. Make sure to create the variable before using it! If we define a variable inside of a function, only that function can use it.
cs: Proměnné můžeme definovat i uvnitř funkcí. Přiřazení proměnné odsadíme tak, aby byla součástí těla funkce. Před použitím proměnné se ujistěte, že jste ji vytvořili (definovali s var)! Pokud definujeme proměnnou uvnitř funkce, může ji používat pouze tato funkce.
de: Wir können auch Variablen innerhalb von Funktionen definieren. Wir richten die Variablenzuweisung durch Einrücken aus, um sie zu einem Teil des Funktionskörpers zu machen. Stelle sicher, dass Du die Variable erstellst, bevor Du sie verwendest! Wenn wir eine Variable innerhalb einer Funktion definieren, kann nur diese Funktion sie verwenden.
ta: செயல்பாடுகளின் உள்ளே மாறிகளையும் நாம் வரையறுக்கலாம். செயல்பாட்டு உடலின் ஒரு பகுதியாக மாற்றுவதை உள்தள்ளுவதன் மூலம் மாறி ஒதுக்கீட்டை சீரமைக்கிறோம். மாறியைப் பயன்படுத்துவதற்கு முன்பு அதை உருவாக்குவதை உறுதிசெய்க! ஒரு செயல்பாட்டின் உள்ளே ஒரு மாறியை நாம் வரையறுத்தால், அந்த செயல்பாடு மட்டுமே அதைப் பயன்படுத்த முடியும்.
uk: Ми також можемо визначати змінні всередині функцій. Ми вирівнюємо присвоєння значення змінній відступом, щоб зробити його частиною тіла функції. Не забудьте створити змінну перед її використанням! Якщо ми визначаємо змінну всередині функції, то використовувати її зможе лише ця функція.
zh_hant: 我們也可以在函式內定義變數。 我們透過縮排來對齊變數的指派，讓它成為函式的一部分。記得在使用變數之前先定義它！ 如果我們在函式內定義變數，那麼只有該函式能夠使用它。

source: The [code]angular_speed[/code] variable only exists inside [code]_process()[/code], because we defined it there. The [code]set_angular_speed()[/code] function can't use it. Trying to use it there will result in an error. Here's what this error might look like.
cs: Proměnná [code]angular_speed[/code] existuje pouze uvnitř [code]_process()[/code], protože jsme ji tam definovali. Funkce [code]set_angular_speed()[/code] ji nemůže použít. Pokus o její použití zde povede k chybě. Chyba může vypadat takto.
de: Die Variable [code]angular_speed[/code] existiert nur innerhalb von [code]_process()[/code], weil wir sie dort definiert haben. Die Funktion [code]set_angular_speed()[/code] kann sie nicht verwenden. Der Versuch, es dort zu verwenden, führt zu einem Fehler. So könnte dieser Fehler aussehen.
ta: . [குறியீடு] set_angular_speed () [/code] செயல்பாடு இதைப் பயன்படுத்த முடியாது. இதைப் பயன்படுத்த முயற்சிப்பது பிழையை ஏற்படுத்தும். இந்த பிழை எப்படி இருக்கும் என்பது இங்கே.
uk: Змінна [code]angular_speed[/code] існує лише всередині [code]_process()[/code], оскільки ми її там визначили. Функція [code]set_angular_speed()[/code] не може її використовувати. Спроба використати її там призведе до помилки. Ось як може виглядати ця помилка.
zh_hant: [code]angular_speed[/code] 變數只存在於 [code]_process()[/code] 內，因為我們在那裡定義了它。[code]set_angular_speed()[/code] 函式無法使用它。 嘗試在其他地方使用這個變數會導致錯誤。 以下是這個錯誤可能的顯示方式。

source: Functions can use any variables defined outside of functions. These variables are [b]script-wide[/b]. If we define a variable inside of a function, only that function can use it.
cs: Funkce mohou používat libovolné proměnné definované mimo funkce. Tyto proměnné jsou [b]pro celý skript[/b] (script-wide). Pokud definujeme proměnnou uvnitř funkce, může ji používat pouze tato funkce.
de: Funktionen können alle Variablen verwenden, die außerhalb von Funktionen definiert sind. Diese Variablen sind [b]script wide[/b](Script übergreifend). Wenn wir eine Variable innerhalb einer Funktion definieren, kann nur diese Funktion sie verwenden.
ta: செயல்பாடுகள் செயல்பாடுகளுக்கு வெளியே வரையறுக்கப்பட்ட எந்த மாறிகளையும் பயன்படுத்தலாம். இந்த மாறிகள் [b] ச்கிரிப்ட்-அகலமானவை [/b]. ஒரு செயல்பாட்டின் உள்ளே ஒரு மாறியை நாம் வரையறுத்தால், அந்த செயல்பாடு மட்டுமே அதைப் பயன்படுத்த முடியும்.
uk: Функції можуть використовувати будь-які змінні, оголошені поза функціями. Ці змінні [b]рівня сценарію[/b]. Якщо ми оголошуємо змінну всередині функції, використовувати її зможе лише ця функція.
zh_hant: 函式可以使用任何在函式外定義的變數。這些變數是 [b]腳本範圍內[/b] 的。 如果我們在函式內定義變數，只有該函式能使用它。

source: Variables are also great at grouping values that control how a character behaves. Grouping them in this way allows us to easily change them.
cs: Proměnné jsou také skvělé pro seskupování hodnot, které řídí chování postavy. Jejich seskupení nám umožňuje je snadno měnit.
de: Variablen eignen sich auch hervorragend zum Gruppieren von Werten, die das Verhalten eines Charakters steuern. Wenn wir sie auf diese Weise gruppieren, können wir sie leicht ändern.
ta: ஒரு பாத்திரம் எவ்வாறு செயல்படுகிறது என்பதைக் கட்டுப்படுத்தும் மதிப்புகளை தொகுத்தல் ஆகியவற்றில் மாறிகள் சிறந்தவை. இந்த வழியில் அவற்றை தொகுத்தல் அவற்றை எளிதாக மாற்ற அனுமதிக்கிறது.
uk: Змінні також чудово групують значення, які контролюють поведінку персонажа. Групуючи їх у такий спосіб, ми можемо легко їх змінювати.
zh_hant: 變數也很適合用來將控制角色行為的數值進行分組。 以這種方式將它們分組，可以讓我們輕鬆地進行修改。

source: Let's give the [code]4[/code] here a label so we know what it does. Create a variable called [code]angular_speed[/code] outside of the [code]_process()[/code] function to make it script-wide. This allows us to use it in other functions too. Then, replace the [code]4[/code] with [code]angular_speed[/code].
cs: Dejme zde [code]4[/code] popisek, abychom věděli, co dělá. Vytvořte proměnnou s názvem [code]angular_speed[/code] mimo funkci [code]_process()[/code], aby byla pro celý skript (script-wide). To nám umožní používat ji i v jiných funkcích. Dále nahraďte [code]4[/code] proměnnou [code]angular_speed[/code].
de: Geben wir dem [code]4[/code] hier ein Label, damit wir wissen, was es tut. Erstelle eine Variable namens [code]angular_speed[/code] außerhalb der Funktion [code]_process()[/code], um sie Script übergreifend zu machen. Dies ermöglicht es uns, es auch in anderen Funktionen zu verwenden. Ersetze dann [code]4[/code] durch [code]angular_speed[/code].
ta: [குறியீடு] 4 [/குறியீடு] இங்கே ஒரு லேபிளைக் கொடுப்போம், எனவே அது என்ன செய்கிறது என்பதை நாங்கள் அறிவோம். ச்கிரிப்ட் அகலமாக மாற்ற [குறியீடு] [குறியீடு] _ நடைமுறைக்கு வெளியே [/குறியீடு] எனப்படும் மாறியை உருவாக்கவும். இது மற்ற செயல்பாடுகளிலும் இதைப் பயன்படுத்த அனுமதிக்கிறது. பின்னர், [குறியீடு] 4 [/குறியீடு] ஐ [குறியீடு] கோண_ச்பீட் [/குறியீடு] உடன் மாற்றவும்.
uk: Давайте позначимо [code]4[/code] тут, щоб ми знали, що він робить. Створіть змінну під назвою [code]angular_speed[/code] поза функцією [code]_process()[/code], щоб зробити її загальною для сценарію. Це дозволяє нам використовувати його в інших функціях. Потім замініть [code]4[/code] на [code]angular_speed[/code].
zh_hant: 讓我們為這裡的 [code]4[/code] 給一個標籤，這樣我們就知道它的用途。 在 [code]_process()[/code] 函數外部創建一個名為 [code]angular_speed[/code] 的變數，這樣它就成為了全腳本範圍的變數。這樣我們也可以在其他函式中使用它。 接著將 [code]4[/code] 替換為 [code]angular_speed[/code]。

source: There's something wrong with the code here. Can you see what it is? Run the code and read the error. Correct the code so it works as intended.
cs: V kódu je něco špatně. Vidíte, co to je? Spusťte kód a přečtěte si chybu. Opravte kód tak, aby fungoval, jak má.
de: Hier stimmt etwas nicht mit dem Code. Kannst Du sehen, was es ist? Führe den Code aus, und lese den Fehler. Korrigiere den Code, damit er wie beabsichtigt funktioniert.
ta: இங்கே குறியீட்டில் ஏதோ தவறு இருக்கிறது. அது என்னவென்று பார்க்க முடியுமா? குறியீட்டை இயக்கி பிழையைப் படியுங்கள். குறியீட்டை சரிசெய்யவும், எனவே இது நோக்கம் கொண்டது.
uk: Тут щось не так із кодом. Ви бачите, що це? Запустіть код і прочитайте помилку. Виправте код, щоб він працював належним чином.
zh_hant: 這裡的程式碼有點問題。你能看出是什麼問題嗎？ 執行程式碼並閱讀錯誤訊息。 修正程式碼，使其按照預期運作。
