Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-21-strings.po
Languages: cs, da, es, it, ja, nl, pt_br, ru, ta, tr, uk, zh_hant

source: Throughout this course, we've mostly stored numbers in variables. But what if we wanted to store a player's name?
cs: V tomto kurzu jsme většinou ukládali do proměnných čísla. Ale co kdybychom chtěli uložit jméno hráče?
da: Gennem dette kursus har vi for det meste lagrede tal i variabler. Men hvad hvis vi ville gemme en spillers navn?
it: Durante questo corso, abbiamo conservato maggiormente numeri nelle variabili. Ma come puoi fare per immagazzinare il nome del giocatore?
ja: このコースでは、主に数値を変数に格納しました。しかし、プレイヤーの名前を保存したい場合はどうすればよいでしょうか？
nl: In deze cursus hebben we meestal getallen opgeslagen in variabelen. Maar wat als we de naam van een speler willen opslaan?
pt_br: Ao longo desse curso, armazenamos principalmente números em variáveis. Mas e se quiséssemos armazenar o nome de um jogador?
ru: На протяжении курса мы в хранили множество чисел в переменных. Но что если мы захотим хранить имя игрока?
ta: இந்த பாடநெறி முழுவதும், நாங்கள் பெரும்பாலும் எண்களை மாறிகளில் சேமித்து வைத்திருக்கிறோம். ஆனால் நாங்கள் ஒரு வீரரின் பெயரை சேமிக்க விரும்பினால் என்ன செய்வது?
tr: Şimdiye kadar, değişkenlerin içinde çoğunlukla sayıları sakladık. Peki ya bir oyuncunun ismini saklamak istersek?
uk: Протягом цього курсу ми здебільшого зберігали числа у змінних. Але що, якби ми хотіли зберегти ім’я гравця?

source: This is where strings help us.
cs: Zde nám pomohou řetězce(string).
da: Det er her strenge hjælper os.
it: Ecco dove le stringhe possono aiutarci.
ja: そこで役立つのが文字列です。
nl: Dit is waar strings ons helpen.
pt_br: É aqui que as strings nos ajudam.
ru: Здесь нам помогут строки.
ta: சரங்கள் எங்களுக்கு உதவுகின்றன.
tr: İşte bu noktada dizeler bize yardımcı olur.
uk: Тут нам допомагають рядки.

source: Strings are instrumental in games and applications. We use them to display information such as the description of a spell or the name of a character.
cs: Řetězce jsou ve hrách a aplikacích velmi důležité. Používáme je k zobrazení informací, jako je popis kouzla nebo jméno postavy.
da: Strenge er instrumentale i spil og applikationer. Vi bruger dem til at vise oplysninger såsom beskrivelsen af en magi eller navnet på en figur.
it: Le stringhe hanno una funzione strumentale nei giochi e nelle applicazioni. Le usiamo per mostrare informazioni come le descrizioni di un'incantesimo o il nome di un personaggio.
ja: 文字列は、ゲームやアプリケーションに役立ちます。それらを使用して、呪文の説明やキャラクターの名前などの情報を表示します。
nl: Strings zijn belangrijk in spellen en applicaties. We gebruiken ze om informatie te tonen, zoals de beschrijving van een spreuk of de naam van een personage.
pt_br: Strings são fundamentais em jogos e aplicativos. Nós as usamos para exibir informações como a descrição de um feitiço ou o nome de um personagem.
ru: Строки играют важную роль в играх приложениях. Мы используем их для отображения такой информации, как описание заклинания или имя персонажа.
ta: விளையாட்டுகள் மற்றும் பயன்பாடுகளில் சரங்கள் கருவியாகும். ஒரு எழுத்துப்பிழை அல்லது ஒரு பாத்திரத்தின் பெயர் போன்ற தகவல்களைக் காண்பிக்க அவற்றைப் பயன்படுத்துகிறோம்.
tr: Dizeler oyunlarda ve uygulamalarda önemli bir yere sahiptir. Bunları bir büyü açıklaması veya bir karakterin ismi gibi bilgileri görüntülemek için kullanırız.
uk: Струни відіграють важливу роль в іграх і програмах. Ми використовуємо їх для відображення такої інформації, як опис заклинання або ім’я персонажа.

source: What are strings
cs: Co jsou to řetězce(string)
da: Hvad er strenge
es: ¿Qué son las cadenas?
it: Cosa sono le stringhe
ja: 文字列とは
nl: Wat zijn strings
pt_br: O que são strings
ru: Что такое строки
ta: சரங்கள் என்றால் என்ன
tr: Dizeler nedir
uk: Що таке рядки
zh_hant: 什麼是字串(string)

source: A [code]String[/code] is a value type which holds text. To create a [code]String[/code], you write text wrapped in quotation marks ([code]""[/code]). For example: [code]"This is a text string."[/code]
cs: [code]String[/code] je typ hodnoty, který obsahuje text. Chcete-li vytvořit [code]String[/code], napíšete text zabalený do uvozovek ([code]""[/code]). Například: [code]"Toto je textový řetězec."[/code]
da: En [code]Streng[/code] er en værditype, der indeholder tekst. Hvis du vil oprette en [code]Streng[/code], skriver du tekst pakket ind i citattegn ([code]"[/code]). For eksempel: [code]"Dette er en tekststreng."[/code]
it: Una [code]String[/code] è un tipo di valore che contiene testo. Per creare una [code]String[/code], scrivi il testo avvolto da virgolette ([code]""[/code]). Per esempio: [code]"Questa è una stringa"[/code].
ja: [code]String[/code]は、テキストを保持する値型です。[code]String[/code] を作成するには、引用符で囲まれたテキストを記述します ([code]""[/code])。例: [code]"This is a text string."[/code]
nl: Een [code]String[/code] is een waardentype dat tekst bevat. Om een [code]String[/code] te maken, schrijf je tekst tussen aanhalingstekens ([code]""[/code]). Bijvoorbeeld: [code]"Dit is een stukje tekst."[/code]
pt_br: Uma [code]String[/code] é um tipo de valor que contém texto. Para criar uma [code]String[/code], você escreve o texto entre aspas ([code]""[/code]). Por exemplo: [code]"Esta é uma string de texto."[/code]
ru: [code]String[/code] (строка) — это тип значения для хранения текста. Чтобы создать [code]String[/code], вам нужно написать текст, заключённый в кавычки ([code]""[/code]). Например: [code]"Это строка текста."[/code]
ta: ஒரு [குறியீடு] சரம் [/குறியீடு] என்பது உரையை வைத்திருக்கும் மதிப்பு வகை. [குறியீடு] சரம் [/குறியீடு] ஐ உருவாக்க, மேற்கோள் மதிப்பெண்களில் ([குறியீடு] "" [/குறியீடு]) மூடப்பட்ட உரையை எழுதுகிறீர்கள். எடுத்துக்காட்டாக: [குறியீடு] "இது ஒரு உரை சரம்." [/குறியீடு]
tr: Bir [code]dize[/code], metin değerleri tutan bir değer tipidir. Bir [code]dize[/code] oluşturmak için, tırnak işaretleri ([code]""[/code]) içine alınmış bir metin yazarsınız. Örneğin: [code]"Bu bir metin dizedir."[/code]
uk: [code]Рядок[/code] — це тип значення, який містить текст. Щоб створити [code]Рядок[/code], ви берете текст у лапки ([code]""[/code]). Наприклад: [code]"Це текстовий рядок."[/code]

source: The quotation marks differentiate strings from other value types and function names.
cs: Uvozovky odlišují řetězce od jiných typů hodnot a názvů funkcí.
da: Citattegn skelner strenge fra andre værdityper og funktionsnavne.
it: Le virgolette differenziano le stringhe da altri tipi di valori e nomi di funzioni.
ja: 引用符は、文字列を他の値型や関数名と区別します。
nl: De aanhalingstekens onderscheiden strings van andere waardentypes en functienamen.
pt_br: As aspas diferenciam strings de outros tipos de valores e nomes de funções.
ru: Кавычки отличают строки от других типов значений и имён функций.
ta: மேற்கோள் குறிகள் மற்ற மதிப்பு வகைகள் மற்றும் செயல்பாட்டு பெயர்களிலிருந்து சரங்களை வேறுபடுத்துகின்றன.
tr: Tırnak işaretleri, dizeleri diğer değer tiplerinden ve fonksiyon isimlerinden ayırır.
uk: Лапки відрізняють рядки від інших типів значень і імен функцій.

source: You may remember we've used strings before in previous lessons.
cs: Možná si pamatujete, že jsme již dříve v předchozích lekcích používali řetězce.
da: Måske du husker, at vi brugte strenge i tidligere lektioner.
it: Potresti ricordare che abbiamo già usato le stringhe nelle lezioni precedenti.
ja: 前のレッスンで文字列を使用したことを覚えているかもしれません。
nl: Je herinnert je misschien dat we strings eerder hebben gebruikt in eerdere lessen.
pt_br: Você deve se lembrar que já usamos strings em lições anteriores.
ru: Возможно, вы помните, что мы уже использовали строки в предыдущих уроках.
ta: முந்தைய பாடங்களில் நாங்கள் இதற்கு முன்பு சரங்களை பயன்படுத்தினோம் என்பதை நீங்கள் நினைவில் வைத்திருக்கலாம்.
tr: Daha önceki derslerde dizeleri kullandığımızı hatırlayabilirsiniz. (hmm, galiba o kısmı kaldırmış olabiliriz).
uk: Можливо, ви пам’ятаєте, що ми вже використовували рядки на попередніх уроках.

source: Under the hood, strings are arrays of characters. In fact, we can use a [code]for[/code] loop to loop through the characters of a [code]String[/code] as we would with any other array.
cs: Pod kapotou jsou řetězce pole znaků. Ve skutečnosti můžeme pomocí cyklu [code]for[/code] procházet znaky řetězce [code]String[/code] stejně jako u jakéhokoli jiného pole.
da: Under hjelmen er strenge arrays af tegn. Faktisk kan vi bruge en [code]for[/code]-løkke til loope at igennem tegnene i en [code]String[/code], ligesom vi ville gøre med ethvert andet array.
es: Técnicamente, las cadenas son matrices de caracteres. De hecho, podemos recorrer los caracteres de una [code]String[/code] de la misma forma que las matrices, utilizando un bucle [code]for[/code].
it: Dietro le quinte, le stringhe sono array di caratteri. Infatti, possiamo usare un ciclo [code]for[/code] per analizzare ciclicamente i caratteri di una [code]String[/code] come potremmo fare in un qualsiasi altro array.
ja: 内部的には、文字列は文字の配列です。実際、[code]for[/code] ループを使用して、他の配列と同じように [code]String[/code] の文字をループできます。
nl: Onder de motorkap zijn strings arrays van tekens. We kunnen zelfs een [code]for[/code]-lus gebruiken om door de tekens van een [code]String[/code] te stappen, zoals we dat met elke andere array zouden doen.
pt_br: Na realidade, as strings são arrays de caracteres. Podemos usar um loop [code]for[/code] para percorrer os caracteres de uma [code]String[/code] da mesma forma que fazemos com os arrays normalmente.
ru: Под капотом, строки — это массивы символов. Фактически, мы можем использовать цикл [code]for[/code] для перебора символов значения [code]String[/code], как и элементов любого другого массива.
ta: ஊட்டின் கீழ், சரங்கள் கதாபாத்திரங்களின் வரிசைகள். உண்மையில்.
tr: Kaputun altında, dizeler karakter dizileridir. Aslında, bir [code]for[/code] döngüsünü kullanarak [code]dizenin[/code] karakterleri içinden, diğer dizilerde olduğu gibi, döngü yapabiliriz.
uk: Під капотом рядки — це масиви символів. Фактично, ми можемо використовувати цикл [code]for[/code] для проходження символів [code]String[/code], як і з будь-яким іншим масивом.
zh_hant: 在電腦底層，字串其實是由多個字符所組成的陣列。事實上，我們可以像處理其他陣列一樣，使用 [code]for[/code] 迴圈來遍歷字串中的每個字符。

source: Which of these are strings?
cs: Které z následujících hodnot jsou řetězce?
da: Hvilke af disse er strenge?
es: ¿Cuáles de los siguientes son cadenas?
it: Quali tra queste sono stringhe?
ja: これらのうち、文字列はどれですか?
nl: Welke van deze zijn strings?
pt_br: Quais dessas opções são strings?
ru: Какие значения являются строками?
ta: இவற்றில் எது சரங்கள்?
tr: Bunlardan hangileri birer dizedir?
uk: Які з них рядки?
zh_hant: 下列哪些是字串？

source: [code]"1"[/code] and [code]"name"[/code] are strings.
cs: [code]"1"[/code] a [code]"name"[/code] jsou řetězce.
da: [code]"1"[/code] og [code]"name"[/code] er strenge.
it: [code]"1"[/code] e [code]"nome"[/code] sono stringhe.
ja: [code]"1"[/code] と [code]"name"[/code] は文字列です。
nl: [code]"1"[/code] en [code]"name"[/code] zijn strings.
pt_br: [code]"1"[/code] e [code]"name"[/code] são strings.
ru: [code]"1"[/code] и [code]"name"[/code] — это строки.
ta: [குறியீடு] "1" [/குறியீடு] மற்றும் [குறியீடு] "பெயர்" [/குறியீடு] சரங்கள்.
tr: [code]"1"[/code] ve [code]"isim"[/code] birer dizedir.
uk: [code]"1"[/code] і [code]"name"[/code] є рядками.

source: [code]"1"[/code] only contains a character and [i]doesn't[/i] represent the number [code]1[/code].
cs: [code]"1"[/code] obsahuje pouze znak a [i]nepředstavuje[/i] číslo [code]1[/code].
da: [code]"1"[/code] indeholder kun et tegn, og [i]repræsenterer ikke[/i] tallet [code]1[/code].
it: [code]"1"[/code] contiene soltanto un carattere e [i]non[/i] rappresenta il numero [code]1[/code].
ja: [code]"1"[/code] には文字のみが含まれ、数値 [code]1[/code] は表[i]されません[/i]。
nl: [code]"1"[/code] bevat alleen een teken en [i]staat niet[/i] voor het getal [code]1[/code].
pt_br: [code]"1"[/code] contém apenas um caractere e [i]não[/i] representa o número [code]1[/code].
ru: [code]"1"[/code] содержит один символ и [i]не[/i] представляет число [code]1[/code].
tr: [code]"1"[/code] yalnızca bir karakter içerir, ve bu [code]1[/code] sayısını [i]temsil etmez[/i].
uk: [code]"1"[/code] містить лише символ і [i]не[/i] представляє число [code]1[/code].

source: [code]"name"[/code] is made up of four different characters.
cs: [code]"jméno"[/code] se skládá ze čtyř různých znaků.
da: [code]"navn"[/code] består af fire forskellige tegn.
it: [code]"nome"[/code] è composto da quattro caratteri differenti.
ja: [code]"name"[/code] は 4 つの異なる文字で構成されています。
nl: [code]"name"[/code] bestaat uit vier verschillende tekens.
pt_br: [code]"name"[/code] é composto por quatro caracteres diferentes.
ru: [code]"name"[/code] — строка из четырёх разных символов.
ta: [குறியீடு] "பெயர்" [/குறியீடு] நான்கு வெவ்வேறு எழுத்துக்களால் ஆனது.
tr: [code]"isim"[/code] dört farklı karakterden oluşur.
uk: [code]"ім'я"[/code] складається з чотирьох різних символів.

source: "name"
es: "nombre"
it: "nome"
ta: "பெயர்"
tr: "isim"

source: Why we use strings
cs: Proč používáme řetězce
da: Hvorfor bruger vi strenge
es: ¿Por qué usamos cadenas?
it: Perchè usiamo le stringhe
ja: 文字列を使用する理由
nl: Waarom we strings gebruiken
pt_br: Por quê usamos strings
ru: Почему мы используем строки
ta: நாம் ஏன் சரங்களை பயன்படுத்துகிறோம்
tr: Neden dizeleri kullanıyoruz
uk: Чому ми використовуємо рядки
zh_hant: 為什麼我們要用字串

source: Every piece of text you see in this app is a string that Godot is displaying for us.
cs: Každý text, který v této aplikaci vidíte, je řetězec, který pro nás Godot zobrazuje.
da: Hvert stykke tekst, du ser i denne app, er en streng, som Godot viser for os.
it: Ogni tratto di testo che vedi in quest'applicazione è una stringa che Godot sta mostrando per noi.
ja: このアプリに表示されるすべてのテキストは、Godotが表示している文字列です。
nl: Elk stukje tekst dat je in deze app ziet, is een string die Godot voor ons weergeeft.
pt_br: Cada pedaço de texto que você vê nesse aplicativo é uma string que a Godot está exibindo para nós.
ru: Каждый фрагмент текста, который вы видите в этом приложении, — это строка, которую Godot отображает для нас.
ta: இந்த பயன்பாட்டில் நீங்கள் காணும் ஒவ்வொரு உரையும் கோடோட் நமக்குக் காண்பிக்கும் ஒரு சரம்.
tr: Bu uygulamada gördüğünüz her yazı parçası, Godot'nun bizim için görüntülediği bir dizedir.
uk: Кожен фрагмент тексту, який ви бачите в цьому додатку, — це рядок, який Годо показує нам.

source: Much like how [code]Vector2[/code] variables make calculations easier, [code]string[/code] variables come with many helper functions and tricks we can use.
cs: Podobně jako proměnné typu [code]Vector2[/code] usnadňují výpočty, tak i proměnné typu [code]string[/code] obsahují mnoho pomocných funkcí a triků, které můžeme použít.
da: Ligesom [code]Vector2[/code]-variabler gør beregninger nemmere, kommer [code]string[/code]-variabler med mange hjælpefunktioner og tricks, vi kan bruge.
it: Molto come le variabili [code]Vector2[/code] rendano i calcoli semplici, le variabili [code]stringa[/code] vengono utilizzati attraverso molte funzioni di supporto e trucchetti che possiamo usare.
ja: [code]Vector2[/code]変数が計算を容易にするのと同じように、[code]string[/code]変数には多くのヘルパー関数とトリックが付属しています。
nl: Net zoals [code]Vector2[/code]-variabelen berekeningen gemakkelijker maken, hebben [code]string[/code]-variabelen veel hulpfuncties en trucjes die we kunnen gebruiken.
pt_br: Assim como as variáveis [code]Vector2[/code] facilitam os cálculos, as variáveis de [code]string[/code] vêm com muitas funções auxiliares e truques que podemos usar.
ru: Подобно тому, как переменные [code]Vector2[/code] облегчают вычисления, переменные типа [code]String[/code] имеют множество вспомогательных функций и особенностей, которые мы можем использовать.
ta: [குறியீடு] வெக்டர் 2 [/குறியீடு] மாறிகள் கணக்கீடுகளை எளிதாக்குகின்றன, [குறியீடு] சரம் [/குறியீடு] மாறிகள் நாம் பயன்படுத்தக்கூடிய பல உதவி செயல்பாடுகள் மற்றும் தந்திரங்களுடன் வருகின்றன.
tr: Tıpkı [code]Vector2[/code] değişkenlerinin hesaplamaları kolaylaştırması gibi, [code]dize[/code] değişkenleri de kullanabileceğimiz birçok yardımcı fonksiyon ve püf noktasıyla birlikte gelir.
uk: Подібно до того, як змінні [code]Vector2[/code] полегшують обчислення, змінні [code]string[/code] мають багато допоміжних функцій і прийомів, які ми можемо використовувати.

source: We can use arrays to store strings too. This is useful for chaining animations. In this example, the [code]play_animation()[/code] plays a specific animation.
cs: K ukládání řetězců můžeme používat i pole. To je užitečné pro řetězení animací. V tomto příkladu funkce [code]play_animation()[/code] přehraje konkrétní animaci.
da: Vi kan også bruge arrays til at gemme strenge. Dette er nyttigt til at kæde animationer sammen. I dette eksempel afspiller [code]play_animation()[/code] en specifik animation.
it: Possiamo usare gli array pure per conservare stringhe. Questo è comodo per concatenare animazioni. In questo esempio, la funzione [code]play_animation()[/code] riproduce una specifica animazione.
ja: 配列を使用して文字列を格納することもできます。これは、アニメーションを連鎖させるのに便利です。この例では、[code]play_animation()[/code] が特定のアニメーションを再生します。
nl: We kunnen ook arrays gebruiken om strings op te slaan. Dit is handig voor het aaneenschakelen van animaties. In dit voorbeeld speelt de [code]play_animation()[/code] een specifieke animatie.
pt_br: Podemos usar arrays para armazenar strings também. Isso é útil para encadear animações. Nesse exemplo, o [code]play_animation()[/code] reproduz uma animação específica.
ru: Мы также можем использовать массивы для хранения строк. Это полезно для создания цепочки анимаций. В этом примере [code]play_animation()[/code] воспроизводит определённую анимацию.
ta: சரங்களையும் சேமிக்க வரிசைகளைப் பயன்படுத்தலாம். அனிமேசன்களைச் சங்கிலி செய்ய இது பயனுள்ளதாக இருக்கும். இந்த எடுத்துக்காட்டில், [குறியீடு] Play_animation () [/code] ஒரு குறிப்பிட்ட அனிமேசனை இயக்குகிறது.
tr: Dizeleri saklamak için, yine dizileri kullanabiliriz. Bu, zincirleme animasyonlar (hareketli görüntü) için kullanışlıdır. Bu örnekte, [code]play_animation()[/code] belirli bir animasyonu oynatır.
uk: Ми також можемо використовувати масиви для зберігання рядків. Це корисно для ланцюжка анімацій. У цьому прикладі [code]play_animation()[/code] відтворює певну анімацію.

source: In the next few practices, we'll use strings in combination with different concepts from earlier lessons.
cs: V několika následujících cvičeních budeme používat řetězce v kombinaci s různými koncepty z předchozích lekcí.
da: I de næste par øvelser vil vi bruge strenge i kombination med forskellige koncepter fra tidligere lektioner.
es: En las próximas prácticas, utilizaremos las cadenas en combinación con diferentes conceptos de lecciones anteriores.
it: Nelle prossime pratiche, useremo le stringhe in combinazione con concetti differenti di lezioni precedenti.
ja: 次のいくつかの演習では、前のレッスンのさまざまな概念と組み合わせて文字列を使用します。
nl: In de volgende oefeningen zullen we strings gebruiken in combinatie met verschillende concepten uit eerdere lessen.
pt_br: Nas próximas práticas, vamos usar strings em combinação com diferentes conceitos das lições anteriores.
ru: В следующих упражнениях мы будем использовать строки в комбинации с разными концепциями из прошлых уроков.
ta: அடுத்த சில நடைமுறைகளில், முந்தைய பாடங்களிலிருந்து வெவ்வேறு கருத்துகளுடன் இணைந்து சரங்களை பயன்படுத்துவோம்.
tr: Önümüzdeki birkaç alıştırmada, dizeleri daha önceki derslerde gördüğümüz farklı kavramlarla birlikte kullanacağız.
uk: У наступних кількох практиках ми будемо використовувати рядки в поєднанні з різними поняттями з попередніх уроків.
zh_hant: 在接下來的幾個練習中，我們將結合字串與之前課程中學過的不同概念來使用。

source: Creating string variables
cs: Vytváření string proměnných
da: Oprettelse af streng variabler
es: Crear variables de cadena
it: Creando variabili stringa
ja: 文字列変数の作成
nl: Stringvariabelen maken
pt_br: Criando variáveis do tipo string
ru: Создание строковых переменных
ta: சரம் மாறிகள் உருவாக்குதல்
tr: Dize değişkenleri oluşturmak
uk: Створення рядкових змінних
zh_hant: 創建字串變數

source: Currently, the robot has a number stored in the [code]robot_name[/code] variable.
cs: V současné době má robot číslo uložené v proměnné [code]robot_name[/code].
da: I øjeblikket har robotten et nummer gemt i variablen [code]robot_name[/code].
it: Al momento, il robot ha un numero conservato nella variabile [code]robot_name[/code].
ja: 現在、ロボットの [code]robot_name[/code] 変数に番号が格納されています。
nl: Momenteel bevat de robot een getal dat is opgeslagen in de variabele [code]robot_name[/code].
pt_br: Atualmente, o robô tem um número armazenado na variável [code]robot_name[/code].
ru: Сейчас имя робота представлено числом, хранящимся в переменной [code]robot_name[/code].
ta: தற்போது, ரோபோ [குறியீடு] ரோபோட்_பேம் [/குறியீடு] மாறியில் சேமிக்கப்பட்டுள்ள எண்ணைக் கொண்டுள்ளது.
tr: Şu anda, robotun [code]robot_name[/code] (robot_isim) değişkeninde, bir numara tutuluyor.
uk: Зараз у змінній [code]robot_name[/code] зберігається номер робота.

source: Change the [code]robot_name[/code] variable so that it's a string instead. You can give it any name you'd like.
cs: Změňte proměnnou [code]robot_name[/code](jméno robota) tak, aby se místo čísla jednalo o řetězec. Můžete mu dát libovolné jméno.
da: Skift variablen [code]robot_name[/code], så den i stedet er en streng. Du kan give den et hvilket som helst navn, du ønsker.
it: Cambia la variabile [code]robot_name[/code] in modo tale che questo piuttosto sia una stringa. Gli puoi dare il nome che ti pare.
ja: [code]robot_name[/code] 変数を文字列に変更します。任意の名前を付けることができます。
nl: Verander de variabele [code]robot_name[/code] in een string. Je kunt het elke naam geven die je wilt.
pt_br: Altere a variável [code]robot_name[/code] para que seja uma string. Você pode dar o nome que quiser.
ru: Измените значение переменной [code]robot_name[/code] на строковое. Вы можете дать роботу любое имя, которое вам нравится.
ta: [குறியீடு] robot_name [/code] மாறியை மாற்றவும், இதனால் அது ஒரு சரம். நீங்கள் விரும்பும் எந்த பெயரையும் அதற்கு கொடுக்கலாம்.
tr: Bunun yerine, [code]robot_name[/code] değişkenini, bir dize olacak şekilde değiştirin. İstediğiniz herhangi bir ismi verebilirsiniz.
uk: Змініть змінну [code]robot_name[/code], щоб вона була рядком. Ви можете дати йому будь-яке ім’я.

source: Give the robot a readable name using a string stored in a variable.
cs: Dejte robotovi čitelné jméno pomocí řetězce uloženého v proměnné.
da: Giv robotten et læsbart navn ved hjælp af en streng gemt i en variabel.
es: Dale al robot un nombre legible usando una cadena almacenada en una variable.
it: Dà al robot un nome leggibile usando una stringa conservata in una variabile.
ja: 変数に格納された文字列を使用して、ロボットに読みやすい名前を付けます。
nl: Geef de robot een leesbare naam met behulp van een string die is opgeslagen in een variabele.
pt_br: Dê ao robô um nome legível usando uma string armazenada em uma variável.
ru: Дайте роботу читабельное имя используя строку, сохранённую в переменной.
ta: மாறியில் சேமிக்கப்பட்ட சரம் பயன்படுத்தி ரோபோவுக்கு படிக்கக்கூடிய பெயரைக் கொடுங்கள்.
tr: Bir değişkende tutulan bir dizeyi kullanarak, robota okunabilir bir isim verin.
uk: Дайте роботу читабельне ім’я за допомогою рядка, що зберігається у змінній.
zh_hant: 給機器人一個可讀的名稱，並將其儲存在一個變數中。

source: Using an array of strings to play a combo
cs: Použití pole řetězců k přehrávání komba
da: Brug af en række strenge til at spille en combo
es: Utilizar una matriz de cadenas para reproducir un combo
it: Usando un array di stringhe per riprodurre una combo
ja: 文字列の配列を使用してコンボを演奏する
nl: Een array van strings gebruiken om een combinatie af te spelen
pt_br: Usando um array de strings para executar um combo
ru: Использование массива строк для выполнения комбо
ta: காம்போ விளையாடுவதற்கு சரங்களின் வரிசையைப் பயன்படுத்துதல்
tr: Dizelerden oluşan bir dizi kullanarak, birleşik hareket (combo) yapmak
uk: Використання масиву струн для відтворення комбо
zh_hant: 使用字串陣列施展連續技
