Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-5-your-first-function.po
Languages: cs, da, de, es, fr, it, pt, ta, uk, zh_hant

source: Instead of using underscores, they start words with capital letters except for the first one. With that convention, you'd write function names like [code]moveForward()[/code] or [code]moveLocalX()[/code]
cs: Místo podtržítek začínají slova velkými písmeny s výjimkou prvního. Podle této konvence byste psali názvy funkcí jako [code]moveForward()[/code] nebo [code]moveLocalX()[/code].
da: I stedet for at bruge understregninger starter de ord med store bogstaver undtagen det første. Med denne konvention ville du skrive funktionsnavne som [code]moveForward()[/code] eller [code]moveLocalX()[/code].
es: En lugar de usar guiones bajos, lo que hacen es que empiezan las palabras con mayúsculas, excepto por la primera palabra. Con esta convención, escribirías nombres de funciones como [code]moveForward()[/code] o [code]moveLocalX()[/code]
it: Al posto di utilizzare i trattini bassi, iniziano le parole con la lettera maiuscola tranne per la prima parola. Con questa convenzione, scriveresti il nome delle funzioni come [code]moveForward()[/code] o [code]moveLocalX()[/code].
pt: Ao invés de usar underscores, eles começam as palavras com letra maiúscula exceto a primeira palavra. Com essa convenção, escreveria nomes de função dessa forma [code]moveForward()[/code] e [code]moveLocalX()[/code]

source: Identifiers also [i]have[/i] to start with a letter or an underscore; You [i]can't[/i] begin with a number, but you can use numbers after the first character.
cs: Identifikátory také [i]musí[/i] začínat písmenem nebo podtržítkem; Ty [i]nemohou[/i] začínat číslem, ale můžete použít čísla druhém, třetím atd. místě.
da: Identifikatorer [i]skal[/i] også starte med et bogstav eller et understregningstegn; Du [i]kan[/i] ikke starte med et tal, men du kan bruge tal efter det første tegn.
es: Los identificadores también [i]deben[/i] empezar con una letra o un guión bajo; [i]no puedes[/i] empezar con un número, pero puedes usar números después del primer carácter.
it: Gli identificatori [i]devono[/i] pure iniziare con una lettera o con un trattino basso; [i]Non[/i] puoi iniziare con un numero, ma puoi usare i numeri dopo il primo carattere.
pt: Identificadores também [i]devem[/i] começar com uma letra ou um underscore; [i]não pode[/i] começar com um número, mas pode usar números depois do primeiro caractere do nome.

source: Which of the following names are valid function names?
cs: Které z následujících názvů jsou platné názvy funkcí?
da: Hvilke af følgende navne er gyldige funktionsnavne?
de: Welcher der folgenden Namen sind gültige Funktionsnamen?
es: ¿Cuáles de los siguientes nombres son nombres de función válidos?
fr: Parmi les noms suivants, lesquels sont des noms de fonction valides ?
it: Quale tra i seguenti nomi sono validi per delle funzioni?
pt: Quais desses nomes são válidos para nome de funções?
ta: பின்வரும் பெயர்களில் எது சரியான செயல்பாட்டு பெயர்கள்?
uk: Які з наведених назв є правильними ідентифікаторами функцій?
zh_hant: 哪些名稱是有效的函式名稱？

source: Note that it's fine to use capital letters.
cs: Všimněte si, že je v pořádku používat velká písmena.
da: Bemærk at det er fint at bruge store bogstaver.
de: Beachte, dass es in Ordnung ist, Großbuchstaben zu verwenden.
es: Ten en cuenta que está bien utilizar mayúsculas.
fr: Notez qu'il est acceptable d'utiliser des majuscules.
it: Nota che non è un problema usare le lettere maiuscole.
pt: Perceba que está tudo bem em usar letras maiúsculas.
ta: பெரிய எழுத்துக்களைப் பயன்படுத்துவது நல்லது என்பதை நினைவில் கொள்க.
uk: Зауважте, що великі букви використовувати можна.
zh_hant: 注意，使用大寫字母是可以的。

source: You can't name a function [code]move forward[/code] because it contains a space. Names in code cannot contain spaces.
cs: Nemůžete'pojmenovat funkci [code]move forward[/code], protože název obsahuje mezeru. Názvy v kódu nemohou obsahovat mezery.
da: Du kan ikke navngive en funktion [code]move forward[/code], fordi den indeholder et mellemrum. Navne i kode må ikke indeholde mellemrum.
es: No puedes nombrar a una función [code]move forward[/code] porque contiene un espacio. Los nombres en código no pueden contener espacios.
it: Non puoi chiamare una funzione [code]move forward[/code] perché contiene uno spazio. I nomi nel codice non possono contenere spazi.
pt: Não pode nomear um função assim [code]move forward[/code] porque entre os nomes existe um espaço. Nomes em códigos não podem ter espaços entre eles.

source: They can't start with numbers either, which is why [code]45_degree_turn[/code] is also invalid.
cs: Nemohou také začínat čísly, proto je [code]45_stupňů_otáčení[/code] také neplatné.
da: De må heller ikke starte med tal, hvilket er grunden til, at [code]45_degree_turn[/code] også er ugyldig.
es: Tampoco pueden empezar con números, por lo que [code]45_degree_turn[/code] tampoco es válido
it: Non possono neanche iniziare con numeri ed è per questo che [code]45_degree_turn[/code] è pure invalido.
pt: Eles também não podem iniciar com números, o que faz esse nome [code]45_degree_turn[/code] também ser inválido.

source: However, having numbers elsewhere in a function name is fine. That's why [code]make3NewCharacters[/code] works.
cs: Pokud jsou však čísla v názvu funkce na jiném místě, je to v pořádku. Proto [code]make3NewCharacters[/code] funguje.
da: Det er dog fint at have tal andre steder i et funktionsnavn. Derfor fungerer [code]make3NewCharacters[/code].
es: Sin embargo, tener números en otra parte del nombre de una función está bien. Es por eso que [code]make3NewCharacters[/code] sí funciona.
it: Tuttavia, avere numeri in qualsiasi altra parte all'interno di un nome di una funzione è ok. Quindi usare [code]make3NewCharacters[/code] va bene.
pt: Entretanto, os nomes podem conter números em qualquer outra parte deles. O nome [code]make3NewCharacters[/code] é válido.

source: Instantly moving the turtle to a different position
cs: Okamžitý přesun želvy na jinou pozici
da: Flytter øjeblikkeligt skildpadden til en anden position
de: Die Schildkröte sofort auf eine andere Position bewegen
es: Mover instantáneamente la tortuga a una posición diferente
fr: Déplacer instantanément la tortue dans une position différente
it: Muovendo istantaneamente la tartaruga in una posizione differente
pt: Movendo a tartaruga instantaneamente para uma posição diferente
ta: உடனடியாக ஆமை வேறு நிலைக்கு நகர்த்துகிறது
uk: Миттєво переміщуємо черепашку в інше положення
zh_hant: 立即將海龜移動到不同的位置

source: In order to draw multiple squares in different positions, we introduce a new function for our turtle to use.
cs: Abychom mohli nakreslit více čtverců na různých pozicích, zavedeme pro naši želvu novou funkci.
da: For at kunne tegne flere firkanter i forskellige positioner introducerer vi en ny funktion, som vores skildpadde kan bruge.
es: Para dibujar varios cuadrados en diferentes posiciones, introducimos una nueva función para que nuestra tortuga la utilice.
it: Per disegnare molti quadrati in posizioni diverse, introduciamo una nuova funzione che la nostra tartaruga utilizzerà.
pt: Para desenhar vários quadrados em posições diferentes , vamos introduzir uma nova função para nossa tartaruga usar.

source: The [code]jump()[/code] function picks up the turtle and places it relative to where it is.
cs: Funkce [code]jump()[/code] zvedne želvu a umístí ji vzhledem k místu, kde se nachází.
da: Funktionen [code]jump()[/code] samler skildpadden op og placerer den i forhold til, hvor den er.
es: La función [code]jump()[/code] toma a la tortuga y la coloca en una posición relativa al lugar donde se encuentra.
it: La funzione [code]jump()[/code] prende la tartaruga e la sposta relativamente a dove si trova.
pt: A função [code]jump()[/code] leva a tartaruga e posiciona-a em relação de onde ela está.

source: So calling [code]jump(-100, 50)[/code] moves the turtle by 100 pixels to the [b]left[/b] and 50 pixels [b]down[/b] without drawing any lines.
cs: Takže voláním [code]jump(-100, 50)[/code] se želva posune o 100 pixelů doleva [b] a o 50 pixelů [b] dolů[/b], aniž by se vykreslily nějaké čáry.
da: Så ved at kalde [code]jump(-100, 50)[/code] flyttes skildpadden 100 pixels til [b]venstre[/b] og 50 pixels [b]ned[/b] uden at tegne nogen linjer.
es: Así, el llamar a [code]jump(-100, 50)[/code] mueve la tortuga 100 pixeles hacia la [b]izquierda[/b] y 50 pixeles hacia [b]abajo[/b] sin dibujar ninguna línea.
it: Dunque chiamare [code]jump(-100, 50)[/code] muoverà la tartaruga di 100 pixel sulla sua [b]sinistra[/b] e 50 pixel vero il [b]basso[/b] senza disegnare alcuna linea.
pt: Então, chamar a função [code]jump(-100, 50)[/code] faz a tartaruga se mover 100 pixels para a [b]esquerda[/b] e 50 pixels [b]para baixo[/b] sem desenhar nenhuma linha.

source: A function to draw squares
cs: Funkce pro kreslení čtverců
da: En funktion til at tegne firkanter
de: Eine Funktion zum Zeichnen von Quadraten
es: Una función para dibujar cuadrados
fr: Une fonction pour dessiner des carrés
it: Una funzione che disegna quadrati
pt: Uma função para desenhar quadrados
ta: சதுரங்களை வரைய ஒரு செயல்பாடு
uk: Функція для малювання квадратів
zh_hant: 繪製正方形的函式

source: Code a function named [code]draw_square()[/code] to draw one square of length 200 pixels. The function should take no parameters.
cs: Nakódujte funkci s názvem [code]draw_square()[/code] tak, aby nakreslila jeden čtverec o délce 200 pixelů. Funkce by neměla mít žádné parametry.
da: Kod en funktion med navnet [code]draw_square()[/code] for at tegne et kvadrat med en længde på 200 pixels. Funktionen bør ikke bruge nogen parametre.
es: Codifica una función llamada [code]draw_square()[/code] para dibujar un cuadrado de 200 pixeles de longitud. La función no debe recibir parámetros.
it: Scrivi una funzione chiamata[code]draw_square()[/code] per disegnare un quadrato avente lato 200 pixel. La funzione non dovrebbe prendere alcun parametro.
pt: programe uma função chamada [code]draw_square()[/code] para desenhar um quadrado de 200 pixels de comprimento. A função não deve ter nenhum parâmetro.

source: Use the [code]move_forward()[/code] and [code]turn_right()[/code] functions to instruct the turtle.
cs: Pomocí funkcí [code]move_forward()[/code] a [code]turn_right()[/code] dejte želvě pokyny.
da: Brug funktionerne [code]move_forward()[/code] og [code]turn_right()[/code] til at instruere skildpadden.
es: Utiliza las funciones [code]move_forward()[/code] y [code]turn_right()[/code] para darle instrucciones a la tortuga.
it: Usa le funzioni [code]move_forward()[/code] e [code]turn_right()[/code] peer istruire la tartaruga.
pt: Use as funções [code]move_forward()[/code] e [code]turn_right()[/code] para instruir a tartaruga.

source: In the following practice, you'll use the [code]draw_square()[/code] function to draw multiple squares by calling your own function.
cs: V následujícím cvičení použijete funkci [code]draw_square()[/code] k nakreslení více čtverců voláním vlastní funkce.
da: I den følgende øvelse bruger du funktionen [code]draw_square()[/code] til at tegne flere kvadrater ved at kalde din egen funktion.
es: En la siguiente práctica, utilizarás la función [code]draw_square()[/code] para dibujar varios cuadrados llamando a tu propia función.
it: Nella seguente pratica, userai la funzione [code]draw_square()[/code] per disegnare vari quadrati chiamando la tua funzione.
pt: Na próxima prática, vai usar a função [code]draw_square()[/code] para desenhar vários quadrados chamando a sua própria função.

source: Until now, you've had to write code by hand, and it's boring. It's time to code a reusable function. You'll use it to draw multiple squares.
cs: Až dosud jste museli psát kód ručně a to je nuda. Je na čase nakódovat opakovaně použitelnou funkci. Budete ji používat k vykreslování více čtverců.
da: Indtil nu har du været nødt til at skrive kode i hånden, og det er kedeligt. Det er tid til at kode en genbrugelig funktion. Du skal bruge den til at tegne flere firkanter.
de: Bis jetzt musstest Du Code von Hand schreiben, und es ist langweilig. Es ist an der Zeit, eine wieder verwendbare Funktion zu schreiben. Du wirst sie verwenden, um mehrere Quadrate zu zeichnen.
es: Hasta ahora, has tenido que escribir código a mano, y tal vez te haya parecido aburrido. Es hora de codificar una función reutilizable. La utilizarás para dibujar varios cuadrados.
fr: Jusqu'à présent, vous deviez écrire du code à la main, et cela peut sembler ennuyeux. Il est temps de coder une fonction réutilisable. Vous allez l'utiliser pour dessiner plusieurs carrés.
it: Fino ad ora, hai dovuto scrivere il codice a mano, questo è noioso. D'ora in poi useremo funzioni riutilizzabili. Le utilizzerai per disegnare molti quadrati.
pt: Até agora, tinha que escrever código à mão e isso é chato. É hora de programar uma função reutilizável. Vai usar ela para desenhar vários quadrados.
ta: இப்போது வரை, நீங்கள் கையால் குறியீட்டை எழுத வேண்டியிருந்தது, அது சலிப்பை ஏற்படுத்துகிறது. மீண்டும் பயன்படுத்தக்கூடிய செயல்பாட்டை குறியிட வேண்டிய நேரம் இது. பல சதுரங்களை வரைய நீங்கள் இதைப் பயன்படுத்துவீர்கள்.
uk: Досі вам доводилося писати код від руки, і це нудно. Настав час створити функцію, яку можна використовувати багато разів. За її допомогою ви намалюєте кілька квадратів.
zh_hant: 到目前為止，你必須手動寫程式碼，這樣有點無聊。現在是時候編寫一個可重複使用的函式了，你將利用這個函式來畫出多個正方形。

source: Drawing multiple squares
cs: Kreslení více čtverců
da: Tegning af flere firkanter
de: Zeichnen mehrerer Quadrate
es: Dibujar varios cuadrados
fr: Dessiner plusieurs carrés
it: Disegnare molti quadrati
pt: Desenhando vários quadrados
ta: பல சதுரங்களை வரைதல்
uk: Малюємо кілька квадратів
zh_hant: 繪製多個正方形

source: You have a function to draw one square: [code]draw_square()[/code]. Use it to draw three squares.
cs: Máte funkci pro vykreslení jednoho čtverce: [code]draw_square()[/code]. Použijte ji pro nakreslení tří čtverců.
da: Du har en funktion til at tegne et kvadrat: [code]draw_square()[/code]. Brug den til at tegne tre kvadrater.
es: Tienes una función para dibujar un cuadrado: [code]draw_square()[/code]. Utilízala para dibujar tres cuadrados.
it: Hai una funzione per disegnare un quadrato: [code]draw_square()[/code]. Usala per disegnare tre quadrati.
pt: Tem uma função para desenhar um quadrado: [code]draw_square()[/code]. Use ela para desenhar três quadrados.

source: We already created [code]draw_square()[/code] for you. Create a function named [code]draw_three_squares[/code] that calls [code]draw_square()[/code] three times.
cs: Už jsme pro Vás vytvořili funkci [code]draw_square()[/code]. Vytvořte funkci s názvem [code]draw_three_squares[/code], která třikrát zavolá [code]draw_square()[/code].
da: Vi har allerede lavet [code]draw_square()[/code] til dig. Opret en funktion med navnet [code]draw_three_squares[/code], der kalder [code]draw_square()[/code] tre gange.
es: Ya creamos [code]draw_square()[/code] para ti. Crea una función llamada [code]draw_three_squares[/code] que llame a [code]draw_square()[/code] tres veces.
it: Abbiamo già creato [code]draw_square()[/code] per te. Crea una funzione chiamata [code]draw_three_squares[/code] che chiama [code]draw_square()[/code] tre volte.
pt: Já criamos a função [code]draw_square()[/code] para si. Crie uma função chamada [code]draw_three_squares[/code] que chama a função [code]draw_square()[/code] três vezes.

source: If you just call the function, all three squares will overlap. To stack them diagonally, call [code]jump(300, 300)[/code] between two calls to [code]draw_square()[/code].
cs: Pokud zavoláte pouze tuto funkci, všechny tři čtverce se budou překrývat. Chcete-li je poskládat diagonálně, zavolejte [code]jump(300, 300)[/code] mezi dvěma voláními [code]draw_square()[/code].
da: Hvis du bare kalder funktionen, vil alle tre kvadrater overlappe hinanden. For at stable dem diagonalt skal du kalde [code]jump(300, 300)[/code] mellem to kald til [code]draw_square()[/code].
es: Si sólo llamas a la función, los tres cuadrados se superpondrán. Para apilarlos en diagonal, llama a [code]jump(300, 300)[/code] entre dos llamadas a [code]draw_square()[/code].
it: Se chiami solamente la funzione, i tre quadrati si sovrapporranno. per impilarli diagonalmente, chiama [code]jump(300, 300)[/code] tra due chiamate di [code]draw_square()[/code].
pt: Se apenas chamar a função, todos os três quadrados vão se sobrepor. Para empilhá-los na diagonal, chame a função [code]jump(300, 300)[/code] entre duas chamadas da função[code]draw_square()[/code].

source: Calling [code]jump(300, 300)[/code] makes the turtle jump by 300 pixels to the right and 300 pixels down without drawing any lines.
cs: Volání [code]jump(300, 300)[/code] způsobí, že želva skočí o 300 pixelů doprava a 300 pixelů dolů, aniž by se vykreslily nějaké čáry.
da: Ved at kalde [code]jump(300, 300)[/code] hopper skildpadden 300 pixels til højre og 300 pixels ned uden at tegne nogen linjer.
es: Llamar a [code]jump(300, 300)[/code] hace que la tortuga salte 300 pixeles hacia la derecha y 300 pixeles hacia abajo sin dibujar ninguna línea.
it: Chiamare [code]jump(300, 300)[/code] fa si che la tartaruga salti di 300 pixel a destra e 300 pixel in basso senza disegnare alcuna linea.
pt: Chamar [code]jump(300, 300)[/code] faz a tartaruga pular 300 pixels para a direita e 300 pixels para baixo sem desenhar nenhuma linha.

source: Now you created a function to draw squares, you can reuse it by calling it multiple times.
cs: Nyní jste vytvořili funkci pro vykreslování čtverců, kterou můžete opakovaně volat.
da: Nu har du oprettet en funktion til at tegne firkanter, som du kan genbruge ved at kalde den flere gange.
de: Nachdem Du eine Funktion zum Zeichnen von Quadraten erstellt hast, kannst Du sie wieder verwenden, indem Du sie mehrmals aufrufst.
es: Ahora que creaste una función para dibujar cuadrados, puedes reutilizarla llamándola varias veces.
fr: Maintenant que vous avez créé une fonction pour dessiner des carrés, vous pouvez la réutiliser en l'appelant plusieurs fois.
it: Ora hai creato una funzione che disegna quadrati, la puoi riutilizzare chiamandola varie volte.
pt: Agora que criou uma função para desenhar quadrados, pode reutilizar ela chamando ela várias vezes.
ta: இப்போது நீங்கள் சதுரங்களை வரைய ஒரு செயல்பாட்டை உருவாக்கியுள்ளீர்கள், அதை பல முறை அழைப்பதன் மூலம் அதை மீண்டும் பயன்படுத்தலாம்.
uk: Тепер, коли ви створили функцію, що малює квадрати, її можна використовувати повторно, тобто викликати кілька разів.
zh_hant: 現在你已經創建了一個畫正方形的函式，你可以透過多次呼叫來重複使用它。

source: Coding Your First Function
cs: Kódování vaší první funkce
da: Kodning af Din Første Funktion
de: Deine erste Funktion
es: Codificar tu primera función
fr: Coder votre première fonction
it: Programmare La Tua Prima Funzione
pt: Programar a sua Primeira Função
ta: உங்கள் முதல் செயல்பாட்டை குறியிடுதல்
uk: Створення першої функції
zh_hant: 編寫你的第一個函式

source: In this simple example, it may not feel super useful. Here's a more useful and realistic one: a function to draw any rectangle.
pt: Nesse exemplo simples, pode parecer que não é tão útil assim. Aqui está um outro exemplo mais útil e realista: uma função que desenha qualquer retângulo.

source: So far, we have called existing functions that other developers wrote. In this lesson, we'll talk more about what functions are and see some examples. Then, you will learn how to define your own functions.
de: Bisher haben wir bestehende Funktionen aufgerufen, die andere Entwickler geschrieben haben. In dieser Lektion werden wir mehr darüber sprechen, was Funktionen sind, und einige Beispiele sehen. Anschließend lernst Du, wie Du deine eigenen Funktionen definierst.
fr: Jusqu'à présent, nous avons appelé des fonctions existantes écrites par d'autres développeurs. Dans cette leçon, nous allons parler davantage de ce que sont les fonctions et voir quelques exemples. Ensuite, vous apprendrez à définir vos propres fonctions.
ta: இதுவரை, மற்ற உருவாக்குபவர்கள் எழுதிய தற்போதைய செயல்பாடுகளை நாங்கள் அழைத்தோம். இந்த பாடத்தில், என்ன செயல்பாடுகள் பற்றி மேலும் பேசுவோம், சில எடுத்துக்காட்டுகளைப் பார்ப்போம். பின்னர், உங்கள் சொந்த செயல்பாடுகளை எவ்வாறு வரையறுப்பது என்பதை நீங்கள் கற்றுக் கொள்வீர்கள்.
uk: Досі, ми лише викликали готові функції, які написали інші розробники. У цьому уроці ми докладніше розберемо такі функції і розглянемо деякі приклади. Завдяки цьому ви навчитеся оголошувати власні функції.
zh_hant: 到目前為止，我們一直在呼叫其他開發者寫好的現有函式。 在這一課中，我們將深入探討什麼是函式，並展示一些範例。接著你將學會如何定義屬於自己的函式。

source: Functions are [i]sequences of instructions[/i] we give a name. We call that name an [i]identifier[/i]. Using the identifier, we can get the computer to execute all the instructions inside the function as many times as we need. This is what a [i]function call[/i] does.
de: Funktionen sind [i]Sequenzen von Anweisungen[/i], denen wir einen Namen geben. Wir nennen diese [i]Bezeichner[/i]. Mit dem Bezeichner können wir den Computer dazu bringen, alle Anweisungen innerhalb der Funktion so oft auszuführen, wie wir benötigen. Das ist es, was ein [i]Funktionsaufruf[/i] tut.
fr: Les fonctions sont des [i]séquences d'instructions[/i] auxquelles nous donnons un nom. Nous appelons ce nom un [i]identifiant[/i]. En utilisant l'identifiant, nous pouvons demander à l'ordinateur d'exécuter toutes les instructions de la fonction autant de fois que nécessaire. C'est ce que fait un [i]appel de fonction[/i].
ta: செயல்பாடுகள் [i] வழிமுறைகளின் காட்சிகள் [/i] நாங்கள் ஒரு பெயரைக் கொடுக்கிறோம். நாங்கள் அந்த பெயரை ஒரு [i] அடையாளங்காட்டி [/i] என்று அழைக்கிறோம். அடையாளங்காட்டியைப் பயன்படுத்தி, செயல்பாட்டிற்குள் உள்ள அனைத்து வழிமுறைகளையும் நமக்குத் தேவையான பல மடங்கு செயல்படுத்த கணினியைப் பெறலாம். இதைத்தான் ஒரு [i] செயல்பாட்டு அழைப்பு [/i] செய்கிறது.
uk: Функція — це [i]послідовність інструкцій[/i], якій ми дали назву. Цю назву називають [i]ідентифікатором[/i]. Використовуючи цей ідентифікатор, ми можемо наказати комп'ютеру виконати всі вказівки функції стільки разів, скільки нам потрібно. Ось що робить [i]виклик функції[/i].
zh_hant: 函式是我們賦予名稱的[b]指令序列[/b]。我們稱這個名稱為[b]識別子(identifier)[/b]。 使用這個識別子，我們可以讓電腦執行函式內的所有指令，且可以執行多次。這就是[b]函式呼叫(function call)[/b]的作用。
