Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-8-defining-variables.po
Languages: cs, da, de, es, fr, it, nl, pt_br, ta, tr, uk, zh_hant

source: You can define variables inside or outside functions. In this practice, you shouldn't create a function.
da: Du kan definere variabler inden for eller uden for funktioner. I denne øvelse bør du ikke oprette en funktion.
es: Puedes definir las variables dentro o fuera de las funciones. En esta práctica, no debes crear una función.
fr: Vous pouvez définir des variables à l'intérieur ou à l'extérieur des fonctions. Dans cet exercice, vous ne devez pas créer de fonction.
it: Puoi definire le variabili dentro o fuori le funzioni. In questa pratica, non dovresti creare una funzione.
pt_br: Você pode definir variáveis dentro ou fora das funções. Nesta prática, você não deve criar uma função.
ta: செயல்பாடுகளுக்குள் அல்லது வெளியே மாறிகளை நீங்கள் வரையறுக்கலாம். இந்த நடைமுறையில், நீங்கள் ஒரு செயல்பாட்டை உருவாக்கக்கூடாது.
tr: Değişkenleri fonksiyonların içinde veya dışında tanımlayabilirsiniz. Bu uygulamada, bir fonksiyon oluşturmamalısınız.
uk: Ви можете визначати змінні всередині або зовні функції. У цій вправі функцію створювати не потрібно.

source: In this practice, you'll define your first variable and give it a specific starting value.
cs: V tomto cvičení nadefinujete svou první proměnnou a přiřadíte jí konkrétní počáteční hodnotu.
da: I denne øvelse definerer du din første variabel og giver den en specifik startværdi.
de: In dieser Übung definierst Du deine erste Variable und gibst ihr einen bestimmten Startwert.
es: En esta práctica, definirás tu primera variable y le darás un valor inicial específico.
fr: Dans cet exercice, vous allez définir votre première variable et lui donner une valeur de départ spécifique.
it: In questa pratica, definirai la tua prima varibile e gli darai un valore specifico.
nl: In deze oefening definieer je je eerste variabele en geef je deze een specifieke beginwaarde.
pt_br: Nesta prática, você vai definir sua primeira variável e dará a ela um valor inicial específico.
ta: இந்த நடைமுறையில், உங்கள் முதல் மாறியை வரையறுத்து, ஒரு குறிப்பிட்ட தொடக்க மதிப்பைக் கொடுப்பீர்கள்.
tr: Bu uygulamada, ilk değişkeninizi tanımlayacak ve ona belirli bir başlangıç değeri vereceksiniz.
uk: У цій вправі ви визначите свою першу змінну і надасте їй певне початкове значення.
zh_hant: 在這次練習中，你將定義你的第一個變數並給它一個特定的起始值。

source: Defining Your Own Variables
cs: Definování vlastních proměnných
da: Definering af dine egne variabler
es: Definir tus propias variables
fr: Définir vos propres variables
it: Definire Le Tue Variabili
nl: Je eigen variabelen definiëren
pt_br: Definindo Suas Próprias Variáveis
ta: உங்கள் சொந்த மாறிகள் வரையறுத்தல்
tr: Kendi Değişkenlerinizi Tanımlamak
uk: Оголошування власних змінних
zh_hant: 定義你自己的變數

source: In the previous lesson, you used a predefined member variable named [code]position[/code]. In your projects, you will need to define your own variables. Imagine that you need to track the player's health in your game. They may start with [code]5[/code] health points. When taking a hit, the health should go down to [code]4[/code]. After another hit, it should be [code]3[/code]. And so on. To keep track of that, you can create a variable named [code]health[/code] to which you add and subtract points. The example below introduces the [code]print()[/code] function, which outputs its argument to the output box on the left. Click the [i]run()[/i] button to instantly run the entire function, and click the [i]step[/i] button to execute lines of code one by one. The [i]Debugger[/i] panel at the bottom shows the current value of the [code]health[/code] variable.
nl: In de vorige les gebruikte je een vooraf gedefinieerde lidvariabele met de naam [code]position[/code]. In je projecten zul je je eigen variabelen moeten definiëren. Stel je voor dat je de gezondheid van de speler in je spel moet bijhouden. Ze zouden kunnen beginnen met [code]5[/code] gezondheidspunten. Als de speler een geraakt wordt, zou de gezondheid moeten zakken naar [code]4[/code]. Na nog een treffer zou het [code]3[/code] moeten zijn. Enzovoort. Om dat bij te houden, kun je een variabele maken met de naam [code]health[/code] waar je punten aan toevoegt en van aftrekt. Het voorbeeld hieronder introduceert de functie [code]print()[/code], die haar argument toont in het uitvoervak aan de linkerkant. Klik op de knop [i]run()[/i] om direct de hele functie uit te voeren en klik op de knop [i]stap[/i] om regels code één voor één uit te voeren. Het [i]Debugger[/i] paneel onderaan toont de huidige waarde van de [code]health[/code] variabele.
zh_hant: 在前面的課程中，你使用了名為 [code]position[/code] 的預設成員變數。 在你的專案中，你將需要定義自己的變數。 假設你需要追蹤遊戲中玩家的生命值。 他們一開始可能有 [code]5[/code] 點生命值。當受到攻擊時，生命值應該降到 [code]4[/code]。再受到一次攻擊後，生命值應該降到 [code]3[/code]，依此類推。 為了追蹤這些數值，你可以創建一個名為 [code]health[/code] 的變數，並在其中加減生命值。 下面的範例介紹了 [code]print()[/code] 函式，它將輸出其引數到左側的輸出框。 點擊[b]執行[/b]按鈕可以立即執行整個函式，點擊[b]單步執行[/b]按鈕則可以逐行執行程式碼。 位於底部的[b]除錯[/b]面板會顯示當前 [code]health[/code] 變數的值。

source: After executing the first two lines of code, you will have a health variable storing a value of [code]4[/code]. Below, we'll break down how you define new variables and explain the [code]print()[/code] function.
cs: Po provedení prvních dvou řádků kódu budete mít proměnnou health s hodnotou [code]4[/code]. Níže si rozebereme, jak definujete nové proměnné, a vysvětlíme si funkci [code]print()[/code].
de: Nachdem Du die ersten beiden Codezeilen ausgeführt hast, hast Du eine Variable für Leben, die den Wert von [code]4[/code] speichert. Im Folgenden wird aufgeschlüsselt, wie Du neue Variablen definierst, und die Funktion [code]print()[/code] erläutert.
nl: Na het uitvoeren van de eerste twee regels code, bevat de gezondheidsvariabele een waarde van [code]4[/code]. Hieronder zullen we uitleggen hoe je nieuwe variabelen definieert en hoe je de functie [code]print()[/code] gebruikt.
zh_hant: 執行前兩行程式碼後，你將擁有一個儲存數值 [code]4[/code] 的 health 變數。 接下來，我們將逐步解釋如何定義新的變數，以及說明 [code]print()[/code] 函式的用途。

source: To use a variable, you must first define it so the computer registers its name. To do so, you start a line of code with the [code]var[/code] keyword followed by your desired variable name. Like [code]func[/code] stands for [i]function[/i], [code]var[/code] stands for [i]variable[/i]. Variables are case-sensitive, which means [code]health[/code] and [code]Health[/code] are technically different variables. Be careful to use the same capitalization wherever you refer to the same variable, or you could be reading or writing to a different variable. The following line defines a [code]health[/code] variable pointing to no value. You can think of it as creating a product label you have yet to stick onto something.
nl: Om een variabele te gebruiken, zul je deze eerst moeten definiëren zodat de computer de naam registreert. Om dit te doen, begin je een regel code met het sleutelwoord [code]var[/code] gevolgd door de gewenste variabelenaam. Zoals [code]func[/code] staat voor [i]function[/i], staat [code]var[/code] voor [i]variable[/i]. Variabelen zijn hoofdlettergevoelig, wat betekent dat [code]health[/code] en [code]Health[/code] technisch gezien verschillende variabelen zijn. Let erop dat je overal waar je naar dezelfde variabele verwijst hetzelfde hoofdlettergebruik toepast, anders lees of schrijf je misschien naar een andere variabele. De volgende regel definieert een [code]health[/code] variabele die naar geen enkele waarde wijst. Je kunt het zien als het maken van een productlabel dat je nog ergens op moet plakken.
zh_hant: 要使用變數，你必須先定義它，讓電腦能夠識別其名稱。 為此，你需要在程式碼的一行開頭使用 [code]var[/code] 關鍵字，後面加上你想要的變數名稱。就像 [code]func[/code] 代表[b]函式[/b]一樣， [code]var[/code] 代表[b]變數[/b]。 變數名稱是區分大小寫的，這意味著 [code]health[/code] 和 [code]Health[/code] 在技術上是不同的變數。記得在引用同一個變數時，大小寫必須一致，否則你可能會讀取或寫入到不同的變數。 以下這行程式碼定義了一個指向空值的 [code]health[/code] 變數。你可以將其視為做了一個還沒貼在商品上的產品標籤。

source: To use a variable, you want to assign it a starting value. You can do so using the equal sign (=). This code assigns the value [code]100[/code] to a new variable named [code]health[/code].
cs: Chcete-li použít proměnnou, musíte jí přiřadit počáteční hodnotu. Můžete tak učinit pomocí znaménka rovná se (=). Tento kód přiřadí hodnotu [code]100[/code] nové proměnné s názvem [code]health[/code].
de: Um eine Variable zu verwenden, musst Du ihr einen Startwert zuweisen. Du kannst dies mit dem Gleichheitszeichen (=) tun. Dieser Code weist einer neuen Variablen mit dem Namen Leben([code]health[/code]) den Wert [code]100[/code] zu.
nl: Om een variabele te gebruiken, moet je er een beginwaarde aan toewijzen. Je kunt dit doen met het gelijkheidsteken (=). Deze code wijst de waarde [code]100[/code] toe aan een nieuwe variabele met de naam [code]health[/code].
zh_hant: 要使用變數，你需要為它指定一個起始值。你可以使用等號（=）來達成這個目的。 這段程式碼將數值 [code]100[/code] 指定給一個名為 [code]health[/code] 的新變數。

source: The code above will display the number [code]100[/code] to some output window. Notice we don't use the [code]var[/code] keyword anymore as we only need it to [i]define[/i] a variable. Also, once you define a variable, you can change its value anytime with the equal sign.
cs: Výše uvedený kód zobrazí číslo [code]100[/code] do nějakého výstupního okna. Všimněte si, že už nepoužíváme klíčové slovo [code]var[/code], protože to potřebujeme pouze k [i]definování[/i] proměnné. Navíc jakmile jednou definujete proměnnou, můžete kdykoli změnit její hodnotu pomocí znaménka rovnosti.
nl: De bovenstaande code zal het getal [code]100[/code] weergeven in een uitvoervenster. Merk op dat we het sleutelwoord [code]var[/code] niet meer gebruiken omdat dit alleen nodig is om een variabele te [i]definiëren[/i]. Als je eenmaal een variabele hebt gedefinieerd, kun je de waarde ervan op elk moment wijzigen met het gelijkheidsteken.
zh_hant: 上面的程式碼將會在某個輸出視窗顯示數字 [code]100[/code]。 請注意，我們不再使用 [code]var[/code] 關鍵字，因為它只需要在[b]定義[/b]變數時使用。 此外，一旦定義了變數，你可以隨時使用等號來更改它的值。

source: The [code]print()[/code] function is generally the first function you learn in academic programming courses. It sends ("prints") the message or value you give it to some output window, often a black window with plain white text.
cs: Funkce [code]print()[/code] je obvykle první funkcí, kterou se učíte v akademických kurzech programování. Odesílá ("tiskne") zprávu nebo hodnotu, kterou jí zadáte, do nějakého výstupního okna, často černého okna s prostým bílým textem.
de: Die Funktion [code]print()[/code] ist in der Regel die erste Funktion, die Sie in akademischen Programmierkursen erlernen. Sie sendet ("druckt") die Nachricht oder den Wert, den Du ihr gibst, an ein Ausgabefenster, oft ein schwarzes Fenster mit einfachem weißem Text.
nl: De [code]print()[/code] functie is over het algemeen de eerste functie die je leert in academische programmeercursussen. Het stuurt ("print") het bericht of de waarde die je het geeft naar een uitvoervenster, vaak een zwart venster met witte tekst.
zh_hant: [code]print()[/code] 函式通常是你在學校程式課程中學到的第一個函式。 它會將你提供的訊息或數值傳送（"列印"）到某個輸出視窗，通常是一個黑色視窗，顯示純白色的文字。

source: Programmers often use [code]print()[/code] to quickly check the value of their variables when their game runs. In the app, we made a special output window that captures calls to [code]print()[/code] and displays a card to make it friendlier for you.
cs: Programátoři často používají [code]print()[/code] k rychlé kontrole hodnoty proměnných při spuštění hry. V aplikaci jsme vytvořili speciální výstupní okno, které zachycuje volání [code]print()[/code] a zobrazuje kartu, aby to pro vás bylo přívětivější.
de: Programmierer verwenden häufig [code]print()[/code], um den Wert ihrer Variablen schnell zu überprüfen, wenn ihr Spiel ausgeführt wird. In der App haben wir ein spezielles Ausgabefenster erstellt, das Aufrufe von [code]print()[/code] erfasst und eine Karte anzeigt, um sie für dich freundlicher zu gestalten.
nl: Programmeurs gebruiken vaak [code]print()[/code] om snel de waarden van hun variabelen te controleren terwijl hun spel draait. In de app hebben we een speciaal uitvoervenster gemaakt dat aanroepen naar [code]print()[/code] opvangt en een kaart weergeeft om het prettiger voor je te maken.
zh_hant: 程式設計師常常使用 [code]print()[/code] 來快速檢查他們的變數在遊戲運行時的值。 在這個應用程式中，我們製作了一個特殊的輸出視窗，捕捉對 [code]print()[/code] 的呼叫，並顯示卡片，讓它對你來說更友善。

source: Here, the verb [i]print[/i] means "to send information to display on the screen." The function "prints" things on your computer display; It does not relate to printers.
cs: Sloveso [i]print[/i] zde znamená "odeslat informaci k zobrazení na obrazovce." Funkce "vytiskne" věci na displej počítače; Netýká se tiskáren.
nl: Het werkwoord [i]print[/i] betekent hier "informatie verzenden om op het scherm weer te geven". De functie "print" dingen op je computerscherm; het heeft geen betrekking tot printers.
zh_hant: 在這裡，動詞[b]print[/b]的意思是「將資訊傳送到螢幕上顯示」。 這個函式是「列印」內容到你的電腦顯示器上；它與印表機無關。

source: As we hinted above, in GDScript, variables work a bit like labels. Assigning a value to a variable is like taking your label (the variable) and sticking it onto some item (the value).
cs: Jak jsme naznačili výše, v jazyce GDScript fungují proměnné trochu jako štítky. Přiřazení hodnoty proměnné je jako vzít štítek (proměnnou) a přilepit ho na nějakou položku (hodnotu).
de: Wie bereits erwähnt, funktionieren Variablen in GDScript ein wenig wie Beschriftungen. Das Zuweisen eines Werts zu einer Variablen ist so, als würde man seine Beschriftung (die Variable) nehmen und es auf ein Element (den Wert) kleben.
nl: Zoals we hierboven al lieten doorschemeren, werken variabelen in GDScript een beetje als labels. Een waarde toewijzen aan een variabele is alsof je het label (de variabele) op een voorwerp (de waarde) plakt.
zh_hant: 正如我們在上面提到的，在 GDScript 中，變數有點像標籤。 將一個值指定給變數就像是把你的標籤（變數）貼到某個物品（值）上一樣。

source: Like a supermarket has a database of product labels, the computer keeps a list of all variables in your code. Given the variable name, the computer can look up the attached value. It has an important consequence. In GDScript, you can stick that label to any other value.
cs: Stejně jako má supermarket databázi etiket výrobků, počítač uchovává seznam všech proměnných ve vašem kódu. Při zadání názvu proměnné může počítač vyhledat připojenou hodnotu. To má důležitý důsledek. V jazyce GDScript můžete tento štítek přilepit k libovolné jiné hodnotě.
de: Wie ein Supermarkt eine Datenbank mit Produktetiketten hat, führt der Computer eine Liste aller Variablen in deinem Code. Mit dem Variablennamen kann der Computer den angehängten Wert nachschlagen. Es hat eine wichtige Konsequenz. In GDScript kannst Du diese Beschriftung an einen beliebigen anderen Wert kleben.
nl: Net zoals een supermarkt een database van productetiketten heeft, houdt de computer een lijst bij van alle variabelen in je code. Gegeven de naam van de variabele, kan de computer de bijbehorende waarde opzoeken. Dit heeft een belangrijk gevolg. In GDScript kun je dat label aan elke willekeurige andere waarde hangen.
zh_hant: 就像超市有一個商品標籤的資料庫一樣，電腦會保持你程式碼中所有變數的清單。 根據變數名稱，電腦可以查找並顯示其所附的值。 這有一個重要的效果。在 GDScript 中，你可以將該標籤貼到任何其他值上。

source: The above code is like taking a label from the appropriate item and sticking it to the wrong thing: - At line 2, the [code]health[/code] variable holds a number. - From line 3, [code]health[/code] holds text. The computer will let you do that! The code's syntax and "grammar" are correct, but it's not good. Variable names should describe the value they contain, so a [code]health[/code] variable with a text value will confuse your future self and other coders. It can also cause errors in your game. Later on, we'll see how to avoid this issue with [i]variable types[/i]. For now, let's practice creating variables!
nl: De bovenstaande code is alsof je een label van het juiste ding afhaalt en op het verkeerde ding plakt: - Op regel 2 bevat de variabele [code]health[/code] een getal. - Vanaf regel 3 bevat [code]health[/code] tekst. De computer laat je dat doen! De vorm en "grammatica" van de code zijn correct, maar het is niet goed. Variabelennamen moeten de waarde beschrijven die ze bevatten, dus een [code]health[/code] variabele met een tekstwaarde zal je toekomstige zelf en andere programmeurs in verwarring brengen. Het kan ook fouten veroorzaken in je game. Later zullen we zien hoe je dit probleem kunt vermijden met [i]variabelentypes[/i]. Laten we nu oefenen met het maken van variabelen!
zh_hant: 上面的程式碼就像是把一個標籤從正確的物品上取下，然後貼到錯誤的物品上： - 在第 2 行， [code]health[/code] 變數儲存的是數字。 - 從第 3 行開始， [code]health[/code] 儲存的是文字。 電腦會允許這樣做！程式碼的語法和「文法」是正確的，但這樣做並不好。 變數名稱應該描述它所包含的值，因此一個儲存文字的 [code]health[/code] 變數會讓你未來回顧時感到困惑，並且會讓其他程式設計師也感到困惑。它還可能會在遊戲中引發錯誤。 稍後我們將看到如何使用[b]變數類型[/b]來避免這個問題。現在，讓我們來練習創建變數吧！

source: Define a variable named [code]health[/code] with a starting value of [code]100[/code]. You can define variables inside or outside functions. In this practice, you shouldn't create a function.
cs: Definujte proměnnou s názvem [code]health[/code] s počáteční hodnotou [code]100[/code]. Můžete definovat proměnné uvnitř nebo vně funkcí. V tomto cvičení byste neměli vytvářet funkci.
de: Definieren Sie eine Variable mit dem Namen Leben([code]health[/code]) mit dem Startwert [code]100[/code]. Du kannst Variablen innerhalb oder außerhalb von Funktionen definieren. In dieser Übung sollst Du keine Funktion erstellen.
nl: Definieer een variabele genaamd [code]gezondheid[/code] met een beginwaarde van [code]100[/code]. Je kunt variabelen binnen of buiten functies definiëren. In deze oefening moet je niet een functie maken.
zh_hant: 定義一個名為 [code]health[/code] 的變數，並給予它一個起始值 [code]100[/code]。 你可以在函式內部或外部定義變數。在這次練習中，你不需要創建函式。

source: In the previous lesson, you used a predefined member variable named [code]position[/code]. In your projects, you will need to define your own variables. Imagine that you need to track the player's health in your game. They may start with [code]5[/code] health points. When taking a hit, the health should go down to [code]4[/code]. After another hit, it should be [code]3[/code]. And so on. To keep track of that, you can create a variable named [code]health[/code] to which you add and subtract points. [i]The example below introduces the [code]print()[/code] function, which outputs its parameter to the output box on the left.[/i]
de: In der vorherigen Lektion hast Du eine vordefinierte Membervariable mit dem Namen [code]position[/code] verwendet. In deinen Projekten musst Du deine eigenen Variablen definieren. Stelle dir vor, du müssest die Gesundheit des Spielers in deinem Spiel verfolgen. Du könntest mit [code]5[/code] Gesundheitspunkten beginnen. Bei einem Treffer sollte die Gesundheit auf [code]4[/code] sinken. Nach einem weiteren Treffer sollte es [code]3[/code] sein. Und so weiter. Um dies zu verfolgen, kannst Du eine Variable mit dem Namen [code]health[/code] erstellen, zu der Du Punkte addierst und subtrahierst. [i] Im folgenden Beispiel wird die Funktion [code]print()[/code] vorgestellt, die deinen Parameter in das Ausgabefeld auf der linken Seite ausgibt. [/i]

source: To use a variable, you must first define it so the computer registers its name. To do so, you start a line of code with the [code]var[/code] keyword followed by your desired variable name. Like [code]func[/code] stands for [i]function[/i], [code]var[/code] stands for [i]variable[/i]. The following line defines a [code]health[/code] variable pointing to no value. You can think of it as creating a product label you have yet to stick onto something.
de: Um eine Variable zu verwenden, musst Du sie zunächst definieren, damit der Computer ihren Namen registriert. Dazu startest Du eine Codezeile mit dem Schlüsselwort [code]var[/code], gefolgt von dem gewünschten Variablennamen. So wie [code]func[/code] für [i]Funktion[/i] steht, steht [code]var[/code] für [i]Variable[/i]. Die folgende Zeile definiert eine Leben([code]health[/code])-Variable, die auf keinen Wert verweist. Du kannst es dir so vorstellen, dass du ein Produktetikett erstellen, das Du noch nicht auf etwas geklebt habst.

source: The code above will display the number [code]100[/code] to some output window. Notice we don't use the [code]var[/code] keyword anymore as we only need it to [i]define[/i] a variable. Also, once you defined a variable, you can change its value anytime with the equal sign.
de: Der obige Code zeigt die Nummer [code]100[/code] in einem Ausgabefenster an. Beachte, dass wir das Schlüsselwort [code]var[/code] nicht mehr verwenden, da wir es nur benötigen, um eine Variable zu [i]definieren[/i]. Nachdem Du eine Variable definiert hast, kannst Du ihren Wert jederzeit mit dem Gleichheitszeichen ändern.

source: The above code is like taking a label from the appropriate item and sticking it to the wrong thing: - At line 1, the [code]health[/code] variable holds a number. - From line 2, [code]health[/code] holds text. The computer will let you do that! The code's syntax and "grammar" are correct, but it's not good. Later on, we'll see how to avoid this issue with [i]variable types[/i]. For now, let's practice creating variables!
de: Der obige Code ist so, als würde man ein Etikett vom entsprechenden Element nehmen und es auf das Falsche kleben: - In Zeile 1 enthält die Variable [code]health[/code] eine Zahl. - Ab Zeile 2 enthält [code]health[/code] Text. Der Computer lässt dich das tun! Die Syntax und "Grammatik" des Codes sind korrekt, aber es ist nicht gut. Später werden wir sehen, wie wir dieses Problem mit [i]Variablentypen[/i] vermeiden können. Lass uns vorerst üben, Variablen zu erstellen!
