Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-1-what-code-*-like.po
Languages: cs, da, de, es, fr, it, ja, nl, ru, ta, tr, uk, zh_hant

source: It's the language used by games like [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] and [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url].
cs: Je to jazyk, který používají hry jako [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] a [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url].
da: Det er det sprog, der bruges af spil som [ignore][url=https://store.steamdrevne.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] og [ignore][url=https://store.steamdrevne.com/app/1942280/Brotato/]Brotato[/url].
de: Sie wird in Spielen wie [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] und [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url] verwendet.
es: Es el lenguaje que utilizan juegos como [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] y [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url].
ja: これは、[ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] や [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url] などのゲームで使用される言語です。
ru: Это язык, на котором сделаны такие игры, как [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] и [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url].
tr: Bu dil, [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] ve [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url] gibi oyunlar tarafından kullanılan dildir.
uk: Це мова, якою зроблено такі ігри, як [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] і [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url].

source: Engineers at Tesla also used it for their cars' dashboards.
cs: Inženýři ve společnosti Tesla jej používali také pro palubní desky svých automobilů.
da: Ingeniører hos Tesla brugte også det til deres bilers dashboards.
de: Auch Ingenieure bei Tesla haben sie für die Armaturenbretter ihrer Autos genutzt.
es: Los ingenieros de Tesla lo usan para los tableros de sus carros.
ja: テスラのエンジニアは、車のダッシュボードにも使用しました。
ru: Инженеры Tesla используют его для приборных панелей своих автомобилей.
tr: Tesla'daki mühendisler onu, arabalarının gösterge panelleri için kullanıyor.
uk: Інженери Tesla використовують її для приладових панелей своїх автомобілів.

source: GDScript is an excellent language to get started with programming because it's specialized. Unlike some other languages, it doesn't have an [i]overwhelming[/i] amount of features for you to learn.
cs: GDScript je vynikající jazyk pro začátky programování, protože je specializovaný. Na rozdíl od některých jiných jazyků nemá [i] ohromující[/i] množství funkcí, které byste se museli naučit.
da: GDScript er et fremragende sprog at komme i gang med programmering, fordi det er specialiseret. I modsætning til nogle andre sprog, har det ikke en [i]overvældende[/i] mængde af funktioner du skal lære.
de: GDScript ist eine ausgezeichnete Sprache, um mit Programmieren zu beginnen. Im Gegensatz zu einigen anderen Sprachen, ist GDScript auf Games spezialisiert und hat deshalb keine [i]überwältigende[/i] Menge an Funktionen, die du lernen musst.
es: GDScript es un lenguaje excelente para iniciarse en la programación porque es especializado. A diferencia de otros lenguajes, no tiene una cantidad [i]abrumadora[/i] de funcionalidades que tengas que aprender.
fr: GDScript est un excellent langage pour débuter en programmation car il est spécialisé. Contrairement à d'autres langages, il n'a pas une quantité [i]écrasante[/i] de fonctionnalités à apprendre.
it: GDScript è un linguaggio eccellente per iniziare a programmare perchè è specializzato. Al contrario di altri linguaggi, non ha una [i]schiacciante[/i] quantità di funzionalità da poter imparare.
ja: GDScriptは特殊な言語なので、プログラミングを始めるのに最適です。他の言語とは異なり、覚える機能の多さに[i]圧倒される[/i]ことはありません。
nl: GDScript is een uitstekende taal om mee te beginnen omdat het een gespecialiseerde programmeertaal is. In tegenstelling tot sommige andere talen heeft het geen [i]overweldigende[/i] hoeveelheid functionaliteiten om te leren.
ru: GDScript — отличный язык для знакомства с программированием, благодаря своей специализации. В отличие от некоторых других языков, в нем нет [i]ошеломляюще огромного[/i] количества особенностей, требующих изучения.
ta: GDSCRIPT நிரலாக்கத்துடன் தொடங்க ஒரு சிறந்த மொழி, ஏனெனில் இது சிறப்பு வாய்ந்தது. வேறு சில மொழிகளைப் போலல்லாமல், நீங்கள் கற்றுக்கொள்ள வேண்டிய அம்சங்களின் அளவு [/i] இது இல்லை.
tr: GDScript, programlamaya başlamak için harika bir dildir, çünkü alanında özelleşmiştir. Bazı diğer dillerden farklı olarak, [i]bunaltıcı derecede[/i] çok miktarda öğrenilecek özelliğe sahip değildir.
uk: GDScript — чудова мова для знайомства з програмуванням завдяки своїй спеціалізації. На відміну від деяких інших мов, у ній немає [i]приголомшливої[/i] кількості особливостей, які слід вивчити.
zh_hant: GDScript 是非常適合程式初學者的特化語言。不像其他語言，沒有[b]過量[/b]的功能要學習。

source: Most programming languages are similar
cs: Většina programovacích jazyků je podobná
da: De fleste programmeringssprog er lignende
de: Die meisten Programmiersprachen sind ähnlich
es: La mayoría de los lenguajes de programación son similares
fr: La plupart des langages de programmation sont similaires
it: Molti linguaggi di programmazione sono simili
ja: ほとんどのプログラミング言語は似たようなもの
nl: Veel programmeertalen lijken op elkaar
ru: Большинство языков программирования похожи
ta: பெரும்பாலான நிரலாக்க மொழிகள் ஒத்தவை
tr: Çoğu programlama dilleri birbirine benzer
uk: Більшість мов програмування схожі
zh_hant: 大部分程式語言都很相似

source: Don't be afraid of being locked in. The concepts you learn in your first programming language will apply to all the others.
cs: Nebojte se, že vás někdo zamkne. Koncepty, které se naučíte v prvním programovacím jazyce, se uplatní ve všech ostatních.
da: Vær ikke bange for at blive låst. De begreber, du lærer på dit første programmeringssprog, gælder for alle de andre.
de: Hab keine Angst davor, das du hier etwas lernst, was später nicht mehr nützlich ist. Die Konzepte, die du in deiner ersten Programmiersprache lernst, gelten auch für alle anderen.
es: No tengas miedo de terminar encerrado(a) en tu primer lenguaje. Los conceptos que aprendas en tu primer lenguaje de programación se aplicarán a todos los demás.
ja: GDScriptから抜け出せなくなる心配はありません。最初のプログラミング言語で学んだ概念は、他の全ての言語でも役立てることができます。
ru: Не бойтесь попасть в заложники одного языка. Концепции, которые вы изучите в своем первом языке программирования, будут применимы и ко всем остальным.
tr: Bir dile takılıp kalmaktan korkmayın. İlk programlama diliniz ile öğreneceğiniz kavramlar, tüm diğerleri için de geçerli olacaktır.
uk: Не бійтеся стати заручником однієї мови. Концепції, які ви вивчите у своїй першій мові програмування, будуть застосовні і до всіх інших.

source: Most languages have more similarities than differences. Once you learn one, it takes much less time to become productive with the next one.
cs: Většina jazyků má více podobností než rozdílů. Jakmile se naučíte jeden z nich, bude vám trvat mnohem méně času, než se stanete produktivními v dalším.
da: De fleste sprog har flere ligheder end forskelle. Når du har lært et, tager det meget kortere tid at blive produktiv med det næste.
de: Die meisten Sprachen haben mehr Ähnlichkeiten als Unterschiede. Sobald du eine gelernt hast, ist es viel einfacher, mit der nächsten produktiv zu werden.
es: La mayoría de los lenguajes tienen más similitudes que diferencias. Una vez que aprendas uno, te llevará mucho menos tiempo volverte eficiente con el siguiente.
ja: ほとんどの言語は違いよりも共通点のほうが多いのです。1つの言語を一度学習してしまえば、次に別の言語を覚えるときに本格的に使いこなせるようになるまでの時間がずっと短くなります。
ru: Большинство языков имеют больше сходств, чем различий. Как только вы изучите один из них, вам потребуется гораздо меньше времени, чтобы начать продуктивно работать со следующим.
tr: Çoğu diller, diğerleriyle olan farklılıklarına karşın, çok daha fazla benzerliklere sahiptir. Birini öğrendikten sonra, bir sonrakinde üretken olmak çok daha az zaman alır.
uk: Більшість мов мають більше схожого, аніж відмінностей. Як тільки ви вивчите одну з них, вам знадобиться значно менше часу, щоб почати продуктивно працювати з наступною.

source: Here's an example of the same code in three languages: GDScript, JavaScript, and Python.
cs: Zde je příklad stejného kódu ve třech jazycích: GDScript, JavaScript a Python.
da: Her er et eksempel på den samme kode i tre sprog: GDScript, JavaScript og Python.
de: Hier ist ein Beispiel für denselben Code in drei Sprachen: GDScript, JavaScript und Python.
es: Aquí tienes un ejemplo del mismo código en tres lenguajes: GDScript, JavaScript y Python.
ja: 同じコードをGDScript、JavaScript、Pythonの3つの言語で記述した例をお見せしましょう。
ru: Вот пример одного и того же кода на трех языках: GDScript, JavaScript и Python.
tr: İşte size aynı kodun üç dilde birer örneği: GDScript, JavaScript ve Python.
uk: Ось приклад одного й того самого коду трьома мовами: GDScript, JavaScript і Python.

source: Try to spot the similarities and differences.
cs: Zkuste si všimnout podobností a rozdílů.
da: Prøv at finde ligheder og forskelle.
de: Versuche, die Ähnlichkeiten und Unterschiede zu erkennen.
es: Intenta detectar las similitudes y diferencias.
ja: 似ているところや違っているところを見つけてみてください。
ru: Попытайтесь найти сходства и различия.
tr: Aralarındaki benzerlikleri ve farklılıkları yakalamayı deneyin.
uk: Спробуйте знайти подібності та відмінності.

source: It doesn't look [i]that[/i] different, does it?
cs: Nevypadá to [i] až tak[/i] jinak, že?
da: Det ser ikke [i]så[/i] forskelligt ud, gør det?
de: Es sieht nicht [i]so[/i] anders aus, oder?
es: No parece [i]tan[/i] diferente, ¿verdad?
fr: Cela n'a pas l'air [i]si[/i] différent, n'est-ce pas ?
it: Non sembrano poi [i]così[/i] diversi, vero?
ja: [i]それほど[/i]違うようには見えませんよね？
nl: Dat ziet er toch niet [i]zo[/i] verschillend uit?
ru: Код не выглядит [i]таким уж[/i] разным, не так ли?
ta: இது [/i] வித்தியாசமாகத் தெரியவில்லை, இல்லையா?
tr: [i]O kadar[/i] da farklı görünmüyorlar, değil mi?
uk: Код не [i]дуже[/i] відрізняється, чи не так?
zh_hant: 看起來沒差[b]那麼[/b]多，是吧？

source: Are programming languages all completely different?
cs: Jsou všechny programovací jazyky zcela odlišné?
da: Er alle programmeringssprog helt forskellige?
de: Sind Programmiersprachen alle völlig unterschiedlich?
es: ¿Son todos los lenguajes de programación completamente diferentes?
fr: Les langages de programmation sont-ils tous complètement différents ?
it: I linguaggi di programmazione sono tutti diversi fra loro?
ja: おさらい：プログラミング言語はそれぞれまったく違うもの？
nl: Zijn programmeertalen allemaal compleet verschillend?
ru: Все языки программирования совершенно разные?
ta: நிரலாக்க மொழிகள் அனைத்தும் முற்றிலும் வேறுபட்டதா?
tr: Programlama dillerinin hepsi tamamen farklı mıdırlar?
uk: Всі мови програмування зовсім різні?
zh_hant: 程式語言都完全相異嗎？

source: If you learn one language and then want to learn another, will you have to start from scratch?
cs: Pokud se naučíte jeden jazyk a pak se chcete naučit další, budete muset začít od nuly?
da: Hvis du lærer et sprog og derefter ønsker at lære et anden, skal du så starte fra bunden?
de: Wenn Du eine Sprache lernst und dann eine andere lernen willst, musst Du dann bei Null anfangen?
es: Si aprendes un lenguaje y luego quieres aprender otro, ¿tendrás que empezar de cero?
fr: Si vous apprenez une langage et que vous souhaitez ensuite en apprendre une autre, devrez-vous recommencer à zéro ?
it: Dopo aver imparato un linguaggio, dovrai ripartire da zero per impararne uno nuovo?
ja: ある言語を学んだ後に別の言語を学びたいと思ったら、また最初から勉強を始めなければならないのでしょうか？
nl: Als je één taal leert en daarna een andere wilt leren, moet je dan helemaal opnieuw beginnen?
ru: Если при изучении одного языка, вы захотите выучить другой, придется ли вам начинать с нуля?
ta: நீங்கள் ஒரு மொழியைக் கற்றுக் கொண்டு, இன்னொன்றைக் கற்றுக்கொள்ள விரும்பினால், நீங்கள் புதிதாகத் தொடங்க வேண்டுமா?
tr: Eğer bir dili öğrenirseniz ve ardından bir başkasını öğrenmek isterseniz, sıfırdan mı başlamanız gerekir?
uk: Якщо після вивчення однієї мови ви захочете вивчити іншу, чи доведеться вам починати з нуля?
zh_hant: 如果你學了程式語言後想學另一個，你得重新開始嗎？

source: Most programming languages build upon the same ideas of how to program. As a result, they're mostly similar.
cs: Většina programovacích jazyků staví na stejných myšlenkách, jak programovat. Proto jsou si většinou podobné.
da: De fleste programmeringssprog bygger på de samme ideer om, hvordan man programmere. Som følge heraf er de fleste lignende.
de: Die meisten Programmiersprachen bauen auf den gleichen Ideen des Programmierens auf. Infolgedessen sind sie meist ähnlich.
es: La mayoría de los lenguajes de programación se basan en las mismas ideas sobre cómo programar. Como resultado, son en su mayoría similares.
ja: ほとんどのプログラミング言語は、プログラミングの方法に関して、同じ考え方に基づいて構築されています。
ru: Большинство языков программирования основаны на одних и тех же идеях о том, как программировать. В результате они в основном похожи.
tr: Çoğu programlama dili, nasıl programlama yapılacağına dair aynı fikirler üzerine inşa edilmişlerdir. Bunun sonucu olarak, büyük miktarda birbirlerine benzerler.
uk: Більшість мов програмування засновані на тих самих ідеях програмування. Як наслідок, вони в основному схожі.

source: It's not to say all languages are the same, though. Some offer a really unique syntax and require a completely different mindset compared to GDScript.
cs: To však neznamená, že jsou všechny jazyky stejné. Některé nabízejí opravdu jedinečnou syntaxi a vyžadují zcela jiné myšlení než GDScript.
da: Det er dog ikke alle sprog der er det samme. Nogle tilbyder en virkelig unik syntaks og kræver en helt anden tankegang sammenlignet med GDScript.
de: Es soll jedoch nicht heißen, dass alle Sprachen gleich sind. Einige bieten eine wirklich einzigartige Syntax und erfordern eine völlig andere Denkweise als GDScript.
es: Sin embargo, esto no quiere decir que todos los lenguajes sean iguales. Algunos ofrecen una sintaxis realmente única y requieren una mentalidad completamente diferente en comparación con GDScript.
ja: とはいえ、全ての言語が同じというわけではありません。その中には、本当に独特な構文を使用し、GDScriptとは全く異なる考え方が必要なものも存在します。
ru: Однако это не значит, что все языки одинаковы. Некоторые предлагают действительно уникальный синтаксис и требуют совершенно другого образа мышления по сравнению с GDScript.
tr: Ancak bu, tüm dillerin aynı olduğu anlamına gelmez. Bazıları gerçekten eşsiz bir söz dizimi sunar ve GDScript'e kıyasla bütünüyle farklı bir düşünce şekli gerektirir.
uk: Однак це не означає, що всі мови однакові. Деякі пропонують дійсно унікальний синтаксис і вимагають зовсім іншого способу мислення, аніж GDScript.

source: However, languages like GDScript, Python, JavaScript, C++, C#, and many others build upon a similar programming philosophy.
cs: Nicméně jazyky jako GDScript, Python, JavaScript, C++, C# a mnoho dalších staví na podobné filozofii programování.
da: Men sprog som GDScript, Python, JavaScript, C++, C# og mange andre bygger på en lignende programmeringsfilosofi.
de: Sprachen wie GDScript, Python, JavaScript, C++, C# und viele andere bauen jedoch auf einer ähnlichen Programmierphilosophie auf.
es: Sin embargo, lenguajes como GDScript, Python, JavaScript, C++, C# y muchos otros se basan en una filosofía de programación similar.
ja: しかし、GDScript、Python、JavaScript、C++、C#、その他の多くの言語は、同じようなプログラミングの設計思想に基づいて作られています。
ru: Однако такие языки, как GDScript, Python, JavaScript, C++, C# и многие другие, основаны на аналогичной философии программирования.
tr: Yine de, GDScript, Python, JavaScript, C++, C# gibi diller ve birçok diğeri benzer bir programlama felsefesini temel alırlar.
uk: Однак такі мови, як GDScript, Python, JavaScript, C++, C# та багато інших, засновані на подібній філософії програмування.

source: No, they have many similarities
cs: Ne, mají mnoho podobností
da: Nej, de har mange ligheder
de: Nein, sie haben viele Gemeinsamkeiten
es: No, tienen muchas similitudes
fr: Non, ils ont de nombreuses similitudes
it: No, sono molto simili
ja: いいえ、多くの類似点があります
nl: Nee, ze hebben veel overeenkomsten
ru: Нет, у них много общего
ta: இல்லை, அவர்களுக்கு பல ஒற்றுமைகள் உள்ளன
tr: Hayır, birçok benzerliğe sahiptirler
uk: Ні, вони мають багато спільного
zh_hant: 不，他們有許多相似處

source: Yes, they are completely different
cs: Ano, jsou zcela odlišné
da: Ja, de er helt forskellige
de: Ja, sie sind völlig unterschiedlich
es: Sí, son completamente diferentes
fr: Oui, ils sont complètement différents
it: Sì, sono completamente diversi
ja: はい、完全に別モノです
nl: Ja, ze zijn totaal verschillend
ru: Да, они совершенно разные
ta: ஆம், அவை முற்றிலும் வேறுபட்டவை
tr: Evet, bütünüyle farklıdırlar
uk: Так, вони зовсім різні
zh_hant: 是，他們完全不一樣

source: This is a course for beginners
cs: Toto je kurz pro začátečníky
da: Dette er et kursus for begyndere
de: Dies ist ein Kurs für Anfänger
es: Este es un curso para principiantes
fr: C'est un cours pour les débutants
it: Questo è un corso per principianti
ja: 初心者のため講座
nl: Dit is een cursus voor beginners
ru: Этот курс для начинающих
ta: இது ஆரம்பநிலைக்கு ஒரு பாடமாகும்
tr: Bu, yeni başlayanlar için bir kurstur
uk: Цей курс для початківців
zh_hant: 這是個初學者課程

source: If you want to learn to make games or code but don't know where to start, this course should be perfect.
cs: Pokud se chcete naučit vytvářet hry nebo kódovat, ale nevíte, kde začít, tento kurz by Vám měl hodně pomoct.
da: Hvis du ønsker at lære at lave spil eller kode, men ikke ved, hvor du skal starte, kan dette kursus være perfekt.
de: Wenn du lernen willst Games oder sonstigen Code zu programmieren, aber nicht weisst, wo du anfangen sollst, ist dieser Kurs perfekt.
es: Si quieres aprender a hacer juegos o a programar pero no sabes por dónde empezar, este curso es perfecto para ti.
fr: Si vous voulez apprendre à créer des jeux ou à coder mais que vous ne savez pas par où commencer, ce cours est fait pour vous.
it: Se vuoi imparare a fare videogiochi o a programmare ma non sai da dove iniziare, questo corso è perfetto per te.
ja: ゲームの作り方やプログラミングを学びたいけど、どこから始めたらいいか分からないという人には、この講座がピッタリです。
nl: Als je games of code wilt leren maken, maar niet weet waar je moet beginnen, dan is deze cursus perfect.
ru: Если вы хотите научиться создавать игры или программировать, но не знаете, с чего начать — этот курс идеально вам подойдёт.
ta: விளையாட்டுகள் அல்லது குறியீட்டை உருவாக்க நீங்கள் கற்றுக்கொள்ள விரும்பினால், ஆனால் எங்கு தொடங்குவது என்று தெரியவில்லை என்றால், இந்த பாடநெறி சரியானதாக இருக்க வேண்டும்.
tr: Eğer oyun yapmayı veya kodlamayı öğrenmek istiyor, ama nereden başlayacağınızı bilmiyorsanız, bu kurs başlamak için mükemmel diyebiliriz.
uk: Якщо ви хочете навчитися створювати ігри або програмувати, але не знаєте, з чого почати, цей курс ідеально вам підійде.
zh_hant: 如果你想學習遊戲製作或程式碼但不知從何開始，這個課程應該相當適合。

source: We designed it for [i]absolute beginners[/i], but if you already know another language, it can be a fun way to get started with Godot.
cs: Navrhli jsme ho pro [i]absolutní začátečníky[/i], ale pokud už znáte jiný jazyk, může to být zábavný způsob, jak začít s Godotem.
da: Vi designede det til [i]absolute begyndere[/i], men hvis du allerede kender et andet sprog, kan det være en sjov måde at komme i gang med Godot.
de: Wir haben den Kurs für [i]absolute Anfänger[/i] entwickelt. Wenn du aber bereits eine andere Sprache kennst, kann es auch eine unterhaltsame Möglichkeit sein, die Grundlagen von Godot zu lernen.
es: Lo hemos diseñado para [i]principiantes absolutos[/i], pero si ya conoces otro lenguaje, también puede ser una forma divertida de iniciarse en Godot.
ja: 私たちは[i]まったくの初心者[/i]のためにこれを作りましたが、すでに他の言語を知っている人は、Godotを楽しく使い始めることができるでしょう。
ru: Мы разработали его для [i]абсолютных новичков[/i], но если вы уже знаете другой язык, данный курс может быть интересным способом начать работу с Godot.
tr: Bu kursu [i]sıfırdan başlayanlar[/i] için tasarladık, ancak hâlihazırda başka bir dil biliyorsanız da Godot'ya başlamak için eğlenceli bir yol olabilir.
uk: Ми розробили його для [i]цілковитих новачків[/i], але якщо ви вже знаєте іншу мову, цей курс може бути цікавим способом розпочати роботу з Godot.

source: We will give you the coding foundations you need to start making games and applications with Godot.
cs: Dáme vám kódovací základy, které potřebujete, abyste mohli začít vytvářet hry a aplikace s Godotem.
da: Vi vil give dig det kode fundament, du skal bruge for at begynde at lave spil og applikationer med Godot.
de: Wir bringen dir die benötigten Programmiergrundlagen bei, um mit der Entwicklung von Games und Anwendungen mit Godot zu beginnen.
es: Te daremos las bases de codificación que necesitas para empezar a hacer juegos y aplicaciones con Godot.
ja: この講座では、Godotでゲームやアプリを作り始めるために必要なプログラミングの基礎をお教えします。
ru: Мы дадим вам основы программирования, необходимые для того, чтобы начать создавать игры и приложения с помощью Godot.
tr: Burada, Godot ile oyunlar ve uygulamalar yapmaya başlamak için ihtiyaç duyacağınız kodlama temellerini sağlayacağız.
uk: Ми дамо вам основи програмування, необхідні для того, щоб почати створювати ігри та програми за допомогою Godot.

source: Please be patient. It will take time before you can make your first complete game alone.
cs: Buďte prosím trpěliví. Bude nějakou dobu trvat, než budete moci vytvořit svou první kompletní hru sami.
da: Vær venligst tålmodig. Det vil tage tid, før du kan lave dit første komplette spil alene.
de: Bitte habe etwas Geduld. Es wird einige Zeit dauern, bis du dein erstes komplettes Spiel oder deine erste App alleine erstellen kannst.
es: Por favor, ten paciencia. Tomará tiempo antes de que puedas hacer tu primer juego completo tú solo o sola.
ja: 辛抱してください。1人でゲームを完成させることができるようになるまでには時間がかかるでしょう。
ru: Пожалуйста, наберитесь терпения. Потребуется время, прежде чем вы сможете сделать свою первую полноценную игру в одиночку.
tr: Ama lütfen sabırlı ol. Tek başınıza ilk oyununuzu yapıp tamamlayabilmeniz zaman alacaktır.
uk: Будь ласка, наберіться терпіння. Потрібен час, перш ніж ви зможете зробити свою першу повноцінну гру самостійно.

source: Learning to make games takes practice
cs: Naučit se vytvářet hry vyžaduje praxi
da: At lære at lave spil kræver øvelse
de: Lernen wie man Games erstellt braucht Übung
es: Aprender a hacer juegos requiere práctica
fr: Apprendre à faire des jeux demande de la pratique
it: Imparare a fare giochi ha bisogno di pratica
ja: ゲーム制作を学ぶためには練習が必要
nl: Games leren maken vergt oefening
ru: Обучение созданию игр требует практики
ta: விளையாட்டுகளை உருவாக்க கற்றுக்கொள்வது நடைமுறையில் உள்ளது
tr: Oyun yapmayı öğrenmek alıştırma gerektirir
uk: Навчання створення ігор потребує практики
zh_hant: 學習製作遊戲需要練習

source: Creating games is more accessible than ever, but it still takes a lot of work and practice.
cs: Tvorba her je dostupnější než kdy dříve, ale stále vyžaduje spoustu práce a praxe.
da: At lave spil er mere tilgængeligt end nogensinde, men det tager stadig en masse arbejde og øvelse.
de: Das Erstellen von Spielen ist zugänglicher denn je, aber es erfordert immer noch viel Arbeit und Übung.
es: Crear juegos es más accesible que nunca, pero sigue requiriendo mucho trabajo y práctica.
ja: ゲーム制作はかつてないほど手軽になりましたが、それでもまだ多くの作業と練習が必要です。
ru: Создание игр стало более доступным, чем когда-либо, но оно по-прежнему требует много работы и практики.
tr: Oyunlar yapmak eskiye göre her zamankinden daha erişilebilir durumda, ama yine de çokça çalışma ve alıştırma gerektirir.
uk: Створення ігор стало доступнішим, ніж будь-коли, але воно, як і раніше, вимагає багато роботи та практики.
