Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-13-conditions.po
Languages: cs, da, es, it, ja, nl, pt, ru, ta, tr, uk, zh_hant

source: In previous lessons, we decreased and increased a character's health, but there was no limit to how much health they could have.
cs: V předchozích lekcích jsme snižovali a zvyšovali zdraví postavy, ale neexistoval žádný limit, kolik zdraví může mít.
da: I tidligere lektioner, mindskede og øgede vi en karakters liv, men der var ingen grænse for, hvor meget liv de kunne have.
es: En las lecciones anteriores, disminuimos y aumentamos la salud de un personaje, pero no había límite para la cantidad de salud que este podía tener.
it: Nelle lezioni precedenti, abbiamo diminuito e aumentato la vita di un personaggio, ma non c'era alcun limite a quanta vita potesse avere.
ja: 以前のレッスンでは、キャラクターの体力を増減させていましたが、持てる体力に制限はありませんでした。
nl: In vorige lessen verlaagden en verhoogden we de gezondheid van een personage, maar er was geen limiet aan hoeveel gezondheid ze konden hebben.
pt: Nas lições anteriores, diminuímos e aumentamos a vida de uma personagem, mas não tinha um limite para quanta vida ele poderia ter.
ru: В предыдущих уроках мы уменьшали и увеличивали здоровье персонажа, но никакого предела того, сколько здоровья может быть у персонажа, не было.
ta: முந்தைய பாடங்களில், ஒரு கதாபாத்திரத்தின் ஆரோக்கியத்தை நாங்கள் குறைத்து அதிகரித்தோம், ஆனால் அவர்கள் எவ்வளவு ஆரோக்கியமாக இருக்க முடியும் என்பதற்கு வரம்பு இல்லை.
tr: Önceki derslerde, bir karakterin sağlığını azaltıp artırıyorduk, ancak ne kadar sağlığa sahip olabilecekleri konusunda bir sınır yoktu.
uk: У попередніх уроках ми зменшували та збільшували здоров’я персонажа, але не було обмежень щодо того, скільки здоров’я він міг мати.
zh_hant: 在之前的課程中，我們有減少和增加角色的生命值，但並沒有設定生命值的上限。

source: As a result, the player could increase their character's health indefinitely, which we do not want.
cs: V důsledku toho by si hráč mohl neomezeně zvyšovat zdraví své postavy, což nechceme.
da: Som følge heraf kunne spilleren øge sin karakters liv på ubestemt tid, hvilket vi ikke ønsker.
es: Como resultado, el jugador podía aumentar la salud de su personaje indefinidamente, lo cual no queremos.
it: Come risultato, il giocatore potrebbe aumentare la vita del suo personaggio per sempre, cosa che noi non vogliamo che succeda.
ja: その結果、プレイヤーはキャラクターの体力を無限に増やすことができますが、これは望ましくありません。
nl: Hierdoor zou de speler de gezondheid van hun personage oneindig kunnen verhogen, wat we niet willen.
pt: Como resultado, o jogador pode aumentar a vida da personagem dele sem nenhum limite e não queremos que isso aconteça.
ru: В результате игрок мог бесконечно увеличивать уровень здоровья своего персонажа, чего мы не хотим.
ta: இதன் விளைவாக, வீரர் தங்கள் கதாபாத்திரத்தின் ஆரோக்கியத்தை காலவரையின்றி அதிகரிக்க முடியும், அதை நாங்கள் விரும்பவில்லை.
tr: Sonuç olarak, oyuncu karakterinin sağlığını sınırsız olarak arttırabilir, ki biz bunu istemiyoruz.
uk: У результаті гравець може збільшувати здоров’я свого персонажа на невизначений термін, чого ми не хочемо.
zh_hant: 結果玩家可以無限制地增加角色的生命值，這是我們不希望發生的。

source: What happens to health when we damage our character?
cs: Co se stane se zdravím, když postavu poškodíme?
da: Hvad sker der med liv, når vi skader vores karakter?
es: ¿Qué ocurre con la salud cuando dañamos a nuestro personaje?
it: Cosa succede alla vita quando danneggiamo il nostro personaggio?
ja: キャラクターにダメージを与えると、体力はどうなりますか?
nl: Wat gebeurt er met de gezondheid als we ons personage schade toebrengen?
pt: O que acontece com a vida quando nosso personagem leva dano?
ru: Что происходит со здоровьем, когда мы наносим урон нашему персонажу?
ta: எங்கள் தன்மையை சேதப்படுத்தும் போது ஆரோக்கியத்திற்கு என்ன நடக்கும்?
tr: Karakterimize zarar verdiğimizde, sağlığa (health) ne olur?
uk: Що відбувається зі здоров'ям, коли ми псуємо свій характер?
zh_hant: 當我們對角色造成傷害時，生命值會發生什麼變化？

source: Suppose our character has [code]100[/code] health.
da: Antag at vores karakter har [code]100[/code] liv.
it: Supponiamo che il nostro giocatore abbia [code]100[/code] punti vita.
ja: キャラクターの体力が[code]100[/code]だとします。
nl: Stel dat ons personage [code]100[/code] gezondheid heeft.
pt: Vamos supor que nosso personagem tenha [code]100[/code] de vida.
ru: Предположим, наш персонаж имеет [code]100[/code] здоровья.
tr: Karakterimizin [code]100[/code] sağlığına sahip olduğunu varsayalım.

source: What would the value of health be if we called [code]take_damage(25)[/code] [b]five times[/b]?
da: Hvad ville værdien af liv være, hvis vi kaldte [code]take_damage(25)[/code] [b]fem gange[/b]?
it: Quanti punti vita rimarrebbero se chiamassimo [code]take_damage(25)[/code] [b]cinque volte[/b]?
ja: [code]take_damage(25)[/code]を[b]5回[/b]呼び出した場合、体力の値はどうなるでしょうか?
nl: Wat zou de waarde van de gezondheid zijn als we [code]take_damage(25)[/code] [b]vijf keer[/b] aanroepen?
pt: Qual seria o valor da vida se chamássemos a função [code]take_damage(25)[/code] [b]cinco vezes[/b]?
ru: Сколько здоровья будет у персонажа, если мы вызовем [code]take_damage(25)[/code] [b]пять раз[/b]?
tr: [code]take_damage(25)[/code] çağrısını [b]beş kez[/b] yapsaydık sağlık değeri (health) ne olurdu?

source: Calling [code]take_damage(25)[/code] five times would subtract a total of [code]125[/code] from [code]100[/code].
da: Hvis man kalder [code]take_damage(25)[/code] fem gange, trækkes i alt [code]125[/code] fra [code]100[/code].
it: Chiamare [code]take_damage(25)[/code]cinque volte sottrarrebbe un totale di [code]125[/code] da [code]100[/code].
ja: [code]take_damage(25)[/code] を 5 回呼び出すと、[code]100[/code] から合計 [code]125[/code] が減算されます。
nl: Vijf keer [code]take_damage(25)[/code] aanroepen zou een totaal van [code]125[/code] van [code]100[/code] aftrekken.
pt: Chamar a função [code]take_damage(25)[/code] cinco vezes subtrairia um total de [code]125[/code] de [code]100[/code].
ru: Пятикратный вызов [code]take_damage(25)[/code] суммарно вычтет [code]125[/code] из [code]100[/code].
tr: [code]take_damage(25)[/code] 'in beş kez çağrılması, toplamda [code]125[/code] değerini [code]100[/code] değerinden çıkaracaktır.

source: We can use conditions to run actions [b]selectively[/b].
da: Vi kan bruge betingelser til at udføre handlinger [b]selektivt[/b].
it: Possiamo usare le condizioni per eseguire azioni [b]in modo selettivo[/b].
ja: 条件を使用して、アクションを[b]選択的[/b]に実行できます。
nl: We kunnen condities gebruiken om acties [b]selectief[/b] uit te voeren.
pt: Podemos usar condições para executar ações [b]seletivamente[/b], ou seja, podemos escolher executar uma ação ou outra dependendo da condição.
ru: Мы можем использовать условия для выполнения действий [b]выборочно[/b].
tr: Eylemleri [b]seçerek[/b] çalıştırmak için koşulları kullanabiliriz

source: Conditions make your code branch into two paths: if the condition is met, the computer will run the corresponding instructions. Otherwise, those instructions will not run at all.
da: Betingelser får din kode til at forgrene sig i to stier: Hvis betingelsen er opfyldt, vil computeren køre de tilsvarende instruktioner. Ellers vil disse instruktioner slet ikke køre.
it: Le condizioni diramano il tuo codice in due percorsi: se la condizione è soddisfatta, il computer eseguirà le istruzioni corrispondenti. Altrimenti, quelle istruzioni non verranno eseguite.
ja: 条件によってコードは 2 つのパスに分岐し、条件が満たされると、コンピューターは対応する命令を実行します。そうしないと、これらの命令はまったく実行されません。
nl: Condities laten je code vertakken in twee paden: als aan de conditie wordt voldaan, zal de computer de bijbehorende instructies uitvoeren. En als niet, dan worden die instructies helemaal niet uitgevoerd.
pt: As condições fazem com que o seu código se ramifique (ou seja, se divide) em dois caminhos: se a condição for atendida, o computador vai executar as instruções correspondentes. Caso contrário, essas instruções não serão executadas.
ru: Условия создадут в вашем коде разветвление на два пути: если условие выполнено, компьютер выполнит соответствующие ему инструкции. Иначе, эти инструкции не выполнятся.
tr: Koşullar, kodunuzu iki yola ayırır: koşul doğrulanırsa, bilgisayar ilgili talimatları çalıştırır. Aksi takdirde, bu talimatlar hiç çalışmayacaktır.

source: Video games and other computer programs are full of conditions. For example, game input largely relies on conditions: [i]if[/i] the player presses the button on a gamepad, the character jumps.
cs: Videohry a další počítačové programy jsou plné podmínek. Například zadávání dat do her se z velké části opírá o podmínky: [i]pokud[/i] hráč stiskne tlačítko na gamepadu, postava vyskočí.
da: Videospil og andre computerprogrammer er fulde af betingelser. For eksempel afhænger spilinput i høj grad af betingelser: [i]hvis[/i] spilleren trykker på knappen på en gamepad, hopper karakteren.
es: Los videojuegos y otros programas informáticos están llenos de condiciones. Por ejemplo, la entrada del juego depende en gran medida de las condiciones: [i]si[/i] el jugador presiona el botón de un gamepad, el personaje salta.
it: I videogiochi e molti altri programmi per computer sono pieni di condizioni. Per esempio, gli input di gioco fanno grande affidamento sulle condizioni: [i]se[/i] il giocatore preme il pulsante sul gamepad, il personaggio salta.
ja: ビデオゲームやその他のコンピュータプログラムは条件に満ちています。[i]たとえば[/i]、ゲームの入力は、プレイヤーがゲームパッドのボタンを押すとキャラクターがジャンプするという条件に大きく依存します。
nl: Videospellen en andere computerprogramma's zitten vol condities. De invoer in spellen is bijvoorbeeld grotendeels gebaseerd op condities: [i]als[/i] de speler op de knop op een gamepad drukt, dan springt het personage.
pt: Jogos e outros programas de computador estão cheios de condições. Por exemplo, os inputs do jogo (a leitura dos botões de controles ou teclados) dependem em grande parte das condições: [i]se[/i] o jogador pressionar o botão num gamepad, o personagem pula.
ru: Видеоигры и другие компьютерные программы полны условий. Например, пользовательский ввод в игре очень сильно зависит от условий: [i]если[/i] игрок нажал кнопку на геймпаде — персонаж подпрыгивает.
ta: வீடியோ கேம்கள் மற்றும் பிற கணினி நிரல்கள் நிபந்தனைகள் நிறைந்துள்ளன. எடுத்துக்காட்டாக, விளையாட்டு உள்ளீடு பெரும்பாலும் நிபந்தனைகளை நம்பியுள்ளது: [i] [/i] வீரர் ஒரு கேம்பேடில் பொத்தானை அழுத்தினால், எழுத்து குதிக்கிறது.
tr: Video oyunları ve diğer bilgisayar programları koşullarla doludur. Örneğin, oyun girdisi büyük ölçüde koşullara dayanır: [i]eğer[/i] oyuncu, oyun kolundaki düğmeye basarsa, karakter zıplar.
uk: Відеоігри та інші комп'ютерні програми повні умов. Наприклад, введення в гру значною мірою залежить від умов: [i]якщо[/i] гравець натискає кнопку на геймпаді, персонаж стрибає.
zh_hant: 電玩遊戲和其他電腦程式中充滿了條件。例如，遊戲輸入大多依賴於條件：[b]如果[/b]玩家按下遊戲手把的按鈕，角色就會跳躍。

source: When the computer checks a condition, this is called [b]to evaluate[/b] a condition. All conditions [b]evaluate[/b] to either [code]true[/code] or [code]false[/code].
da: Når computeren kontrollerer en betingelse, kaldes dette [b]at evaluere[/b] en betingelse. Alle betingelser [b]evaluerer[/b] til enten [code]true[/code](«sandt») eller [code]false[/code](«falsk»).
it: Quando il computer controlla una condizione, si dice che [b]valutano[/b] una condizione. Tutte le condizioni [b]valutano[/b] che la condizione sia o [code]vera[/code] o [code]falsa[/code].
ja: コンピューターが条件をチェックすると、条件を[b]評価[/b]するために呼び出されます。すべての条件は [code]true[/code] または [code]false[/code] のいずれかに[b]評価[/b]されます。
nl: Wanneer de computer een conditie controleert, heet dit een conditie [b]evalueren[/b]. Alle condities [b]evalueren[/b] naar ofwel [code]true[/code] (waar) of [code]false[/code] (onwaar).
pt: O computador verificar uma condição chama-se [b]avaliar[/b] uma condição. Todas as condições [b]são avaliadas[/b] como [code]true[/code] (verdadeiro) ou [code]false[/code] (falso).
ru: Процесс проверки условий компьютером называется [b]оценкой[/b] условий. Все условия [b]оцениваются[/b] как истинные ([code]true[/code]) либо как ложные ([code]false[/code]).
tr: Bilgisayar bir koşulu kontrol ettiğinde, buna [b]bir koşulu[/b] değerlendirmek denir. Tüm koşullar, ya [code]true[/code] (doğru) ya da [code]false[/code] (yanlış) olarak [b]değerlendirilir[/b] .

source: Either the player is pressing the button, or not. Either the character is touching an enemy, or not.
da: Enten trykker spilleren på knappen, eller ej. Enten rører karakteren en fjende, eller ej.
it: O il giocatore sta premendo il pulsante, oppure no. O il personaggio sta toccando un nemico, oppure no.
ja: プレーヤーがボタンを押しているか、押していないかのどちらかです。キャラクターが敵に触れているか、触れていないかのどちらかです。
nl: De speler drukt op de knop of niet. Het personage raakt een vijand aan, of niet.
pt: Ou o jogador pressiona o botão, ou não. Ou a personagem toca num inimigo, ou não.
ru: Нажал ли игрок на кнопку или нет. Соприкасается ли игрок с противником или нет.
tr: Oyuncu düğmeye basıyor, ya da basmıyor. Karakter bir düşmana dokunuyor, ya da dokunmuyor.

source: In our case, [i]if[/i] the health goes over a maximum value, we want to reset it to the maximum.
da: I vores tilfælde, [i]hvis[/i] livet overstiger en maksimal værdi, vil vi nulstille det til maksimum.
it: Nel nostro caso, [i]se[/i] la vita va sotto un valore minimo, lo vogliamo resettare la massimo.
ja: この場合、ヘルスが最大値を超えた[i]場合[/i]は、最大値にリセットします。
nl: In ons geval, [i]als[/i] de gezondheid over een maximale waarde gaat, willen we het terugbrengen tot het maximum.
pt: No nosso caso, [i]se[/i] a vida ultrapassar um valor máximo, queremos redefini-la ao máximo (e não deixar ultrapassar esse máximo).
ru: В нашем случае, [i]если[/i] здоровье превышает максимальное значение, мы хотим сбросить его до максимального.
tr: Bizim durumumuzda, [i]eğer[/i] sağlık, izin verilen en yüksek değerin üzerine çıkarsa, bunu en yüksek değere geri değiştirmek istiyoruz.

source: To define a condition, we use the [code]if[/code] keyword. We write a line starting with [code]if[/code], [ignore]type the condition to evaluate, and end the line with a colon.
da: For at definere en betingelse bruger vi nøgleordet [code]if[/code](«hvis» på engelsk). Vi skriver en linje, der starter med [code]if[/code], skriver den betingelse, der skal evalueres, og afslutter linjen med et kolon.
it: Per definire una condizione, utilizziamo la parola chiave [code]if[/code]. Scriviamo una riga che inizia con [code]if[/code], [ignore]digitiamo la condizione da valutare e terminiamo la riga con i due punti.
ja: 条件を定義するには、[code]if[/code] キーワードを使用します。[code]if[/code]で始まる行を記述し、評価する条件を[無視]入力し、行をコロンで終わらせます。
nl: Om een conditie te definiëren, gebruiken we het sleutelwoord [code]if[/code]. We schrijven een regel die begint met [code]if[/code], [ignore]schrijven de conditie die we willen evalueren en eindigen de regel met een dubbele punt.
ru: Чтобы определить условие мы используем ключевое слово [code]if[/code]. Мы начинаем строку с [code]if[/code], затем пишем условие для оценки и заканчиваем строку двоеточием.
tr: Bir koşul tanımlamak için [code]if[/code] (eğer) anahtar sözcüğünü kullanırız. Satırı yazmaya, [code]if[/code] ile başlıyoruz, değerlendirilecek koşulu yazıyoruz, ve satırı iki nokta üst üste ile bitiriyoruz.

source: Notice the [code]>[/code] comparison sign. We read this symbol as "greater than".
da: Bemærk sammenligningstegnet [code]>[/code]. Vi læser dette symbol som "større end".
it: Nota il segno di confronto [code]>[/code]. Questo simbolo viene letto come "maggiore di".
ja: [code]>[/code] の比較記号に注目してください。この記号は「より大きい」と読みます。
nl: Let op het vergelijkingsteken [code]>[/code]. We lezen dit symbool als "groter dan".
pt: Observe o sinal de comparação [code]>[/code]. Lemos esse símbolo como "maior que".
ru: Обратите внимание на знак сравнения [code]>[/code]. Мы читаем этот символ как «больше чем».
tr: [code]>[/code] karşılaştırma işaretine dikkat edin. Bu sembolü "büyüktür" olarak okuruz.

source: We've seen how function definitions use a colon at the end of the first line and nest content inside.
da: Vi har set, hvordan funktionsdefinitioner bruger et kolon i slutningen af den første linje og indlejrer indhold indeni.
it: Abbiamo visto come le definizioni di funzione utilizzino i due punti alla fine della prima riga e annidino il contenuto all'interno.
ja: 関数定義で最初の行の末尾にコロンを使用し、その中にコンテンツを入れ子にする方法を見てきました。
nl: We hebben gezien hoe functiedefinities een dubbele punt gebruiken aan het einde van de eerste regel en de inhoud erin nesten.
pt: Vimos como as definições de função usam o sinal de dois pontos no final da primeira linha e aninham o conteúdo dentro dela.
ru: Мы видели, как определения функций используют двоеточие в конце первой строки и вкладывают содержимое внутрь.
tr: Fonksiyon tanımlarının, ilk satırın sonunda iki nokta üst üste kullandığını, ve talimatların içine nasıl yerleştirildiğini gördük.

source: In GDScript, this syntax is a recurring pattern for all code blocks.
da: I GDScript er denne syntaks et tilbagevendende mønster for alle kodeblokke.
it: In GDScript, questa sintassi è un modello ricorrente per tutti i blocchi di codice.
ja: GDScriptでは、この構文はすべてのコードブロックで繰り返されるパターンです。
nl: In GDScript is deze vorm een terugkerend patroon voor alle codeblokken.
pt: No GDScript, essa sintaxe é um padrão recorrente para todos os blocos de código.
ru: В GDScript этот синтаксис является повторяющимся шаблоном для всех блоков кода.
tr: GDScript'te bu sözdizimi tüm kod kalıpları için yinelenen bir modeldir.

source: The computer knows which instructions belong to the condition because they are indented.
da: Computeren ved, hvilke instruktioner der hører til betingelsen, fordi de er indrykket.
it: Il computer sa quali istruzioni appartengono alla condizione perché sono indentate.
ja: コンピューターは、インデントされているため、どの命令が条件に属しているかを認識します。
nl: De computer weet welke instructies bij de conditie horen doordat ze inspringen.
pt: O computador sabe quais instruções pertencem à condição porque elas possuem indentação.
ru: Компьютер понимает, какие инструкции относятся к условию, потому что они помечены отступом.
tr: Bilgisayar, satırda girintili oldukları için, hangi talimatların koşula ait olduğunu bilir.

source: Comparisons
cs: Porovnání
da: Sammenligninger
es: Comparaciones
it: Comparazioni
ja: 比較
nl: Vergelijkingen
pt: Comparações
ru: Сравнения
ta: ஒப்பீடுகள்
tr: Karşılaştırmalar
uk: Порівняння
zh_hant: 比較

source: In the above example, we used the [code]>[/code] syntax to mean "greater than".
da: I ovenstående eksempel brugte vi [code]>[/code]-syntaksen til at betyde "større end".
it: Nell'esempio qui sopra, abbiamo usato la sintassi [code]>[/code] per intendere "maggiore di".
ja: 上記の例では、[code]>[/code] 構文を使用して「より大きい」という意味です。
nl: In het bovenstaande voorbeeld hebben we de vorm [code]>[/code] gebruikt om "groter dan" aan te geven.
pt: No exemplo acima, usamos a sintaxe [code]>[/code] para significar "maior que".
ru: В примере выше мы использовали символ [code]>[/code] означающий «больше чем».
tr: Yukarıdaki örnekte, "büyüktür" anlamına gelmek üzere [code]>[/code] işaretini kullandık.

source: We can compare numbers in other ways too.
da: Vi kan også sammenligne tal på andre måder.
it: Possiamo comparare numeri anche in altri modi.
ja: 他の方法でも数値を比較することができます。
nl: We kunnen getallen ook op andere manieren vergelijken.
pt: Podemos comparar números de outras maneiras também.
ru: Мы можем сравнить числа и другими способами.
tr: Sayıları başka şekillerde de karşılaştırabiliriz.

source: [code]>[/code] means "greater than" [code]<[/code] means "less than" [code]==[/code] means "equal to" [code]!=[/code] means "not equal to"
da: [code]>[/code] betyder "større end" [code]<[/code] betyder "mindre end" [code]==[/code] betyder "lig med" [code]!=[/code] betyder "ikke lig med"
it: [code]>[/code] significa "maggiore di" [code]<[/code] significa "minore di" [code]==[/code] significa "uguale a" [code]!=[/code] significa "diverso da"
ja: [code]>[/code] は「より大きい」を意味します [code]<[/code] は 「より小さい」 を意味します。 [code]==[/code]は「等しい」を意味します [code]!=[/code] は 「等しくない」 を意味します。
nl: [code]>[/code] betekent "groter dan". [code]<[/code] betekent "minder dan". [code]==[/code] betekent "gelijk aan". [code]!=[/code] betekent "niet gelijk aan".
pt: [code]>[/code] significa "maior que" [code]<[/code] significa "menor que" [code]==[/code] significa "igual a" [code]!=[/code] significa "não igual a" (ou diferente de)
ru: [code]>[/code] означает «больше чем» [code]<[/code] означает «меньше чем» [code]==[/code] означает «равно» [code]!=[/code] означает «не равно»
tr: [code]>[/code] "büyüktür" anlamına gelir [code]<[/code] "küçüktür" anlamına gelir [code]==[/code] "eşittir" anlamına gelir [code]!=[/code] "eşit değil" anlamına gelir

source: Here's how we might use these in [code]if[/code] statements.
da: Sådan kan vi bruge disse i [code]if[/code]-sætninger.
it: Ecco come potremmo usare queste condizioni [code]if[/code].
ja: これらを [code]if[/code] ステートメントで使用する方法は次のとおりです。
nl: Dit is hoe we deze zouden kunnen gebruiken in [code]if[/code] instructies.
pt: Vamos ver como podemos usar esses símbolos em condições [code]if[/code].
ru: Вот примеры того, как мы можем использовать эти способы в условии [code]if[/code].
tr: İşte bunları [code]if[/code] ifadelerinde nasıl kullanabileceğimize dair birkaç örnek.

source: What does "pass" do in the code?
cs: Co v kódu dělá "pass"?
da: Hvad gør "pass" i koden?
it: Cosa fa "pass" nel codice?
ja: コード内で「パス」は何をしますか?
nl: Wat doet "pass" in de code?
ru: Что означает "pass" в коде?
ta: குறியீட்டில் "பாச்" என்ன செய்கிறது?
tr: Kodun içindeki "pass" ne işe yarar?
uk: Що робить "pass" у коді?
zh_hant: 在這段程式碼中，「pass」有什麼作用？

source: The [code]pass[/code] keyword prevents errors in our code when a line cannot be empty.
da: Nøgleordet [code]pass[/code] forhindrer fejl i vores kode, når en linje ikke kan være tom.
it: La parola chiave [code]pass[/code] previene gli errori nel codice quando una riga non può essere vuota.
ja: [code]pass[/code]キーワードは、行を空にできない場合のコードのエラーを防ぎます。
nl: Het sleutelwoord [code]pass[/code] voorkomt fouten in onze code wanneer een regel niet leeg mag zijn.
ru: Ключевое слово [code]pass[/code] предотвращает ошибки в нашем коде, когда строка не может быть пустой.
tr: [code]pass[/code] anahtar kelimesi, bir satırın boş olmaması gerektiğinde, kodumuzda hata oluşmasını önler.

source: For example, we must have a line of code after a function definition or an [code]if[/code] block. When you don't know what to write yet, you can use the [code]pass[/code] keyword as a placeholder, and Godot won't give any errors.
da: For eksempel skal vi have en linje kode efter en funktionsdefinition eller en [code]if[/code]-blok. Når du ikke ved, hvad du skal skrive endnu, kan du bruge nøgleordet [code]pass[/code] som en pladsholder, og Godot vil ikke give nogen fejl.
it: Ad esempio, è necessario avere una riga di codice dopo una definizione di funzione o un blocco [code]if[/code]. Quando non si sa ancora cosa scrivere, si può usare la parola chiave [code]pass[/code] come segnaposto e Godot non darà alcun errore.
ja: たとえば、関数定義または [code]if[/code] ブロックの後にコード行が必要です。何を書けばよいかわからない場合は、[code]pass[/code]キーワードをプレースホルダーとして使用でき、Godotはエラーを出しません。
nl: We moeten bijvoorbeeld een regel code hebben na een functiedefinitie of een [code]if[/code] blok. Als je nog niet weet wat je moet schrijven, kun je het sleutelwoord [code]pass[/code] gebruiken als plaatshouder en zal Godot geen fout melden.
ru: Например, после определения функции или блока [code]if[/code] должна быть строка кода. Если вы еще не знаете, что писать, вы можете использовать ключевое слово [code]pass[/code] в качестве заглушки, и Godot не выдаст никаких ошибок.
tr: Örneğin, bir fonksiyon tanımından veya [code]if[/code] kalıbından sonra bir kod satırına sahip olmalıyız. Henüz ne yazacağınızı bilmiyorsanız, [code]pass[/code] anahtar sözcüğünü yer tutucu olarak kullanabilirsiniz, böylece Godot herhangi bir hata vermeyecektir.
