Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-1-what-code-*-like.po
Languages: cs, da, de, es, fr, it, ja, nl, ru, ta, tr, uk, zh_hant

source: Programming is the process of writing precise instructions that tell a computer how to perform a task. A game's instructions are, for example: moving a character, drawing a life bar, or playing a sound.
fr: La programmation consiste à écrire des instructions précises qui indiquent à un ordinateur comment effectuer une tâche. Les instructions d'un jeu sont, par exemple : déplacer un personnage, dessiner une barre de vie ou jouer un son.
it: Programmare è il processo di scrittura di precise istruzioni che dicono al computer come svolgere un compito. Le istruzioni di un gioco possono essere, per esempio: muovere un personaggio, creare una barra della vita, o riprodurre un suono.
nl: Programmeren is het proces van het schrijven van precieze instructies die een computer vertellen hoe hij een taak moet uitvoeren. De instructies van een spel zijn bijvoorbeeld: een personage verplaatsen, een levensbalk tekenen of een geluid afspelen.
ta: நிரலாக்கமானது ஒரு பணியை எவ்வாறு செய்வது என்று ஒரு கணினியைக் கூறும் துல்லியமான வழிமுறைகளை எழுதும் செயல்முறையாகும். ஒரு விளையாட்டின் அறிவுறுத்தல்கள், எடுத்துக்காட்டாக: ஒரு கதாபாத்திரத்தை நகர்த்துவது, வாழ்க்கைப் பட்டியை வரைதல் அல்லது ஒலியை வாசித்தல்.
zh_hant: 程式是撰寫精確指令告訴電腦該如何做事的過程。 而遊戲的指令有，像是：移動角色、繪製生命條、或播放音效。

source: Programming languages are different from natural ones like English or Spanish. The computer does not think. Unlike us, it can't [i]interpret[/i] what you tell it. You can't tell it something vague like "draw a circle." Which circle? Where? Which color should it be? How big should it be?
fr: Les langages de programmation sont différents des langages naturels comme l'anglais ou l'espagnol. L'ordinateur ne pense pas. Contrairement à nous, il ne peut pas [i]interpréter[/i] ce que vous lui dites. Vous ne pouvez pas lui dire quelque chose de vague comme "dessine un cercle". Quel cercle ? Où ? De quelle couleur devrait-il être ? Quelle devrait être sa taille ?
it: I linguaggi di programmazione sono diversi da quelli naturali come l'inglese o lo spagnolo. Il computer non pensa. A differenza di noi, non può [i]interpretare[/i] ciò che gli si dice. Non si può dire qualcosa di vago come "disegna un cerchio". Quale cerchio? Dove? Di che colore deve essere? Quanto deve essere grande?
nl: Programmeertalen verschillen van natuurlijke talen zoals Nederlands of Spaans. De computer denkt niet. In tegenstelling tot ons, kan hij niet [i]interpreteren[/i] wat je hem vertelt. Je kunt hem niet iets vaags vertellen als "teken een cirkel". Welke cirkel? Waar? Welke kleur moet hij hebben? Hoe groot moet hij zijn?
ta: நிரலாக்க மொழிகள் ஆங்கிலம் அல்லது ச்பானிச் போன்ற இயற்கையானவற்றிலிருந்து வேறுபடுகின்றன. கணினி நினைக்கவில்லை. எங்களைப் போலல்லாமல், நீங்கள் என்ன சொல்கிறீர்கள் என்பதை [/i] விளக்க முடியாது. "ஒரு வட்டத்தை வரையவும்" போன்ற தெளிவற்ற ஒன்றை நீங்கள் சொல்ல முடியாது. எந்த வட்டம்? எங்கே? இது எந்த நிறமாக இருக்க வேண்டும்? அது எவ்வளவு பெரியதாக இருக்க வேண்டும்?
zh_hant: 程式語言與英語或西班牙語這樣的自然語言不同。電腦不會思考。與我們不同的是，它無法[b]解釋[/b]你告訴它的內容。 你不能讓它去做一些模糊的事情，比如「畫一個圓」。 哪個圓？畫到哪裡？該用什麼顏色畫？該畫多大？

source: To draw a filled circle, the computer needs to know exact drawing coordinates, the radius, the thickness, and color you want. The code to do so [i]may[/i] look like this. [i]Click the button to run the code example and see the result.[/i]
fr: Pour dessiner un cercle rempli, l'ordinateur doit connaître les coordonnées exactes du dessin, le rayon, l'épaisseur et la couleur que vous souhaitez. Le code pour ce faire [i]peut[/i] ressembler à ceci. [i]Cliquez sur le bouton pour exécuter l'exemple de code et voir le résultat.[/i]
it: Per disegnare un cerchio, il computer ha bisogno di sapere le coordinate esatte di dove disegnarlo, il raggio, lo spessore, e il colore che vuoi. Il codice per fare ciò [i]potrebbe[/i] essere simile a questo. [i]Clicca il tasto per eseguire l'esempio di codice e vedere il risultato.[/i]
nl: Om een gevulde cirkel te tekenen, moet de computer de exacte tekencoördinaten, de straal, de dikte en de gewenste kleur weten. De code om dat te doen [i]zou[/i] er als volgt uit kunnen zien. [i]Klik op de knop om het codevoorbeeld uit te voeren en het resultaat te bekijken.[/i]
ta: நிரப்பப்பட்ட வட்டத்தை வரைய, கணினி சரியான வரைதல் ஒருங்கிணைப்புகள், ஆரம், தடிமன் மற்றும் நீங்கள் விரும்பும் வண்ணத்தை அறிந்து கொள்ள வேண்டும். அவ்வாறு செய்வதற்கான குறியீடு [i] [/i] இப்படி இருக்கலாம். [i] குறியீடு எடுத்துக்காட்டை இயக்க பொத்தானைக் சொடுக்கு செய்து முடிவைக் காண்க. [/i]
zh_hant: 要繪製塗滿的圓圈，電腦需要知道你想要的繪製座標、半徑、厚度、還有顏色。 程式碼看起來[b]可能[/b]是這個樣子。 [b]點擊按鈕以運行範例程式碼並查看結果。[/b]

source: In the following lessons, you'll learn how this code works. For now, we want to give you a sense of what computer code looks like. In this example, everything matters: each parenthesis, capital letter, period, and comma. The computer always does [b]exactly[/b] what you tell it to. No more, no less. It [i]blindly[/i] follows every instruction. [b]When you program, you're the one in charge, and you're free to do [i]anything[/i] you want.[/b]
fr: Dans les leçons suivantes, vous apprendrez comment ce code fonctionne. Pour l'instant, nous voulons vous donner une idée de ce à quoi ressemble le code informatique. Dans cet exemple, tout compte : chaque parenthèse, chaque majuscule, chaque point et chaque virgule. L'ordinateur fait toujours [b]exactement[/b] ce que vous lui dites de faire. Pas plus, pas moins. Il suit [i]aveuglément[/i] chaque instruction. [b]Lorsque vous programmez, c'est vous qui décidez et vous êtes libre de faire [i]tout[/i] ce que vous voulez.[/b]
it: Nelle prossime lezioni, imparerai come funziona questo codice. Per ora, vogliamo solo darti un'idea di com'è fatto del codice. In questo esempio, ogni parentesi, lettera maiuscola, punto o virgola sono importanti. Il computer farà [b]esattamente[/b] ciò che gli dici di fare, sempre. Né più, né meno. Segue ogni istruzione [i]ciecamente[/i]. [b]Quando programmi, sei tu a comandare, e sei libero di fare [i]tutto[/i] quello che vuoi.[/b]
nl: In de volgende lessen leer je hoe deze code werkt. Voor nu willen we je een idee geven van hoe computercode eruitziet. In dit voorbeeld telt alles: elk haakje, elke hoofdletter, punt en komma. De computer doet altijd [b]precies[/b] wat je hem opdraagt. Niets meer, niet minder. Hij volgt [i]blindelings[/i] elke instructie op. [b]Wanneer je programmeert, ben jij degene die de leiding heeft en ben je vrij om [i]alles[/i] te doen wat je wilt.[/b]
ta: பின்வரும் பாடங்களில், இந்த குறியீடு எவ்வாறு செயல்படுகிறது என்பதை நீங்கள் கற்றுக்கொள்வீர்கள். இப்போதைக்கு, கணினி குறியீடு எப்படி இருக்கும் என்பதைப் புரிந்துகொள்ள விரும்புகிறோம். இந்த எடுத்துக்காட்டில், எல்லாமே முக்கியம்: ஒவ்வொரு அடைப்புக்குறிப்பும், மூலதன கடிதம், காலம் மற்றும் கமா. கணினி எப்போதும் [b] சரியாக [/b] நீங்கள் சொல்வதைச் செய்கிறது. இனி இல்லை, குறைவாக இல்லை. இது [i] கண்மூடித்தனமாக [/i] ஒவ்வொரு வழிமுறையையும் பின்பற்றுகிறது. [b] நீங்கள் நிரல் செய்யும் போது, நீங்கள் பொறுப்பேற்கிறீர்கள், மேலும் நீங்கள் விரும்பும் எதையும் செய்ய நீங்கள் சுதந்திரமாக இருக்கிறீர்கள். [/b]
zh_hant: 在接下來的課程中，你會學習到這個程式碼是怎麼運作的。 現階段，我們只是想給你電腦程式碼看起來的感覺。在這個範例中，每件事都很重要：每個小括號、大小寫、句號、還有逗號。 電腦永遠會[b]完全遵照[/b]你告訴它要做的事。不多，不少。它[b]盲目地[/b]跟隨每一步指令。 [b]撰寫程式時，控制權在你身上，你能做[b]任何[/b]想做的事。[/b]

source: In this course, you'll learn the GDScript programming language (the name stands for "Godot script"). This is a language by game developers for game developers. You can use it within the Godot game engine to create games and applications. It's the language used by games like [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] and [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url]. Engineers at Tesla also used it for their cars' dashboards.
fr: Dans ce cours, vous apprendrez le langage de programmation GDScript (le nom signifie « Godot script » ). Il s'agit d'un langage conçu par des développeurs de jeux pour des développeurs de jeux. Vous pouvez l'utiliser dans le moteur de jeu Godot pour créer des jeux et des applications. C'est le langage utilisé par des jeux comme [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] et [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url]. Les ingénieurs de Tesla l'utilisent pour les tableaux de bord de leurs voitures.
nl: In deze cursus leer je de programmeertaal GDScript (de naam staat voor "Godot script"). Dit is een taal gemaakt door gameontwikkelaars voor gameontwikkelaars. Je kunt het gebruiken binnen de Godot game engine om games en apps te maken. Het is de taal die wordt gebruikt in spellen als [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] en [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url]. Ingenieurs bij Tesla hebben het ook gebruikt voor de dashboards van hun auto's.
ta: இந்த பாடத்திட்டத்தில், நீங்கள் GDSCRIPT நிரலாக்க மொழியைக் கற்றுக்கொள்வீர்கள் (பெயர் "கோடோட் ச்கிரிப்ட்" என்பதைக் குறிக்கிறது). விளையாட்டு உருவாக்குநர்களுக்கான விளையாட்டு உருவாக்குநர்களின் மொழி இது. விளையாட்டுகள் மற்றும் பயன்பாடுகளை உருவாக்க நீங்கள் அதை கோடோட் கேம் எஞ்சினுக்குள் பயன்படுத்தலாம். இது [புறக்கணிப்பு] [url = https: //store.steampowered.com/app/1637320/dome_keeper/] டோம் கீப்பர் [/url] மற்றும் [புறக்கணிப்பு] [url = https: //store.steampowered .com/app/1942280/brotato/] ப்ரோடாடோ [/url]. டெச்லாவில் உள்ள பொறியாளர்கள் இதை தங்கள் கார்களின் டாச்போர்டுகளுக்கு பயன்படுத்தினர்.
zh_hant: 在這門課程中，你將學習 GDScript 程式語言（名稱代表「Godot 腳本」）。 這是一門由遊戲開發者為遊戲開發者設計的語言。你可以在 Godot 遊戲引擎中使用它來創建遊戲和應用程式。 它是像 [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] 和 [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url] 這些遊戲所使用的語言。 特斯拉的工程師也曾使用它來設計他們車輛的儀表板。

source: Don't be afraid of being locked in. The concepts you learn in your first programming language will apply to all the others. Most languages have more similarities than differences. Once you learn one, it takes much less time to become productive with the next one. Here's an example of the same code in three languages: GDScript, JavaScript, and Python. Try to spot the similarities and differences.
fr: N'ayez pas peur d'être enfermé(e). Les concepts que vous apprenez dans votre premier langage de programmation s'appliqueront à tous les autres. La plupart des langages ont plus de similitudes que de différences. Une fois que vous en avez appris un, il faut beaucoup moins de temps pour devenir performant(e) avec le suivant. Voici un exemple du même code dans trois langages : GDScript, JavaScript et Python. Essayez de repérer les similitudes et les différences.
it: Non avere paura di esserti bloccato. I concetti che impari nel tuo primo linguaggio di programmazione si applicheranno agli altri. Molti linguaggi hanno più somiglianze ché differenze. Appena ne impari uno, ci vuole molto meno tempo a diventare efficienti nel prossimo. Ecco un esempio dello stesso codice in tre linguaggi diversi: GDScript, JavaScript e Python. Cerca di trovare i punti in comune e le differenze.
nl: Wees niet bang om vast te komen zitten aan GDScript. De concepten die je leert in je eerste programmeertaal zijn ook van toepassing op andere talen. De meeste talen hebben meer overeenkomsten dan verschillen. Als je er eenmaal een onder de knie hebt, kost het veel minder tijd om productief te worden met de volgende. Hier is een voorbeeld van dezelfde code in drie talen: GDScript, JavaScript en Python. Probeer de overeenkomsten en verschillen te vinden.
ta: பூட்டப்படுவதற்கு பயப்பட வேண்டாம். உங்கள் முதல் நிரலாக்க மொழியில் நீங்கள் கற்றுக் கொள்ளும் கருத்துக்கள் மற்ற அனைவருக்கும் பொருந்தும். பெரும்பாலான மொழிகள் வேறுபாடுகளை விட அதிக ஒற்றுமையைக் கொண்டுள்ளன. நீங்கள் ஒன்றைக் கற்றுக்கொண்டவுடன், அடுத்தவருடன் விளைவாக்கம் செய்ய மிகக் குறைந்த நேரம் எடுக்கும். மூன்று மொழிகளில் ஒரே குறியீட்டின் எடுத்துக்காட்டு இங்கே: GDSCRIPT, சாவாகைஉரை மற்றும் Python. ஒற்றுமைகள் மற்றும் வேறுபாடுகளைக் கண்டறிய முயற்சிக்கவும்.
zh_hant: 不用擔心被困住。你在第一個程式語言中學到的概念能套用在其他所有語言。 大部分的語言相似處都多於相異處。學會一個後，要在下個語言取得生產力的時間便縮短許多。 這裡有用三種語言寫同樣程式碼的例子，分別為：GDScript、JavaScript、和Python。 請試著看出相似處與相異處。

source: Most programming languages build upon the same ideas of how to program. As a result, they're mostly similar. It's not to say all languages are the same, though. Some offer a really unique syntax and require a completely different mindset compared to GDScript. However, languages like GDScript, Python, JavaScript, C++, C#, and many others build upon a similar programming philosophy.
fr: La plupart des langages de programmation reposent sur les mêmes idées sur la façon de programmer. Par conséquent, ils sont pour la plupart similaires. Mais cela ne veut pas dire que tous les langages sont identiques. Certains offrent une syntaxe vraiment unique et nécessitent une approche complètement différente de GDScript. Cependant, des langages comme GDScript, Python, JavaScript, C++, C# et bien d'autres reposent sur une philosophie de programmation similaire.
it: La maggior parte dei linguaggi di programmazione si basa sulle stesse idee relative alla programmazione. Perciò, sono molto simili tra loro. Questo però non significa che tutti i linguaggi sono uguali. Alcuni hanno una sintassi molto particolare e richiedono una mentalità completamente diversa rispetto al GDScript. In ogni caso, i linguaggi come GDScript, Python, JavaScript, C++, C# e molti altri sono stati creati tenendo a mente filosofie di programmazione molto simili tra loro.
nl: De meeste programmeertalen bouwen voort op dezelfde ideeën over hoe te programmeren. Als gevolg daarvan lijken ze vaak op elkaar. Dat wil echter niet zeggen dat alle talen hetzelfde zijn. Sommige talen hebben een unieke vorm en vereisen een compleet andere manier van denken dan GDScript. Talen als GDScript, Python, JavaScript, C++, C# en vele andere bouwen echter voort op een vergelijkbare programmeerfilosofie.
ta: பெரும்பாலான நிரலாக்க மொழிகள் எவ்வாறு நிரல் செய்வது என்ற அதே யோசனைகளை உருவாக்குகின்றன. இதன் விளைவாக, அவை பெரும்பாலும் ஒத்தவை. எல்லா மொழிகளும் ஒரே மாதிரியானவை என்று சொல்ல முடியாது. சிலர் மிகவும் தனித்துவமான தொடரியல் வழங்குகிறார்கள் மற்றும் சி.டி.எச்ச்கிரிப்டுடன் ஒப்பிடும்போது முற்றிலும் மாறுபட்ட மனநிலை தேவை. இருப்பினும், சி.டி.எச்ச்கிரிப்ட், பைதான், சாவாச்கிரிப்ட், சி ++, சி#மற்றும் பல போன்ற மொழிகள் இதேபோன்ற நிரலாக்க தத்துவத்தை உருவாக்குகின்றன.
zh_hant: 大部分程式語言都建立在同樣的程式概念上。因此，他們非常相似。 但這並不是說所有語言都一樣。有些語言會提供非常獨特的語法，並需要與GDScript完全不同的思考模式。 然而 GDScript、Python、JavaScript、C++、C# 與許多其他語言，都建立在相似的程式哲學上。

source: We designed it for [i]absolute beginners[/i], but if you already know another language, it can be a fun way to get started with Godot. We will give you the coding foundations you need to start making games and applications with Godot. Please be patient. It will take time before you can make your first complete game alone.
fr: Nous l'avons conçu pour les [i]débutant(e)s absolu(e)s[/i], mais si vous connaissez déjà un autre langage, cela peut être une façon amusante de commencer à utiliser Godot. Nous vous donnerons les bases de code dont vous avez besoin pour commencer à créer des jeux et des applications avec Godot. Soyez patient(e). Il vous faudra du temps avant de pouvoir réaliser votre premier jeu complet tout(e) seul(e).
it: L'abbiamo progettato per chi è alle [i]primissime armi[/i], ma se conosci già altri linguaggi potrebbe anche essere un modo divertente per muovere i primi passi con Godot. Ti daremo le basi di programmazione di cui avrai bisogno per cominciare a creare giochi e applicazioni con Godot. Per favore, abbi pazienza. Tieni a mente che servirà del tempo prima che tu possa creare il tuo primo gioco in modo autonomo.
nl: We hebben het ontworpen voor beginners, maar als je al een andere taal kent, kan het ook een leuke manier zijn om met Godot aan de slag te gaan. We leren je de basisbeginselen van het programmeren die je nodig hebt om games en andere toepassingen te maken met Godot. Wees geduldig. Het zal even duren voor je je eerste volledige game alleen kan maken.
ta: நாங்கள் அதை [i] முழுமையான தொடக்கக்காரர்களுக்காக வடிவமைத்தோம் [/i], ஆனால் உங்களுக்கு ஏற்கனவே வேறொரு மொழியை அறிந்திருந்தால், கோடோட்டுடன் தொடங்க இது ஒரு வேடிக்கையான வழியாகும். கோடோட்டுடன் விளையாட்டுகளையும் பயன்பாடுகளையும் தயாரிக்கத் தொடங்க வேண்டிய குறியீட்டு அடித்தளங்களை நாங்கள் உங்களுக்கு வழங்குவோம். தயவுசெய்து பொறுமையாக இருங்கள். உங்கள் முதல் முழுமையான விளையாட்டை தனியாக உருவாக்குவதற்கு முன் நேரம் எடுக்கும்.
zh_hant: 我們設計課程給[b]完完全全的新手[/b]，但若你已經懂其他語言，這也能作為初次接觸Godot的有趣方法。 我們會給你開始使用 Godot 製作遊戲與應用程式需要的程式碼基礎。 請務必有耐心。到你能獨自完成遊戲前，需要時間。

source: Creating games is more accessible than ever, but it still takes a lot of work and practice. Do not expect any single course or book to turn you into a professional. [b]Programming is something you learn through practice.[/b] If something doesn't make immediate sense, don't stress it too much! Keep learning and come back to it later. Enjoy the process and celebrate every little success. You will never stop learning as a game developer.
fr: Créer des jeux est plus accessible que jamais, mais cela demande toujours beaucoup de travail et de pratique. Ne vous attendez pas à ce qu'un seul cours ou livre fasse de vous un professionnel. [b]La programmation est quelque chose qui s'apprend par la pratique.[/b] Si quelque chose n'a pas de sens immédiat, ne stressez pas trop ! Continuez à apprendre et revenez-y plus tard. Amusez-vous et célébrez chaque petit succès. Vous n'arrêterez jamais d'apprendre en tant que développeur ou développeuse de jeux.
it: Creare videogiochi, ora come ora, è più accessibile che mai, ma c'è comunque bisogno di tanto lavoro e pratica. Perciò, non aspettarti che ogni singolo corso o libro possa farti diventare un professionista. [b]Bisogna fare pratica per imparare a programmare.[/b] Se c'è qualcosa che non capisci al primo colpo, non preoccuparti! Continua ad esercitarti e ritornaci in seguito. Divertiti a imparare, e goditi ogni piccola conquista. Non smetterai mai di imparare come sviluppatore di videogiochi.
nl: Games maken is toegankelijker dan ooit, maar het vergt nog steeds veel werk en oefening. Verwacht niet dat één cursus of boek je in een professional verandert. [b]Programmeren leer je door te oefenen.[/b] Als iets niet meteen duidelijk is, maak je dan niet te druk! Blijf leren en kom er later op terug. Geniet van het proces en vier elk succesje. Als gameontwikkelaar zul je nooit stoppen met leren.
ta: விளையாட்டுகளை உருவாக்குவது முன்னெப்போதையும் விட அணுகக்கூடியது, ஆனால் இது இன்னும் நிறைய வேலைகளையும் பயிற்சியையும் எடுக்கும். எந்தவொரு பாடத்திட்டமும் புத்தகமும் உங்களை ஒரு தொழில்முறை நிபுணராக மாற்றும் என்று எதிர்பார்க்க வேண்டாம். [ஆ] நிரலாக்கமானது நீங்கள் நடைமுறையில் கற்றுக் கொள்ளும் ஒன்று. [/b] ஏதாவது உடனடி அர்த்தமல்ல என்றால், அதை அதிகமாக வலியுறுத்த வேண்டாம்! கற்றுக்கொண்டே இருங்கள், பின்னர் அதற்கு திரும்பி வாருங்கள். செயல்முறையை அனுபவித்து ஒவ்வொரு சிறிய வெற்றிகளையும் கொண்டாடுங்கள். விளையாட்டு உருவாக்குநராக நீங்கள் ஒருபோதும் கற்றலை நிறுத்த மாட்டீர்கள்.
zh_hant: 製作遊戲比以往更容易入門，但仍然需要大量的努力與練習。 不要指望靠一門課程或一本書就能讓你成為專業開發者。[b]程式設計是靠實作來學習的。[/b] 如果有什麼無法馬上理解的事，別太有壓力！持續學習，之後再回頭理解它。 享受過程並慶祝每個小小的成功。作為遊戲開發者，你的學習之路永無止境。

source: Along the way, we'll teach you: - Some of the mindset you need as a developer. Too many programming courses skip that essential part. - How to write GDScript code. - Essential programming foundations to get you started. As you go through the course, you will have many questions. We will answer them the best we can as we go. But there is so much to cover that we have to take a few shortcuts. We don't want to [i]overwhelm[/i] you with information. We also want to respect the pace at which our brains memorize things. We broke down the course into short lessons and practices. If we put too much into each part, you'd learn slower. If at any time you're left with burning questions, you're more than welcome to join [url=https://discord.gg/87NNb3Z]our Discord community[/url].
fr: En cours de route, nous vous apprendrons : - Des aspects importants de la mentalité dont vous avez besoin en tant que développeur. Trop de cours de programmation sautent cette partie essentielle. - Comment écrire du code GDScript. - Les bases de programmation essentielles pour vous aider à démarrer. Lorsque vous suivrez le cours, vous aurez de nombreuses questions. Nous y répondrons du mieux que nous pourrons au fur et à mesure. Mais il y a tellement de choses à couvrir que nous devons prendre quelques raccourcis. Nous ne voulons pas vous [i]submerger[/i] d'informations. Nous voulons aussi respecter le rythme auquel nos cerveaux mémorisent les choses. Nous avons divisé le cours en leçons et pratiques courtes. Si nous en mettions trop dans chaque partie, vous apprendrez plus lentement. Si à un moment donné vous vous retrouvez avec des questions brûlantes, vous êtes plus que bienvenu(e) pour rejoindre [url=https://discord.gg/87NNb3Z]notre communauté Discord[/url].
it: Lungo il percorso di apprendimento, ti insegneremo: - Parte della mentalità da programmatore. Molti corsi di programmazione saltano questa parte essenziale. - Come scrivere codice in GDScript. - Basi essenziali di programmazione per farti iniziare. Durante il corso, avrai sicuramente molte domande. Col tempo, ti daremo tutte le risposte che desideri al meglio che possiamo. Ma tratteremo così tanti argomenti che ci toccherà prendere qualche scorciatoia. Non vogliamo [i]sovraccaricarti[/i] con troppe informazioni. Vogliamo anche rispettare il ritmo di memorizzazione del nostro cervello. Abbiamo suddiviso il corso in tante piccole lezioni con varie pratiche su codice. Se avessimo messo troppe informazioni in ogni parte, impareresti più lentamente. E se in qualsiasi momento dovessi ritrovarti con qualche domanda a cui non riesci proprio a trovare una risposta, puoi unirti alla nostra [url=https://discord.gg/87NNb3Z]community su Discord[/url].
nl: Onderweg leren we je: - De mindset die je als ontwikkelaar nodig hebt. Te veel programmeercursussen slaan dit essentiële deel over. - Hoe je GDScript-code schrijft. - Essentiële programmeerfundamenten om je op weg te helpen. Bij het doorlopen van de cursus zul je veel vragen hebben. We zullen ze zo goed als we kunnen beantwoorden. Maar er is zoveel te behandelen dat we een paar kortere wegen moeten nemen. We willen je niet [i]overweldigen[/i] met informatie. We willen ook het tempo respecteren waarmee onze hersenen dingen onthouden. We hebben de cursus opgedeeld in korte lessen en oefeningen. Als we te veel in elk onderdeel zouden stoppen, zou je langzamer leren. Als je op enig moment brandende vragen hebt, ben je meer dan welkom in [url=https://discord.gg/87NNb3Z]onze Discord-gemeenschap[/url].
ta: வழியில், நாங்கள் உங்களுக்கு கற்பிப்போம்: - டெவலப்பராக உங்களுக்கு தேவையான சில மனநிலைகள். பல நிரலாக்க படிப்புகள் அந்த அத்தியாவசிய பகுதியைத் தவிர்க்கின்றன. - GDSCRIPT குறியீட்டை எழுதுவது எப்படி. - நீங்கள் தொடங்குவதற்கு அத்தியாவசிய நிரலாக்க அடித்தளங்கள். நீங்கள் நிச்சயமாக செல்லும்போது, உங்களுக்கு பல கேள்விகள் இருக்கும். நாம் செல்லும்போது எங்களால் முடிந்ததை அவர்களுக்கு பதிலளிப்போம். ஆனால் மறைக்க நிறைய இருக்கிறது, நாம் ஒரு சில குறுக்குவழிகளை எடுக்க வேண்டும். நாங்கள் [/i] தகவல்களை வெளிப்படுத்த விரும்பவில்லை. எங்கள் மூளை விசயங்களை மனப்பாடம் செய்யும் வேகத்தையும் மதிக்க விரும்புகிறோம். நாங்கள் பாடத்திட்டத்தை குறுகிய பாடங்கள் மற்றும் நடைமுறைகளாக உடைத்தோம். நாங்கள் ஒவ்வொரு பகுதிக்கும் அதிகமாக வைத்தால், நீங்கள் மெதுவாகக் கற்றுக்கொள்வீர்கள். எந்த நேரத்திலும் நீங்கள் எரியும் கேள்விகள் இருந்தால், [url = https: //discord.gg/87nnb3z] எங்கள் முரண்பாடு சமூகம் [/url] இல் சேர நீங்கள் வரவேற்கப்படுகிறீர்கள்.
zh_hant: 在這門課程中，我們將教你： - 成為開發者所需的一些心態。太多程式設計課程忽略了這個關鍵部分。 - 如何編寫 GDScript 程式碼。 - 入門需要的程式設計基礎。 在學習過程中，你會有許多問題。我們會盡力在過程中解答。 不過課程內容很多，我們必須採取一些簡化的方式。我們不希望讓你感到[b]資訊過載[/b]，也希望尊重大腦記憶的學習節奏。 我們將課程分成簡短的單元和練習。如果每個部分內容過多，會讓你學得更慢。 如果你有任何問題，隨時歡迎加入我們的[url=https://discord.gg/87NNb3Z]Discord 社群[/url]。
