Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-11-time-delta.po
Languages: cs, da, de, es, fr, it, ja, ru, ta, tr, uk, zh_hant

source: The time it takes to display a new frame varies. If you don't take that time into account in your code, your game will have gameplay issues and bugs. Godot provides that time to the [code]_process()[/code] function through the [code]delta[/code] parameter. In the example below, the top robot moves using [code]delta[/code]. As a result, it moves at a fixed speed. The bottom robot moves over a constant distance every frame, [i]without[/i] taking [code]delta[/code] into account. It will move faster or slower than the top robot on [i]your[/i] computer. The bottom robot will move [i]differently for everyone[/i]!
cs: Doba zobrazení nového snímku se liší. Pokud tuto dobu v kódu nezohledníte, bude mít hra problémy s hratelností a chyby. Godot tento čas poskytuje funkci [code]_process()[/code] prostřednictvím parametru [code]delta[/code]. V následujícím příkladu se horní robot pohybuje pomocí [code]delta[/code]. Výsledkem je, že se pohybuje pevnou rychlostí. Spodní robot se pohybuje každý snímek po konstantní vzdálenosti, [i]bez[/i] zohlednění [code]delta[/code]. Bude se pohybovat rychleji nebo pomaleji než horní robot na [i]vašem[/i] počítači. Spodní robot se bude pohybovat [i]pro každého jinak[/i]!
de: Die Zeit, die zum Anzeigen eines neuen Frames benötigt wird, variiert. Wenn Du diese Zeit in deinem Code nicht berücksichtigst, hat dein Spiel Gameplay-Probleme und Bugs. Godot stellt diese Zeit der Funktion [code]_process()[/code] über den Parameter [code]delta[/code] zur Verfügung. Im folgenden Beispiel bewegt sich der oberste Roboter mit [code]delta[/code]. Infolgedessen bewegt es sich mit einer festen Geschwindigkeit. Der untere Roboter bewegt sich in jedem Frame über eine konstante Entfernung, [i]ohne[/i] [code]delta[/code] zu berücksichtigen. Er bewegt sich schneller oder langsamer als der obere Roboter auf [i]deinem[/i] Computer. Der untere Roboter bewegt sich [i]für jeden anders[/i]!
es: El tiempo que tarda en aparecer un nuevo fotograma varía. Si no tienes en cuenta ese tiempo en tu código, tu juego tendrá problemas de jugabilidad y errores. Godot proporciona ese tiempo a la función [code]_process()[/code] a través del parámetro [code]delta[/code]. En el ejemplo siguiente, el robot que está arriba se mueve utilizando [code]delta[/code]. Como resultado, se mueve a una velocidad fija. El robot que está abajo se mueve a una distancia constante en cada fotograma, [i]sin[/i] tener en cuenta el [code]delta[/code]. Se moverá más rápido o más lento que el robot de arriba en [i]tu[/i] computadora. ¡El robot de abajo se moverá [i]de forma diferente para todos[/i]!
it: Il tempo che viene impiegato per mostrare un nuovo frame cambia. Se non fai conto di questo tempo nel tuo codice, il tuo gioco avrà problemi di gameplay e vari bug. Godot fornisce quel tempo alla funzione [code]_process()[/code] attraverso il parametro [code]delta[/code]. Nell'esempio qui sotto, il robot in alto si muove usando [code]delta[/code]. Come risultato, si muove ad una velocità costante. Il robot in basso si muove di una distanza costante ad ogni frame, [i]senza[/i] fare i conti con il [code]delta[/code]. Si muoverà più veloce o più lento del robot in alto sul [i]tuo[/i] computer. Il robot in basso si muoverà [i]diversamente per tutti[/i]!
ru: Время, которое требуется для отображения нового кадра варьируется. Если вы не учтёте это в коде, ваша игра будет иметь геймплейные проблемы и баги. Godot предоставляет это время в функции [code]_process()[/code] через параметр [code]delta[/code]. В примере ниже верхний робот двигается с применением [code]delta[/code]. В результате он двигается с фиксированной скоростью. Нижний робот двигается на фиксированную дистанцию каждый кадр, [i]без[/i] применения [code]delta[/code] в вычислениях. По этой причине он будет двигаться быстрее или медленнее чем верхний робот, в зависимости от характеристик [i]вашего[/i] компьютера. Нижний робот будет двигаться [i]у всех по-разному[/i]!
ta: புதிய சட்டகத்தைக் காண்பிக்க எடுக்கும் நேரம் மாறுபடும். உங்கள் குறியீட்டில் அந்த நேரத்தை நீங்கள் கணக்கில் எடுத்துக் கொள்ளாவிட்டால், உங்கள் விளையாட்டில் விளையாட்டு சிக்கல்கள் மற்றும் பிழைகள் இருக்கும். கோடோட் [குறியீடு] _PROCESS () [/குறியீடு] செயல்பாட்டிற்கு [குறியீடு] டெல்டா [/குறியீடு] அளவுருவின் மூலம் அந்த நேரத்தை வழங்குகிறது. கீழேயுள்ள எடுத்துக்காட்டில், [குறியீடு] டெல்டா [/குறியீடு] ஐப் பயன்படுத்தி மேல் ரோபோ நகர்கிறது. இதன் விளைவாக, இது ஒரு நிலையான வேகத்தில் நகர்கிறது. [/I] [குறியீடு] டெல்டா [/குறியீடு] ஐ கணக்கில் எடுத்துக் கொள்ளாமல், [i] ஒவ்வொரு சட்டகத்தையும் ஒரு நிலையான தூரத்திற்கு மேல் கீழே நகர்த்துகிறது. இது [i] உங்கள் [/i] கணினியில் சிறந்த ரோபோவை விட வேகமாக அல்லது மெதுவாக நகரும். கீழே உள்ள ரோபோ அனைவருக்கும் வித்தியாசமாக நகரும் [/i]!
uk: Час, потрібний для показу нового кадру, варіюється. Якщо ви не врахуєте це в коді, ваша гра матиме геймплейні проблеми та баги. В Godot функція [code]_process()[/code] отримує цей час у параметрі [code]delta[/code]. У прикладі нижче верхній робот рухається із застосуванням [code]delta[/code]. Тому він рухається з однаковою швидкістю. Нижній робот рухається на однакову відстань щокадру, [i]без[/i] використання [code]delta[/code] в обчисленнях. З цієї причини він рухатиметься швидше або повільніше ніж верхній робот, залежно від характеристик[i]вашого[/i] комп'ютера. Нижній робот буде рухатися [i]у всіх по-різному[/i]!
zh_hant: 顯示新幀的時間是變化的。 如果你在程式碼中不考慮這段時間，遊戲將會出現遊玩上的問題和錯誤。Godot 透過 [code]delta[/code] 參數，將這段時間提供給 [code]_process()[/code] 函式。 在下面的範例中，頂部的機器人使用 [code]delta[/code] 來移動。這樣一來，它會以固定的速度移動。 底下的機器人則每幀移動固定的距離，[b]沒有[/b]考慮 [code]delta[/code]。這樣它會比上面的機器人更快或更慢地移動，取決於[b]你的[/b]電腦。 底下的機器人會因為[b]設備的不同對每個人都有不同的移動方式[/b]！

source: Multiplying time-sensitive values by [code]delta[/code] makes them [b]time-dependent[/b] rather than [b]frame-dependent[/b]. Thanks to that, we get reliable movement over time. Without [code]delta[/code], frame times vary from computer to computer and during gameplay. Because of that, the movement will differ for every player, making the game inconsistent and messy.
cs: Vynásobením časově citlivých hodnot [code]delta[/code] se tyto hodnoty stanou [b]závislými na čase[/b] namísto [b]závislých na snímku[/b]. Díky tomu získáváme spolehlivý pohyb v průběhu času. Bez [code]delta[/code] se časy snímků liší od počítače k počítači a během hraní. Z tohoto důvodu se pohyb bude u každého hráče lišit, takže hra bude nekonzistentní a chaotická.
de: Die Multiplikation zeitkritischer Werte mit [code]delta[/code] macht sie [b]zeitabhängig[/b] und nicht [b]frame-abhängig[/b]. Dank dessen erhalten wir im Laufe der Zeit eine zuverlässige Bewegung. Ohne [code]delta[/code] variieren die Framezeiten von Computer zu Computer und während des Spiels. Aus diesem Grund unterscheidet sich die Bewegung für jeden Spieler, was das Spiel inkonsistent und chaotisch macht.
es: Multiplicar los valores sensibles al tiempo por [code]delta[/code] los hace [b]dependientes del tiempo[/b] en lugar de [b]dependientes de los fotogramas[/b]. Gracias a esto, obtenemos un movimiento fiable a lo largo del tiempo. Sin [code]delta[/code], los tiempos de los fotogramas varían de una computadora a otra y durante el juego. Por eso, el movimiento será diferente para cada jugador, haciendo que el juego sea inconsistente y desordenado.
it: Moltiplicando valori tempo-sensibili per [code]delta[/code]v li rende [b]tempo-dipendenti[/b] piuttosto che [b]frame-dipendenti[/b]. Grazie a questo, otteniamo movimenti affidabili col tempo. Senza il [code]delta[/code], il tempo tra i frame varia da computer a computer e durante il gameplay. Per questo motivo, il movimento sarà differente per ogni giocatore, rendendo il gioco incoerente e caotico.
ru: Умножение чувствительных ко времени значений на [code]delta[/code] сделает их [b]зависимыми от времени[/b] в противовес их изначальной [b]зависимости от кадров[/b]. Это позволит нам получить достоверное движение на протяжении всего времени. Без [code]delta[/code], время которое игрок проводит в кадре отличалось бы от компьютера к компьютеру и на протяжении игры. По этой причине скорость передвижения была бы разной для каждого из игроков, что сделало бы игру непредсказуемой и беспорядочной.
ta: [குறியீடு] டெல்டா [/குறியீடு] மூலம் நேர-உணர்திறன் மதிப்புகளைப் பெருக்குவது [B] பிரேம் சார்ந்த [/b] ஐ விட அவற்றை [b] நேரத்தைச் சார்ந்தது [/b] ஆக்குகிறது. அதற்கு நன்றி, காலப்போக்கில் நம்பகமான இயக்கத்தைப் பெறுகிறோம். [குறியீடு] டெல்டா [/குறியீடு] இல்லாமல், பிரேம் நேரங்கள் கணினியிலிருந்து கணினிக்கு மற்றும் விளையாட்டின் போது வேறுபடுகின்றன. இதன் காரணமாக, இயக்கம் ஒவ்வொரு வீரருக்கும் வேறுபடுகிறது, இது விளையாட்டை முரண்பாடாகவும் குழப்பமாகவும் மாற்றும்.
uk: Множення чутливих до часу значень на [code]delta[/code] зробить їх [b]залежними від часу[/b], на противагу початковій їх [b]залежності від кадрів[/b]. Це дасть нам змогу отримати вірогідний рух протягом усього часу. Без [code]delta[/code], час, який гравець проводить у кадрі, відрізнявся б від комп'ютера до комп'ютера і протягом гри. З цієї причини швидкість пересування була б різною для кожного з гравців, що зробило б гру непередбачуваною та безладною.
zh_hant: 將時間相關的數值乘以 [code]delta[/code] 使它們變成[b]基於時間[/b]而非[b]基於幀[/b]。 藉由這樣，我們能夠實現隨著時間可靠的移動。 如果沒有 [code]delta[/code]，每台電腦和遊玩過程中的幀時間都會有所不同。這樣一來，移動會對每位玩家有所不同，導致遊戲體驗不一致且混亂。

source: At the moment, the rotation of the robot is frame-dependent. Add [code]delta[/code] to make the rotational speed time-dependent. The robot should rotate [code]2[/code] radians per second.
cs: V současné době je otáčení robota závislé na snímku. Přidejte [code]delta[/code], aby byla rychlost otáčení závislá na čase. Robot by se měl otáčet [code]2[/code] radiány za sekundu.
de: Im Moment ist die Rotation des Roboters frame-abhängig. Füge [code]delta[/code] hinzu, um die Drehzahl zeitabhängig zu machen. Der Roboter sollte sich um [code]2[/code] Bogenmaß pro Sekunde drehen.
es: Por el momento, la rotación del robot depende de los fotogramas. Añade [code]delta[/code] para hacer que la velocidad de rotación dependa del tiempo. El robot debe girar [code]2[/code] radianes por segundo.
it: Al momento, la rotazione del robot è frame-dipendente. Aggiungi [code]delta[/code] per rendere la velocità di rotazione tempo-dipendente. Il robot dovrebbe ruotare di [code]2[/code] radianti al secondo.
ru: В текущий момент скорость вращения робота зависит от скорости расчёта кадров. Добавьте [code]delta[/code] чтобы сделать скорость вращения зависимой от времени. Робот должен вращаться на [code]2[/code] радиана в секунду.
ta: இந்த நேரத்தில், ரோபோவின் சுழற்சி பிரேம் சார்ந்தது. சுழற்சி வேக நேரத்தைச் சார்ந்ததாக மாற்ற [குறியீடு] டெல்டா [/குறியீடு] ஐச் சேர்க்கவும். ரோபோ ஒரு நொடிக்கு [குறியீடு] 2 [/குறியீடு] ரேடியன்களை சுழற்ற வேண்டும்.
uk: Зараз швидкість обертання робота залежить від швидкості розрахунку кадрів. Додайте [code]delta[/code], щоб швидкість обертання залежала від часу. Робот має повертатися на [code]2[/code] радіани за секунду.
zh_hant: 目前，機器人的旋轉是依賴於每個幀的。 加入 [code]delta[/code] 使旋轉速度變為依賴時間。 機器人應該每秒旋轉 [code]2[/code] 弧度。

source: In this practice, make the robot move in a smooth circle using delta. To get this movement, the robot should rotate [code]2[/code] radians per second and move [code]100[/code] pixels per second towards clockwise. [b]Note:[/b] Please write the values in the parentheses when calling the functions. If you define extra variables, we will not be able to check your practice.
cs: V tomto cvičení přimějte robota, aby se pohyboval po plynulé kružnici pomocí delta. Abyste dosáhli tohoto pohybu, měl by se robot otáčet [code]2[/code] radiány za sekundu a pohybovat se [code]100[/code] pixelů za sekundu směrem doprava. [b]Poznámka:[/b] Při volání funkcí pište hodnoty do závorek. Pokud definujete další proměnné, nebudeme moci váš postup zkontrolovat.
de: Lasse den Roboter in dieser Übung mit delta flüssig im Kreis bewegen. Um diese Bewegung zu erhalten, sollte der Roboter sich um [code]2[/code] Bogenmaß pro Sekunde drehen und [code]100[/code] Pixel pro Sekunde in Richtung Uhrzeigersinn bewegen. [b]Hinweis:[/b] Bitte schreibe die Werte in die Klammern, wenn Du die Funktionen aufrufst. Wenn Du zusätzliche Variablen definierst, können wir Deine Übung nicht überprüfen.
es: En esta práctica, haz que el robot se mueva en un círculo de forma suave y fluida utilizando delta. Para conseguir este movimiento, el robot debe girar [code]2[/code] radianes por segundo y moverse [code]100[/code] pixeles por segundo en el sentido de las agujas del reloj. [b]Nota:[/b] Escribe los valores entre paréntesis cuando llame a las funciones. Si define variables adicionales, no podremos verificar su práctica.
it: In questa pratica, fa sì ché il robot si muova in un cerchio in modo fluido usando il delta. Per raggiungere questo movimento, il robot dovrebbe ruotare di [code]2[/code] radianti al secondo e muoversi di [code]100[/code] pixel al secondo in senso orario. [b]Nota:[/b] Scrivi i valori nelle parentesi quando chiami le funzioni. Se definisci variabili extra, non saremo in grado di validare la tua pratica.
ru: В этом упражнении вам нужно заставить робота двигаться плавно по окружности, при помощи delta. Робот должен вращаться на [code]2[/code] радиана в секунду и двигаться на [code]100[/code] пикселей в секунду по часовой стрелке. [b]Примечание:[/b] Пожалуйста, при вызове функций пишите значения в круглых скобках. Если вы определите дополнительные переменные, мы не сможем проверить правильность вашего решения.
ta: இந்த நடைமுறையில், டெல்டாவைப் பயன்படுத்தி மென்மையான வட்டத்தில் ரோபோவை நகர்த்தவும். இந்த இயக்கத்தைப் பெற, ரோபோ நொடிக்கு [குறியீடு] 2 [/குறியீடு] ரேடியன்களை சுழற்றி [குறியீடு] 100 [/குறியீடு] பிக்சல்களை நொடிக்கு கடிகார திசையில் நகர்த்த வேண்டும். [b] குறிப்பு: [/b] செயல்பாடுகளை அழைக்கும்போது அடைப்புக்குறிக்குள் மதிப்புகளை எழுதுங்கள். கூடுதல் மாறிகள் நீங்கள் வரையறுத்தால், உங்கள் நடைமுறையை எங்களால் சரிபார்க்க முடியாது.
uk: У цій вправі вам потрібно змусити робота рухатися плавно по колу, за допомогою дельти. Робот має повертатися за годинниковою стрілкою на [code]2[/code] радіани за секунду і переміщуватися на [code]100[/code] пікселів за секунду. [b]Примітка:[/b] Будь ласка, під час виклику функцій пишіть значення в круглих дужках. Якщо ви визначите додаткові змінні, ми не зможемо перевірити ваш розв'язок.
zh_hant: 在這個練習中，讓機器人使用 [code]delta[/code] 平滑地移動在圓形軌道上。 為了達成這個移動，機器人應該每秒旋轉 [code]2[/code] 弧度，並且每秒移動 [code]100[/code] 像素，沿順時針方向。 [b]注意：[/b] 請在呼叫函式時填寫括號中的數值。如果你定義額外的變數，我們將無法檢查你的練習。

source: Depending on the game, the computer, and what the game engine needs to calculate, frames take more or less time to display. There will always be milliseconds variations from frame to frame. That is why the [code]_process()[/code] function receives a [code]delta[/code] parameter. Delta represents a time difference. It's the time passed since the previous frame, in seconds. The [code]delta[/code] parameter tells us how long it took for Godot to complete the [b]previous frame[/b]. We can use it to ensure that the changes between frames don't make the game's behavior unreliable. This is because different computers run differently, so a fast computer will have more frames per second than a slow computer. If we ignore [code]delta[/code], the game experience will vary, depending on the computer. Delta helps to make the game experience consistent for everyone.
es: Dependiendo del juego, de la computadora y de lo que el motor del juego tenga que calcular, los fotogramas tardan más o menos tiempo en mostrarse. Siempre habrá variaciones de milisegundos de un fotograma a otro. Es por eso que la función [code]_process()[/code] recibe un parámetro [code]delta[/code]. La palabra "delta" representa una diferencia de tiempo. Es el tiempo transcurrido desde el fotograma anterior, en segundos. El parámetro [code]delta[/code] nos dice cuánto tiempo le tomó a Godot completar el [b]fotograma anterior[/b]. Podemos utilizarlo para asegurarnos de que las variaciones entre fotogramas no hacen que la simulación del juego sea poco fiable. Esto es porque los distintos ordenadores funcionan de forma diferente, por lo que un ordenador rápido tendrá más fotogramas por segundo que uno lento. Si ignoramos [code]delta[/code], la experiencia de juego variará en función del ordenador. Delta ayuda a que la experiencia de juego sea uniforme para todos.
ru: В зависимости от игры, компьютера и объёма вычислений, которые должен сделать игровой движок, приготовление кадра к отображению может занять больше или меньше времени. Эта процедура всегда будет выполняться с разницей в несколько миллисекунд от кадра к кадру. Именно поэтому функция [code]_process()[/code] принимает параметр [code]delta[/code]. Словом «дельта» (delta) обозначается разница, в нашем случае — разница во времени. Это количество времени, прошедшее с момента начала обработки предыдущего кадра, в секундах. Параметр [code]delta[/code] сообщает нам, сколько времени затратил Godot на отрисовку [b]предыдущего кадра[/b]. Мы можем использовать его, чтобы гарантировать, что различия между кадрами не испортят симуляцию игры. Это связано с тем, что разные компьютеры работают по-разному, поэтому на быстром компьютере будет больше кадров в секунду, чем на медленном. Если мы проигнорируем [code]delta[/code], впечатления от игры будут различаться в зависимости от компьютера. Delta помогает сделать игровой процесс одинаковым для всех.
