Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-18-for-loops.po
Languages: da, de, es, it, ja, nl, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: We can break down the instructions the loop runs. You can see how a loop is a shortcut to code that otherwise gets very long.
da: Vi kan opdele de instruktioner, som løkken kører. Du kan se, hvordan en løkke er en genvej til kode, der ellers bliver meget lang.
ja: ループが実行する命令を分解できます。ループが、そうでなければ非常に長くなるコードへのショートカットであることがわかります。
nl: We kunnen de instructies die de lus uitvoert uit elkaar halen. Je kunt zien hoe een lus een kortere weg is naar code die anders erg lang wordt.
pt_br: Nós podemos especificar as instruções executadas pelo loop. Você pode ver que um loop é um atalho para programar que seria muito longo de outra forma.
ta: லூப் இயங்கும் வழிமுறைகளை நாம் உடைக்கலாம். ஒரு லூப் என்பது குறியீட்டிற்கான குறுக்குவழி என்பது எப்படி என்பதை நீங்கள் காணலாம், இல்லையெனில் மிக நீளமாக இருக்கும்.
tr: Döngünün çalıştırdığı talimatları parçalara ayırabiliriz. Bir döngünün, başka şekilde olsa çok uzun olacak bir kod için, bir kısayol olduğunu görebilirsiniz.
uk: Ми можемо розбити інструкції циклу. Ви можете побачити, як цикл є ярликом для коду, який інакше стає дуже довгим.

source: We can put whatever code we like in the loop's code block, including other function calls like [code]draw_rectangle()[/code].
da: Vi kan indsætte lige den kode, vi ønsker, i løkkens kodeblok, inklusive andre funktionskald som [code]draw_rectangle()[/code].
de: Wir können alles mögliche in den Codeblock der Schleife stecken, einschließlich Aufrufe von anderen Funktionen, wie [code]draw_rectangle()[/code].
es: Podemos poner el código que queramos en el bloque de código del bucle, incluyendo otras llamadas a funciones como [code]draw_rectangle()[/code].
it: Nel blocco di codice del ciclo possiamo inserire tutto il codice che vogliamo, comprese altre chiamate di funzione come [code]draw_rectangle()[/code].
ja: ループのコードブロックには、[code]draw_rectangle()[/code]のような他の関数呼び出しを含め、好きなコードを配置できます。
nl: We kunnen in het codeblok van de lus zetten wat we maar willen, inclusief andere functieaanroepen zoals [code]draw_rectangle()[/code].
pt_br: Podemos colocar qualquer código que quisermos dentro do bloco do loop, incluindo chamadas para outras funções, como [code]draw_rectangle()[/code].
ru: Мы можем поместить в блок кода цикла любой код, который нам нравится, включая вызовы других функций, таких как [code]draw_rectangle()[/code].
ta: [குறியீடு] டிரா_ரெக்டாங்கல் () [/குறியீடு] போன்ற பிற செயல்பாட்டு அழைப்புகள் உட்பட, லூப்பின் குறியீடு தொகுதியில் நாங்கள் விரும்பும் எந்த குறியீட்டையும் வைக்கலாம்.
tr: Döngünün kod gövdesine, [code]draw_rectangle()[/code] gibi diğer fonksiyon çağrıları da dahil olmak üzere, istediğimiz kodu koyabiliriz.
uk: Ми можемо помістити будь-який код, який нам подобається, у блок коду циклу, включно з іншими викликами функцій, як-от [code]draw_rectangle()[/code].
zh_hans: 我们可以在循环代码块中添加任何代码，包括调用 [code]draw_rectangle()[/code] 等其他函数。
zh_hant: 我們可以在迴圈的程式區塊中放入任何喜歡的程式碼，包括像是 [code]draw_rectangle()[/code] 這樣的函式呼叫。

source: Using a for loop instead of a while loop
da: Brug af en for-løkke i stedet for en while-løkke
de: Verwenden einer for-Schleife anstelle einer while-Schleife
es: Utilizar un bucle for en lugar de bucles while
it: Usando un ciclo for al posto di un ciclo while
ja: while ループの代わりに for ループを使用する
nl: Een for-lus gebruiken in plaats van een while-lus
pt_br: Usando o loop for ao invés do loop while
ru: Использование цикла for внутри цикла while
ta: சிறிது நேரம் வளையத்திற்கு பதிலாக A க்கு A ஐப் பயன்படுத்துதல்
tr: while döngüsü yerine, for döngüsü kullanmak
uk: Використання циклу for замість циклу while
zh_hans: 使用 for 循环而不是 while 循环
zh_hant: 使用 for 迴圈而不是 while 迴圈

source: Here's our old [code]move_to_end()[/code] function which used a [code]while[/code] loop.
da: Her er vores gamle [code]move_to_end()[/code] funktion, som brugte en [code]while[/code]-løkke.
de: Hier ist unsere alte [code]move_to_end()[/code] Funktion, die in eine [code]while[/code] Schleife verwendet.
es: Aquí está nuestra antigua función [code]move_to_end()[/code] que utilizaba un bucle [code]while[/code].
it: Ecco la nostra vecchia funzione [code]move_to_end()[/code] che utilizzava un ciclo [code]while[/code].
ja: これは、[code]while[/code]ループを使用した古い[code]move_to_end()[/code]関数です。
nl: Hier is onze oude [code]move_to_end()[/code] functie die een [code]while[/code]-lus gebruikte.
pt_br: Aqui está nossa antiga função [code]move_to_end()[/code] que usava um loop [code]while[/code].
ru: Вот наш старая функция [code]move_to_end()[/code], которая использует цикл [code]while[/code].
ta: எங்கள் பழைய [குறியீடு] MOVE_TO_END () [/குறியீடு] செயல்பாடு [/குறியீடு] சுழற்சியைப் பயன்படுத்தியது.
tr: İşte bizim [code]while[/code] döngüsü kullanan eski [code]move_to_end()[/code] fonksiyonumuz.
uk: Ось наша стара функція [code]move_to_end()[/code], яка використовувала цикл [code]while[/code].
zh_hans: 这是我们之前用过的旧 [code]move_to_end()[/code] 函数，是用 [code]while[/code] 循环写的。
zh_hant: 這是我們之前的 [code]move_to_end()[/code] 函式，它使用了 [code]while[/code] 迴圈。

source: If we use a [code]for[/code] loop instead, the code becomes a little simpler.
da: Hvis vi i stedet bruger en [code]for[/code]-løkke, bliver koden lidt mere enkel.
de: Wenn wir stattdessen eine [code]for[/code]-Schleife verwenden, wird der Code etwas einfacher.
es: Si usamos un bucle [code]for[/code] en su lugar, el código se vuelve un poco más simple.
it: Usando un ciclo [code]for[/code] invece, il codice diventerebbe un po' più semplice.
ja: 代わりに [code]for[/code] ループを使用すると、コードは少し単純になります。
nl: Als we in plaats daarvan een [code]for[/code]-lus gebruiken, wordt de code iets eenvoudiger.
pt_br: Se usarmos um loop [code]for[/code] ao invés do loop while, o código se torna um pouco mais simples.
ru: Если мы используем цикл [code]for[/code] вместо него, код станет немного проще.
ta: அதற்கு பதிலாக [/குறியீடு] வளையத்திற்கு [குறியீடு] பயன்படுத்தினால், குறியீடு கொஞ்சம் எளிமையாகிறது.
tr: Eğer bunun yerine [code]for[/code] döngüsü kullanırsak, kod biraz daha basit hale gelir.
uk: Якщо замість цього ми використаємо цикл [code]for[/code], код стане трохи простішим.
zh_hans: 如果我们改用 [code]for[/code] 循环，代码会变得更简单一些。
zh_hant: 如果我們改用 [code]for[/code] 迴圈，程式碼會變得簡單一些。

source: Rather than constantly checking if the robot reached the end of the board, with the [code]for[/code] loop, we take the board's width beforehand, then move the robot a set amount of times.
da: I stedet for konstant at tjekke, om robotten nåede slutningen af brættet, tager vi brættets bredde på forhånd med [code]for[/code]-løkken, og bevæger derefter robotten et bestemt antal gange.
ja: [code]for[/code]ループでは、ロボットがボードの端に到達したかどうかを常にチェックするのではなく、ボードの幅を事前に取得し、ロボットを一定回数移動させます。
nl: In plaats van voortdurend te controleren of de robot het einde van het bord heeft bereikt, nemen we met de [code]for[/code]-lus vooraf de breedte van het bord en verplaatsen we de robot een vast aantal keren.
pt_br: Ao invés de verificar constantemente se o robô chegou ao final do tabuleiro, com o loop [code]for[/code], pegamos a largura do tabuleiro de antemão e, em seguida, movemos o robô por um determinado número de vezes.
ta: [/குறியீடு] வளையத்திற்கான [குறியீடு] ரோபோ பலகையின் முடிவை எட்டியதா என்பதை தொடர்ந்து சோதிப்பதற்குப் பதிலாக, நாங்கள் போர்டின் அகலத்தை முன்பே எடுத்துக்கொள்கிறோம், பின்னர் ரோபோவை ஒரு குறிப்பிட்ட அளவு நகர்த்துவோம்.
tr: Robotun tahtanın sonuna ulaşıp ulaşmadığını sürekli kontrol etmek yerine, [code]for[/code] döngüsü kullanarak, tahtanın genişliğini başlarken alıyor, ardından robotu belirli sayıda hareket ettiriyoruz.
uk: Замість того, щоб постійно перевіряти, чи досяг робот кінця дошки, за допомогою циклу [code]for[/code] ми заздалегідь беремо ширину дошки, а потім переміщаємо робота задану кількість разів.

source: The function still works the same. You can execute it below.
da: Funktionen fungerer stadig på samme måde. Du kan udføre den nedenfor.
ja: 関数は引き続き同じように機能します。以下で実行できます。
nl: De functie werkt nog steeds hetzelfde. Je kunt haar hieronder uitvoeren.
pt_br: A função ainda funciona da mesma forma. Você pode executar ela abaixo.
ta: செயல்பாடு இன்னும் ஒரே மாதிரியாக செயல்படுகிறது. நீங்கள் அதை கீழே இயக்கலாம்.
tr: Fonksiyon hala aynı şekilde çalışmaktadır. Aşağıda çalıştırabilirsiniz.
uk: Функція все ще працює так само. Ви можете виконати його нижче.

source: In the practices, we'll use [code]for[/code] loops in different ways to get you used to using them.
da: I øvelserne vil vi bruge [code]for[/code]-løkker på forskellige måder for at vænne dig til at bruge dem.
de: In den Übungen werden wir [code]for[/code]-Schleifen auf verschiedene Arten verwenden, um Dich daran zu gewöhnen, sie zu verwenden.
es: En las prácticas, utilizaremos bucles [code]for[/code] de diferentes maneras para que te acostumbres a utilizarlos.
it: Nelle pratiche, useremo il ciclo [code]for[/code] in modi differenti per abituarti a usarlo.
ja: 演習では、[code]for[/code] ループをさまざまな方法で使用して、使用に慣れます。
nl: In de oefeningen zullen we [code]for[/code]-lussen op verschillende manieren gebruiken om je te laten wennen aan het gebruik ervan.
pt_br: Nas práticas, vamos usar loops [code]for[/code] de diferentes maneiras para que você se acostume a usá-los.
ru: В упражнениях мы будем использовать цикл [code]for[/code] различными способами для того, чтобы вы привыкли их использовать.
ta: நடைமுறைகளில், [/குறியீடு] சுழல்களை வெவ்வேறு வழிகளில் [குறியீடு] பயன்படுத்துவோம்.
tr: Alıştırmalarda, [code]for[/code] döngülerini farklı şekillerde kullanarak bunları kullanmaya alışmanızı sağlayacağız.
uk: У практичних заняттях ми будемо використовувати цикли [code]for[/code] різними способами, щоб ви звикли їх використовувати.
zh_hans: 在本次练习中，为了让你习惯使用方法，我们将以不同的方式使用 [code]for[/code] 循环。
zh_hant: 在練習中，我們會以不同的方式使用 [code]for[/code] 迴圈，讓你習慣使用它們。

source: Using a for loop to move to the end of the board
da: Brug af en for-løkke til at flytte til slutningen af brættet
de: Verwenden einer for-Schleife, um zum Ende des Bretts zu gelangen
es: Utilizar un bucle for para moverse al final del tablero
it: Usando un ciclo for per arrivare alla fine della tavola
ja: for ループを使用してボードの末尾に移動する
nl: Een for-lus gebruiken om naar het einde van het bord te bewegen
pt_br: Usando um loop for para mover até o final do tabuleiro
ru: Использование цикла for для перемещения к концу доски
ta: பலகையின் முடிவுக்கு செல்ல ஒரு ஃபார் லூப்பைப் பயன்படுத்துதல்
tr: Tahtanın sonuna gitmek için bir for döngüsü kullanmak
uk: Використання циклу for для переходу до кінця дошки
zh_hans: 使用 for 循环移动到棋盘的末端
zh_hant: 使用 for 迴圈移動到棋盤的終點

source: Once again, the robot has decided to stand at the top of the board.
da: Endnu engang har robotten besluttet sig for at stå øverst på brættet.
ja: ここでも、ロボットはボードの一番上に立つことにしました。
nl: Wederom heeft de robot besloten om bovenaan het bord te gaan staan.
pt_br: Mais uma vez, o robô decidiu ficar na parte superior do tabuleiro.
ta: மீண்டும், ரோபோ போர்டின் உச்சியில் நிற்க முடிவு செய்துள்ளது.
tr: Robot, bir kez daha, tahtanın tepesinde durmaya karar verdi.
uk: Знову робот вирішив стати на вершину дошки.

source: This time, use a [code]for[/code] loop in the [code]move_to_bottom()[/code] function to have it move to the bottom of the board.
da: Denne gang skal du bruge en [code]for[/code]-løkke i funktionen [code]move_to_bottom()[/code] for at få den til at flytte sig til bunden af brættet.
ja: 今回は[code]move_to_bottom()[/code]関数で[code]for[/code]ループを使って、ボードの一番下まで移動させます。
nl: Gebruik deze keer een [code]for[/code]-lus in de [code]move_to_bottom()[/code] functie om hem naar de onderkant van het bord te laten bewegen.
pt_br: Dessa vez, use um loop [code]for[/code] na função [code]move_to_bottom()[/code] para que ele se mova para a parte inferior do tabuleiro.
ta: இந்த நேரத்தில், [/குறியீடு] வளையத்திற்கு [குறியீடு] நகர்வு_டோ_பொட்டோம் () [/குறியீடு] செயல்பாட்டில் ஒரு [குறியீடு] வளையத்தைப் பயன்படுத்தவும்.
tr: Bu kez, tahtanın altına hareket etmesini sağlamak için [code]move_to_bottom()[/code] fonksiyonunda bir [code]for[/code] döngüsü kullanın.
uk: Цього разу скористайтеся циклом [code]for[/code] у функції [code]move_to_bottom()[/code], щоб перемістити його вниз дошки.

source: The board size is determined by the [code]Vector2[/code] variable [code]board_size[/code].
da: Brættets størrelse bestemmes af [code]Vector2[/code] variablen [code]board_size[/code].
ja: ボードサイズは [code]Vector2[/code] 変数 [code]board_size[/code] によって決定されます。
nl: De grootte van het bord is bepaald door de [code]Vector2[/code] variabele [code]board_size[/code].
pt_br: O tamanho do tabuleiro é determinado pela variável [code]board_size[/code] do tipo [code]Vector2[/code].
ta: போர்டு அளவு [குறியீடு] திசையன் 2 [/குறியீடு] மாறி [குறியீடு] போர்டு_சைச் [/குறியீடு] மூலம் தீர்மானிக்கப்படுகிறது.
tr: Tahtanın boyutu, [code]Vector2[/code] tipindeki [code]board_size[/code] değişkeni tarafından belirleniyor.
uk: Розмір дошки визначається змінною [code]Vector2[/code] I [code]board_size[/code].

source: The robot's starting cell is [code]Vector2(2, 0)[/code].
da: Robottens startcelle er [code]Vector2(2, 0)[/code].
ja: ロボットの開始セルは [code]Vector2(2, 0)[/code] です。
nl: De begincel van de robot is [code]Vector2(2, 0)[/code].
pt_br: A célula inicial do robô é [code]Vector2(2, 0)[/code].
ta: ரோபோவின் தொடக்க செல் [குறியீடு] வெக்டர் 2 (2, 0) [/குறியீடு] ஆகும்.
tr: Robotun konumu olan"cell" değişkenin, başlangıç değeri olarak [code]Vector2(2, 0)[/code].
uk: Початкова клітинка робота — [code]Вектор2(2, 0)[/code].

source: Use a for loop to have our robot move from the top of the board to the bottom.
da: Brug en for-løkke til at få vores robot til at bevæge sig fra toppen af brættet til bunden.
de: Verwende eine for-Schleife, damit sich unser Roboter von der Oberseite des Bretts nach unten bewegt.
es: Utiliza un bucle for para que nuestro robot se mueva de la parte superior del tablero a la inferior.
it: Una un ciclo for per far muovere il robot dalla cima alla fine della tavola.
ja: for ループを使用して、ロボットをボードの上から下に移動します。
nl: Gebruik een for-lus om onze robot van de bovenkant van het bord naar de onderkant te laten bewegen.
pt_br: Use um loop for para fazer nosso robô se mover da parte superior do tabuleiro até a parte inferior.
ru: Используйте цикл for для перемещения нашего робота из верхней части доски в нижнюю.
ta: எங்கள் ரோபோ பலகையின் மேலிருந்து கீழே செல்ல எங்கள் ரோபோவை பயன்படுத்த A க்கு பயன்படுத்தவும்.
tr: Robotumuzun tahtanın üstünden altına doğru hareket etmesini sağlamak için bir for döngüsü kullanın.
uk: Використовуйте цикл for, щоб наш робот рухався від верхньої частини дошки до нижньої.
zh_hans: 使用 for 循环让机器人从棋盘的顶部移动到底部。
zh_hant: 使用 for 迴圈讓我們的機器人從棋盤的頂端移動到底部。

source: Improving code with a for loop
da: Forbedring af kode med en for-løkke
de: Verbessern von Code mit einer for-Schleife
es: Mejorar el código con un bucle for
it: Migliorando il codice con un ciclo for
ja: for ループによるコードの改善
nl: Code verbeteren door middel van een for-lus
pt_br: Melhorando o código com um loop for
ru: Улучшение кода при помощи цикла for
ta: ஒரு வளையத்துடன் குறியீட்டை மேம்படுத்துதல்
tr: Kodu, bir for döngüsü ile iyileştirmek
uk: Покращення коду за допомогою циклу for
zh_hans: 使用 for 循环改进代码
zh_hant: 使用 for 迴圈改進程式碼

source: Use a [code]for[/code] loop to remove the duplicate code in the [code]run()[/code] function.
da: Brug en [code]for[/code]-løkke til at fjerne den duplikerede kode i [code]run()[/code]-funktionen.
ja: [code]for[/code] ループを使用して、[code]run()[/code] 関数内の重複コードを削除します。
nl: Gebruik een [code]for[/code]-lus om de dubbele code in de [code]run()[/code] functie te verwijderen.
pt_br: Use um loop [code]for[/code] para remover o código duplicado na função [code]run()[/code].
ta: [குறியீடு] ரன் () [/குறியீடு] செயல்பாட்டில் நகல் குறியீட்டை அகற்ற [/குறியீடு] வளையத்திற்கு [குறியீடு] பயன்படுத்தவும்.
tr: [code]run()[/code] fonksiyonundaki tekrarlanan kodu kaldırmak için bir [code]for[/code] döngüsü kullanın.
uk: Використовуйте цикл [code]for[/code], щоб видалити повторюваний код у функції [code]run()[/code].

source: In this practice, we revisit the turtle and drawing rectangles.
da: I denne øvelse gennemgår vi skildpadden og tegning af rektangler.
ja: この演習では、亀を再訪し、長方形を描きます。
nl: In deze oefening bekijken we opnieuw de schildpad en het tekenen van rechthoeken.
pt_br: Nessa prática, nós revisitaremos a tartaruga e o desenho de retângulos.
ta: இந்த நடைமுறையில், நாங்கள் ஆமை மற்றும் செவ்வகங்களை வரைவோம்.
tr: Bu alıştırmada kaplumbağa ve dikdörtgen çizme konusunu tekrar ele alıyoruz.
uk: У цій практиці ми повертаємось до черепахи та малювання прямокутників.

source: With our new knowledge of [code]for[/code] loops, we can condense this code to take up less space and make it easier to modify.
da: Med vores nye viden om [code]for[/code]-løkker kan vi kondensere denne kode, så den fylder mindre og gør den nemmere at ændre.
ja: [code]for[/code] ループに関する新しい知識により、このコードを凝縮して占有するスペースを減らし、変更を容易にすることができます。
nl: Met onze nieuwe kennis van [code]for[/code]-lussen, kunnen we deze code inkorten zodat hij minder ruimte in beslag neemt en gemakkelijker aan te passen is.
pt_br: Com nosso novo conhecimento de loops [code]for[/code], podemos condensar esse código para ocupar menos espaço e deixar fácil para fazer alguma modificação caso necessário.
ta: [/குறியீடு] சுழல்களுக்கான [குறியீடு] பற்றிய எங்கள் புதிய அறிவைக் கொண்டு, குறைந்த இடத்தை எடுத்துக்கொள்வதற்கும் மாற்றியமைப்பதை எளிதாக்குவதற்கும் இந்த குறியீட்டை நாங்கள் ஒடுக்கலாம்.
tr: [code]for[/code] döngüleri hakkındaki yeni bilgilerimizle, bu kodu daha az yer kaplayacak ve daha kolay değiştirilebilecek şekilde kısaltabiliriz.
uk: Завдяки нашим новим знанням про цикли [code]for[/code] ми можемо стиснути цей код, щоб займати менше місця та полегшити його зміну.

source: The turtle should draw three squares in a horizontal line. The squares should be 100 pixels apart.
da: Skildpadden skal tegne tre firkanter i en vandret linje. Firkanterne skal være 100 pixels fra hinanden.
ja: 亀は水平線で3つの正方形を描く必要があります。正方形は 100 ピクセル離れている必要があります。
nl: De schildpad moet drie vierkanten in een horizontale lijn tekenen. De vierkanten moeten 100 pixels uit elkaar liggen.
pt_br: A tartaruga deve desenhar três quadrados em uma linha horizontal. Os quadrados devem estar separados um do outro por 100 pixels.
ta: ஆமை ஒரு கிடைமட்ட கோட்டில் மூன்று சதுரங்களை வரைய வேண்டும். சதுரங்கள் 100 படப்புள்ளிகள் இடைவெளியில் இருக்க வேண்டும்.
tr: Kaplumbağa yatay bir çizgide üç kare çizmelidir. Kareler 100 piksel aralıklı olmalıdır.
uk: Черепаха повинна намалювати три квадрати горизонтальною лінією. Відстань між квадратами має бути 100 пікселів.

source: In the past we had to copy and paste code to draw multiple rectangles. Let's revisit previous code and improve it with a for loop.
da: Tidligere måtte vi kopiere og indsætte kode for at tegne flere rektangler. Lad os gennemgå tidligere kode og forbedre den med en for-løkke.
de: In der Vergangenheit mussten wir Code kopieren und einfügen, um mehrere Rechtecke zu zeichnen. Lass uns den vorherigen Code erneut aufgreifen und mit einer for-Schleife verbessern.
es: Antes teníamos que copiar y pegar el código para dibujar varios rectángulos. Revisemos el código anterior y mejorémoslo con un bucle for.
it: In passato dovevamo copiare e incollare codice per disegnare più rettangoli. Rivisitiamo il precedente codice per migliorarlo con un ciclo for.
ja: 以前は、複数の長方形を描画するためにコードをコピーして貼り付ける必要がありました。前のコードを再訪して、for ループで改善しましょう。
nl: Voorheen moesten we code kopiëren en plakken om meerdere rechthoeken te tekenen. Laten we de vorige code opnieuw bekijken en verbeteren met een for-lus.
pt_br: No passado, tínhamos que copiar e colar código para desenhar vários retângulos. Vamos revisitar um código que vimos antes e melhorá-lo com um loop for.
ru: В прошлом нам пришлось копировать код, чтобы нарисовать несколько прямоугольников. Давайте вернёмся к старому коду и улучшим его при помощи цикла for.
ta: கடந்த காலத்தில் பல செவ்வகங்களை வரைய குறியீட்டை நகலெடுத்து ஒட்ட வேண்டியிருந்தது. முந்தைய குறியீட்டை மறுபரிசீலனை செய்து அதை ஒரு லூப் மூலம் மேம்படுத்துவோம்.
tr: Geçmişte, birden fazla dikdörtgen çizmek için kodu kopyalayıp yapıştırarak çoğaltmamız gerekiyordu. Önceki kodu tekrar gözden geçirelim ve bir for döngüsü ile geliştirelim.
uk: Раніше нам доводилося копіювати та вставляти код, щоб намалювати кілька прямокутників. Давайте переглянемо попередній код і вдосконалимо його за допомогою циклу for.
zh_hans: 在过去，要绘制多个矩形必须复制和粘贴代码。 让我们重新审视以前的代码并使用 for 循环对其进行改进。
zh_hant: 過去我們必須複製貼上程式碼來繪製多個矩形。現在讓我們回顧之前的程式碼，並使用 for 迴圈來改進它。

source: Introduction to For Loops
da: Introduktion til For-løkker
de: Einführung in for-Schleifen
es: Introducción a los bucles for
it: Introduzione Ai Cicli For
ja: For ループの紹介
nl: Inleiding tot for-lussen
pt_br: Introdução ao Loop For
ru: Введение в циклы for
ta: சுழல்களுக்கு அறிமுகம்
tr: For Döngülerine Giriş
uk: Вступ до циклів For
zh_hans: For循环入门
zh_hant: For 迴圈入門

source: In the last lesson, we looked at [code]while[/code] loops. We found they were useful if we don't know how many times we should repeat code. However, they could result in infinite loops if we're not careful. The loop below never ends because we never increment [code]number[/code].
de: In der letzten Lektion haben wir uns [code]while[/code]-Schleifen angesehen. Wir haben herausgefunden, dass sie nützlich sind, wenn wir nicht wissen, wie oft wir Code wiederholen sollten. Sie können jedoch zu Endlosschleifen führen, wenn wir nicht vorsichtig sind. Die Schleife unten endet nie, weil wir niemals [code]number[/code] inkrementieren (erhöhen).
es: En la última lección, vimos los bucles [code]while[/code]. Descubrimos que eran útiles si no sabemos cuántas veces debemos repetir el código. Sin embargo, podrían resultar en bucles infinitos si no tenemos cuidado. El bucle a continuación nunca termina porque nunca incrementamos [code]number[/code].
it: Nell'ultima lezione abbiamo analizzato i cicli [code]while[/code]. Abbiamo scoperto che sono utili se non sappiamo quante volte dobbiamo ripetere il codice. Tuttavia, se non stiamo attenti, possono dare origine a cicli infiniti. Il ciclo sottostante non termina mai perché non incrementiamo mai [code]number[/code].
ru: В последнем уроке мы рассмотрели циклы [code]while[/code]. Мы обнаружили, что они полезны в случаях, когда нам не известно заранее, сколько раз следует повторить код. Однако, из-за них программа может застрять в бесконечном цикле, если мы не будем соблюдать осторожность. Приведённый ниже цикл никогда не закончится, потому что мы никогда не увеличиваем [code]number[/code].
zh_hans: 在上一课中，我们学习了 [code]while[/code] 循环。 如果我们要重复代码，但是不知道应该重复多少次，它就很有用。 但是，如果够不小心，它可能会导致无限循环/死循环。 下例的循环永远不会结束，因为 [code]number[/code] 永远不会增加。
zh_hant: 在上堂課中，我們學習了 [code]while[/code] 迴圈。當我們無法確定該重複執行程式碼的次數時，[code]while[/code] 迴圈會非常有用。 然而如果我們不小心，可能會導致無限迴圈。 以下的迴圈永遠不會結束，因為我們沒有遞增 [code]number[/code]。
