Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-6-multiple-function-parameters.po
Languages: cs, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, zh_hans, zh_hant

source: However, this is good for learning: it trains your fingers to [ignore]type precisely.
cs: Je to však dobré pro učení: trénujete si prsty pro přesné [ignore] psaní.
de: Dies hilft jedoch gut beim Lernen: Es trainiert deine Finger, präzise zu tippen.
fr: Cependant, c'est bon pour l'apprentissage : cela entraîne vos doigts à taper avec précision.
it: Tuttavia, questo è buono per imparare: allena le tue dita a scrivere precisamente.
nl: Dit is echter goed voor het leerproces: het traint je vingers om precies te [ignore]typen.
pt: No entanto, isso é bom para aprender: ele treina os seus dedos para [ignore]digitar com precisão.
ru: Однако это полезно для обучения: это тренирует ваши пальцы [ignore]печатать более точно.
ta: இருப்பினும், இது கற்றலுக்கு நல்லது: இது உங்கள் விரல்களுக்கு துல்லியமாக [புறக்கணிக்க] பயிற்சி அளிக்கிறது.

source: Then, after you finish this course, you will see that the computer assists you a lot when you code real games with a feature called auto-completion.
cs: Po dokončení tohoto kurzu pak uvidíte, že vám počítač při kódování skutečných her hodně pomáhá díky funkci zvané automatické dokončování.
de: Wenn du diesen Kurs beendet hast, wirst du sehen, dass der Computer dir beim Programmieren echter Spiele mit einer Funktion namens Autovervollständigung sehr behilflich ist.
fr: Ensuite, après avoir terminé ce cours, vous verrez que l'ordinateur vous aide beaucoup lorsque vous codez de vrais jeux avec une fonctionnalité appelée « auto-complétion ».
it: Dopo che avrai finito il corso, vedrai che il computer ti assisterà un sacco programmando un gioco reale, con una funzionalità chiamata auto-completamento.
nl: Wanneer je klaar bent met deze cursus, zul je zien dat de computer je veel helpt bij het programmeren van echte spellen met een functionaliteit genaamd auto-completion.
pt: Então, depois de terminar este curso, verá que o computador o auxilia muito na hora de programar jogos reais com um recurso chamado auto-completar.
ru: Позже, после окончания этого курса, вы увидите, что компьютер сильно помогает вам при программировании реальных игр с помощью функции, называемой автодополнением.
ta: பின்னர், இந்த பாடத்திட்டத்தை நீங்கள் முடித்த பிறகு, ஆட்டோ-காம்ப்லேசன் எனப்படும் அம்சத்துடன் உண்மையான கேம்களை குறியிடும்போது கணினி உங்களுக்கு நிறைய உதவுகிறது என்பதை நீங்கள் காண்பீர்கள்.

source: Based on a few characters you [ignore]type, it will offer you to complete long names.
cs: Na základě několika znaků, které [ignore]zadáte, vám nabídne doplnění dlouhých názvů.
de: Auf der Grundlage einiger weniger Zeichen, die du tippst, bietet er dir an, lange Namen zu vervollständigen.
fr: En fonction de quelques caractères que vous tapez, il vous proposera de compléter des noms longs.
it: In base ad alcuni caratteri che inserisci, ti offrirà di completare nomi lunghi.
nl: Op basis van een paar tekens die je [negeert]typt, biedt het je aan om lange namen aan te vullen.
pt: Com base em alguns caracteres que [ignore]digita, oferecerá nomes longos completos.
ru: Основываясь на нескольких [ignore]напечатанных вами символах, он будет предлагать вам варианты для завершения длинных имён.
ta: நீங்கள் [புறக்கணிக்கவும்] சில எழுத்துக்களின் அடிப்படையில், நீண்ட பெயர்களை முடிக்க இது உங்களுக்கு வழங்கும்.

source: When defining a function, parameters are...
cs: Pokud definujete funkci, parametry jsou...
de: Bei der Definition einer Funktion sind Parameter...
es: Al definir una función, los parámetros son...
fr: Lors de la définition d'une fonction, les paramètres sont...
it: Quando definisci una funzione, i parametri sono...
ja: 関数を定義するときのパラメータは...
nl: Bij het definiëren van een functie zijn parameters...
pt: Ao definir uma função, os parâmetros são...
pt_br: Ao definir uma função, os parâmetros são...
ru: При определении функции параметры...
ta: ஒரு செயல்பாட்டை வரையறுக்கும் போது, அளவுருக்கள் ...
zh_hans: 定义函数时，参数是...
zh_hant: 定義函式時，參數是…

source: You can define functions with or without parameters, depending on your needs.
cs: Podle potřeby můžete definovat funkce s parametry nebo bez nich.
de: Du kannst Funktionen mit oder ohne Parameter definieren, je nach Bedarf.
es: Puedes definir funciones con o sin parámetros, según tus necesidades.
fr: Vous pouvez définir des fonctions avec ou sans paramètres, en fonction de vos besoins.
it: Puoi definire una funzione con o senza parametri, in base ai tuoi bisogni.
ja: ニーズに応じて、パラメーターを使用して関数を定義することも、パラメーターなしで関数を定義することもできます。
nl: Je kunt functies definiëren met of zonder parameters, afhankelijk van wat je nodig hebt.
pt: Pode definir funções com ou sem parâmetros, depende das suas necessidades.
pt_br: Você pode definir funções com ou sem parâmetros, depende da suas necessidades.
ru: Вы можете определять функции с параметрами или без них, в зависимости от ваших потребностей.
ta: உங்கள் தேவைகளைப் பொறுத்து அளவுருக்கள் அல்லது இல்லாமல் செயல்பாடுகளை நீங்கள் வரையறுக்கலாம்.
zh_hans: 定义函数可带参数可不带，这取决于你的需求。
zh_hant: 你可以根據需求定義有參數或無參數的函式。

source: Optional
cs: Volitelné
es: Opcionales
fr: Facultatifs
it: Opzionali
ja: オプション
nl: Niet verplicht
pt: Opcional
pt_br: Opcional
ru: Необязательны
ta: விரும்பினால்
zh_hans: 可选
zh_hant: 可選

source: Mandatory
cs: Povinné
de: Verpflichtend
es: Obligatorios
fr: Obligatoires
it: Obbligatori
ja: 必須
nl: Verplicht
pt: Obrigatório
pt_br: Obrigatório
ru: Обязательны
ta: கட்டாய
zh_hans: 硬性要求
zh_hant: 必須

source: What's the correct syntax to define a function with multiple parameters?
cs: Jaká je správná syntaxe pro definici funkce s více parametry?
de: Was ist die richtige Syntax, um eine Funktion mit mehreren Parametern zu definieren?
es: ¿Cuál es la sintaxis correcta para definir una función con múltiples parámetros?
fr: Quelle est la syntaxe correcte pour définir une fonction avec plusieurs paramètres ?
it: Qual è la sintassi corretta per definire una funzione con più parametri?
ja: 複数のパラメーターを持つ関数を定義するための正しい構文は何ですか?
nl: Wat is de juiste vorm om een functie met meerdere parameters te definiëren?
pt: Qual é a sintaxe correta para definir uma função com vários parâmetros?
pt_br: Qual é a sintaxe correta para definir uma função com vários parâmetros?
ru: Какой синтаксис используется для определения функции с несколькими параметрами?
ta: பல அளவுருக்கள் கொண்ட செயல்பாட்டை வரையறுக்க சரியான தொடரியல் என்ன?
zh_hans: 定义具有多个参数的函数的正确语法是什么？
zh_hant: 定義具有多個參數的函式的正確語法是什麼？

source: You always write the function parameters inside of the parentheses. To define multiple parameters, you separate them with a comma.
cs: Parametry funkce se vždy zapisují do závorek. Chcete-li definovat více parametrů, oddělte je čárkou.
de: Du schreibst die Funktionsparameter immer innerhalb der Klammern. Um mehrere Parameter zu definieren, trennst Du diese durch ein Komma.
es: Siempre escribes los parámetros de la función dentro de los paréntesis. Para definir varios parámetros, los separas con una coma.
fr: Vous écrivez toujours les paramètres de la fonction à l'intérieur des parenthèses. Pour définir plusieurs paramètres, vous les séparez par une virgule.
it: Puoi sempre scrivere i parametri di una funzione all'interno delle parentesi. Per definire più parametri, li separi con una virgola.
ja: 関数パラメータは常に括弧内に記述します。 複数のパラメータを定義するには、パラメータをカンマで区切ります。
nl: Je zet de functieparameters altijd tussen de haakjes. Om meerdere parameters te definiëren, scheid je ze met een komma.
pt: Sempre escreve os parâmetros da função dentro dos parênteses. Para definir vários parâmetros, separa-os com uma vírgula.
pt_br: Você sempre escreve os parâmetros da função dentro dos parênteses. Para definir vários parâmetros, você separa eles com uma vírgula.
ru: Параметры функции всегда пишутся внутри круглых скобок. Чтобы задать несколько параметров, разделяйте их запятой.
ta: நீங்கள் எப்போதும் அடைப்புக்குறிக்குள் செயல்பாட்டு அளவுருக்களை எழுதுகிறீர்கள். பல அளவுருக்களை வரையறுக்க, நீங்கள் அவற்றை ஒரு கமாவுடன் பிரிக்கிறீர்கள்.
zh_hans: 你始终得将函数参数写在括号内。 要定义多个参数，请用逗号分隔它们。
zh_hant: 你始終得把函式的參數寫在括號內。要定義多個參數，則需要用逗號分隔它們。

source: func function_name(parameter_1, parameter_2, ...):
cs: func nazev_funkce(parametr_1, parametr_2, ...):
de: func funktions_name(parameter_1, parameter_2, ...):
es: func nombre_de_función(parámetro_1, parámetro_2, ...):
fr: func nom_de_fonction(paramètre_1, paramètre_2, ...):
it: func nome_della_funzione(parametro_1, parametro_2, ...):
ja: func 関数名(パラメーター 1, パラメーター 2, ...):
pt: func nome_da_função(parâmetro_1, parâmetro_2, ...):
pt_br: func nome_da_função(parâmetro_1, parâmetro_2, ...):
ta: செயல்பாடு செயல்பாடு_பெயர் (அளவுரு 1, அளவுரு 2, ...):
zh_hans: func 函数名(参数_1, 参数_2, ...):

source: func function_name(parameter_1 parameter_2 ...):
cs: func nazev_funkce(parametr_1 parametr_2 ...):
de: func funktions_name(parameter_1 parameter_2 ...):
es: func nombre_de_función(parámetro_1 parámetro_2 ...):
fr: func nom_de_fonction(paramètre_1 paramètre_2 ...):
it: func nome_della_funzione(parametro_1 parametro_2 ...):
ja: func 関数名(パラメーター 1 パラメーター 2 ...):
pt: func nome_da_função(parâmetro_1 parâmetro_2 ...):
pt_br: func nome_da_função(parâmetro_1 parâmetro_2 ...):
ta: செயல்பாடு செயல்பாடு_பெயர் (அளவுரு 1 அளவுரு 2 ...):
zh_hans: func 函数名(参数_1 参数_2 ...):

source: func function_name(): parameter_1, parameter_2, ...
cs: func nazev_funkce(): parametr_1, parametr_2, ...
de: func funktions_name(): parameter_1, parameter_2, ...
es: func nombre_de_función(): parámetro_1, parámetro_2, ...
fr: func nom_de_fonction(): paramètre_1, paramètre_2, ...
it: func nome_della_funzione(): parametro_1, parametro_2, ...
ja: func 関数名(): パラメータ 1, パラメータ 2, ...
pt: func nome_da_função(): parâmetro_1, parâmetro_2, ...
pt_br: func nome_da_função(): parâmetro_1, parâmetro_2, ...
ta: செயல்பாடு செயல்பாடு_பெயர் (): அளவுரு 1, அளவுரு 2, ...
zh_hans: func 函数名(): 参数_1, 参数_2, ...

source: Now it's your turn to create a function with multiple parameters: a function to draw rectangles of any size.
cs: Nyní je řada na vás, abyste vytvořili funkci s více parametry: funkci pro kreslení obdélníků libovolné velikosti.
de: Jetzt bist Du an der Reihe, eine Funktion mit mehreren Parametern zu erstellen: Eine Funktion zum Zeichnen von Rechtecken beliebiger Größe.
es: Ahora te toca a ti crear una función con múltiples parámetros: una función para dibujar rectángulos de cualquier tamaño.
fr: C'est maintenant à votre tour de créer une fonction avec plusieurs paramètres : une fonction pour dessiner des rectangles de n'importe quelle taille.
it: Ora tocca a te creare una funzione con più parametri: una funzione che disegni un rettangolo di qualsiasi grandezza.
ja: 次は、複数のパラメーターを持つ関数、つまり任意のサイズの四角形を描画する関数を作成する番です。
nl: Nu is het jouw beurt om een functie met meerdere parameters te maken: een functie om rechthoeken van elke grootte te tekenen.
pt: Agora é sua vez de criar uma função com vários parâmetros: uma função para desenhar retângulos de qualquer tamanho.
pt_br: Agora é sua vez de criar uma função com vários parâmetros: uma função para desenhar retângulos de qualquer tamanho.
ru: Теперь ваша очередь создать функцию с несколькими параметрами: функцию для рисования прямоугольников любого размера.
ta: இப்போது பல அளவுருக்கள் கொண்ட ஒரு செயல்பாட்டை உருவாக்குவது உங்கள் முறை: எந்த அளவிலும் செவ்வகங்களை வரைய ஒரு செயல்பாடு.
zh_hans: 现在轮到你来创建一个多参数的函数了：一个可以绘制任意大小矩形的函数。
zh_hant: 現在輪到你來創建一個帶有多個參數的函式：一個可以畫任意大小矩形的函式。

source: Drawing corners of different sizes
cs: Kreslení rohů různých velikostí
de: Zeichnen von Ecken unterschiedlicher Größe
es: Dibujar esquinas de diferentes tamaños
fr: Dessiner des coins de différentes tailles
it: Disegnando degli spigoli di grandezze differenti
ja: さまざまなサイズのコーナーを描画する
nl: Hoeken van verschillende groottes tekenen
pt: Desenhando ângulos de 90° de tamanhos diferentes
pt_br: Desenhando ângulos de 90° de tamanhos diferentes
ru: Рисование углов с линиями разных размеров
ta: வெவ்வேறு அளவுகளின் மூலைகளை வரைதல்
zh_hans: 绘制不同大小的角
zh_hant: 繪製不同大小的直角

source: Before we create a rectangle of any size, let's first see how we can use parameters to draw simpler shapes.
cs: Než vytvoříme obdélník libovolné velikosti, podívejme se nejprve, jak můžeme pomocí parametrů nakreslit jednodušší tvary.
de: Bevor wir ein Rechteck beliebiger Größe erstellen, sehen wir uns zunächst an, wie wir Parameter verwenden können, um einfachere Formen zu zeichnen.
fr: Avant de créer un rectangle de n'importe quelle taille, voyons d'abord comment nous pouvons utiliser des paramètres pour dessiner des formes plus simples.
it: Prima di andare a creare un rettangolo di ogni grandezza, vediamo come possiamo usare i parametri per disegnare forme più semplici.
nl: Voordat we een rechthoek van willekeurige grootte maken, laten we eerst eens kijken hoe we parameters kunnen gebruiken om eenvoudigere vormen te tekenen.
pt: Antes de criarmos um retângulo de qualquer tamanho, vamos primeiro ver como podemos usar parâmetros para desenhar formas mais simples.
ru: Прежде чем мы создадим прямоугольник произвольного размера, давайте посмотрим, как можно использовать параметры для рисования более простых фигур.
ta: எந்த அளவிலும் ஒரு செவ்வகத்தை உருவாக்குவதற்கு முன், எளிமையான வடிவங்களை வரைய அளவுருக்களை எவ்வாறு பயன்படுத்தலாம் என்பதை முதலில் பார்ப்போம்.

source: Here we have an incomplete function that will draw corners with lines of any length, but it's missing its [code]length[/code] parameter.
cs: Zde máme neúplnou funkci, která bude kreslit rohy s čarami libovolné délky, ale chybí jí parametr [code]length[/code].
de: Hier haben wir eine unvollständige Funktion, die Ecken mit Linien beliebiger Länge zeichnet, aber es fehlt der Parameter [code]length[/code](Länge)..
fr: Nous avons ici une fonction incomplète qui dessinera des coins avec des lignes de n'importe quelle longueur, mais il lui manque son paramètre de longueur : [code]length[/code].
it: Qui abbiamo una funzione incompleta che disegnerà degli spigoli con linee di ogni lunghezza, ma manca il suo parametro [code]length[/code].
nl: Hier hebben we een onvolledige functie die hoeken zal tekenen met lijnen van willekeurige lengte, maar de parameter [code]length[/code] ontbreekt nog.
pt: Aqui temos uma função incompleta que irá desenhar ângulos de 90° com linhas de qualquer comprimento, mas falta o parâmetro [code]length[/code].
ru: Здесь у нас есть недоработанная функция, которая должна рисовать углы с линиями любой длины, но ей не хватает параметра [code]length[/code].
ta: இங்கே நம்மிடம் ஒரு முழுமையற்ற செயல்பாடு உள்ளது, அது எந்த நீளத்தின் வரிகளுடன் மூலைகளை ஈர்க்கும், ஆனால் அதன் [குறியீடு] நீளம் [/குறியீடு] அளவுருவைக் காணவில்லை.

source: The function will move the turtle forward an amount defined by the parameter [code]length[/code], turn [code]90[/code] degrees, then move forward [code]length[/code] pixels.
cs: Funkce posune želvu dopředu o množství definované parametrem [code]length[/code], otočí o [code]90[/code] stupňů a pak se posune dopředu [code]length[/code] pixelů.
de: Die Funktion bewegt die Schildkröte um einen durch den Parameter [code]length[/code] definierten Betrag vorwärts, dreht sich um [code]90°[/code] nach rechts und bewegt sich dann um den Wert von [code]length[/code] in Pixeln vorwärts .
fr: La fonction fera avancer la tortue d'une quantité définie par le paramètre [code]length[/code], la fera tourner de [code]90[/code] degrés, puis la fera avancer à nouveau du nombre de pixels défini par [code]length[/code].
it: La funzione muoverà la tartaruga in avanti di una quantità definita dal parametro [code]length[/code], ruota di [code]90[/code] gradi, poi muoviti in avanti di [code]length[/code] pixel.
nl: De functie zal de schildpad een afstand, bepaald door de parameter [code]length[/code], naar voren verplaatsen, [code]90[/code] graden draaien en dan [code]length[/code] pixels naar voren verplaatsen.
pt: A função vai mover a tartaruga para frente pela quantidade definida pelo parâmetro [code]length[/code], vai girar [code]90[/code] graus, então vai mover para frente pela quantidade de [code]length[/code] pixels.
ru: Эта функция должна заставить черепашку переместиться вперед на величину, определяемую параметром [code]length[/code], повернуть на [code]90[/code] градусов, затем переместиться вперед на [code]length[/code] пикселей.
ta: செயல்பாடு ஆமை முன்னோக்கி அளவுரு [குறியீடு] நீளம் [/குறியீடு], [குறியீடு] 90 [/குறியீடு] டிகிரிகளை மாற்றி, பின்னர் [குறியீடு] நீளம் [/குறியீடு] பிக்சல்களை முன்னோக்கி நகர்த்தும்.

source: Complete the [code]draw_corner()[/code] function so it uses the [code]length[/code] parameter to draw corners.
cs: Dokončete funkci [code]draw_corner()[/code], aby k kreslení rohů používala parametr [code]length[/code].
de: Vervollständige die Funktion [code]draw_corner()[/code] so, dass sie den Parameter [code]length[/code] zum Zeichnen von Ecken verwendet.
fr: Complétez la fonction [code]draw_corner()[/code] pour qu'elle utilise le paramètre [code]length[/code] pour dessiner des coins.
it: Completa la funzione [code]draw_corner()[/code] cosicché utilizzi il parametro [code]length[/code] per disegnare gli spigoli.
nl: Vul de functie [code]draw_corner()[/code] aan zodat deze de parameter [code]length[/code] gebruikt om hoeken te tekenen.
pt: Complete a função [code]draw_corner()[/code] para que ela use o parâmetro [code]length[/code] para desenhar ângulos de 90°.
ru: Доработайте функцию [code]draw_corner()[/code] так, чтобы она использовала параметр [code]length[/code] для рисования углов.
ta: [குறியீடு] draw_corner () [/code] செயல்பாட்டை முடிக்கவும், எனவே இது மூலைகளை வரைய [குறியீடு] நீளம் [/குறியீடு] அளவுருவைப் பயன்படுத்துகிறது.

source: Using function parameters, code a function you can reuse to draw corners with lines of varying sizes.
cs: Pomocí parametrů funkce nakódujte funkci, kterou můžete opakovaně použít k vykreslování rohů s čarami různých velikostí.
de: Schreibe mithilfe von Funktionsparametern eine Funktion, die Du wiederverwenden kannst, um Ecken mit Linien unterschiedlicher Größe zu zeichnen.
es: Usando parámetros de función, codifica una función que puedas reutilizar para dibujar esquinas con líneas de diferentes tamaños.
fr: En utilisant des paramètres de fonction, codez une fonction que vous pouvez réutiliser pour dessiner des coins avec des lignes de différentes tailles.
it: Usando i parametri della funzione, scrivi una funzione che puoi riutilizzare per disegnare degli spigoli con linee di grandezza variabile.
ja: 関数パラメーターを使用して、さまざまなサイズの線でコーナーを描画するために再利用できる関数をコーディングします。
nl: Gebruik functieparameters om een functie te maken die je kunt hergebruiken om hoeken te tekenen met lijnen van verschillende grootte.
pt: Usando parâmetros de função, programe uma função que pode reutilizar para desenhar ângulos de 90° com linhas de tamanhos variados.
pt_br: Usando parâmetros de função, programe uma função que você pode reutilizar para desenhar ângulos de 90° com linhas de tamanhos variados.
ru: Используя параметры функции, создайте функцию, которую можно использовать повторно для рисования углов с линиями разных размеров.
ta: செயல்பாட்டு அளவுருக்களைப் பயன்படுத்தி, ஒரு செயல்பாட்டைக் குறியீடு நீங்கள் மாறுபட்ட அளவுகளின் வரிகளுடன் மூலைகளை வரைய மீண்டும் பயன்படுத்தலாம்.
zh_hans: 使用函数参数，编写一个可以重复使用的函数，绘制边长不同的角。
zh_hant: 使用函式參數，編寫一個可以重複使用的函式來畫出不同長度的角。

source: Using multiple parameters
cs: Použití více parametrů
de: Verwenden mehrerer Parameter
es: Usar múltiples parámetros
fr: Utiliser plusieurs paramètres
it: Usando più variabili
ja: 複数のパラメータの使用
nl: Meerdere parameters gebruiken
pt: Usando vários parâmetros
pt_br: Usando vários parâmetros
ru: Использование нескольких параметров
ta: பல அளவுருக்களைப் பயன்படுத்துதல்
zh_hans: 使用多个参数
zh_hant: 使用多個參數

source: In this practice, we'll improve our [code]draw_corner()[/code] function so the angle can also vary.
cs: V tomto praktickém cvičení vylepšíme naši funkci [code]draw_corner()[/code] tak, aby se úhel mohl také měnit.
de: In dieser Übung verbessern wir unsere [code]draw_corner()[/code]-Funktion, sodass der Winkel auch variieren kann.
fr: Dans cet exercice, nous allons améliorer notre fonction [code]draw_corner()[/code] pour que l'angle puisse également varier.
it: In questa pratica, miglioreremo la nostra funzione [code]draw_corner()[/code] cosicché l'angolo possa pure variare.
nl: In deze oefening verbeteren we onze [code]draw_corner()[/code] functie zodat de hoek ook kan variëren.
pt: Neste exercício, vamos melhorar nossa função [code]draw_corner()[/code] para que o ângulo também possa variar.
ru: В этом упражнении мы усовершенствуем нашу функцию [code]draw_corner()[/code], чтобы угол пересечения линий также мог меняться.
ta: இந்த நடைமுறையில், எங்கள் [குறியீடு] Draw_corner () [/குறியீடு] செயல்பாட்டை மேம்படுத்துவோம், எனவே கோணமும் மாறுபடும்.

source: Add the [code]angle[/code] parameter after the [code]length[/code] parameter in the [code]draw_corner()[/code] function and use it to draw corners of varying angles.
cs: Přidejte parametr [code] angle[/code] za parametr [code] length[/code] ve funkci [code]draw_corner()[/code] a použijte ji k vykreslování rohů o různých úhlech.
de: Füge der Funktion [code]draw_corner()[/code] den Parameter [code]angle[/code] hinzu und verwende sie, um Ecken mit unterschiedlichen Winkeln zu zeichnen.
fr: Ajoutez le paramètre [code]angle[/code] à la fonction [code]draw_corner()[/code] après le paramètre [code]length[/code] et utilisez-le pour dessiner des angles variables.
it: Aggiungi il parametro [code]angle[/code] dopo il parametro [code]length[/code] nella funzione [code]draw_corner()[/code] e usala per disegnare spigoli di angolo variabile.
nl: Voeg de parameter [code]angle[/code] toe na de parameter [code]length[/code] in de functie [code]draw_corner()[/code] en gebruik deze om hoeken met verschillende hoeken te tekenen.
pt: Adicione o parâmetro [code]angle[/code] após o parâmetro [code]length[/code] na função [code]draw_corner()[/code] e use ela para desenhar bordas de ângulos variados.
ru: Добавьте параметр [code]angle[/code] после параметра [code]length[/code] в функцию [code]draw_corner()[/code] и используйте ее для рисования углов разного размера.
ta: [குறியீடு] நீளம் [/குறியீடு] அளவுருவுக்குப் பிறகு [குறியீடு] கோணம் [/குறியீடு] அளவுருவைச் சேர்த்து, [குறியீடு] Draw_corner () [/குறியீடு] செயல்பாட்டில் சேர்த்து மாறுபட்ட கோணங்களின் மூலைகளை வரைய இதைப் பயன்படுத்தவும்.

source: With two parameters, code a function to draw corners with any angle.
cs: S pomocí dvou parametrů nakódujte funkci, která vykreslí rohy s libovolným úhlem.
de: Schreibe eine Funktion mit zwei Parametern, um Ecken mit einem beliebigen Winkel zu zeichnen.
es: Con dos parámetros, codifica una función para dibujar esquinas con cualquier ángulo.
fr: Avec deux paramètres, codez une fonction pour dessiner des coins avec n'importe quel angle.
it: Con due parametri, scrivi una funzione che disegni degli spigoli con ogni angolo.
ja: 2 つのパラメーターを使用して、任意の角度でコーナーを描画する関数をコーディングします。
nl: Door middel van twee parameters, maak een functie om hoeken met een willekeurige hoek te tekenen.
pt: Com dois parâmetros, programe uma função para desenhar ângulos de 90° com qualquer ângulo.
pt_br: Com dois parâmetros, programe uma função para desenhar ângulos de 90° com qualquer ângulo.
ru: Напишите функцию для рисования углов любого размера при помощи двух параметров.
ta: இரண்டு அளவுருக்கள் மூலம், எந்த கோணத்திலும் மூலைகளை வரைய ஒரு செயல்பாட்டை குறியிடவும்.
zh_hans: 使用两个参数，编写一个函数来绘制任意角度的角。
zh_hant: 使用兩個參數，編寫一個函式來繪製具有任意角度的角。

source: Drawing squares of any size
cs: Kreslení čtverců libovolné velikosti
de: Zeichnen von Quadraten beliebiger Größe
es: Dibujar cuadrados de cualquier tamaño
fr: Dessiner des carrés de n'importe quelle taille
it: Disegnando quadrati di ogni grandezza
ja: 任意のサイズの正方形を描画する
nl: Vierkanten van willekeurige grootte tekenen
pt: Desenhando quadrados de qualquer tamanho
pt_br: Desenhando quadrados de qualquer tamanho
ru: Рисование квадратов любого размера
ta: எந்த அளவிலான சதுரங்களையும் வரைதல்
zh_hans: 绘制任意大小的正方形
zh_hant: 繪製任意大小的正方形
