Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-8-defining-variables.po
Languages: cs, da, de, es, fr, it, nl, pt_br, ta, tr, uk, zh_hant

source: In the previous lesson, you used a predefined member variable named [code]position[/code].
da: I den forrige lektion brugte du en foruddefineret medlemsvariabel ved navn [code]position[/code].
es: En la lección anterior, usaste una variable miembro predefinida llamada [code]position[/code].
fr: Dans la leçon précédente, vous avez utilisé une variable membre prédéfinie appelée [code]position[/code].
it: Nella lezione precedente è stata utilizzata una variabile membro predefinita chiamata [code]position[/code].
pt_br: Na lição anterior, você usou uma variável membro predefinida chamada [code]position[/code].
ta: முந்தைய பாடத்தில், நீங்கள் [குறியீடு] நிலை [/குறியீடு] என்ற முன் வரையறுக்கப்பட்ட உறுப்பினர் மாறியைப் பயன்படுத்தினீர்கள்.
tr: Önceki derste, [code]position[/code] adında önceden tanımlanmış bir üye değişken kullandınız.
uk: У попередньому уроці ви використовували передвизначену властивість з назвою [code]position[/code].

source: In your projects, you will need to define your own variables.
da: I dine projekter skal du definere dine egne variabler.
es: En tus proyectos, tendrás que definir tus propias variables.
fr: Dans vos projets, vous devrez définir vos propres variables.
it: Nei vostri progetti, dovrete definire le vostre variabili.
pt_br: Em seus projetos, você vai precisar definir suas próprias variáveis.
ta: உங்கள் திட்டங்களில், உங்கள் சொந்த மாறிகள் வரையறுக்க வேண்டும்.
tr: Projelerinizde kendi değişkenlerinizi tanımlamanız gerekecek.
uk: У своїх проєктах вам доведеться визначати власні змінні.

source: Imagine that you need to track the player's health in your game.
da: Forestil dig, at du skal spore spillerens liv i dit spil.
es: Imagina que necesitas hacer un seguimiento de la salud del jugador en tu juego.
fr: Imaginez que vous ayez besoin de faire un suivi de la santé du joueur dans votre jeu.
it: Immaginate di dover tenere traccia della salute dei giocatori nel vostro gioco.
pt_br: Imagine que você precisa acompanhar a vida do jogador no seu jogo.
ta: உங்கள் விளையாட்டில் வீரரின் ஆரோக்கியத்தை நீங்கள் கண்காணிக்க வேண்டும் என்று கற்பனை செய்து பாருங்கள்.
tr: Oyununuzda, oyuncuların sağlığını takip etmeniz gerektiğini düşünün.
uk: Уявіть, що вам потрібно стежити за здоров'ям гравця у грі.

source: They may start with [code]5[/code] health points. When taking a hit, the health should go down to [code]4[/code]. After another hit, it should be [code]3[/code]. And so on.
da: De kan starte med [code]5[/code] livspoint. Når du tager et slag, skal livet gå ned til [code]4[/code]. Efter et andet slag skal det være [code]3[/code]. Og så videre.
es: Los jugadores pueden empezar con [code]5[/code] puntos de salud. Al recibir un golpe, la salud debería bajar a [code]4[/code]. Después de otro golpe, debería ser [code]3[/code]. Y así sucesivamente.
fr: Le joueur peut commencer avec [code]5[/code] points de santé. Lorsqu'il reçoit un coup, la santé devrait descendre à [code]4[/code]. Après un autre coup, elle devrait être de [code]3[/code]. Et ainsi de suite.
it: Il giocatore potrebbe iniziare con [code]5[/code] punti salute. Quando subisce un colpo, la salute deve scendere a [code]4[/code]. Dopo un altro colpo, dovrebbe essere [code]3[/code]. E così via.
pt_br: Ela pode começar com [code]5[/code] pontos. Ao receber um golpe, a vida cai para [code]4[/code]. Depois de outro hit, deve ser [code]3[/code]. E assim por diante.
ta: அவை [குறியீடு] 5 [/குறியீடு] சுகாதார புள்ளிகளுடன் தொடங்கலாம். செய் பெறும்போது, உடல்நலம் [குறியீடு] 4 [/குறியீடு] க்குச் செல்ல வேண்டும். மற்றொரு வெற்றிக்குப் பிறகு, அது [குறியீடு] 3 [/குறியீடு] ஆக இருக்க வேண்டும். மற்றும் பல.
tr: [code]5[/code] sağlık puanı ile başlayabilirler. Bir darbe aldıklarında, sağlık puanı [code]4[/code]'e düşmelidir. Başka bir darbeden sonra, [code]3[/code]'a düşmelidir. Ve bu böyle devam eder.
uk: Він може почати з [code]5[/code] очками здоров'я. При отриманні удару здоров'я має зменшитись до [code]4[/code]. Після ще одного удару воно має стати рівним [code]3[/code]. І так далі.

source: To keep track of that, you can create a variable named [code]health[/code] to which you add and subtract points.
da: For at holde styr på det, kan du oprette en variabel med navnet [code]health[/code], som du tilføjer og trækker point fra.
es: Para hacer un seguimiento de eso, puedes crear una variable llamada [code]health[/code] a la que sumas y restas puntos.
fr: Pour garder une trace de cela, vous pouvez créer une variable nommée [code]health[/code] à laquelle vous ajoutez et soustrayez des points.
it: Per tenerne traccia, si può creare una variabile chiamata [code]health[/code] a cui aggiungere e sottrarre punti.
pt_br: Para acompanhar isso, você pode criar uma variável chamada [code]health[/code] que você pode usar para adicionar e subtrair pontos.
ta: அதைக் கண்காணிக்க, நீங்கள் [குறியீடு] உடல்நலம் [/குறியீடு] என்ற மாறியை உருவாக்கலாம், அதில் நீங்கள் புள்ளிகளைச் சேர்த்து கழிப்பலாம்.
tr: Bunun takibini yapmak için, puan ekleyip çıkardığınız [code]health[/code] adında bir değişken oluşturabilirsiniz.
uk: Щоб стежити за цим, можна створити змінну з назвою [code]health[/code], до якої можна додавати або віднімати очки.

source: The example below introduces the [code]print()[/code] function, which outputs its argument to the output box on the left.
da: Eksemplet nedenfor introducerer funktionen [code]print()[/code], som udsender sit argument til output boksen til venstre.
es: [i]El siguiente ejemplo introduce la función [code]print()[/code], que envía su parámetro a la casilla de salida de la izquierda.[/i]
fr: L'exemple ci-dessous présente la fonction [code]print()[/code], qui affiche son paramètre dans la boîte de sortie à gauche.
it: L'esempio seguente introduce la funzione [code]print()[/code], che invia il suo argomento alla casella di output a sinistra.
pt_br: O exemplo abaixo apresenta a função [code]print()[/code], que envia seu parâmetro para a caixa de saída à esquerda.
ta: கீழே உள்ள எடுத்துக்காட்டு [குறியீடு] அச்சு () [/குறியீடு] செயல்பாட்டை அறிமுகப்படுத்துகிறது, இது அதன் வாதத்தை இடதுபுறத்தில் உள்ள வெளியீட்டு பெட்டியில் வெளியிடுகிறது.
tr: Aşağıdaki örnek, girdi değişkenini soldaki çıktı kutusuna yazdıran [code]print()[/code] fonksiyonunu tanıtmaktadır.
uk: У прикладі нижче наведено функцію [code]print()[/code], яка виводить значення параметра в полі виведення ліворуч.

source: Click the [i]run()[/i] button to instantly run the entire function, and click the [i]step[/i] button to execute lines of code one by one.
da: Klik på knappen [i]run()[/i] for øjeblikkeligt at køre hele funktionen, og klik på knappen [i]step[/i] for at udføre koden linje for linje.
es: Haz clic en el botón [i]run()[/i] para ejecutar instantáneamente toda la función, y haz clic en el botón [i]step[/i] para ejecutar líneas de código una a una.
fr: Cliquez sur le bouton [i]run()[/i] pour exécuter instantanément la fonction entière, et cliquez sur le bouton [i]step[/i] pour exécuter les lignes de code une par une.
it: Cliccando sul pulsante [i]run()[/i] si esegue immediatamente l'intera funzione, mentre cliccando sul pulsante [i]step[/i] si eseguono le righe di codice una alla volta.
pt_br: Clique no botão [i]executar()[/i] para executar instantaneamente a função inteira, e clique no botão [i]passo[/i] para executar as linhas de código uma a uma.
ta: முழு செயல்பாட்டையும் உடனடியாக இயக்க [i] ரன் () [/i] பொத்தானைக் சொடுக்கு செய்து, குறியீட்டின் வரிகளை ஒவ்வொன்றாக இயக்க [i] படி [/i] பொத்தானைக் சொடுக்கு செய்க.
tr: Bütün fonksiyonu tek seferde çağırmak için[i]run()[/i] (çalıştır) düğmesine, kod satırlarını tek tek yürütmek için [i]step[/i] (adım) düğmesine tıklayın.
uk: Натисніть кнопку [i]run()[/i], щоб миттєво запустити всю функцію, або натискайте кнопку [i]step[/i], щоб виконувати рядки коду один за одним.

source: The [i]Debugger[/i] panel at the bottom shows the current value of the [code]health[/code] variable.
da: [i]Fejlfindings[/i] panelet nederst viser den aktuelle værdi af [code]health[/code] variabelen.
es: El panel [i]Debugger[/i] de la parte inferior muestra el valor actual de la variable [code]health[/code].
fr: Le panneau [i]Débogueur[/i] en bas montre la valeur actuelle de la variable [code]health[/code].
it: Il pannello [i]Debugger[/i] in basso mostra il valore corrente della variabile [code]health[/code].
pt_br: O painel [i]Depurador[/i] na parte inferior mostra o valor atual da variável [code]health[/code].
ta: கீழே உள்ள [i] பிழைத்திருத்தம் [/i] குழு [குறியீடு] உடல்நலம் [/குறியீடு] மாறியின் தற்போதைய மதிப்பைக் காட்டுகிறது.
tr: Alttaki [i]hata ayıklama[/i] (Debugger) paneli [code]health[/code] değişkeninin şimdiki değerini gösterir.
uk: Панель [i]Зневаджувач[/i] внизу показує поточне значення змінної [code]health[/code].

source: After executing the first two lines of code, you will have a health variable storing a value of [code]4[/code].
da: Efter at have kørt de første to linjer kode, vil du have en livs variabel der lagere af en værdi af [code]4[/code].
es: Tras ejecutar las dos primeras líneas de código, tendrás una variable de salud que almacena un valor de [code]4[/code].
fr: Après avoir exécuté les deux premières lignes de code, vous aurez une variable de santé stockant une valeur de [code]4[/code].
it: Dopo aver eseguito le prime due righe di codice, avrai una variabile della vita che conserva un valore di [code]4[/code].
pt_br: Depois de executar as duas primeiras linhas de código, você vai ter uma variável de vida armazenando um valor de [code]4[/code] pontos.
ta: குறியீட்டின் முதல் இரண்டு வரிகளை இயக்கிய பிறகு, [குறியீடு] 4 [/குறியீடு] இன் மதிப்பை சேமித்து வைக்கும் சுகாதார மாறி உங்களிடம் இருக்கும்.
tr: Kodun ilk iki satırını çalıştırdıktan sonra, [code]4[/code] değerini saklayan bir sağlık değişkeniniz olacaktır.
uk: Після виконання перших двох рядків тіла функції ви отримаєте змінну health, яка зберігає значення [code]4[/code].

source: Below, we'll break down how you define new variables and explain the [code]print()[/code] function.
da: Nedenfor vil vi se på, hvordan du definerer nye variabler og forklarer funktionen [code]print()[/code].
es: A continuación, desglosaremos cómo defines nuevas variables y explicaremos la función [code]print()[/code].
fr: Ci-dessous, nous allons décortiquer comment définir de nouvelles variables et nous expliquerons la fonction [code]print()[/code].
it: Sotto, ti spiegheremo la funzione [code]print()[/code] e come definire nuove variabili.
pt_br: Abaixo, vamos detalhar como você define novas variáveis e explicaremos a função [code]print()[/code].
ta: கீழே, நீங்கள் புதிய மாறிகளை எவ்வாறு வரையறுக்கிறீர்கள் மற்றும் [குறியீடு] அச்சு () [/குறியீடு] செயல்பாட்டை விளக்குவோம்.
tr: Aşağıda, yeni değişkenleri nasıl tanımlayacağınızı ve [code]print()[/code] fonksiyonunu açıklayacağız.
uk: Нижче ми розберемо, як визначати нові змінні, та пояснимо функцію [code]print()[/code].

source: Defining a variable
cs: Definování proměnné
da: Definering af en variabel
es: Definir una variable
fr: Définir une variable
it: Definendo una varibile
nl: Een variabele definiëren
pt_br: Definindo uma variável
ta: ஒரு மாறியை வரையறுத்தல்
tr: Bir değişken tanımlamak
uk: Оголошення змінної
zh_hant: 定義一個變數

source: To use a variable, you must first define it so the computer registers its name.
da: For at bruge en variabel skal du først definere den, så computeren registrerer dens navn.
fr: Pour utiliser une variable, vous devez d'abord la définir afin que l'ordinateur enregistre son nom.
it: Per utilizzare una variabile, è necessario prima definirla in modo che il computer ne registri il nome.
pt_br: Para usar uma variável, você deve primeiro defini-la para que o computador registre seu nome.
ta: ஒரு மாறியைப் பயன்படுத்த, நீங்கள் முதலில் அதை வரையறுக்க வேண்டும், எனவே கணினி அதன் பெயரை பதிவு செய்கிறது.
tr: Bir değişkeni kullanmak için, önce onu tanımlamanız gerekir, böylece bilgisayar onun ismini kaydeder.
uk: Щоб використовувати змінну, потрібно спочатку оголосити її, щоб комп'ютер зареєстрував її назву.

source: To do so, you start a line of code with the [code]var[/code] keyword followed by your desired variable name. Like [code]func[/code] stands for [i]function[/i], [code]var[/code] stands for [i]variable[/i].
da: For at gøre dette starter du en linje kode med nøgleordet [code]var[/code] efterfulgt af dit ønskede variabelnavn. Ligesom [code]func[/code] står for [i]function[/i], står [code]var[/code] for [i]variabel[/i].
fr: Pour ce faire, vous commencez une ligne de code avec le mot-clé [code]var[/code] suivi du nom de la variable que vous souhaitez. Comme [code]func[/code] signifie [i]fonction[/i], [code]var[/code] signifie [i]variable[/i].
it: Per farlo, si inizia una riga di codice con la parola chiave [code]var[/code] seguita dal nome della variabile desiderata. Come [code]func[/code] sta per [i]function[/i], [code]var[/code] sta per [i]variable[/i].
pt_br: Para fazer isso, você inicia uma linha de código com a palavra-chave [code]var[/code] seguida do nome desejado para a variável. Assim como [code]func[/code] significa [i]função[/i], [code]var[/code] significa [i]variável[/i].
ta: அவ்வாறு செய்ய, நீங்கள் விரும்பிய மாறி பெயரைத் தொடர்ந்து [குறியீடு] var [/code] முக்கிய சொல்லுடன் குறியீட்டின் வரியைத் தொடங்குவீர்கள். [குறியீடு] FUNC [/code] ஐப் போலவே [i] செயல்பாட்டைக் குறிக்கிறது [/i], [குறியீடு] var [/code] என்பது [i] மாறியைக் குறிக்கிறது [/i].
tr: Bunu yapmak için, bir kod satırına [code]var[/code] anahtar kelimesi ile başlar ve ardından istediğiniz değişken ismini yazarsınız. [code]func[/code] isminin[i]fonksiyonu[/i] (function) temsil etmesi gibi, [code]var[/code] ismi de [i]değişken[/i] (variable) anlamına gelir.
uk: Для цього слід розпочати рядок коду з ключового слова [code]var[/code], і продовжити бажаною назвою змінної. Так само, як [code]func[/code] позначає [i]функцію[/i], [code]var[/code] позначає [i]змінну[/i].

source: Variables are case-sensitive, which means [code]health[/code] and [code]Health[/code] are technically different variables. Be careful to use the same capitalization wherever you refer to the same variable, or you could be reading or writing to a different variable.
da: Variabler skelner mellem store og små bogstaver, hvilket betyder, at [code]health[/code] og [code]Health[/code] teknisk set er forskellige variabler. Vær omhyggelig med at bruge de samme store og små bogstaver, når du refererer til den samme variabel, ellers kan du læse eller skrive til en anden variabel.
fr: Les variables sont sensibles à la casse, ce qui signifie que [code]health[/code] et [code]Health[/code] sont techniquement des variables différentes. Veillez à utiliser la même capitalisation partout où vous faites référence à la même variable, sinon vous pourriez lire ou écrire dans une variable différente.
it: Le variabili sono sensibili alle maiuscole, il che significa che [code]health[/code] e [code]Health[/code] sono tecnicamente variabili diverse. Fate attenzione a usare la stessa maiuscola ogni volta che vi riferite alla stessa variabile, altrimenti potreste leggere o scrivere su una variabile diversa.
pt_br: Variáveis são sensíveis a letras maiúsculas e minúsculas. Isso significa que [code]health[/code] and [code]Health[/code] são tecnicamente duas variáveis diferentes. Tome cuidado para usar a mesma capitalização quando for se referir a uma variável, ou você pode acabar lendo ou escrevendo numa variável diferente.
ta: மாறிகள் வழக்கு-உணர்திறன் கொண்டவை, அதாவது [குறியீடு] உடல்நலம் [/குறியீடு] மற்றும் [குறியீடு] உடல்நலம் [/குறியீடு] தொழில்நுட்ப ரீதியாக வேறுபட்ட மாறிகள். ஒரே மாறியைக் குறிப்பிடும் இடமெல்லாம் அதே மூலதனத்தைப் பயன்படுத்த கவனமாக இருங்கள், அல்லது நீங்கள் வேறு மாறிக்கு படிக்கலாம் அல்லது எழுதலாம்.
tr: Değişkenler büyük/küçük harfe duyarlıdır, yani [code]health[/code] ve [code]Health[/code] teknik olarak farklı değişkenlerdir. Aynı değişkeni işaret ettiğiniz her yerde, aynı harf büyüklüğü kullanımına dikkat edin, aksi takdirde farklı bir değişkeni okuyor veya yazıyor olabilirsiniz.
uk: Змінні чутливі до регістру, тобто, [code]health[/code] і [code]Health[/code] технічно різні змінні. Будьте обережні і використовуйте одну й ту ж велику букву скрізь, де ви посилаєтеся на ту саму змінну, інакше ви можете прочитати або змінити іншу змінну.

source: The following line defines a [code]health[/code] variable pointing to no value. You can think of it as creating a product label you have yet to stick onto something.
da: Den følgende linje definerer en [code]health[/code]-variabel, der ikke peger på nogen værdi. Du kan tænke på det som at oprette en produktetiket, du endnu ikke har sat på noget.
fr: La ligne suivante définit une variable [code]health[/code] qui ne pointe vers aucune valeur. Vous pouvez considérer cela comme la création d'une étiquette de produit que vous n'avez pas encore collée sur quelque chose.
it: La riga seguente definisce una variabile [code]health[/code] che punta a nessun valore. Si può pensare a questa variabile come alla creazione di un'etichetta di un prodotto che si deve ancora attaccare a qualcosa.
pt_br: A linha a seguir define uma variável [code]health[/code] que não possui nenhum valor. Você pode pensar nisso como criar um rótulo de um produto que você ainda precisa colar em algo (ou seja, você criou a variável e não colocou nenhum valor nela ainda).
ta: பின்வரும் வரி ஒரு [குறியீடு] ஆரோக்கியத்தை வரையறுக்கிறது [/குறியீடு] மாறியை எந்த மதிப்பும் சுட்டிக்காட்டுகிறது. நீங்கள் இன்னும் ஏதாவது ஒன்றில் ஒட்டிக்கொள்ளாத ஒரு தயாரிப்பு லேபிளை உருவாக்குவதாக நீங்கள் நினைக்கலாம்.
tr: Aşağıdaki satır, hiçbir değere işaret etmeyen bir [code]health[/code] değişkeni tanımlar. Bunu, henüz bir şeyin üzerine yapıştırmadığınız bir ürün etiketi oluşturmak gibi düşünebilirsiniz.
uk: Такий рядок оголошує змінну [code]health[/code], яка не вказує на жодне значення. Уявляйте це як створення етикетки продукту, яку ви ще маєте на щось наклеїти.

source: Like with functions, a member variable's name must be unique inside a given code file. Creating two variables next to each other with the same name will cause an error.
cs: Stejně jako u funkcí musí být název členské proměnné jedinečný v rámci daného souboru(namespace) kódu. Vytvoření dvou proměnných se stejným názvem vedle sebe způsobí chybu.
da: Ligesom med funktioner skal navnet på en medlemsvariabel være unikt i en given kodefil. Oprettelse af to variabler ved siden af hinanden med samme navn vil forårsage en fejl.
de: Wie bei Funktionen muss der Name einer Membervariablen innerhalb einer bestimmten Codedatei eindeutig sein. Wenn Du zwei Variablen mit demselben Namen erstellst, tritt ein Fehler auf.
es: Al igual que con las funciones, el nombre de una variable miembro debe ser único dentro de un archivo de código determinado. Crear dos variables contiguas con el mismo nombre provocará un error.
fr: Comme pour les fonctions, le nom d'une variable membre doit être unique dans un fichier de code donné. La création de deux variables côte à côte avec le même nom provoquera une erreur.
it: Come per le funzioni, il nome di una variabile membro deve essere unico all'interno di un file di codici. Creando due variabili l'uno vicino all'altra con lo stesso nome può causare un errore.
nl: Net als bij functies moet de naam van een lidvariabele uniek zijn binnen een bepaald codebestand. Twee variabelen naast elkaar maken met dezelfde naam zal een fout veroorzaken.
pt_br: Assim como as funções, o nome de uma variável membro deve ser exclusivo dentro de um determinado arquivo de código. Criar duas variáveis próximas uma da outra com o mesmo nome causará um erro.
ta: செயல்பாடுகளைப் போலவே, கொடுக்கப்பட்ட குறியீடு கோப்பில் ஒரு உறுப்பினர் மாறியின் பெயர் தனித்துவமாக இருக்க வேண்டும். ஒரே பெயருடன் ஒருவருக்கொருவர் அடுத்ததாக இரண்டு மாறிகள் உருவாக்குவது பிழையை ஏற்படுத்தும்.
tr: Aynı Fonksiyonlar gibi, belirli bir kod dosyası içinde, bir üye değişkenin ismi benzersiz olmalıdır. Aynı isme sahip iki değişkeni yan yana oluşturmak hataya neden olur.
uk: Як і у випадку з функціями, назва властивості має бути унікальною в межах файлу коду. Створення двох змінних поруч одна з одною з однаковою назвою спричинить помилку.
zh_hant: 就像函式一樣，成員變數的名稱在同一個程式碼檔案中必須是唯一的。若在相鄰的兩行程式碼中創建了相同名稱的變數，將會造成錯誤。

source: To use a variable, you want to assign it a starting value. You can do so using the equal sign (=).
da: For at bruge en variabel skal du tildele den en startværdi. Du kan gøre dette ved at bruge lighedstegnet (=).
es: Para utilizar una variable, debes asignarle un valor inicial. Puedes hacerlo usando el signo de igual (=).
fr: Pour utiliser une variable, vous devez lui assigner une valeur de départ. Vous pouvez le faire en utilisant le signe égal (=).
it: Per usare una variabile, prima devi assegnarli un valore iniziale. Puoi fare questo usando il simbolo di uguaglianza (=).
pt_br: Para usar uma variável, você deve atribuir a ela um valor inicial. Você pode fazer isso usando o sinal de igual (=).
ta: ஒரு மாறியைப் பயன்படுத்த, நீங்கள் அதை ஒரு தொடக்க மதிப்பை ஒதுக்க விரும்புகிறீர்கள். சம அடையாளத்தைப் பயன்படுத்தி நீங்கள் அவ்வாறு செய்யலாம் (=).
tr: Bir değişkeni kullanmak için, ona bir başlangıç değeri atamak istersiniz. Bunu eşittir işaretini (=) kullanarak yapabilirsiniz.
uk: Щоб використовувати змінну, слід надати їй початкове значення. Це можна зробити за допомогою знака рівності (=).

source: This code assigns the value [code]100[/code] to a new variable named [code]health[/code].
da: Denne kode tildeler værdien [code]100[/code] til en ny variabel med navnet [code]health[/code].
es: Este código asigna el valor [code]100[/code] a una nueva variable llamada [code]health[/code].
fr: Ce code assigne la valeur [code]100[/code] à une nouvelle variable nommée [code]health[/code].
it: Questo codice assegna un valore di [code]100[/code] ad una nuova variabile chiamata [code]health[/code].
pt_br: Esse código atribui o valor [code]100[/code] em uma nova variável chamada [code]health[/code].
ta: இந்தக் குறியீடு [குறியீடு] 100 [/குறியீடு][குறியீடு] உடல்நலம் [/குறியீடு] என்ற புதிய மாறிக்கு ஒதுக்குகிறது.
tr: Bu kod, [code]100[/code] değerini, [code]health[/code] adlı yeni bir değişkene atar.
uk: Цей код надає значення [code]100[/code] новій змінній із назвою [code]health[/code].

source: After defining your variable, you can access its value by writing the variable's name.
cs: Po definování proměnné můžete k její hodnotě přistupovat tak, že napíšete její název.
da: Når du har defineret din variable, kan du få adgang til værdien ved at skrive variablens navn.
de: Nachdem Du die Variable definiert hast, kannst Du auf ihren Wert zugreifen, indem Du den Namen der Variablen eingibst.
es: Después de definir tu variable, puedes acceder a su valor escribiendo el nombre de la variable.
fr: Après avoir défini votre variable, vous pouvez accéder à sa valeur en écrivant le nom de la variable.
it: Dopo aver definito la tua variabile, puoi accedere al suo valore scrivendo il nome della variabile.
nl: Nadat je je variabele hebt gedefinieerd, kun je de waarde ervan uitlezen door de naam van de variabele te schrijven.
pt_br: Depois de definir sua variável, você pode acessar seu valor escrevendo o nome dela.
ta: உங்கள் மாறியை வரையறுத்த பிறகு, மாறியின் பெயரை எழுதுவதன் மூலம் அதன் மதிப்பை அணுகலாம்.
tr: Değişkenini tanımladıktan sonra, değişkenin ismini yazarak değerine erişebilirsiniz.
uk: Після визначення змінної отримати доступ до її значення можна, просто написавши назву змінної.
zh_hant: 定義完變數後，你可以透過寫出變數的名稱來存取它的值。
