Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-7-member-variables.po
Languages: cs, da, de, es, fr, nl, pt_br, ru, ta, uk, zh_hans, zh_hant

source: To access those X and Y sub-components, you add a dot (".") after the variable name.
da: For at få adgang til disse X- og Y-underkomponenter tilføjer du et punktum (".") efter variabelnavnet.
es: Para acceder a esos subcomponentes X y Y, se añade un punto (".") después del nombre de la variable.
fr: Pour accéder à ces sous-composantes X et Y, vous ajoutez un point (« . ») après le nom de la variable.
pt_br: Para acessar esses subcomponentes X e Y, adicione um ponto final (".") após o nome da variável.
ru: Чтобы получить доступ к этим вложенным компонентам X и Y, добавьте точку (".") после имени переменной.
ta: அந்த ஃச் மற்றும் ஒய் துணைக் கூறுகளை அணுக, மாறி பெயருக்குப் பிறகு ஒரு புள்ளியை (".") சேர்க்கிறீர்கள்.
uk: Щоб отримати доступ до цих вкладених компонентів X та Y, додайте після назви змінної крапку (".").

source: The code below places the entity at [code]200[/code] pixels on the x-axis and [code]250[/code] pixels on the y-axis.
da: Koden nedenfor placerer enheden ved [code]200[/code] pixels på x-aksen og [code]250[/code] pixels på y-aksen.
es: El siguiente código coloca la entidad a [code]200[/code] pixeles en el eje x y a [code]250[/code] pixeles en el eje y.
fr: Le code ci-dessous place l'entité à [code]200[/code] pixels sur l'axe x et [code]250[/code] pixels sur l'axe y.
pt_br: O código abaixo coloca a entidade em [code]180[/code] pixels no eixo x e [code]120[/code] pixels no eixo y.
ru: Приведенный ниже код размещает объект в координаты [code]200[/code] пикселей по оси x и [code]250[/code] пикселей по оси y.
ta: கீழேயுள்ள குறியீடு Y- அச்சில் எக்ச்-அச்சு மற்றும் [குறியீடு] 250 [/குறியீடு] பிக்சல்களில் [குறியீடு] 200 [/குறியீடு] பிக்சல்களில் உள்ளது.
uk: Наведений нижче код розміщує об'єкт у положення [code]200[/code] пікселів за віссю x і [code]250[/code] пікселів за віссю y.

source: Notice how we use the equal sign ("=") to assign the numbers on the right to the sub-variables on the left.
da: Bemærk, hvordan vi bruger lighedstegnet ("=") for at tildele tallene til højre til undervariablerne til venstre.
es: Observa cómo usamos el signo de igualdad ("=") para asignar los números de la derecha a las subvariables de la izquierda.
fr: Remarquez comment nous utilisons le signe égal (« = ») pour attribuer les nombres de droite aux sous-variables de gauche.
pt_br: Observe como usamos o sinal de igual ("=") para atribuir os números que estão na direita para a sub-variável na esquerda.
ru: Обратите внимание как мы используем знак равенства ("="), чтобы присвоить числа справа вложенным переменным слева.
ta: வலதுபுறத்தில் உள்ள எண்களை இடதுபுறத்தில் உள்ள துணை மாறிகள் ஒதுக்க சம அடையாளத்தை ("=") எவ்வாறு பயன்படுத்துகிறோம் என்பதைக் கவனியுங்கள்.
uk: Зверніть увагу, як ми використовуємо знак рівності ("="), щоб присвоїти числа праворуч вкладеним змінним ліворуч.

source: Unlike in maths, in computer programming, the equal sign ("=") does not mean "is equal to."
da: I modsætning til i matematik betyder lighedstegnet ("=") i computerprogrammering ikke "er lig med".
es: A diferencia de las matemáticas, en la programación informática, el signo igual ("=") no significa "es igual a".
fr: Contrairement aux mathématiques, en programmation informatique, le signe égal (« = ») ne signifie pas « est égal à ».
pt_br: Ao contrário da matemática, na programação de computadores, o sinal de igual ("=") não significa "é igual a".
ru: В отличие от математики, в компьютерном программировании знак равенства ("=") не означает "равно".
ta: கணிதத்தைப் போலல்லாமல், கணினி நிரலாக்கத்தில், சமமான அடையாளம் ("=") என்பது "சமம்" என்று அர்த்தமல்ல.
uk: На відміну від математики, у комп'ютерному програмуванні знак рівності ("=") не означає "дорівнює".

source: Instead, it means "assign the result of the expression on the right to the variable on the left". We assign values so often in code that we prefer to reserve the equal sign for that.
da: I stedet betyder det "tildel resultatet af udtrykket til højre til variablen til venstre". Vi tildeler værdier så ofte i kode, at vi foretrækker at reservere lighedstegnet til det.
es: En cambio, significa "asignar el resultado de la expresión de la derecha a la variable de la izquierda". Asignamos valores tan a menudo en el código que preferimos reservar el signo igual para eso.
fr: Il signifie plutôt « assigne le résultat de l'expression de droite à la variable de gauche ». Nous assignons des valeurs si souvent dans le code que nous préférons réserver le signe égal pour cela.
pt_br: Em vez disso, significa "atribuir o resultado da expressão da direita para a variável da esquerda". Nós atribuímos valores com tanta frequência no código que preferimos reservar o sinal de igual para esse propósito.
ru: Вместо этого он означает "присвоить результат выражения справа переменной слева". Мы настолько часто присваиваем значения в коде, что предпочли зарезервировать знак равенства для этого.
ta: அதற்கு பதிலாக, இதன் பொருள் "இடதுபுறத்தில் உள்ள மாறிக்கு வலதுபுறத்தில் வெளிப்பாட்டின் முடிவை ஒதுக்குங்கள்". குறியீட்டில் மதிப்புகளை நாங்கள் அடிக்கடி ஒதுக்குகிறோம், அதற்கான சம அடையாளத்தை முன்பதிவு செய்ய நாங்கள் விரும்புகிறோம்.
uk: Натомість він означає "присвоїти значення виразу праворуч змінній ліворуч". Ми в коді настільки часто присвоюємо значення, що вирішили використати знак рівності саме для цього.

source: In games, the Y-axis is positive going down
cs: Ve hrách je osa Y kladná směrem dolů.
da: I spil er Y-aksen positiv gående nedad
de: In Spielen ist die Y-Achse nach unten hin positiv
es: En los juegos, el eje Y es positivo hacia abajo
fr: Dans les jeux, l'axe Y est positif en descendant
nl: In games is de Y-as positief naar beneden
pt_br: Nos jogos, o eixo Y é positivo quando ele vai para baixo
ru: В играх ось Y направлена вниз
ta: விளையாட்டுகளில், Y- அச்சு நேர்மறையானது
uk: В іграх вісь Y напрямлена вниз
zh_hans: 在游戏中，Y 轴为正向下
zh_hant: 在遊戲中 Y 軸往下才是正方向

source: Note that in games, assuming your character's position starts at (0, 0), the code above moves the entity [code]200[/code] pixels to the right and [code]250[/code] pixels down.
da: Bemærk, at i spil, forudsat at din figurs position starter ved (0, 0), flytter koden ovenfor enheden [code]200[/code] pixels til højre og [code]250[/code] pixels nedad.
es: Ten en cuenta que en los juegos, suponiendo que la posición de tu personaje comienza en (0, 0), el código anterior mueve la entidad [code]180[/code] pixeles hacia la derecha y [code]120[/code] pixeles hacia abajo.
fr: Notez que dans les jeux, en supposant que la position de votre personnage commence à (0, 0), le code ci-dessus déplace l'entité [code]200[/code] pixels vers la droite et [code]250[/code] pixels vers le bas.
pt_br: Observe que em jogos, assumindo que a posição do seu personagem começa em (0, 0), o código acima move a entidade [code]200[/code] pixels para a direita e [code]250[/code] pixels para baixo.
ru: Обратите внимание, что в играх, если ваш персонаж находится в позиции (0, 0), приведенный выше код переместит его на [code]200[/code] пикселей вправо и на [code]250[/code] пикселей вниз.
ta: கேம்களில், உங்கள் கதாபாத்திரத்தின் நிலை (0, 0) தொடங்குகிறது என்று கருதி, மேலே உள்ள குறியீடு[குறியீடு] 200 [/குறியீடு] பிக்சல்களை வலது புறமாகவும், [குறியீடு] 250 [/குறியீடு] பிக்சல்களையும் கீழே நகர்த்துகிறது என்பதை நினைவில் கொள்க.
uk: Зверніть увагу, що в іграх, якщо ваш персонаж перебуває в положенні (0, 0), наведений вище код перемістить його на [code]200[/code] пікселів праворуч і на [code]250[/code] пікселів униз.

source: In math, the y-axis is generally positive going up by convention.
da: I matematik er y-aksen generelt positiv, når den går opad, ifølge konventionen.
es: En matemáticas, el eje y suele ser positivo hacia arriba por convención.
fr: En mathématiques, l'axe y est généralement positif en montant, par convention.
pt_br: Em matemática, o eixo y é geralmente positivo para cima, por convenção.
ru: В математике, как правило, ось Y направлена вверх, потому что так принято.
ta: கணிதத்தில், ஒய்-அச்சு பொதுவாக மாநாட்டால் அதிகரிக்கும்.
uk: У математиці, як правило, вісь Y спрямовують угору.

source: The convention is the [i]opposite[/i] in video games and many computer applications: the y-axis is positive going down.
da: Konventionen er den [i]modsatte[/i] i videospil og mange computerapplikationer: y-aksen er positiv, når den går nedad.
es: La convención es la [i]contraria[/i] en los videojuegos y en muchas aplicaciones informáticas: el eje y es positivo hacia abajo.
fr: La convention est le [i]contraire[/i] dans les jeux vidéo et de nombreuses applications informatiques : l'axe y est positif en descendant.
pt_br: A convenção em videogames é o [i]oposto[/i] e em muitos aplicativos de computador também: o eixo y é positivo para baixo.
ru: В видеоиграх и многих компьютерных приложениях принято [i]обратное[/i]: положительные значения оси Y направлены вниз.
ta: வீடியோ கேம்கள் மற்றும் பல கணினி பயன்பாடுகளில் [i] எதிர் [/i] மாநாடு: Y- அச்சு நேர்மறையானது.
uk: У відеоіграх та багатьох комп'ютерних програмах прийнято [i]протилежне[/i]: додатний кінець осі Y спрямований униз.

source: Why does the Y-axis point downwards?
da: Hvorfor peger Y-aksen nedad?
es: ¿Por qué el eje Y apunta hacia abajo?
fr: Pourquoi l’axe des Y pointe-t-il vers le bas ?
nl: Waarom wijst de Y-as omlaag?
pt_br: Por que o eixo Y aponta para baixo?
ru: Почему ось Y направлена вниз?
ta: Y- அச்சு ஏன் கீழ்நோக்கி சுட்டிக்காட்டுகிறது?
uk: Чому вісь Y спрямована вниз?
zh_hans: 为什么 Y 轴向下？
zh_hant: 為什麼 Y 軸向下？

source: This may be confusing if you only saw the y-axis pointing up in math classes. However, in math, axes go in any direction. They don't even have to be perpendicular.
da: Dette kan være forvirrende, hvis du kun ser y-aksen pege opad i matematiktimerne. I matematik går akser dog i alle retninger. De behøver ikke engang at være vinkelrette.
es: Esto puede resultar confuso si en las clases de matemáticas sólo veías el eje Y apuntando hacia arriba. Sin embargo, en matemáticas, los ejes van en cualquier dirección. Ni siquiera tienen que ser perpendiculares.
fr: Cela peut être déroutant si vous n'avez vu que l'axe y pointant vers le haut dans les cours de maths. Cependant, en maths, les axes vont dans n'importe quelle direction. Ils n'ont même pas besoin d'être perpendiculaires.
pt_br: Isso pode ser confuso se você só viu o eixo y apontando para cima nas aulas de matemática. No entanto, em matemática, os eixos vão em qualquer direção. Eles nem precisam ser perpendiculares.
ru: Это может сбивать с толку, если вы видели только ось Y, указывающую вверх, на уроках математики. Однако в математике оси могут идти в любом направлении. Они даже не должны быть перпендикулярны.
ta: கணித வகுப்புகளில் Y- அச்சு சுட்டிக்காட்டுவதை மட்டுமே நீங்கள் பார்த்தால் இது குழப்பமாக இருக்கலாம். இருப்பினும், கணிதத்தில், அச்சுகள் எந்த திசையிலும் செல்கின்றன. அவர்கள் செங்குத்தாக இருக்க வேண்டியதில்லை.
uk: Це може збивати з пантелику, якщо ви бачили тільки вісь Y, що вказує вгору, на уроках математики. Однак у математиці осі можуть мати будь-який напрям. Вони навіть не завжди перпендикулярні.

source: On the computer, the position (0, 0) happens to correspond to the top-left of your computer screen. It then makes sense for coordinates to be positive when going towards the bottom-right corner.
da: På computeren svarer positionen (0, 0) tilfældigvis til øverste venstre hjørne af din computerskærm. Det giver så mening, at koordinaterne er positive, når de går mod nederste højre hjørne.
es: En la computadora, la posición (0, 0) corresponde a la parte superior izquierda de la pantalla de tu computadora. Por tanto, tiene sentido que las coordenadas sean positivas cuando se va hacia la esquina inferior derecha.
fr: Sur l'ordinateur, il se trouve que la position (0, 0) correspond au coin supérieur gauche de l'écran de votre ordinateur. Il est donc logique que les coordonnées soient positives lorsqu'on se dirige vers le coin inférieur droit.
pt_br: No computador, a posição (0, 0) corresponde ao canto superior esquerdo do seu monitor. Então, faz sentido que as coordenadas sejam positivas ao ir para o canto inferior direito.
ru: На компьютере позиция (0, 0) соответствует верхнему левому углу экрана вашего компьютера. Поэтому, становление координат положительными при движении к правому нижнему углу имеет смысл.
ta: கணினியில், நிலை (0, 0) உங்கள் கணினித் திரையின் மேல்-இடதுபுறத்துடன் ஒத்துப்போகிறது. கீழ்-வலது மூலையை நோக்கிச் செல்லும்போது ஆயத்தொகுப்புகள் நேர்மறையாக இருப்பதற்கு இது அர்த்தமுள்ளதாக இருக்கிறது.
uk: На комп'ютері позиція (0, 0) відповідає верхньому лівому куту екрана. Тому, вибір додатних координат при русі до правого нижнього кута має сенс.

source: This leads to another question: why is position zero the top left of the screen? This is due to computer and TV displays history: they would calculate and display pixels starting from the top left corner and moving towards the bottom right corner.
da: Dette fører til et andet spørgsmål: hvorfor er position nul øverst til venstre på skærmen? Dette skyldes computer- og tv-skærmes historie: de beregnede og viste pixels startende fra øverste venstre hjørne og bevægede sig mod nederste højre hjørne.
es: Esto nos lleva a otra pregunta: ¿por qué la posición cero está en la parte superior izquierda de la pantalla? Esto se debe a la historia de las pantallas de las computadoras y televisores: calculaban y mostraban los pixeles empezando desde la esquina superior izquierda y moviéndose hacia la esquina inferior derecha.
fr: Cela nous amène à une autre question : pourquoi la position zéro est-elle en haut à gauche de l'écran ? Cela est dû à l'histoire des écrans d'ordinateur et de télévision : ils calculaient et affichaient les pixels en partant du coin supérieur gauche et en allant vers le coin inférieur droit.
pt_br: Isso nós leva a outra pergunta: por que a posição zero é o canto superior esquerdo da tela? Isso se deve a história de como eram feitos os monitores e as TVs: eles calculam e exibem pixels começando no canto superior esquerdo e se move em direção ao canto inferior direito.
ru: Это приводит к другому вопросу: почему нулевая позиция находится в верхнем левом углу экрана? Так сложилось в ходе истории компьютерных и телевизионных дисплеев: они вычисляли и отображали пиксели, начиная с верхнего левого угла, двигаясь к нижнему правому.
ta: இது மற்றொரு கேள்விக்கு வழிவகுக்கிறது: நிலை ஏன் திரையின் மேல் இடதுபுறம் பூச்சியம்? இது கணினி மற்றும் டிவி வரலாற்றைக் காட்டுகிறது: அவை மேல் இடது மூலையிலிருந்து தொடங்கி கீழ் வலது மூலையை நோக்கி நகரும் பிக்சல்களைக் கணக்கிட்டு காண்பிக்கும்.
uk: Це викликає інше питання: чому нульова позиція міститься у верхньому лівому куті екрана? Так склалося в ході розвитку комп'ютерних та телевізійних дисплеїв: вони обчислювали та відображали пікселі, починаючи з верхнього лівого кута, рухаючись до нижнього правого.

source: Let's look at one last example before moving on to the practice. The following code makes the character 1.5 times its starting size.
cs: Než přejdeme k praxi, podívejme se na poslední příklad. Následující kód vytvoří znak o velikosti 1,5násobku jeho počáteční velikosti.
da: Lad os se på et sidste eksempel, før vi går videre til øvelsen. Følgende kode gør karakteren 1,5 gange dens startstørrelse.
es: Veamos un último ejemplo antes de pasar a la práctica. El siguiente código hace que el personaje sea 1.5 veces su tamaño inicial.
fr: Voyons un dernier exemple avant de passer à la pratique. Le code suivant rend le personnage 1.5 fois plus grand que sa taille de départ.
nl: Laten we nog een laatste voorbeeld bekijken voordat we verder gaan met de oefening. De volgende code maakt het personage 1,5 keer zijn begingrootte.
pt_br: Vamos ver um último exemplo antes de passar para a prática. O código a seguir faz o personagem ficar 1,5 vezes maior do que seu tamanho inicial.
ru: Прежде чем перейти к упражнениям, давайте рассмотрим последний пример. Следующий код делает персонажа в 1.5 раза больше его изначального размера.
ta: பயிற்சிக்குச் செல்வதற்கு முன் ஒரு கடைசி உதாரணத்தைப் பார்ப்போம். பின்வரும் குறியீடு எழுத்துக்குறியை அதன் தொடக்க அளவை 1.5 மடங்கு செய்கிறது.
uk: Перш ніж перейти до вправ, розглянемо останній приклад. Такий код робить персонажа в 1.5 рази більшим за його початковий розмір.
zh_hans: 在开始练习之前，让我们看最后一个例子。 以下代码使角色编程其起始大小的 1.5 倍。
zh_hant: 讓我們再看一個範例，在進入練習之前。以下的程式碼會將角色的大小放大 1.5 倍。

source: How do you access sub-variables?
cs: Jak přistupujete k dílčím proměnným?
da: Hvordan får du adgang til undervariabler?
de: Wie greifst Du auf Untervariablen zu?
es: ¿Cómo accedes a las subvariables?
fr: Comment accéder aux sous-variables ?
nl: Hoe krijg je toegang tot deelvariabelen?
pt_br: Como você acessa sub-variáveis?
ru: Как получить доступ ко вложенным переменным?
ta: துணை மாறிகள் எவ்வாறு அணுகுவது?
uk: Як отримати доступ до вкладених змінних?
zh_hans: 怎样才能访问子变量？
zh_hant: 怎麼存取子變數？

source: Variables often hold sub-values, like the [code]position[/code] has two sub-variables: [code]x[/code] and [code]y[/code]. How would you access the [code]x[/code], for example?
cs: Proměnné často obsahují podhodnocení, například [code]position[/code] má dvě dílčí proměnné: [code]x[/code] a [code]y[/code]. Jak byste například získali přístup k [code]x[/code]?
da: Variabler indeholder ofte underværdier, f.eks. har [code]position[/code] to undervariabler: [code]x[/code] og [code]y[/code]. Hvordan ville du for eksempel tilgå [code]x[/code]?
de: Variablen enthalten oft Unterwerte, z.B. [code]position[/code] hat zwei Unterwerte: [code]x[/code] und [code]y[/code]. Wie würdest Du beispielsweise auf den [code]x[/code] zugreifen?
es: Las variables a menudo contienen subvalores, como la [code]position[/code], que tiene dos subvariables: [code]x[/code] y [code]y[/code]. ¿Cómo accederías a la [code]x[/code], por ejemplo?
fr: Les variables contiennent souvent des sous-valeurs, comme la [code]position[/code] qui a deux sous-variables : [code]x[/code] et [code]y[/code]. Comment accéderiez-vous au [code]x[/code], par exemple ?
nl: Variabelen bevatten vaak deelwaarden, zoals de [code]position[/code] twee deelvariabelen bevat: [code]x[/code] en [code]y[/code]. Hoe zou je bijvoorbeeld de [code]x[/code] gebruiken?
pt_br: As variáveis geralmente contêm sub-valores, igual a variável [code]position[/code] que tem duas sub-variáveis: [code]x[/code] e [code]y[/code]. Como você acessaria a sub-variável [code]x[/code], por exemplo?
ru: Переменные часто содержат вложенные значения, например позиция [code]position[/code] имеет две вложенные переменные: [code]x[/code] и [code]y[/code]. Как получить доступ к [code]x[/code], например?
ta: [குறியீடு] நிலை [/குறியீடு] போன்ற இரண்டு துணை மாறுபாடுகள் உள்ளன: [குறியீடு] ஃச் [/குறியீடு] மற்றும் [குறியீடு] ஒய் [/குறியீடு] போன்ற மாறிகள் பெரும்பாலும் துணை மதிப்புகளைக் கொண்டுள்ளன. எடுத்துக்காட்டாக, [குறியீடு] ஃச் [/code] ஐ எவ்வாறு அணுகலாம்?
uk: Змінні часто містять вкладені значення, наприклад, положення [code]position[/code] має дві вкладені змінні: [code]x[/code] і [code]y[/code]. Як отримати доступ, наприклад, до [code]x[/code]?
zh_hans: 变量通常包含子值，例如 [code]position[/code] 有两个子变量：[code]x[/code] 和 [code]y[/code]。那么，你要怎么访问到 [code]x[/code]？
zh_hant: 變數常常會持有子值，例如 [code]position[/code] 變數有兩個子變數：[code]x[/code] 和 [code]y[/code]。那麼要如何存取 [code]x[/code] 呢？

source: To access a sub-variable, you need to write a dot between the parent variable name and the sub-variable name.
da: For at få adgang til en undervariabel skal du skrive et punktum mellem navnet på den overordnede variabel og navnet på undervariablen.
es: Para acceder a una subvariable, tienes que escribir un punto entre el nombre de la variable padre y el nombre de la subvariable.
fr: Pour accéder à une sous-variable, vous devez écrire un point entre le nom de la variable parent et le nom de la sous-variable.
pt_br: Para acessar uma sub-variável, você precisa escrever um ponto final entre o nome da variável pai e o nome da sub-variável.
ru: Чтобы получить доступ ко вложенной переменной, необходимо написать точку между именем родительской переменной и именем вложенной переменной.
ta: ஒரு துணை-மாறுபாட்டை அணுக, நீங்கள் பெற்றோர் மாறி பெயர் மற்றும் துணை மாறி பெயருக்கு இடையில் ஒரு புள்ளியை எழுத வேண்டும்.
uk: Щоб отримати доступ до вкладеної змінної, слід поставити крапку між назвою батьківської змінної та назвою вкладеної змінної.

source: For example, to access the [code]x[/code] sub-variable of the [code]position[/code] variable, you'll write [code]position.x[/code].
da: For eksempel, for at få adgang til undervariablen [code]x[/code] af variablen [code]position[/code] skal du skrive [code]position.x[/code].
es: Por ejemplo, para acceder a la subvariable [code]x[/code] de la variable [code]position[/code], escribirías [code]position.x[/code].
fr: Par exemple, pour accéder à la sous-variable [code]x[/code] de la variable [code]position[/code], vous écririez [code]position.x[/code].
pt_br: Por exemplo, para acessar a sub-variável [code]x[/code] da variável [code]position[/code], você vai escrever [code]position.x[/code].
ru: Например, чтобы получить доступ ко вложенному значению [code]x[/code] переменной [code]position[/code], необходимо написать [code]position.x[/code].
ta: எடுத்துக்காட்டாக, [குறியீடு] ஃச் [/code] [குறியீடு] நிலை [/குறியீடு] மாறியின் துணை-மாறுபாட்டை அணுக, நீங்கள் [குறியீடு] position.x [/code] ஐ எழுதுவீர்கள்.
uk: Наприклад, щоб отримати доступ до вкладеного значення [code]x[/code] змінної [code]position[/code], слід написати [code]position.x[/code].

source: You write a dot (".") between the variable and the sub-variable name.
cs: Mezi název proměnné a název dílčí proměnné napíšete tečku (".").
da: Du skriver et punktum (".") mellem variablen og undervariablens navn.
de: Schreibe einen Punkt (".") zwischen die Variable und den Namen der Untervariablen.
es: Escribes un punto (".") entre el nombre de la variable y el nombre de la subvariable.
fr: Vous écrivez un point (« . ») entre le nom de la variable et le nom de la sous-variable.
nl: Je schrijft een punt (".") tussen de variabele en de naam van de deelvariabele.
pt_br: Você escreve um ponto final (".") entre a variável e o nome da sub-variável.
ru: Написать точку (".") между переменной и именем вложенной переменной.
ta: நீங்கள் மாறி மற்றும் துணை மாறி பெயருக்கு இடையில் ஒரு புள்ளியை (".") எழுதுகிறீர்கள்.
uk: Поставити крапку (".") між змінною та назвою вкладеної змінної.
zh_hans: 在变量和子变量名称之间写一个点（“.”）。
zh_hant: 你需要在變數名稱和子變數名稱之間寫上一個點（"."）。

source: You write an arrow ("->") between the variable and the sub-variable name.
cs: Mezi název proměnné a název dílčí proměnné napíšete šipku ("->").
da: Du skriver en pil ("->") mellem variablen og undervariablens navn.
de: Schreibe einen Pfeil ("->") zwischen die Variable und den Namen der Untervariablen.
es: Escribes una flecha ("->") entre el nombre de la variable y el nombre de la subvariable.
fr: Vous écrivez une flèche (« -> ») entre le nom de la variable et le nom de la sous-variable.
nl: Je schrijft een punt ("->") tussen de variabele en de naam van de deelvariabele.
pt_br: Você escreve uma seta ("->") entre a variável e o nome da sub-variável.
ru: Написать стрелку ("->") между переменной и именем вложенной переменной.
ta: மாறி மற்றும் துணை மாறி பெயருக்கு இடையில் ஒரு அம்பு ("->") எழுதுகிறீர்கள்.
uk: Поставити стрілку ("->") між змінною та назвою вкладеної змінної.
zh_hans: 在变量和子变量名称之间写一个箭头（“->”）。
zh_hant: 你需要在變數名稱和子變數名稱之間寫上一個箭頭（"->"）。
