Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-13-conditions.po
Languages: cs, da, es, it, ja, nl, pt, ru, ta, tr, uk, zh_hant

source: In the previous example, if there was nothing below the [code]if[/code] lines, Godot would give us an "Expected an indented block after 'if' " error.
da: I det foregående eksempel, hvis der ikke var noget under [code]if[/code]-linjerne, ville Godot give os fejlen "Forventede en indrykket blok efter 'if'".
it: Nell'esempio precedente, se non ci fosse stato nulla sotto le righe [code]if[/code], Godot avrebbe dato un errore "Atteso un blocco rientrato dopo 'if'".
ja: 前の例では、[code]if[/code]行の下に何もない場合、Godotは「'if' の後にインデントされたブロックが必要です」というエラーを表示します。
nl: In het vorige voorbeeld, als er niets onder de [code]if[/code] regels stond, zou Godot ons een "Expected an indented block after 'if'" foutmelding geven.
ru: В предыдущем примере, если бы под строками [code]if[/code] ничего не было, Godot выдал бы нам ошибку «Ожидается блок с отступом после 'if'».
tr: Önceki örnekte, [code]if[/code] satırlarının altında hiçbir şey olmasaydı, Godot bize, "Expected an indented block after 'if' " yani "'if' den sonra girintili bir gövde bekleniyor" hatası verecekti.

source: Which of these statements are true?
cs: Která z těchto tvrzení jsou pravdivá?
da: Hvilke af disse udsagn er sande?
es: ¿Cuál de estas afirmaciones es cierta?
it: Quali di queste affermazioni è vera?
ja: これらの記述のうち、正しいものはどれですか?
nl: Welke van deze beweringen zijn waar?
pt: Quais dessas afirmações são verdadeiras?
ru: Какое из этих условий истинно?
ta: இந்த அறிக்கைகளில் எது உண்மை?
tr: Bu ifadelerden hangileri doğrudur?
uk: Які з цих тверджень вірні?
zh_hant: 這些敘述中哪些是正確的？

source: The comparison [code]3 > 1[/code] means "three is greater than one" which is [b]true[/b]. The comparison [code]2 < 3[/code] means "two is less than three" which is [b]true[/b]. The comparison [code]1 != 3[/code] means "one is not equal to three" which is [b]true[/b].
da: Sammenligningen [code]3 > 1[/code] betyder "tre er større end ét", hvilket er [b]sandt[/b]. Sammenligningen [code]2 < 3[/code] betyder "to er mindre end tre", hvilket er [b]sandt[/b]. Sammenligningen [code]1 != 3[/code] betyder "én er ikke lig med tre", hvilket er [b]sandt[/b].
it: Il confronto [code]3 > 1[/code] significa "tre è maggiore di uno" che è [b]vero[/b]. Il confronto [code]2 < 3[/code] significa "due è minore di tre" che è [b]vero[/b]. Il confronto [code]1 != 3[/code] significa "uno è diverso da tre" che è [b]vero[/b].
ja: 比較 [code]3 > 1[/code] は [b]true[/b] である "3 は 1 より大きい" という意味です。 比較[code]2 < 3[/code] は [b]true[/b] である "2 は 3 より小さい" という意味です。 比較 [code]1 != 3[/code] は [b]true[/b] である "1 は 3 と等しくない" という意味です。
nl: De vergelijking [code]3 > 1[/code] betekent "drie is groter dan één" wat [b]waar[/b] is. De vergelijking [code]2 < 3[/code] betekent "twee is kleiner dan drie" wat [b]waar[/b] is. De vergelijking [code]1 != 3[/code] betekent "één is niet gelijk aan drie" wat [b]waar[/b] is.
pt: A comparação [code]3 > 1[/code] significa "três é maior que um", que é [b]true[/b]. A comparação [code]2 < 3[/code] significa "dois é menor que três", que é [b]true[/b]. A comparação [code]1 != 3[/code] significa "um não é igual a três", que é [b]true[/b].
ru: Сравнение [code]3 > 1[/code] означает «три больше чем один», что [b]истинно[/b]. Сравнение [code]2 < 3[/code] означает «два меньше чем три», что [b]истинно[/b]. Сравнение [code]1 != 3[/code] означает «один не равно трём», что [b]истинно[/b].
tr: [code]3 > 1[/code] karşılaştırması, "üç birden büyüktür" anlamına gelir ki bu [b]doğrudur[/b]. [code]2 < 3[/code] karşılaştırması, "iki üçten küçüktür" anlamına gelir ki bu [b]doğrudur[/b]. [code]1 != 3[/code] karşılaştırması, "bir üçe eşit değildir" anlamına gelir ki bu [b]doğrudur[/b].

source: The comparison [code]2 == 1[/code] means "two is equal to one" which is [b]false[/b]. The comparison [code]3 < 1[/code] means "three is less than one" which is [b]false[/b].
da: Sammenligningen [code]2 == 1[/code] betyder "to er lig med ét", hvilket er [b]falsk[/b]. Sammenligningen [code]3 < 1[/code] betyder "tre er mindre end ét", hvilket er [b]falsk[/b].
it: Il confronto [code]2 == 1[/code] significa "due è uguale a uno" che è [b]falso[/b]. Il confronto [code]3 < 1[/code] significa "tre è minore di uno" che è [b]falso[/b].
ja: 比較 [code]2 == 1[/code] は [b]false[/b] である "2 は 1 に等しい" という意味です。 比較[code]3 < 1[/code] は [b]false[/b] である "3 は 1 より小さい" という意味です。
nl: De vergelijking [code]2 == 1[/code] betekent "twee is gelijk aan één" en dat is [b]onwaar[/b]. De vergelijking [code]3 < 1[/code] betekent "drie is kleiner dan één" en dat is [b]onwaar[/b].
pt: A comparação [code]2 == 1[/code] significa "dois é igual a um", que é [b]false[/b]. A comparação [code]3 < 1[/code] significa "três é menor que um", que é [b]false[/b].
ru: Сравнение [code]2 == 1[/code] означает «два равно одному», что [b]ложно[/b]. Сравнение [code]3 < 1[/code] означает «три меньше чем один», что [b]ложно[/b].
tr: [code]2 == 1[/code] karşılaştırması, "iki bire eşittir" anlamına gelir ki bu [b]yanlıştır[/b]. [code]3 < 1[/code] karşılaştırması, "üç birden küçüktür" anlamına gelir ki bu [b]yanlıştır[/b].

source: Or else...
da: Eller også...
es: Si no...
it: Altrimenti...
ja: 或いは。。。
nl: En anders...
pt: Ou outra coisa...
ru: Иначе...
ta: இல்லையெனில் ...
tr: Ya değilse...
uk: Або інакше...
zh_hant: 否則的話…

source: The [code]if[/code] keyword comes with a complementary [code]else[/code] keyword.
da: Nøgleordet [code]if[/code] kommer med et supplerende [code]else[/code](«ellers» på engelsk)-nøgleord.
it: La parola chiave [code]if[/code] ha un'altra parola chiave complementare [code]else[/code].
ja: [code]if[/code] キーワードには、補完的な [code]else[/code] キーワードが付属しています。
nl: Het sleutelwoord [code]if[/code] heeft een aanvullend sleutelwoord [code]else[/code].
pt: A palavra-chave [code]if[/code] vem com uma palavra-chave complementar [code]else[/code].
ru: Ключевое слово [code]if[/code] имеет вспомогательное ключевое слово [code]else[/code].
tr: [code]if[/code] anahtar kelimesi, tamamlayıcı bir [code]else[/code] anahtar kelimesi ile birlikte gelir.

source: You can write an [code]else[/code] block after an [code]if[/code] block, like so.
da: Du kan skrive en [code]else[/code]-blok efter en [code]if[/code]-blok, sådan her.
it: Puoi scrivere un blocco [code]else[/code] solo dopo un blocco [code]if[/code], così.
ja: このように、[code]if[/code]ブロックの後に[code]else[/code]ブロックを書くことができます。
nl: Je kunt een [code]else[/code] blok schrijven na een [code]if[/code] blok, als volgt.
pt: Pode escrever um bloco [code]else[/code] depois de um bloco [code]if[/code], assim.
ru: Вы можете написать блок [code]else[/code] после блока [code]if[/code] вот так.
tr: Bir [code]if[/code] kalıbından sonra, aşağıdaki gibi bir [code]else[/code] kalıbı yazabilirsiniz.

source: The [code]else[/code] block will run whenever the condition above it isn't met.
cs: Blok [code]else[/code] se spustí vždy, když není splněna podmínka uvedená nad ním.
da: Blokken [code]else[/code] kører, når betingelsen ovenfor ikke er opfyldt.
es: El bloque [code]else[/code] se ejecutará siempre que no se cumpla la condición anterior a él.
it: Il blocco [code]else[/code] si eseguirà ogniqualvolta che la condizione sopra non è raggiunta.
ja: [code]else[/code] ブロックは、上記の条件が満たされないたびに実行されます。
nl: Het [code]else[/code] blok wordt uitgevoerd wanneer niet wordt voldaan aan de conditie erboven.
pt: O bloco [code]else[/code] será executado sempre que a condição acima não for atendida.
ru: Блок [code]else[/code] выполнится в том случае, если условие над ним ложно.
ta: [குறியீடு] வேறு [/குறியீடு] தொகுதி மேலே உள்ள நிபந்தனையை நிறைவு செய்யாத போதெல்லாம் இயங்கும்.
tr: [code]else[/code] gövdesi, üstteki koşul karşılanmadığında çalışacaktır.
uk: Блок [code]else[/code] запускатиметься щоразу, коли умова вище не виконується.
zh_hant: [code]else[/code] 區塊會在上面的條件不成立時執行。

source: In the following practices, we'll use conditions and improve the way our character's health changes so it has limits.
cs: V následujících postupech použijeme podmínky a zlepšíme způsob, jakým se zdraví naší postavy mění tak, aby mělo limity.
da: I de følgende øvelser bruger vi betingelser og forbedrer den måde, vores karakters helbred ændrer sig på, så det har grænser.
es: En las siguientes prácticas, utilizaremos condiciones y mejoraremos la forma en que cambia la salud de nuestro personaje para que tenga límites.
it: Nelle seguenti pratiche, useremo le condizioni per migliorare il modo in cui la vita del nostro personaggio cambia cosicché abbia dei limiti.
ja: 以下の演習では、条件を使用して、キャラクターの体力の変化方法を改善して、制限を設けます。
nl: In de volgende oefeningen zullen we condities gebruiken en de manier waarop de gezondheid van ons personage verandert verbeteren zodat het grenzen krijgt.
pt: Nas práticas a seguir, usaremos condições e vamos melhorar a maneira como a vida da nossa personagem muda para que tenha limites.
ru: В следующих упражнениях мы используем условия для улучшения способа изменения здоровья персонажа, чтобы оно имело ограничения.
ta: பின்வரும் நடைமுறைகளில், நாங்கள் நிபந்தனைகளைப் பயன்படுத்துவோம், மேலும் எங்கள் கதாபாத்திரத்தின் உடல்நல மாற்றங்களை மேம்படுத்துவோம், எனவே அதற்கு வரம்புகள் உள்ளன.
tr: Sıradaki alıştırmalarda, koşulları kullanacağız ve karakterimizin sağlığının değişme şeklini geliştireceğiz, böylece sınırları olacak.
uk: У наступних вправах ми будемо використовувати умови та покращувати спосіб зміни здоров’я нашого персонажа, щоб воно мало обмеження.
zh_hant: 在接下來的練習中，我們將使用條件來改進角色的生命值變化，使其生命值有限制。

source: Using Comparisons
cs: Použití porovnání
da: Brug af sammenligninger
es: Usar comparaciones
it: Usando Le Comparazioni
ja: 比較の使用
nl: Vergelijkingen gebruiken
pt: Usando comparações
ru: Использование условий
ta: ஒப்பீடுகளைப் பயன்படுத்துதல்
tr: Karşılaştırmaları Kullanmak
uk: Використання порівнянь
zh_hant: 使用比較語句

source: This series of [code]if[/code] statements is all wrong. Change the comparisons so each comparison matches the instruction below it.
da: Denne serie af [code]if[/code]-udsagn er helt forkerte. Rediger sammenligningerne, så hver sammenligning matcher instruktionen nedenunder.
it: Questa serie di condizioni [code]if[/code] sono tutte sbagliate. Cambia le comparazioni cosicché ognuna rispecchi le istruzioni sotto di esse.
ja: この一連の [code]if[/code] ステートメントはすべて間違っています。各比較がその下の命令と一致するように比較を変更します。
nl: Deze reeks [code]if[/code] instructies zit vol fouten. Verander de vergelijkingen zodat elke vergelijking overeenkomt met de instructie eronder.
pt: Essa série de instruções [code]if[/code] está totalmente errada. Altere as comparações para que cada comparação corresponda à instrução abaixo dela.
ru: Вся последовательность условий [code]if[/code] сломана. Измените знаки сравнения, чтобы каждое условие удовлетворяло инструкции под ним.

source: Keep the values and statements as they are; only change the comparison signs.
da: Behold værdierne og udsagnene, som de er; rediger kun sammenligningstegnene.
it: Mantieni i valori e le condizioni così come sono; cambia solo il segno di comparazione.
ja: 値とステートメントはそのままにしておきます。比較符号のみを変更します。
nl: Laat de waarden en beweringen zoals ze zijn; verander alleen de vergelijkingstekens.
pt: Mantenha os valores e declarações como estão; altere apenas os sinais de comparação.
ru: Значения выражений менять не нужно, меняйте только знаки сравнения.

source: As a reminder, the comparison signs are: [code] > greater than < less than == equal to != not equal to [/code]
da: Som en påmindelse er sammenligningstegnene: [code] > større end < mindre end == lig med != ikke lig med [/code]
it: Come promemoria, ecco i vari segni di comparazione: [code] > maggiore di < minore di == uguale a != diverso da [/code]
ja: 注意点として、比較記号は次のとおりです。 [code] >より大きい < より小さい == 等しい != 等しくない [/code]
nl: Ter herinnering, de vergelijkingstekens zijn: [code] > groter dan < kleiner dan == gelijk aan != niet gelijk aan [/code]
pt: Como lembrete, os sinais de comparação são: [code] > maior que < menor que == igual a != diferente de [/code]
ru: Напоминаем, знаками сравнения являются: [code] > больше чем < меньше чем == равно != не равно [/code]

source: The line [code]health < 5:[/code] means "health is less than 5".
da: Linjen [code]health < 5:[/code] betyder "liv er mindre end 5".
it: La riga [code]health < 5:[/code] significa "la vita è minore di 5".
ja: [code]health < 5:[/code] という行は、「正常性が 5 未満」を意味します。
nl: De regel [code]health < 5:[/code] betekent "gezondheid is minder dan 5".
pt: A linha [code]health < 5:[/code] significa "vida é menor do que 5".
ru: Строка [code]health < 5:[/code] означает «здоровье меньше пяти».

source: Because [code]health = 100[/code], this is false so [code]print("health is greater than five.")[/code] won't run.
da: Fordi [code]health = 100[/code], er dette falsk, så [code]print("health is greater than five.")[/code] vil ikke køre.
it: Poiché [code]health = 100[/code], questo è falso quindi [code]print("health is greater than five.")[/code] non verrà eseguito.
ja: [code]health = 100[/code] なので、これは false なので [code]print("health is greater than five.")[/code] は実行されません。
nl: Omdat [code]health = 100[/code] is dit onwaar, dus [code]print("health is greater than five.")[/code] wordt niet uitgevoerd.
pt: Como [code]health = 100[/code], isso é falso, então [code]print("vida é maior que cinco.")[/code] não será executado.
ru: Так как [code]health = 100[/code], это условие ложно и инструкция [code]print("health is greater than five.")[/code] не выполнится.

source: Comparing values allows us to make decisions in code. But there's something wrong with these statements..
cs: Porovnávání hodnot nám umožňuje rozhodovat v kódu. V těchto výrocích je však něco špatně..
da: Sammenligning af værdier giver os mulighed for at træffe beslutninger i kode. Men der er noget galt med disse udsagn..
es: Comparar valores nos permite tomar decisiones en el código. Pero hay algo mal en estas sentencias...
it: Comparare valori ci consente di prendere delle decisioni nel nostro codice. Ma c'è qualcosa di sbagliato in queste condizioni..
ja: 値を比較することで、コードで決定を下すことができます。しかし、これらの声明には何か問題があります。
nl: Door waarden te vergelijken kunnen we beslissingen nemen in code. Maar er is iets mis met deze beweringen...
pt: Comparar valores nos permite tomar decisões no código. Mas há algo de errado com essas declarações ..
ru: Сравнение значений позволяет нам принимать решения в коде. Но тут с условиями что-то не так..
ta: மதிப்புகளை ஒப்பிடுவது குறியீட்டில் முடிவுகளை எடுக்க அனுமதிக்கிறது. ஆனால் இந்த அறிக்கைகளில் ஏதோ தவறு இருக்கிறது ..
tr: Değerleri karşılaştırmak, kod içinde kararlar vermemizi sağlar. Ama bu ifadelerde yanlış olan bir şey var.
uk: Порівняння значень дозволяє нам приймати рішення в коді. Але в цих твердженнях щось не так..
zh_hant: 這些比較運算式使我們能夠在程式碼中做出決策。不過，這些語句有些地方是錯誤的。

source: Limiting Healing
cs: Omezení léčení
da: Begrænsning af Healing
es: Limitar la curación
it: Limitando Le Cure
ja: 回復の制限
nl: Genezing beperken
pt: Limitando a Cura
ru: Ограничиваем исцеление
ta: குணப்படுத்துவதைக் கட்டுப்படுத்துகிறது
tr: İyileşmeyi Sınırlamak
uk: Обмеження зцілення
zh_hant: 限制回復量

source: We have a heal function that adds an amount to the character's health.
da: Vi har en helbredelsesfunktion, der tilføjer et beløb til karakterens helbred.
it: Abbiamo una funzione di cura che aggiunge una quantità alla vita del personaggio.
ja: キャラクターの体力に量を追加する回復機能があります。
nl: We hebben een genezingsfunctie die een hoeveelheid toevoegt aan de gezondheid van het personage.
pt: Temos uma função de cura que adiciona uma certa quantidade na vida do personagem.
ru: У нас есть функция heal, которая добавляет amount к здоровью персонажа.
tr: Karakterin sağlığına bir miktar ekleme yapan (amount) bir iyileştirme fonksiyonumuz var.

source: Add to the function so the character's health is never greater than [code]80[/code].
da: Læg det til funktionen, så karakterens helbred aldrig er større end [code]80[/code].
it: Aggiungi alla funzione cosicché la vita del personaggio non sia mai maggiore di [code]80[/code].
ja: キャラクターの体力が [code]80[/code] を超えないように関数に追加します。
nl: Vul de functie aan zodat de gezondheid van het personage nooit groter is dan [code]80[/code].
pt: Adicione algo na função para que a vida da personagem nunca seja maior que [code]80[/code].
ru: Доработайте функцию, чтобы здоровье персонажа никогда не поднималось выше [code]80[/code].
tr: Karakterin sağlığının hiçbir zaman [code]80[/code] değerinden büyük olmaması için fonksiyona ekleme yapın.

source: As much as we might like, we don't want our robot to have too much health. Limit how much healing the robot can take.
cs: I když bychom si to možná přáli, nechceme, aby náš robot měl příliš mnoho zdraví. Omezte, kolik léčení může robot přijmout.
da: Så meget som vi måske gerne vil, ønsker vi ikke, at vores robot skal have for meget liv. Begræns, hvor meget helbredelse robotten kan tage.
es: Por mucho que nos guste la idea, no queremos que nuestro robot tenga demasiada salud. Limita la cantidad de curación que puede recibir el robot.
it: Per quanto ci potrebbe stare simpatico, non vogliamo che il nostro robot abbia troppa vita. Limita quanto il robot si possa curare.
ja: 私たちは、ロボットの体力をあまり良くしたくありません。ロボットが受けられる回復量を制限します。
nl: Hoe leuk het ook zou zijn, we willen niet dat onze robot te veel gezondheidspunten heeft. Beperk hoeveel genezing de robot kan ontvangen.
pt: Por mais que queremos isso, não queremos que nosso robô tenha muita vida. Limite a quantidade de cura que o robô pode ter.
ru: Как бы нам ни хотелось, наш робот не должен иметь слишком много здоровья. Ограничьте количество здоровья, которое может иметь робот.
ta: நாம் விரும்பும் அளவுக்கு, எங்கள் ரோபோவுக்கு அதிக ஆரோக்கியத்தை நாங்கள் விரும்பவில்லை. ரோபோ எவ்வளவு குணமடைய முடியும் என்பதை கட்டுப்படுத்துங்கள்.
tr: Ne kadar çok hoş olsa da, robotumuzun aşırı fazla sağlığının olmasını istemiyoruz. Robotun ne kadar iyileşme alabileceğini sınırlayın.
uk: Як би нам не хотілося, ми не хочемо, щоб у нашого робота було надто багато здоров’я. Обмежте кількість лікування, яке може отримати робот.
zh_hant: 儘管我們希望角色的生命值越多越好，但我們不希望機器人擁有過多的生命值。限制機器人可以接受的治療量。

source: Preventing Health from Going Below Zero
cs: Prevence poklesu zdraví pod nulu
da: Forhindre at Liv Kan Gå Under Nul
es: Evitar que la salud caiga por debajo de cero
it: Impedendo Che La Vita Superi Lo Zero
ja: 体力がゼロを下回るのを防ぐ
nl: Voorkomen dat de gezondheid onder nul zakt
pt: Evitando que a Vida Fique Abaixo de Zero
ru: Запрещаем здоровью опускаться ниже нуля
ta: உடல்நலம் பூச்சியத்திற்கு கீழே செல்வதைத் தடுக்கிறது
tr: Sağlığın Sıfırın Altına Düşmesini Önlemek
uk: Запобігання здоров'ю від падіння нижче нуля
zh_hant: 防止生命值低於零

source: When the robot takes damage, its health can be negative.
da: Når robotten tager skade, kan dens helbred være negativt.
it: Quando il robot prende danno, la sua vita può essere negativa.
ja: ロボットがダメージを受けると、その体力がマイナスになる可能性があります。
nl: Wanneer de robot schade oploopt, kan zijn gezondheid negatief worden.
pt: Quando o robô sofre dano, a saúde dele pode ficar negativa.
ru: В результате получения урона, количество здоровья робота может стать отрицательным.
tr: Robot hasar aldığında, sağlığı negatif olabilir.

source: We might want to display the health number on screen, like in Japanese RPGs.
da: Vi vil måske gerne vise livs-tallet på skærmen, ligesom i japanske RPG'er.
it: Potremmo voler mostrare la i punti vita su schermo, come nei JRPG.
ja: 日本のRPGのように、体力の数値を画面に表示したい場合があります。
nl: We willen misschien het gezondheidsgetal op het scherm weergeven, zoals in Japanse RPG's.
pt: Podemos querer exibir o número de saúde no ecrã, como nos RPGs japoneses.
ru: Возможно, мы захотим отображать количество здоровья на экране, как в японских RPG.
tr: Japon RPG'lerinde (rol yapma oyunları) olduğu gibi, sağlık değerini ekranda görüntülemek isteyebiliriz.

source: We don't want negative numbers. We want to stop at zero instead.
da: Vi ønsker ikke negative tal. Vi vil i stedet stoppe ved nul.
it: Non vogliamo i numeri negativi. Vogliamo fermarci a zero invece.
ja: 負の数は必要ありません。代わりにゼロで停止したいと思います。
nl: We willen geen negatieve getallen. In plaats daarvan willen we stoppen bij nul.
pt: Não queremos números negativos. Queremos parar em zero em vez disso.
ru: Мы не хотим чтобы наши характеристики стали отрицательными, их значения должны остановиться на нуле.
tr: Negatif sayılar istemiyoruz. Bunun yerine sıfırda durmak istiyoruz.

source: Calling the function should reduce [code]health[/code] by [code]amount[/code].
da: Kald af funktionen bør reducere [code]health[/code] med [code]amount[/code].
it: Chiamare la funzione dovrebbe ridurre [code]health[/code] di [code]amount[/code].
ja: 関数を呼び出すと、[code]health[/code] が [code]amount[/code] だけ減らされます。
nl: Het aanroepen van de functie moet [code]health[/code] verminderen met [code]amount[/code].
pt: Chamar a função deve reduzir [code]health[/code] pelo valor de [code]amount[/code].
ru: Вызов функции должен уменьшать [code]health[/code] на [code]amount[/code].
tr: Fonksiyonun çağrılması, sağlığı, [code]health[/code], verilen miktarda, [code]amount[/code], azaltmalıdır.

source: If [code]health[/code] goes below [code]0[/code], set it to [code]0[/code] again.
da: Hvis [code]health[/code] går under [code]0[/code], skal du indstille den til [code]0[/code] igen.
it: Se [code]health[/code] va sotto [code]0[/code], settala a [code]0[/code] di nuovo.
ja: [code]health[/code] が [code]0[/code] を下回った場合は、再度 [code]0[/code] に設定します。
nl: Als [code]health[/code] onder [code]0[/code] komt, zet het dan weer op [code]0[/code].
pt: Se [code]health[/code] ficar abaixo de [code]0[/code], defina-a para [code]0[/code] novamente.
ru: При уменьшении значения [code]health[/code] ниже [code]0[/code], установите его в [code]0[/code] снова.
tr: Eğer [code]health[/code], [code]0[/code]'ın altına düşerse, tekrar [code]0[/code] olarak ayarlayın.

source: Having a negative health value doesn't make a lot of sense. Make sure the robot's health can't go below zero.
cs: Záporná hodnota zdraví nedává smysl. Ujistěte se, že zdraví robota nemůže klesnout pod nulu.
da: Det giver ikke meget mening at have en negativ livs-værdi. Sørg for, at robottens livs-niveau ikke kan falde under nul.
es: Tener un valor de salud negativo no tiene mucho sentido. Asegúrate de que la salud del robot no pueda bajar de cero.
it: Avere una vita negativa non ha molto senso. Fa sì ché la vita del robot non possa mai andare sotto zero.
ja: 体力が負の値を持つことはあまり意味がありません。ロボットの体力がゼロを下回らないようにしてください。
nl: Een negatieve gezondheidswaarde heeft niet veel zin. Zorg ervoor dat de gezondheid van de robot niet onder nul kan komen.
pt: Ter um valor negativo de vida não faz muito sentido. Certifique-se de que a vida do robô não fique abaixo de zero.
ru: Наличие отрицательного значения здоровья не имеет особого смысла. Убедитесь, что здоровье робота не может опуститься ниже нуля.
ta: எதிர்மறையான சுகாதார மதிப்பைக் கொண்டிருப்பது நிறைய அர்த்தத்தை ஏற்படுத்தாது. ரோபோவின் உடல்நலம் பூச்சியத்திற்கு கீழே செல்ல முடியாது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
tr: Negatif bir sağlık değerine sahip olmak pek mantıklı değil. Robotun sağlığının sıfırın altına düşemeyeceğinden emin olun.
uk: Мати негативне значення здоров’я не має великого сенсу. Переконайтеся, що здоров'я робота не може опускатися нижче нуля.
zh_hant: 當生命值變成負數時並不合理。請確保機器人的生命值不會低於零。

source: Conditions
cs: Podmínky
da: Betingelser
es: Condiciones
it: Condizioni
ja: 条件
nl: Condities
pt: Condições
ru: Условия
ta: நிபந்தனைகள்
tr: Koşullar
uk: Умови
zh_hant: 條件語句

source: To define a condition, we use the [code]if[/code] keyword. We write a line starting with [code]if[/code], type the condition to evaluate, and end the line with a colon.
pt: Para definir uma condição, usamos a palavra-chave [code]if[/code]. Escrevemos uma linha começando com [code]if[/code], digitamos a condição a ser avaliada e terminamos a linha com o sinal de dois pontos.
