Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-25-creating-dictionaries.po
Languages: cs, da, es, fr, it, ja, pt, ru, ta, tr, uk, zh_hant

source: We access the value of keys by writing the dictionary name, with the key in between square brackets.
cs: K hodnotě klíčů přistupujeme tak, že zapíšeme název slovníku a klíč vložíme do hranatých závorek.
da: Vi tilgår værdien af nøgler ved at skrive ordbogens navn, med nøglen mellem firkantede parenteser.
es: Accedemos al valor de las claves escribiendo el nombre del diccionario, con la clave entre corchetes.
fr: Nous accédons à la valeur des clés en écrivant le nom du dictionnaire, avec la clé entre crochets.
it: Accediamo al valore delle chiavi scrivendo il nome del dizionario, con la chiave tra parentesi quadre.
ja: キーの値にアクセスするには、辞書名を書き、キーを角括弧で囲みます。
pt: Acessamos o valor das chaves escrevendo o nome do dicionário, com a chave entre colchetes.
ru: Чтобы получить значение по ключу нужно написать имя словаря, а после указать ключ в квадратных скобках.
ta: சதுர அடைப்புக்குறிக்கு இடையில் உள்ள சாவியுடன் அகராதி பெயரை எழுதுவதன் மூலம் விசைகளின் மதிப்பை அணுகுவோம்.
tr: Anahtar kelimelerin gösterdiği değerlere, köşeli parantez arasına anahtar kelime gelecek şekilde sözlük adını yazarak erişiyoruz.
uk: Ми отримуємо доступ до значення ключів, записуючи ім’я словника з ключем у квадратних дужках.
zh_hant: 我們可以透過在字典名稱後加上方括號，並在括號內填入鍵來存取對應的值。

source: How would you access how many gems the player has?
cs: Jak se dostanete k tomu, kolik drahokamů hráč má?
da: Hvordan får man adgang til, hvor mange ædelsten spilleren har?
es: ¿Cómo accederías a cuántas gemas tiene el jugador?
fr: Comment accéderiez-vous au nombre de gemmes que possède le joueur ?
it: Come faresti a capire quante gemme ha il giocatore?
ja: プレイヤーが持っている宝石の数にどのようにアクセスしますか?
pt: Como acederia quantas gemas o jogador tem?
ru: Как узнать, сколько драгоценных камней (gem) есть у игрока?
ta: வீரருக்கு எத்தனை ரத்தினங்கள் உள்ளன என்பதை நீங்கள் எவ்வாறு அணுகுவீர்கள்?
tr: Yukarıdaki "inventory" içinde, oyuncunun ne kadar mücevheri (gems) olduğuna nasıl erişirdiniz?
uk: Як отримати доступ до кількості дорогоцінних каменів у гравця?
zh_hant: 你會如何存取玩家擁有的寶石數量？

source: We need to make sure the key is the same as we defined in the dictionary.
cs: Musíme se ujistit, že klíč je stejný, jako jsme ho definovali ve slovníku.
da: Vi skal sørge for, at nøglen er den samme, som vi definerede i ordbogen.
es: Tenemos que asegurarnos de que la clave sea la misma que definimos en el diccionario.
fr: Nous devons nous assurer que la clé est la même que celle que nous avons définie dans le dictionnaire.
it: Dobbiamo assicurarci che la chiave sia la stessa che abbiamo definito nel dizionario.
ja: キーが辞書で定義したものと同じであることを確認する必要があります。
pt: Precisamos ter certeza de que a chave é a mesma que definimos no dicionário.
tr: Anahtarın, sözlükte tanımladığımız ile aynı olduğundan emin olmalıyız.

source: In our case, [code]var item_count = inventory["gems"][/code] is correct.
cs: V našem případě je [code]var item_count = inventory["gems"][/code] správné.
da: I vores tilfælde er [code]var item_count = inventory["gems"][/code] korrekt.
es: En nuestro caso, [code]var item_count = inventory["gems"][/code] es correcto.
fr: Dans notre cas, [code]var item_count = inventory["gems"][/code] est correct.
it: Nel nostro caso, [code]var item_count = inventory["gems"][/code] è corretto.
ja: 私たちの場合、[code]var item_count = inventory["gems"][/code]が正しいです。
pt: No nosso caso, [code]var item_count = inventário["gems"][/code] está correto.
tr: Bizim durumumuzda, [code]var item_count = inventory["gems"][/code] doğrudur.

source: Changing values
cs: Změna hodnot
da: Ændring af værdier
es: Cambiar los valores
fr: Modifier les valeurs
it: Cambiare i valori
ja: 値の変更
pt: Mudando valores
ru: Изменение значений
ta: மதிப்புகளை மாற்றுதல்
tr: Değerleri değiştirmek
uk: Зміна значень
zh_hant: 修改字典的值

source: We can also change values directly, which is useful in our case for adding or removing items from the player's inventory.
cs: Hodnoty můžeme měnit také přímo, což je v našem případě užitečné pro přidávání nebo odebírání předmětů z inventáře hráče.
da: Vi kan også ændre værdier direkte, hvilket er nyttigt i vores tilfælde til at tilføje eller fjerne genstande fra spillerens lager.
es: También podemos cambiar los valores directamente, lo que es útil en nuestro caso para añadir o eliminar objetos del inventario del jugador.
fr: Nous pouvons également modifier les valeurs directement, ce qui est utile dans notre cas pour ajouter ou retirer des objets de l'inventaire du joueur.
it: Possiamo anche cambiare i valori direttamente, questo ci torna utile nel nostro caso per aggiungere e rimuovere oggetti dall'inventario del giocatore.
ja: 値を直接変更することもでき、プレイヤーのインベントリにアイテムを追加または削除する場合に便利です。
pt: Também podemos alterar os valores diretamente, o que é útil no nosso caso para adicionar ou remover itens do inventário do jogador.
ru: Также, мы можем изменять значения напрямую, что, в нашем случае, полезно для добавления или удаления предметов из инвентаря игрока.
ta: மதிப்புகளை நேரடியாக மாற்றலாம், இது பிளேயரின் சரக்குகளிலிருந்து உருப்படிகளைச் சேர்ப்பது அல்லது அகற்றுவதற்கு எங்கள் விசயத்தில் பயனுள்ளதாக இருக்கும்.
tr: Ayrıca, değerleri doğrudan değiştirebiliriz, bu da bizim durumumuzda, oyuncunun envanterine öğe eklemek veya çıkarmak için kullanışlıdır.
uk: Ми також можемо змінювати значення безпосередньо, що корисно в нашому випадку для додавання або видалення предметів з інвентарю гравця.
zh_hant: 我們也可以直接更改數值，這在我們需要增加或移除玩家背包內的物品時非常實用。

source: In the following practices, we'll use a dictionary to create a player inventory and create a function to change the value of items.
cs: V následujících postupech použijeme slovník pro vytvoření inventáře hráče a vytvoříme funkci pro změnu hodnoty položek.
da: I de følgende øvelser bruger vi en ordbog til at oprette et spillerlager og oprette en funktion til at ændre værdien af genstande.
es: En las siguientes prácticas, utilizaremos un diccionario para crear el inventario de un jugador y crearemos una función para cambiar el número de los objetos.
fr: Dans les exercices suivants, nous utiliserons un dictionnaire pour créer un inventaire de joueur et créerons une fonction pour modifier la valeur des objets.
it: Nelle seguenti pratiche, useremo un dizionario per creare un inventario per il giocatore e per creare una funzione che cambi i valori degli oggetti.
ja: 次の演習では、辞書を使用してプレイヤーインベントリを作成し、アイテムの値を変更する関数を作成します。
pt: Nas práticas a seguir, usaremos um dicionário para criar um inventário e criaremos uma função para alterar o valor dos itens.
ru: В следующих упражнениях мы создадим инвентарь игрока при помощи словаря, а также напишем функцию для изменения количества предметов в инвентаре.
ta: பின்வரும் நடைமுறைகளில், ஒரு பிளேயர் சரக்குகளை உருவாக்க மற்றும் உருப்படிகளின் மதிப்பை மாற்ற ஒரு செயல்பாட்டை உருவாக்க ஒரு அகராதியைப் பயன்படுத்துவோம்.
tr: Sıradaki alıştırmalarda, bir oyuncu envanteri oluşturmak için bir sözlük kullanacağız, ve öğelerin değerini değiştirmek için bir fonksiyon oluşturacağız.
uk: У наступних практиках ми будемо використовувати словник для створення інвентарю гравця та створення функції для зміни вартості предметів.
zh_hant: 在接下來的練習中，我們將使用字典來建立玩家的背包，並撰寫一個函式來修改物品的數量。

source: Creating an inventory using a dictionary
cs: Vytvoření inventáře pomocí slovníku
da: Oprettelse af en inventarliste ved hjælp af en ordbog
es: Crear un inventario utilizando un diccionario
fr: Créer un inventaire à l'aide d'un dictionnaire
it: Creare un inventario usando un dizionario
ja: 辞書を使用したインベントリーの作成
pt: Criando um inventário usando um dicionário
ru: Создание инвентаря при помощи словаря
ta: அகராதியைப் பயன்படுத்தி ஒரு சரக்குகளை உருவாக்குதல்
tr: Sözlük kullanarak bir envanter oluşturmak
uk: Створення опису за допомогою словника
zh_hant: 使用字典來建立背包

source: Let's give some items to the player.
cs: Dejme hráči nějaké předměty.
da: Lad os give spilleren nogle genstande.
es: Démosle algunos objetos al jugador.
fr: Donnons quelques objets au joueur.
it: Diamo qualche oggetto al giocatore.
ja: プレイヤーにいくつかのアイテムを渡しましょう。
pt: Vamos dar alguns itens ao jogador.
tr: Hadi oyuncumuza bazı eşyalar verelim.

source: We use a dictionary for the player's inventory. We defined the [code]inventory[/code] variable for you, but it contains no items yet.
cs: Pro inventář hráče používáme slovník. Definovali jsme pro vás proměnnou [code]inventory[/code], ale zatím neobsahuje žádné položky.
da: Vi bruger en ordbog til spillerens lager. Vi har defineret variablen [code]inventory[/code] for dig, men den indeholder endnu ingen genstande.
es: Utilizamos un diccionario para el inventario del jugador. Hemos definido la variable [code]inventory[/code] por ti, pero aún no contiene ningún objeto.
fr: Nous utilisons un dictionnaire pour l'inventaire du joueur. Nous avons défini la variable [code]inventory[/code] pour vous, mais elle ne contient encore aucun objet.
it: Usiamo un dizionario per l'inventario del giocatore. Abbiamo già definito la variabile [code]inventory[/code] per te, ma ancora non contiene alcun oggetto.
ja: プレイヤーのインベントリには辞書を使用します。[code]inventory[/code] 変数を定義しましたが、まだアイテムは含まれていません。
pt: Usamos um dicionário para o inventário do jogador. Definimos a variável [code]inventory[/code] para si, mas ainda não contém itens.
tr: Oyuncunun envanteri için bir sözlük kullanıyoruz. [code]inventory[/code] değişkenini sizin için tanımladık, ancak henüz öğe içermiyor.

source: Give the player the following items by adding the correct keys and values to the dictionary:
cs: Dejte hráči následující položky přidáním správných kláves a hodnot do slovníku:
da: Giv spilleren følgende genstande ved at tilføje de korrekte nøgler og værdier til ordbogen:
es: Dale al jugador los siguientes objetos añadiendo las claves y valores correctos al diccionario:
fr: Donnez au joueur les objets suivants en ajoutant les clés et les valeurs correctes au dictionnaire :
it: Dà al giocatore i seguenti oggetti aggiungendo le chiavi corrette e i valori al dizionario.
ja: 辞書に正しいキーと値を追加して、プレーヤーに次の項目を与えます。
pt: Dê ao jogador os seguintes itens adicionando as chaves e valores corretos ao dicionário:
tr: Sözlüğe doğru anahtarları ve değerleri ekleyerek, oyuncuya aşağıdaki öğeleri verin:

source: - Three "healing heart". - Nine "gems". - One "sword".
cs: - Tři "léčivé srdce" - "healing heart". - Devět "drahokamů" - "gems". - Jeden "meč" - "sword".
da: - Tre "healing heart". - Ni "gems". - Et "sword".
es: - Tres "healing heart" (corazones sanadores). - Nueve "gems" (gemas). - Una "sword" (espada).
fr: - Trois "healing heart" (cœurs de guérison). - Neuf "gems" (gemmes). - Une "sword" (épée).
it: - Tre "healing heart". - Nove "gems". - Una "sword".
ja: - 3つの「体力回復」。 - 9つの「宝石」。 - 1本の「剣」。
pt: - Três "healing heart". - Nove "gems". - Uma "sword".
tr: - Üç tane iyileştirici kalp, "healing heart". - Dokuz tane mücevher, "gems". - Bir tane kılıç, "sword".

source: The keys should be text strings, and the values whole numbers.
cs: Klíče by měly být textové řetězce a hodnoty celá čísla.
da: Nøglerne skal være tekststrenge, og værdierne skal være hele tal.
es: Las claves deben ser cadenas de texto, y los valores números enteros.
fr: Les clés doivent être des chaînes de texte, et les valeurs des nombres entiers.
it: Le chiavi dovrebbero essere stringhe di testo e i valori numeri interi.
ja: キーはテキスト文字列で、値は整数である必要があります。
pt: As chaves devem ser strings de texto e os valores devem ser números inteiros.
tr: Anahtarlar birer metin dizesi, ve değerler de birer tam sayı olmalıdır.

source: Collecting items is fun, but we need a good way to store them. Write a dictionary to display the player's items.
cs: Sbírání předmětů je zábava, ale potřebujeme dobrý způsob, jak je uložit. Napište slovník pro zobrazení hráčových předmětů.
da: Det er sjovt at samle genstande, men vi har brug for en god måde at opbevare dem på. Skriv en ordbog for at vise spillerens genstande.
es: Recolectar objetos es divertido, pero necesitamos una buena forma de almacenarlos. Escribe un diccionario para mostrar los objetos del jugador.
fr: Collectionner des objets est amusant, mais nous avons besoin d'un bon moyen de les stocker. Écrivez un dictionnaire pour afficher les objets du joueur.
it: Collezionare oggetti è divertente, ma abbiamo bisogno di un buon metodo per conservarli. Scrivi un dizionario che mostri gli oggetti del giocatore.
ja: アイテムを集めるのは楽しいですが、アイテムを保管するための良い方法が必要です。プレイヤーのアイテムを表示する辞書を記述します。
pt: Coletar itens é divertido, mas precisamos de uma boa maneira de armazená-los. Escreva um dicionário para exibir os itens do jogador.
ru: Собирать предметы весело, но нам нужен хороший способ их хранения. Напишите словарь для отображения предметов игрока.
ta: பொருட்களை சேகரிப்பது வேடிக்கையானது, ஆனால் அவற்றை சேமிக்க எங்களுக்கு ஒரு நல்ல வழி தேவை. பிளேயரின் உருப்படிகளைக் காட்ட ஒரு அகராதியை எழுதுங்கள்.
tr: Eşyaları toplamak eğlencelidir, ancak onları saklamak için iyi bir yola ihtiyacımız var. Oyuncunun öğelerini görüntülemek için bir sözlük yazın.
uk: Збирати предмети весело, але нам потрібен хороший спосіб їх зберігання. Напишіть словник для відображення предметів гравця.
zh_hant: 收集物品很有趣，但我們需要一個良好的方式來存放它們。請編寫一個字典來顯示玩家的物品。

source: Increasing item counts
cs: Zvyšování počtu položek
da: Øge genstands mængden
es: Aumentar el número de objetos
fr: Augmenter le nombre d'objets
it: Aumentare la quantità di oggetti
ja: アイテム数の増加
pt: Aumentar a quantidade de itens
ru: Увеличиваем количество предметов
ta: உருப்படி எண்ணிக்கையை அதிகரிக்கும்
tr: Öğe sayılarını artırmak
uk: Збільшення кількості елементів
zh_hant: 增加物品數量

source: We want to change the item counts in the player's inventory whenever the player picks up or uses an item.
cs: Chceme změnit počet položek v inventáři hráče, kdykoli si hráč vezme nebo použije nějakou položku.
da: Vi ønsker at ændre antallet af genstande i spillerens lager, hver gang spilleren samler eller bruger en genstand.
es: Queremos cambiar el recuento de objetos en el inventario del jugador cada vez que éste recoja o utilice un objeto.
fr: Nous souhaitons modifier le nombre d'objets dans l'inventaire du joueur chaque fois que celui-ci ramasse ou utilise un objet.
it: Vogliamo cambiare le quantità di oggetti nell'inventario ogni volta che il giocatore prende o utilizza un oggetto.
ja: プレイヤーがアイテムを拾ったり使用したりするたびに、プレイヤーのインベントリ内のアイテム数を変更したいと考えています。
pt: Queremos alterar a quantidade de itens no inventário do jogador sempre que o jogador escolher ou usar um item.
tr: Oyuncu bir öğeyi aldığında veya kullandığında, oyuncunun envanterindeki öğe sayılarını değiştirmek istiyoruz.

source: We've started the [code]add_item()[/code] function for you.
cs: Pro začátek jsme pro vás vytvořili funkci [code]add_item()[/code].
da: Vi har startet funktionen [code]add_item()[/code] for dig.
es: Hemos puesto en marcha la función [code]add_item()[/code] por ti.
fr: Nous avons commencé la fonction [code]add_item()[/code] pour vous.
it: Abbiamo iniziato la funzione [code]add_item()[/code] per te.
ja: [code]add_item()[/code]関数を開始しました。
pt: Iniciamos a função [code]add_item()[/code] para si.
tr: [code]add_item()[/code] (ekle_öğe) fonksiyonunu senin için başlattık.

source: The [code]inventory[/code] dictionary should use the [code]item_name[/code] parameter as the key to access its values, and we should increase the value by [code]amount[/code].
cs: Slovník [code]inventory[/code] by měl jako klíč pro přístup ke svým hodnotám používat parametr [code]item_name[/code] a hodnotu bychom měli zvýšit o [code]amount[/code].
da: Ordbogen [code]inventory[/code] skal bruge parameteren [code]item_name[/code] som nøgle til at få adgang til dens værdier, og vi skal øge værdien med [code]amount[/code].
es: El diccionario [code]inventory[/code] debe utilizar el parámetro [code]item_name[/code] como clave para acceder a sus valores, y debemos aumentar el valor en [code]amount[/code].
fr: Le dictionnaire [code]inventory[/code] doit utiliser le paramètre [code]item_name[/code] comme clé pour accéder à ses valeurs, et nous devons augmenter la valeur par [code]amount[/code].
it: Il dizionario [code]inventory[/code] dovrebbe usare il parametro [code]item_name[/code] come chiave per accedere ai valori e dovremmo incrementarne il valore di [code]amount[/code].
ja: [code]inventory[/code]辞書は、その値にアクセスするためのキーとして[code]item_name[/code]パラメータを使用する必要があり、値を[code]amount[/code]だけ増やす必要があります。
pt: O dicionário [code]inventory[/code] deve usar o parâmetro [code]item_name[/code] como chave para aceder os valores dele e devemos aumentar o valor usando [code]amount[/code].
tr: Önceden tanımlı [code]inventory[/code] (envanter) sözlüğünün değerlerine erişmek için anahtar olarak [code]item_name[/code] (öğe_ismi) alınan değişkenini kullanmalı, ve ilgili değeri [code]amount[/code] (miktar) kadar artırmalıyız.

source: To test this practice, we'll use your [code]add_item()[/code] function to increase the item count of Healing Heart, Gems, and Sword.
cs: Abychom si tento postup vyzkoušeli, použijeme funkci [code]add_item()[/code] ke zvýšení počtu položek Healing Heart, Gems a Sword.
da: For at teste denne praksis bruger vi din [code]add_item()[/code]-funktion til at øge antallet af genstande i Healing Heart, Gems og Sword.
es: Para probar esta práctica, utilizaremos tu función [code]add_item()[/code] para aumentar el conteo de la cantidad de [code]healing heart[/code], [code]gems[/code] y [code]sword[/code].
fr: Pour tester cette pratique, nous allons utiliser votre fonction [code]add_item()[/code] pour augmenter le nombre de Healing Heart, Gems, et Sword.
it: Per provare questa pratica, useremo la funzione [code]add_item()[/code] per aumentare la quantità di oggetti di Healing Heart, Gems e Sword.
ja: この方法をテストするために、[code]add_item()[/code]関数を使用して、体力回復、宝石、剣のアイテム数を増やします。
pt: Para testar essa prática, usaremos a sua função [code]add_item()[/code] para aumentar a contagem de itens de Healing Heart, Gems e Sword.
tr: Bu uygulamayı test etmek için [code]add_item()[/code] fonksiyonunu kullanarak Şifalı Kalp ("healing heart"), Mücevherler ("gems") ve Kılıç ("sword") öğe sayısını artıracağız.

source: The player might walk over a pick-up or find something in a chest, so we need a way to change the item counts in our inventory.
cs: Hráč může přejít přes pick-up(předmět ke zvednutí) nebo najít něco v truhle, takže potřebujeme způsob, jak změnit počty předmětů v našem inventáři.
da: Spilleren går måske hen over et pickup eller finder noget i en kiste, så vi har brug for en måde at ændre antallet af genstande i vores lager.
es: El jugador podría recoger un objeto o encontrar algo en un cofre, por lo que necesitamos una forma de actualizar el recuento de objetos en nuestro inventario.
fr: Il se peut que le joueur marche sur un pick-up ou trouve quelque chose dans un coffre, nous avons donc besoin d'un moyen de modifier le nombre d'objets dans notre inventaire.
it: Il giocatore potrebbe camminare sopra un oggetto fluttuante o trovare qualcosa in una cassa, dunque abbiamo bisogno di un modo per cambiare il conteggio degli oggetti nel nostro inventario.
ja: プレイヤーが拾った場所を歩いたり、チェストの中に何かを見つけたりする可能性があるため、インベントリのアイテム数を変更する方法が必要です。
pt: O jogador pode passar por cima de um item ou encontrar algo num baú, então precisamos de uma maneira de alterar a contagem de itens em nosso inventário.
ru: Игрок может поднять предмет с пола или найти что-то в сундуке, поэтому нам нужен способ изменить количество предметов в инвентаре.
ta: வீரர் ஒரு பிக்-அப் மீது நடக்கலாம் அல்லது மார்பில் ஏதாவது ஒன்றைக் காணலாம், எனவே எங்கள் சரக்குகளில் உள்ள உருப்படி எண்ணிக்கையை மாற்ற எங்களுக்கு ஒரு வழி தேவை.
tr: Oyuncu, yerdeki alınabilir bir eşyanın üzerinden geçebilir, veya bir sandıkta bir şey bulabilir, bu yüzden envanterimizdeki eşya sayılarını değiştirmenin bir yoluna ihtiyacımız var.
uk: Гравець може пройти через пікап або знайти щось у скрині, тому нам потрібен спосіб змінити кількість предметів у нашому інвентарі.
zh_hant: 玩家可能會走過可拾取的物品或在箱子裡找到東西，因此我們需要一種方法來改變物品庫中的物品數量。

source: Creating Dictionaries
cs: Vytváření slovníků
da: Oprettelse af ordbøger
es: Creación de diccionarios
fr: Création de dictionnaires
it: Creare Dizionari
ja: 辞書の作成
pt: Criando Dicionários
ru: Создание словарей
ta: அகராதிகளை உருவாக்குதல்
tr: Sözlükler Oluşturmak
uk: Створення словників
zh_hant: 創建字典

source: In the last lesson, we used an array to represent a player's inventory. With just an array of item names, though, we can't easily keep track of the amount of each item. Instead, we can bundle the item names and amounts into a single [i]dictionary[/i]. A dictionary is a data structure that allows you to map pairs of values. In the pair, we call the first value a [i]key[/i] as we use it to access the second. In other words, a dictionary has a list of [i]keys[/i], and each key points to a [i]value[/i]. To define a dictionary, we use curly brackets. A colon separates each key and its value. A comma separates each key and value pair.
ru: В последнем уроке мы использовали массив для представления инвентаря игрока. Однако, в массиве, содержащем только названия предметов, отслеживать количество предметов каждого типа очень непросто. Вместо этого мы можем объединить названия предметов и их количество в один [i]словарь[/i]. Словарь (dictionary) — это структура данных, которая позволяет вам сопоставлять пары значений. Первое значение в паре мы называем [i]ключом[/i], оно используется для получения второго значения пары. Другими словами, словарь содержит в себе список [i]ключей[/i], а каждый ключ указывает на какое-то [i]значение[/i]. Для определения словаря используются фигурные скобки. Ключ и его значение отделяются друг от друга двоеточием. Пары ключ-значение отделяются друг от друга запятыми.
ta: கடைசி பாடத்தில், ஒரு வீரரின் சரக்குகளை குறிக்க ஒரு வரிசையைப் பயன்படுத்தினோம். உருப்படி பெயர்களின் வரிசையுடன், ஒவ்வொரு பொருளின் அளவையும் நாம் எளிதாகக் கண்காணிக்க முடியாது. அதற்கு பதிலாக, நாம் உருப்படி பெயர்களையும் அளவுகளையும் ஒற்றை [i] அகராதியாக மாற்றலாம் [/i]. ஒரு அகராதி என்பது ஒரு தரவு கட்டமைப்பாகும், இது சோடிகளின் மதிப்புகளை வரைபட அனுமதிக்கிறது. இந்த சோடியில், முதல் மதிப்பை [i] விசையை [/i] என்று அழைக்கிறோம். வேறு வார்த்தைகளில் கூறுவதானால், ஒரு அகராதியில் [i] விசைகள் [/i] இன் பட்டியல் உள்ளது, மேலும் ஒவ்வொரு முக்கியமும் ஒரு [i] மதிப்பை சுட்டிக்காட்டுகிறது [/i]. ஒரு அகராதியை வரையறுக்க, நாங்கள் சுருள் அடைப்புக்குறிகளைப் பயன்படுத்துகிறோம். ஒரு பெருங்குடல் ஒவ்வொரு விசையையும் அதன் மதிப்பையும் பிரிக்கிறது. ஒரு கமா ஒவ்வொரு விசை மற்றும் மதிப்பு சோடியையும் பிரிக்கிறது.
uk: У минулому уроці ми використовували масив для представлення інвентарю гравця. Однак, маючи лише назви елементів, ми не можемо легко відстежити кількість кожного елемента. Натомість ми можемо об’єднати назви елементів і суми в один [i]словник[/i]. Словник — це структура даних, яка дозволяє відображати пари значень. У парі ми називаємо перше значення [i]ключем[/i], оскільки використовуємо його для доступу до другого. Іншими словами, у словнику є список [i]ключів[/i], і кожен ключ вказує на [i]значення[/i]. Для визначення словника ми використовуємо фігурні дужки. Двокрапка розділяє кожен ключ і його значення. Кома відділяє кожну пару ключів і значень.
zh_hant: 在前面的課程中，我們使用陣列來表示玩家的背包。 然而僅僅用一個物品名稱的陣列，我們無法輕鬆追蹤每個物品的數量。 相反地我們可以將物品名稱和數量綁定在一起，放進一個單一的[b]字典(dictionary)[/b]中。 字典是一種資料結構，允許你將一對值映射在一起。在這對值中，我們稱第一個值為[b]鍵(key)[/b]，因為我們用它來存取第二個值。 換句話說，字典擁有一組[b]鍵(key)[/b]，每個鍵都指向一個[b]值(value)[/b]。 要定義一個字典，我們使用大括號。每個鍵與其對應的值之間用冒號分隔，而每對鍵值組則用逗號分隔。
