Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-10-the-game-loop.po
Languages: cs, da, de, es, fr, ja, pt, ru, ta, tr, uk, zh_hant

source: As we've seen, Godot has functions that do certain actions. For example, the [code]show()[/code] and [code]hide()[/code] functions change the visibility of things.
da: Som vi har set, har Godot funktioner, der udfører visse handlinger. For eksempel, [code]show()[/code] og [code]hide()[/code] funktioner ændrer synligheden af tingene.
fr: Comme nous l'avons vu, Godot a des fonctions qui effectuent certaines actions. Par exemple, les fonctions [code]show()[/code] et [code]hide()[/code] changent la visibilité des choses.
ja: これまで見てきたように、Godotには特定のアクションを実行する関数があります。たとえば、[code]show()[/code] 関数と [code]hide()[/code] 関数は、モノの可視性を変更します。
pt: Como vimos, A Godot possui funções que realizam determinadas ações. Por exemplo, as funções [code]show()[/code] e [code]hide()[/code] mudam a visibilidade das coisas.
tr: Şimdiye kadar gördüğümüz gibi, Godot'nun belirli eylemleri gerçekleştiren kendi fonksiyonları var. Örneğin, [code]show()[/code] (göster) ve [code]hide()[/code] (gizle) fonksiyonları nesnelerin görünürlüğünü değiştirir.

source: We can also create our own functions to make custom effects like adding or removing health to a character.
da: Vi kan også oprette vores egne funktioner til at udfører brugerdefinerede effekter som at tilføje eller fjerne sundhed til en figur.
fr: Nous pouvons également créer nos propres fonctions pour réaliser des effets personnalisés, comme ajouter ou retirer de la santé à un personnage.
ja: また、独自の関数を作成して、キャラクターの体力を追加または削除するなどのカスタム効果を作成することもできます。
pt: Também podemos criar as nossas próprias funções para criar efeitos personalizados, como adicionar ou remover a vida de uma personagem.
tr: Ayrıca, bir karaktere sağlık eklemek veya çıkarmak gibi özel yapım etkiler oluşturmak için, kendi fonksiyonlarımızı da oluşturabiliriz.

source: Godot also has special functions we can customize or add to.
da: Godot har også særlige funktioner, vi kan tilpasse eller tilføje til.
fr: Godot a également des fonctions spéciales que nous pouvons personnaliser ou auxquelles nous pouvons ajouter du code.
ja: Godotには、カスタマイズまたは追加できる特別な機能もあります。
pt: A Godot também tem funções especiais que podemos personalizar ou acrescentar algo a mais nelas.
tr: Godot ayrıca, özelleştirebileceğimiz veya üzerine ekleyebileceğimiz özel fonksiyonlara da sahiptir.

source: Take the [code]_process()[/code] function.
da: Tag funktionen [code]_process()[/code].
fr: Par exemple, prenons la fonction [code]_process()[/code].
ja: [code]_process()[/code]関数を取ります。
pt: Olhe a função [code]_process()[/code] por exemplo.
tr: [code]_process()[/code] fonksiyonunu ele alalım.

source: The [code]_process()[/code] function gets its name because it does calculations or continuous actions.
da: [code]_process()[/code] funktionen har fået sit navn, fordi den udfører beregninger eller kontinuerlige handlinger.
fr: La fonction [code]_process()[/code] doit son nom au fait qu'elle effectue des calculs ou des actions continues.
ja: [code]_process()[/code] 関数は、計算または連続アクションを実行するため、その名前が付けられています。
pt: A função [code]_process()[/code] recebe esse nome porque faz cálculos ou ações contínuas.
tr: [code]_process()[/code] (işleme) fonksiyonu, hesaplamalar veya sürekli eylemler yaptığı için bu adı almıştır.

source: It's like a juice factory that [b]processes[/b] juice bottles: the bottles are always moving along a conveyor belt, while different machines operate on them.
da: Det er som en juice fabrik, der [b]processer[/b] juiceflasker: flaskerne bevæger sig altid langs et transportbånd, mens forskellige maskiner behandler dem.
fr: C'est comme une usine de jus de fruits qui traite ([b]« process »[/b] en anglais) des bouteilles de jus : les bouteilles se déplacent toujours le long d'un tapis roulant, tandis que différentes machines opèrent sur elles.
ja: これは、ジュースのボトルを[b]処理[/b]するジュース工場のようなもので、ボトルは常にベルトコンベアに沿って移動し、さまざまな機械が稼働しています。
pt: É como uma fábrica de sumo que [b]processa[/b] garrafas de sumo: as garrafas estão sempre se movendo ao longo de uma esteira transportadora, enquanto diferentes máquinas operam sobre elas.
tr: Tıpkı, meyve suyu şişelerini [b]işleyen[/b] bir meyve suyu fabrikası gibi: şişeler, farklı makineler tarafından üzerlerinde işlem yapılırken, her zaman bir taşıma bandı boyunca hareket eder.

source: It's similar in Godot, but this function can run [b]hundreds of times a second[/b].
cs: V Godotu je to podobné, ale tato funkce může běžet [b] stokrát za sekundu [/b].
da: Det er lignende i Godot, men denne funktion kan køre [b]hundrede vis af gange i sekundet[/b].
de: Es ist ähnlich in Godot, aber diese Funktion kann [b]hunderte Male pro Sekunde[/b] ausgeführt werden.
es: Es similar en Godot, pero esta función puede ejecutarse [b]cientos de veces por segundo[/b].
fr: C'est similaire dans Godot, mais cette fonction peut s'exécuter [b]des centaines de fois par seconde[/b].
ja: Godotでも同様ですが、この関数は1秒間に[b]数百回[/b]実行できます。
pt: Esse processo funciona de forma parecida dentro da Godot, mas essa função pode ser executada [b]centenas de vezes por segundo[/b].
ru: В Godot происходит нечто похожее, но эта функция может выполняться [b]сотни раз в секунду[/b].
ta: இது கோடோட்டில் ஒத்திருக்கிறது, ஆனால் இந்த செயல்பாடு ஒரு நொடிக்கு நூற்றுக்கணக்கான முறை [/b] இயக்க முடியும்.
tr: Bu Godot için de benzerdir, ancak bu fonksiyon, [b]bir saniyede yüzlerce kez çalışabilir[/b].
uk: В Godot відбувається щось схоже, але ця функція може виконуватися [b]сотні разів за секунду[/b].
zh_hant: 在 Godot 中也類似，但這個函式可以每秒執行[b]數百次[/b]。

source: How many parameters does this function take?
cs: Kolik parametrů tato funkce vyžaduje?
da: Hvor mange parametre tager denne funktion?
de: Wie viele Parameter benötigt diese Funktion?
es: ¿Cuántos parámetros toma esta función?
fr: Combien de paramètres prend cette fonction ?
ja: この関数はいくつのパラメータを取りますか?
pt: Quantos parâmetros essa função pode ter?
ru: Сколько параметров принимает эта функция?
ta: இந்த செயல்பாடு எத்தனை அளவுருக்கள் எடுக்கும்?
tr: Bu fonksiyonun kaç tane alınan değişkeni var?
uk: Скільки параметрів приймає ця функція?
zh_hant: 這個函式有多少個參數？

source: The [code]_process()[/code] function takes one parameter: [code]delta[/code].
da: Funktionen [code]_process()[/code] tager én parameter: [code]delta[/code].
fr: La fonction [code]_process()[/code] prend un paramètre : [code]delta[/code].
ja: [code]_process()[/code] 関数は [code]delta[/code] という 1 つのパラメーターを取ります。
pt: A função [code]_process()[/code] recebe um parâmetro: [code]delta[/code].
tr: [code]_process()[/code] fonksiyonunun bir tane alınan değeri var: [code]delta[/code].

source: We'll look at what [code]delta[/code] is in the next lesson, as well as show how to use it.
da: Vi vil se på, hvad [code]delta[/code] er i den næste lektion, samt vise, hvordan man bruger den.
fr: Nous verrons ce qu'est [code]delta[/code] dans la prochaine leçon et montrerons comment l'utiliser.
ja: 次のレッスンでは、[code]delta[/code]とは何か、そしてその使い方を紹介します。
pt: Vamos ver o que é [code]delta[/code] na próxima lição, além de mostrar-lhe como usá-lo.
tr: Bir sonraki derste [code]delta[/code] 'nın (küçük miktar) ne olduğuna tekrar bakacağız ve nasıl kullanılacağını göstereceğiz.

source: The [code]_process()[/code] function won't do anything until we add something to it.
da: Funktionen [code]_process()[/code] gør ikke noget, før vi tilføjer noget til den.
fr: La fonction [code]_process()[/code] ne fera rien tant que nous ne lui ajouterons pas quelque chose.
ja: [code]_process()[/code]関数は、何かを追加するまで何もしません。
pt: A função [code]_process()[/code] não vai fazer nada até que adicionemos algo nela.
tr: [code]_process()[/code] fonksiyonu, biz ona bir şey ekleyene kadar hiçbir şey yapmayacaktır.

source: You might notice the underscore [code]_[/code] in front of the function name. This is a convention programmers use to coordinate work, and it'll only make sense once you have experience coding in Godot.
da: Du bemærker måske understregningen [code]_[/code] foran funktionsnavnet. Dette er en konvention, som programmører bruger til at koordinere arbejde, og den giver kun mening, når du har erfaring med kodning i Godot.
fr: Vous remarquerez peut-être le tiret bas [code]_[/code] devant le nom de la fonction. Il s'agit d'une convention que les programmeurs utilisent pour coordonner leur travail et qui n'aura de sens qu'une fois que vous aurez acquis de l'expérience en matière de codage dans Godot.
ja: 関数名の前にアンダースコア [code]_[/code] があることに気付くかもしれません。これは、プログラマーが作業を調整するために使用する規則であり、Godotでのコーディングの経験がある場合にのみ意味があります。
tr: Fonksiyon adının önündeki alt çizgiyi, [code]_[/code], fark etmişsinizdir. Bu, programcıların işleri uyumlu çalıştırmak için kullandıkları bir gelenektir, ve ancak Godot'da kodlama deneyiminiz olduğunda anlam kazanacaktır.

source: For now, all you need to know is that if the function exists in your code, and it is called precisely [code]_process[/code], then Godot will automatically run it every [i]frame[/i].
da: For nu er alt, hvad du behøver at vide, at hvis funktionen findes i din kode, og den kaldes præcis [code]_process[/code], så vil Godot automatisk køre den hver [i]frame[/i].
fr: Pour l'instant, tout ce que vous devez savoir, c'est que si la fonction existe dans votre code, et qu'elle est appelée précisément [code]_process[/code], alors Godot l'exécutera automatiquement à chaque [i]frame[/i] (image).
ja: 今のところ、知っておく必要があるのは、関数がコードに存在し、それが正確に[code]_process [/code]と呼ばれる場合、Godotは[i]フレーム[/i]ごとに自動的に実行するということです。
tr: Şimdilik bilmeniz gereken tek şey, bu fonksiyon kodunuzda mevcutsa, ve tam olarak [code]_process[/code] ismiyle çağrılırsa, o zaman Godot, bunu her oyun karesinde, [i]frame[/i], otomatik olarak çalıştıracaktır.

source: When Godot draws on the screen, we call that a frame.
da: Når Godot tegner på skærmen, kalder vi det en frame.
fr: Lorsque Godot dessine sur l'écran, nous appelons cela une image.
ja: Godotが画面に描画するとき、それをフレームと呼びます。
tr: Godot ekrana çizim yaptığında, buna bir çerçeve, ya da oyun karesi (frame), diyoruz.

source: Is this the same for other engines?
cs: Je to stejné i u jiných herních enginů?
da: Er dette det samme for andre motorer?
de: Ist das auch so für andere Engines?
fr: Est-ce la même chose pour les autres moteurs ?
ja: これは他のエンジンでも同じですか?
ru: На других движках то же самое?
ta: மற்ற இயந்திரங்களுக்கும் இதுவேதா?
tr: Bu diğer motorlar için de aynı mı?
uk: Чи так само на інших рушіях?
zh_hant: 其他遊戲引擎也是這樣嗎？

source: Other game engines might use different names like [code]_update()[/code].
cs: Jiné herní enginy mohou používat jiné názvy jako [code]_update()[/code].
da: Andre spilmotorer bruger muligvis andre navne som [code]_update()[/code].
de: Andere Spiel-Engines verwenden möglicherweise andere Namen wie [code]_update()[/code].
es: Otros motores de juegos pueden utilizar nombres diferentes como [code]_update()[/code].
fr: D'autres moteurs de jeu peuvent utiliser des noms différents comme [code]_update()[/code].
ja: 他のゲームエンジンでは、[code]_update()[/code]のように異なる名前を使用する場合があります。
pt: Outras engines de jogos podem usar nomes diferentes, como [code]_update()[/code].
ru: Другие игровые движки для тех же целей могут использовать функции с другими названиями, например [code]_update()[/code].
ta: பிற விளையாட்டு இயந்திரங்கள் [குறியீடு] _Update () [/code] போன்ற வெவ்வேறு பெயர்களைப் பயன்படுத்தலாம்.
tr: Diğer oyun motorları, [code]_update()[/code] (güncelle) gibi farklı isimler kullanabilir.
uk: Інші ігрові рушії з цією ж метою можуть використовувати функції з іншими назвами, наприклад [code]_update()[/code].
zh_hant: 其他遊戲引擎可能會使用不同的名稱，例如 [code]_update()[/code]。

source: Why is the _process() function useful?
cs: Proč je funkce _process() užitečná?
da: Hvorfor er _process()-funktionen nyttig?
de: Warum ist die Funktion _process() nützlich?
es: ¿Por qué es útil la función _process()?
fr: Pourquoi la fonction _process() est-elle utile ?
ja: _process()関数が便利なのはなぜですか?
pt: Por que a função _process() é útil?
ru: Чем полезна функция _process()?
ta: _ -பதவி () செயல்பாடு ஏன் பயனுள்ளதாக இருக்கும்?
tr: _process() fonksiyonu neden yararlıdır?
uk: Чим корисна функція _process()?
zh_hant: 為什麼 _process() 函式很有用？

source: It's perhaps better to see the [code]_process()[/code] function in action.
da: Det er måske bedre at se funktionen [code]_process()[/code] i aktion.
fr: Il est peut-être préférable de voir la fonction [code]_process()[/code] en action.
ja: [code]_process()[/code]関数が動作しているのを見た方が良いかもしれません。
pt: Talvez seja melhor ver a função [code]_process()[/code] em ação.
tr: [code]_process()[/code] fonksiyonunu çalışırken görmek belki daha iyi olacaktır.

source: Take the following example.
da: Tag følgende eksempel.
fr: Prenons l'exemple suivant.
ja: 次の例を見てください。
pt: Tome o seguinte exemplo.
tr: Aşağıdaki örneği ele alalım.

source: When you click the button [code]set_process(true)[/code], you activate processing on the robot.
da: Når du klikker på knappen [code]set_process(true)[/code], aktiverer du bearbejdningen på robotten.
fr: Lorsque vous cliquez sur le bouton [code]set_process(true)[/code], vous activez le traitement sur le robot.
ja: [code]set_process(true)[/code]ボタンをクリックすると、ロボットの処理がアクティブになります。
pt: Ao clicar no botão [code]set_process(true)[/code], ativa o processamento no robô.
tr: [code]set_process(true)[/code] ("ayarla_işlem(doğru)") düğmesine tıklarsanız, robot üzerinde işlem yapmayı etkinleştirirsiniz.

source: From there, every frame, Godot runs the [code]_process()[/code] function.
da: Derfra kører Godot funktionen [code]_process()[/code] i hver frame.
fr: À partir de là, à chaque image, Godot exécute la fonction [code]_process()[/code].
ja: そこから、フレームごとに、Godotは[code]_process()[/code]関数を実行します。
pt: A partir daí, a cada frame, a Godot executa a função [code]_process()[/code].
tr: Bundan sonra Godot, her karede [code]_process()[/code] fonksiyonunu çalıştırır.

source: Since we wrote a [code]rotate()[/code] instruction, Godot is rotating the character by [code]0.05[/code] radians [b]many[/b] times a second.
da: Da vi skrev en [code]rotate()[/code] instruktion, roterer Godot tegnet med [code]0,05[/code] radianer [b]mange[/b] gange i sekundet.
fr: Comme nous avons écrit une instruction [code]rotate()[/code], Godot fait tourner le personnage de [code]0.05[/code] radians [b]plusieurs[/b] fois par seconde.
ja: [code]rotate()[/code]命令を書いたので、Godotは1秒間に[b]何度[/b]も[code]0.05[/code]ラジアンで文字を回転させています。
pt: Como escrevemos uma instrução [code]rotate()[/code], a Godot gira a personagem em [code]0.05[/code] radianos [b]muitas[/b] vezes por segundo.
tr: Bir [code]rotate()[/code] (döndür) komutu yazdığımız için, Godot, karakteri, saniyede [b]birçok kez[/b] [code]0,05[/code] radyan kadar döndürüyor.

source: How often does the _process() function run?
cs: Jak často se spouští funkce _process()?
da: Hvor ofte kører _process()-funktionen?
de: Wie oft wird die Funktion _process() aufgerufen?
es: ¿Con qué frecuencia se ejecuta la función _process()?
fr: À quelle fréquence la fonction _process() est-elle exécutée ?
ja: _process() 関数はどのくらいの頻度で実行されますか?
pt: Com que frequência a função _process() é executada?
ru: Как часто выполняется функция _process()?
ta: _PROCESS () செயல்பாடு எத்தனை முறை இயங்குகிறது?
tr: _process() fonksiyonu ne sıklıkla çalışır?
uk: Як часто виконується функція _process()?
zh_hant: _process() 函式的執行頻率是？

source: The faster your computer, the more times [code]_process()[/code] will run.
da: Jo hurtigere din computer er, desto flere gange vil [code]_process()[/code] køre.
fr: Plus votre ordinateur est rapide, plus le nombre d'exécutions de [code]_process()[/code] sera élevé.
ja: コンピュータが高速であればあるほど、[code]_process()[/code]の実行回数が多くなります。
pt: Quanto mais rápido o seu computador for, mais vezes a função [code]_process()[/code] será executada.
tr: Bilgisayarınız ne kadar hızlıysa, [code]_process()[/code] o kadar çok çalışacaktır.

source: Godot will try and run [code]_process()[/code] as quickly as it can. This makes sure any movement or animations look smooth and fluid.
da: Godot vil forsøge at køre [code]_process()[/code] så hurtigt som muligt. Dette sikrer, at enhver bevægelse eller animation ser jævn og flydende ud.
fr: Godot essaiera d'exécuter [code]_process()[/code] aussi rapidement que possible. Cela permet de s'assurer que les mouvements ou les animations auront un aspect doux et fluide.
ja: Godotは[code]_process()[/code]をできるだけ早く実行しようとします。これにより、動きやアニメーションが滑らかで滑らかに見えるようになります。
pt: A Godot tentará executar a função [code]_process()[/code] o mais rápido possível. Isso garante que qualquer movimento ou animação pareça suave e fluido.
tr: Godot, [code]_process()[/code] fonksiyonunu olabildiğince hızlı çalıştırmayı deneyecektir. Bu, herhangi bir hareketin veya hareketli görüntünün (animasyon) pürüzsüz ve akıcı görünmesini sağlar.

source: Once a second.
cs: Jednou za sekundu.
da: En gang i sekundet.
de: Einmal pro Sekunde.
es: Una vez por segundo.
fr: Une fois par seconde.
ja: 一秒に一回。
pt: Uma vez por segundo.
ru: Раз в секунду.
ta: ஒரு நொடி.
tr: Saniyede bir kez.
uk: Раз на секунду.
zh_hant: 一秒鐘一次。

source: Multiple times a second.
cs: Několikrát za sekundu.
da: Flere gange i sekundet.
de: Mehrmals pro Sekunde.
es: Varias veces por segundo.
fr: Plusieurs fois par seconde.
ja: 1秒間に複数回。
pt: Várias vezes por segundo.
ru: Несколько раз в секунду.
ta: ஒரு நொடி பல முறை.
tr: Saniyede birçok kez.
uk: Кілька разів на секунду.
zh_hant: 每秒執行很多次。

source: In the practice, you'll learn how to use the process function to rotate and move a character yourself.
cs: V tomto cvičení se naučíte, jak pomocí funkce Process otáčet a přesouvat postavu.
da: I øvelsen lærer du, hvordan du bruger procesfunktionen til selv at rotere og flytte en karakter.
de: In den Übungen lernst du, wie du die Prozessfunktion verwendest, um einen Charakter selbst zu drehen und zu bewegen.
es: En la práctica, aprenderás cómo utilizar la función [code]_process()[/code] para girar y mover un personaje tú mismo.
fr: Dans la pratique, vous apprendrez à utiliser la fonction [code]_process()[/code] pour faire pivoter et déplacer un personnage.
ja: 演習では、プロセス機能を使用して、キャラクターを自分で回転および移動する方法を学びます。
pt: Na lição de prática, vai aprender a usar a função process para rotacionar e mover uma personagem você mesmo.
ru: В упражнении вы самостоятельно научитесь использовать функцию process для вращения и перемещения персонажа.
ta: நடைமுறையில், ஒரு பாத்திரத்தை நீங்களே சுழற்றவும் நகர்த்தவும் செயல்முறை செயல்பாட்டை எவ்வாறு பயன்படுத்துவது என்பதை நீங்கள் கற்றுக்கொள்வீர்கள்.
tr: Bu uygulamada, bir karakteri döndürmeniz ve taşımanız için, bu "_process" fonksiyonunu nasıl kullanacağınızı öğreneceksiniz.
uk: У вправі ви навчитеся використовувати функцію process для обертання та переміщення персонажа.
zh_hant: 在這個練習中，你將學會如何使用 process 函式來旋轉和移動角色。

source: Rotating a Character Continuously
cs: Nepřetržité otáčení postavy
da: Kontinuerlig Rotation af en Karakter
de: Kontinuierliches Drehen eines Charakters
es: Girar un personaje de forma continua
fr: Faire pivoter un personnage en continu
ja: 文字の連続回転
pt: Rotacionar uma Personagem de Maneira Contínua
ru: Непрерывное вращение персонажа
ta: ஒரு பாத்திரத்தை தொடர்ந்து சுழற்றுகிறது
tr: Bir Karakteri Sürekli Döndürme
uk: Неперервне обертання персонажа
zh_hant: 持續旋轉腳色

source: Make the robot rotate slowly by adding to the [code]_process()[/code] function.
da: Få robotten til at rotere langsomt ved at tilføje det til funktionen [code]_process()[/code].
fr: Faites tourner le robot lentement en ajoutant du code à la fonction [code]_process()[/code].
ja: [code]_process()[/code]関数を追加して、ロボットをゆっくり回転させます。
pt: Faça o robô rotacionar lentamente adicionando algo na função [code]_process()[/code].
tr: [code]_process()[/code] fonksiyonuna ekleme yaparak, robotun yavaşça dönmesini (rotate) sağlayın.

source: A rotation speed of about [code]0.05[/code] each frame should do.
da: En rotationshastighed på omkring [code]0,05[/code] pr. frame burde være tilstrækkelig.
fr: Une vitesse de rotation d'environ [code]0.05[/code] par image devrait suffire.
ja: 各フレームの回転速度は約[code]0.05[/code]で十分です。
pt: Uma velocidade de rotação com cerca de [code]0.05[/code] por frame deve ser suficiente.
tr: Her karede yaklaşık [code]0,05[/code] dönüş hızı yeterli olacaktır.

source: Creating Circular Movement
cs: Vytváření kruhového pohybu
da: Oprettelse af Cirkulær Bevægelse
de: Kreisförmige Bewegungungen erzeugen
es: Crear un movimiento circular
fr: Créer un mouvement circulaire
ja: 円運動の作成
pt: Criando Movimento Circular
ru: Создание кругового движения
ta: வட்ட இயக்கத்தை உருவாக்குதல்
tr: Dairesel Hareket Oluşturmak
uk: Створення колового руху
zh_hant: 實現圓周運動

source: Make the robot move in a large circle slowly by rotating it and simultaneously moving it along its x direction.
da: Få robotten til at bevæge sig langsomt i en stor cirkel ved at rotere den og samtidig bevæge den langs dens x-retning.
fr: Faites en sorte que le robot se déplace lentement dans un grand cercle en le faisant tourner et en le déplaçant simultanément dans sa direction x.
ja: ロボットを回転させ、同時にx方向に沿って動かすことで、大きな円を描くようにゆっくりと動かします。
pt: Faça o robô se mover lentamente num grande círculo girando e movendo ele simultaneamente ao longo da direção dele no eixo x.
tr: Robotu, aynı anda hem yavaşça döndürerek ve hem de kendi yerel x yönü (bize göre olan x yönü değil) boyunca hareket ettirerek, büyük bir daire içinde yavaşça hareket etmesini sağlayın.

source: To do this, add the [code]rotate()[/code] and [code]move_local_x()[/code] functions to [code]_process()[/code].
da: For at gøre dette skal du tilføje funktionerne [code]rotate()[/code] og [code]move_local_x()[/code] til [code]_process()[/code].
fr: Pour ce faire, ajoutez les fonctions [code]rotate()[/code] et [code]move_local_x()[/code] à [code]_process()[/code].
ja: これを行うには、[code]rotate()[/code] 関数と [code]move_local_x()[/code] 関数を [code]_process()[/code] に追加します。
pt: Para fazer isso, adicione as funções [code]rotate()[/code] e [code]move_local_x()[/code] na função [code]_process()[/code].
tr: Bunu yapmak için, [code]rotate()[/code] (döndür) ve [code]move_local_x()[/code] (yerel x üzerinde ilerlet) fonksiyonlarını [code]_process()[/code] öğesine ekleyin.

source: Use a rotation speed of [code]0.05[/code] radians per frame, and move the robot [code]5[/code] pixels per frame.
da: Brug en rotationshastighed på [code]0,05[/code] radianer pr. frame, og bevæg robotten [code]5[/code] pixels pr. frame.
fr: Utilisez une vitesse de rotation de [code]0.05[/code] radians par image et déplacez le robot de [code]5[/code] pixels par image.
ja: 1フレームあたり[code]0.05[/code]ラジアンの回転速度を使用し、1フレームあたり[code]5[/code]ピクセルずつロボットを動かします。
pt: Use uma velocidade de rotação de [code]0,05[/code] radianos por frame e mova o robô [code]5[/code] pixels por frame.
tr: Kare başına [code]0,05[/code] radyan dönüş hızı kullanın, ve robotu kare başına [code]5[/code] piksel hareket ettirin.

source: The Game Loop
cs: Herní smyčka
da: Spilleløkken
de: Die Spielschleife
es: El bucle del juego
fr: La boucle du jeu
ja: ゲームループ
pt: O Loop do Jogo
ru: Игровой цикл
ta: விளையாட்டு வளையம்
tr: Oyun Döngüsü
uk: Ігровий цикл
zh_hant: 遊戲循環

source: You might notice the underscore [code]_[/code] in front of the function name. This is a convention. It means the function is already defined by Godot.
pt: Pode notar o sinal de underscore [code]_[/code] na frente do nome da função. Isso é uma convenção. Isso significa que a função já foi definida pela própria Godot.

source: If the function exists, and is called exactly [code]_process[/code], then Godot will automatically run it every frame.
pt: Se a função existir e for chamada exatamente [code]_process[/code], então a Godot vai executar ela automaticamente a cada frame.
