Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-26-looping-over-dictionaries.po
Languages: cs, da, de, it, ja, pt, pt_br, ru, ta, tr, uk, zh_hant

source: To do so, call the [code]display_item()[/code] function. It takes two arguments: the item name and the amount.
da: For at gøre dette skal du kalde funktionen [code]display_item()[/code]. Den kræver to argumenter: genstandsnavnet og mængden.
de: Rufe dazu die Funktion [code]display_item()[/code] auf. Diese Funktion wird mit zwei Argumenten aufgerufen: Dem Objektnamen und der Menge.
it: Per fare questo, chiama la funzione [code]display_item()[/code]. Necessita di due argomenti: il nome dell'oggetto e la sua quantità.
ja: これを行うには、[code]display_item()[/code] 関数を呼び出します。アイテム名と金額の 2 つの引数を取ります。
pt: Para fazer isso, chame a função [code]display_item()[/code]. São necessários dois argumentos: o nome do item e a quantidade.
pt_br: Para fazer isso, chame a função [code]display_item()[/code]. São necessários dois argumentos: o nome do item e a quantidade.
ru: Для отображения вызовите функцию [code]display_item()[/code]. Она принимает два аргумента: название предмета и количество.
tr: Bunu yapmak için [code]display_item()[/code] (görüntüle_öğe) fonksiyonunu çağırın. Bu fonksiyon iki girdi değişkeni gerektirir: öğenin ismi ve miktarı.
uk: Для цього викличте функцію [code]display_item()[/code]. Він приймає два аргументи: назву товару та суму.

source: We need to display the player's inventory on the screen but lack the code to do so. Use a loop to display every item.
cs: Potřebujeme zobrazit inventář hráče na obrazovce, ale chybí nám k tomu kód. K zobrazení každé položky použijte smyčku.
da: Vi skal vise spillerens lager på skærmen, men mangler koden til at gøre det. Brug et loop til at vise alle genstande.
de: Wir wollen das Inventar des Spielers auf dem Bildschirm anzeigen, aber uns fehlt der Code dafür. Verwende eine Schleife, um die Objekte anzuzeigen.
it: Dobbiamo visualizzare l'inventario del giocatore sullo schermo ma non abbiamo il codice per fare ciò. Usa un ciclo per rappresentare ogni oggetto.
ja: プレイヤーのインベントリを画面に表示する必要がありますが、そのためのコードがありません。ループを使用して、すべての項目を表示します。
pt: Precisamos exibir o inventário do jogador no ecrã, mas não temos o código para isso. Use um loop para exibir cada item.
pt_br: Precisamos exibir o inventário do jogador na tela, mas não temos o código para isso. Use um loop para exibir cada item.
ru: Нам нужно отобразить содержимое инвентаря игрока на экране, но у нас нет кода для этого. Используйте цикл для отображения каждого предмета.
ta: பிளேயரின் சரக்குகளை நாம் திரையில் காண்பிக்க வேண்டும், ஆனால் அவ்வாறு செய்வதற்கான குறியீடு இல்லை. ஒவ்வொரு பொருளையும் காண்பிக்க ஒரு வளையத்தைப் பயன்படுத்தவும்.
tr: Oyuncunun envanterini ekranda göstermemiz gerekiyor, ancak bunu yapmak için kodumuz yok. Her öğeyi görüntülemek için bir döngü kullanın.
uk: Нам потрібно відобразити інвентар гравця на екрані, але для цього немає коду. Використовуйте цикл, щоб відобразити кожен елемент.
zh_hant: 我們需要在畫面上顯示玩家的物品清單，但缺少相關程式碼。使用迴圈來顯示每個物品。

source: Placing units on the board
cs: Umístění jednotek na hrací plochu
da: Placering af enheder på spillepladen
de: Einheiten auf dem Spielfeld platzieren
it: Piazzando le unità sulla tavola
ja: ボードへのユニットの配置
pt: Colocando unidades no tabuleiro
pt_br: Colocando unidades no tabuleiro
ru: Размещение юнитов на доске
ta: பலகையில் அலகுகளை வைப்பது
tr: Birimleri tahtaya yerleştirmek
uk: Розміщення одиниць на дошці
zh_hant: 將單位放置在棋盤上

source: We have a dictionary named [code]units[/code] that maps a cell position on the grid to a unit to put there.
da: Vi har en ordbog med navnet [code]units[/code], der knytter en celleposition på gitteret til en enhed, der skal placeres der.
de: Wir haben ein Dictionary mit dem Namen [code]units[/code]. Dieser ordnet einer Einheit eine Zellenposition im Raster zu, um sie dort zu platzieren.
it: Abbiamo un dizionario chiamato [code]units[/code] che mappa una posizione nelle celle della griglia ad un'unità da posizionare al suo interno.
ja: グリッド上のセルの位置をそこに配置する単位にマッピングする[code]units[/code]という名前の辞書があります。
pt: Temos um dicionário chamado [code]units[/code] que mapeia uma posição de célula no grid para uma unidade a ser posta lá.
pt_br: Temos um dicionário chamado [code]units[/code] que mapeia uma posição de célula no grid para uma unidade a ser colocada lá.
ru: У нас есть словарь, имеющий имя [code]units[/code], который сопоставляет позицию на сетке с юнитом, которого нужно туда поставить.
tr: [code]units[/code] adında (birimler), ızgaradaki bir hücre konumunu, oraya koyacağımız bir birimle eşleyen bir sözlüğümüz var.
uk: У нас є словник під назвою [code]одиниці[/code], який відображає позицію клітинки на сітці на одиницю, яку потрібно туди додати.

source: Using a for loop and the [code]place_unit()[/code] function, place every unit in the units dictionary at the desired position on the game board.
da: Brug en for-løkke og funktionen [code]place_unit()[/code] til at placere hver enhed i enhedsordbogen på den ønskede position på spillebrættet.
de: Platziere mit einer for-Schleife und der Funktion [code]place_unit()[/code] jede Einheit im Dictionary an der gewünschten Position auf dem Spielfeld.
it: Usando un ciclo e la funzione [code]place_unit()[/code], piazza ogni unità nel dizionario delle unità alla posizione desiderata sulla tavola da gioco.
ja: for ループと [code]place_unit()[/code] 関数を使用して、単位辞書内のすべてのユニットをゲーム ボード上の目的の位置に配置します。
pt: Usando um loop for e a função [code]place_unit()[/code], ponha cada unidade no dicionário units na posição desejada no tabuleiro do jogo.
pt_br: Usando um loop for e a função [code]place_unit()[/code], coloque cada unidade no dicionário units na posição desejada no tabuleiro do jogo.
ru: Используйте цикл for и функцию [code]place_unit()[/code] для размещения каждого юнита из словаря в необходимую позицию на игровой доске.
tr: Bir for döngüsü ve [code]place_unit()[/code] (yerleştir_birim) fonksiyonunu kullanarak, birimler sözlüğündeki her birimi oyun tahtasında istenen konuma yerleştirin.
uk: Використовуючи цикл for і функцію [code]place_unit()[/code], розмістіть кожну одиницю в словнику одиниць у потрібну позицію на ігровому полі.

source: We want to populate our game board with units at the start of every battle. Loop over the dictionary to place units on the board.
cs: Na začátku každé bitvy chceme herní plán naplnit jednotkami. Smyčkou nad slovníkem umístěte jednotky na hrací plochu.
da: Vi ønsker at fylde vores spillebræt med enheder i starten af hver kamp. Loop over ordbogen for at placere enheder på brættet.
de: Wir wollen unser Spielfeld zu Beginn jedes Gefechts mit Einheiten füllen. Benutze eine Schleife, um die Einheiten im Dictionary auf dem Spielfeld zu platzieren.
it: Vogliamo popolare la nostra tavola da gioco con unità all'inizio di ogni scontro. Scansiona il dizionario con un ciclo per piazzare le unità sulla tavola.
ja: すべての戦闘の開始時にゲームボードにユニットを配置したいと考えています。辞書をループして、ボードにユニットを配置します。
pt: Queremos preencher nosso tabuleiro de jogo com unidades no início de cada batalha. Faça um loop sobre o dicionário para pôr as unidades no tabuleiro.
pt_br: Queremos preencher nosso tabuleiro de jogo com unidades no início de cada batalha. Faça um loop sobre o dicionário para colocar as unidades no tabuleiro.
ru: Мы хотим заполнять нашу игровую доску юнитами при начале каждого сражения. Переберите элементы словаря в цикле для размещения юнитов на доске.
ta: ஒவ்வொரு போரின் தொடக்கத்திலும் எங்கள் விளையாட்டு பலகையை அலகுகளுடன் விரிவுபடுத்த விரும்புகிறோம். போர்டில் அலகுகளை வைக்க அகராதியின் மீது சுழற்சி.
tr: Her savaşın başında, oyun tahtamızı birimlerle doldurmak istiyoruz. Birimleri tahtaya yerleştirmek için sözlüğün üzerinde döngü yapın.
uk: Ми хочемо заповнювати нашу ігрову дошку одиницями на початку кожного бою. Перейдіть по словнику, щоб розмістити одиниці на дошці.
zh_hant: 我們希望在每場戰鬥開始時將單位配置到棋盤。使用迴圈遍歷字典，將單位放置到棋盤上。

source: Looping over dictionaries
cs: Procházení slovníků
da: Looping hen over ordbøger
de: Schleifen für Dictionaries verwenden
it: Analizzando ciclicamente i dizionari
ja: 辞書のループ
pt: Loop em dicionários
pt_br: Loop em dicionários
ru: Обход словарей в цикле
ta: அகராதிகள் மீது சுழலும்
tr: Sözlükler üzerinde döngü kurmak
uk: Перегляд словників
zh_hant: 用迴圈遍歷字典

source: Instead, you can directly type the variable name in a [code]for[/code] loop after the [code]in[/code] keyword. The language understands that you implicitly want to loop over the dictionary's keys.
pt: Ao invés disso, pode digitar diretamente o nome da variável num loop [code]for[/code] após a palavra-chave [code]in[/code]. A linguagem entende que deseja fazer um loop sobre as chaves do dicionário implicitamente.

source: Like with arrays, you can loop over dictionaries. You can loop over both their keys and values. Let's see how it works with two examples.
cs: Stejně jako u polí můžete přes slovníky procházet smyčkou. Můžete procházet jak přes klíče, tak přes hodnoty. Podívejme se, jak to funguje na dvou příkladech.
ta: வரிசையைப் போலவே, நீங்கள் அகராதி மீது சுழற்றலாம். அவர்களின் சாவிகள் மற்றும் மதிப்புகள் இரண்டையும் நீங்கள் சுழற்றலாம். இது இரண்டு எடுத்துக்காட்டுகளுடன் எவ்வாறு செயல்படுகிறது என்று பார்ப்போம்.
zh_hant: 像處理陣列一樣，你也可以對字典進行迴圈處理。你可以對字典的鍵和值進行迴圈。 讓我們透過兩個範例來看看是如何運作的。

source: To display the player's inventory, you need to know what it contains. You need the name and amount of each object. And from code, you can only achieve that by looping over the whole dictionary and processing key-value pairs one by one. To get the list of keys in the dictionary, you can call its [code]keys()[/code] member function.
cs: Chcete-li zobrazit inventář hráče, musíte vědět, co obsahuje. Potřebujete název a množství každého předmětu. A toho z kódu dosáhnete pouze tak, že projdete celý slovník a postupně zpracujete dvojice klíč-hodnota. Chcete-li získat seznam klíčů ve slovníku, můžete zavolat jeho členskou funkci [code]keys()[/code].
ta: பிளேயரின் சரக்குகளைக் காட்ட, அதில் என்ன இருக்கிறது என்பதை நீங்கள் அறிந்து கொள்ள வேண்டும். ஒவ்வொரு பொருளின் பெயர் மற்றும் அளவு உங்களுக்கு தேவை. குறியீட்டிலிருந்து, முழு அகராதியையும் சுழற்றுவதன் மூலமும், முக்கிய மதிப்பு சோடிகளை ஒவ்வொன்றாக செயலாக்குவதன் மூலமும் மட்டுமே நீங்கள் அதை அடைய முடியும். அகராதியில் விசைகளின் பட்டியலைப் பெற, நீங்கள் அதன் [குறியீடு] விசைகள் () [/குறியீடு] உறுப்பினர் செயல்பாட்டை அழைக்கலாம்.
zh_hant: 要顯示玩家的物品清單，你需要知道它包含了什麼。也就是每個物品的名稱和數量。 而從程式碼中，你只能透過對整個字典進行迴圈，逐一處理鍵值對，來達成這個目的。 要獲得字典中的鍵列表，你可以呼叫它的 [code]keys()[/code] 成員函式。

source: But it's something we do so much that you don't need to call the function. Instead, you can directly [ignore]type the variable name in a [code]for[/code] loop after the [code]in[/code] keyword. The language understands that you implicitly want to loop over the dictionary's keys.
ta: ஆனால் இது நாங்கள் மிகவும் செய்யும் ஒன்று, நீங்கள் செயல்பாட்டை அழைக்க தேவையில்லை. அதற்கு பதிலாக, [/குறியீடு] முக்கிய சொற்களில் [/குறியீடு] க்குப் பிறகு [/குறியீடு] வளையத்திற்கான மாறி பெயரை நேரடியாக [புறக்கணிக்க] தட்டச்சு செய்யலாம். அகராதியின் சாவியை நீங்கள் மறைமுகமாக வளைய விரும்புகிறீர்கள் என்பதை மொழி புரிந்துகொள்கிறது.
zh_hant: 但這是我們做得非常頻繁的操作，因此你不需要特別呼叫函式。 相反地，你可以在 [code]for[/code] 迴圈中的 [code]in[/code] 關鍵字後直接使用變數名稱。程式語言會自動理解你是想對字典的鍵進行迴圈。

source: You can get the values with the syntax [code]dictionary[key][/code] as you learned in the previous lesson. We can loop over the inventory keys, get the corresponding values, and display all that information in the user interface.
cs: Hodnoty můžete získat pomocí syntaxe [code]dictionary[key][/code], jak jste se naučili v předchozí lekci. Můžeme procházet klíči inventáře, získat odpovídající hodnoty a zobrazit všechny tyto informace v uživatelském rozhraní.
ta: முந்தைய பாடத்தில் நீங்கள் கற்றுக்கொண்டபடி தொடரியல் [குறியீடு] அகராதி [விசை] [/குறியீடு] மூலம் மதிப்புகளைப் பெறலாம். சரக்கு விசைகளை நாம் வளையலாம், தொடர்புடைய மதிப்புகளைப் பெறலாம் மற்றும் பயனர் இடைமுகத்தில் அந்த எல்லா தகவல்களையும் காண்பிக்கலாம்.
zh_hant: 你可以使用語法 [code]dictionary[key][/code] 來取得對應的值，這是你在前一課學過的內容。 我們可以對物品庫的鍵進行迴圈，取得對應的值，並將所有資訊顯示在使用者介面上。

source: We can also use a dictionary to map units to their position on a game board. That's how you'd typically code a board game, a grid-based RPG, or a tactical RPG. While we focused on [code]String[/code] keys so far, GDScript dictionaries accept any value type as a key, allowing you to map anything to anything. The only limitation is that every key must be unique.
cs: Můžeme také použít slovník k mapování jednotek na jejich pozici na herním plánu. Takto byste obvykle kódovali deskovou hru, gridové RPG nebo taktické RPG. Zatímco jsme se dosud soustředili na klíče [code]String[/code], slovníky GDScript přijímají jako klíč jakýkoli typ hodnoty, což vám umožňuje mapovat cokoli na cokoli. Jediným omezením je, že každý klíč musí být jedinečný.
ta: ஒரு விளையாட்டு பலகையில் தங்கள் நிலைக்கு அலகுகளை வரைபடமாக்க ஒரு அகராதியைப் பயன்படுத்தலாம். நீங்கள் பொதுவாக ஒரு போர்டு விளையாட்டு, கட்டம் அடிப்படையிலான ஆர்பிசி அல்லது ஒரு தந்திரோபாய ஆர்பிசி ஆகியவற்றைக் குறியிடுவீர்கள். நாங்கள் இதுவரை [குறியீடு] சரம் [/குறியீடு] விசைகளில் கவனம் செலுத்துகையில், GDSCRIPT அகராதிகள் எந்த மதிப்பு வகையையும் ஒரு விசையாக ஏற்றுக்கொள்கின்றன, இது எதையும் எதற்கும் வரைபடமாக்க உங்களை அனுமதிக்கிறது. ஒரே வரம்பு என்னவென்றால், ஒவ்வொரு விசையும் தனித்துவமாக இருக்க வேண்டும்.
zh_hant: 我們也可以使用字典將單位映射到遊戲棋盤上的位置。 這通常用來編寫桌上遊戲、基於網格的 RPG 或戰略 RPG。 儘管到目前為止我們專注於 [code]字串(String)[/code] 鍵，但 GDScript 字典接受任何值類型作為鍵，讓你可以將任何東西映射到任何東西。 唯一的限制是每個鍵必須是唯一的。

source: We use a dictionary to represent the player's inventory in this game. The dictionary keys are the name of items, and they map to the number of items that the player owns. You need to loop over the dictionary and display the name and amount of every item in the inventory. To do so, call the [code]display_item()[/code] function. It takes two arguments: the item name and the amount.
cs: V této hře používáme slovník, který reprezentuje hráčův inventář. Klíče slovníku jsou názvy předmětů a mapují se na počet předmětů, které hráč vlastní. Je třeba procházet slovníkem ve smyčce a zobrazit název a množství každé položky v inventáři. Za tímto účelem zavolejte funkci [code]display_item()[/code]. Ta přijímá dva argumenty: název položky a částku.
ta: இந்த விளையாட்டில் வீரரின் சரக்குகளை பிரதிநிதித்துவப்படுத்த ஒரு அகராதியைப் பயன்படுத்துகிறோம். அகராதி விசைகள் உருப்படிகளின் பெயர், மேலும் அவை பிளேயருக்கு சொந்தமான பொருட்களின் எண்ணிக்கையை வரைபடமாக்குகின்றன. நீங்கள் அகராதியின் மீது வளைய வேண்டும் மற்றும் சரக்குகளில் உள்ள ஒவ்வொரு பொருளின் பெயரையும் அளவையும் காட்ட வேண்டும். அவ்வாறு செய்ய, [குறியீடு] display_item () [/குறியீடு] செயல்பாட்டை அழைக்கவும். இது இரண்டு வாதங்களை எடுக்கிறது: உருப்படி பெயர் மற்றும் தொகை.
zh_hant: 我們使用字典來表示這個遊戲中的玩家物品清單。字典的鍵是物品名稱，並且映射到玩家擁有的物品數量。 你需要遍歷字典並顯示每個物品名稱和數量。 為此可以呼叫 [code]display_item()[/code] 函式。它有兩個引數：物品名稱和數量。

source: We have a dictionary named [code]units[/code] that maps a cell position on the grid to a unit to put there. Using a for loop and the [code]place_unit()[/code] function, place every unit in the units dictionary at the desired position on the game board.
cs: Máme slovník s názvem [code]units[/code], který mapuje pozici buňky na mřížce na jednotku, kterou tam vložíte. Pomocí cyklu for a funkce [code]place_unit()[/code] umístěte každou jednotku ve slovníku jednotek na požadované místo na herním plánu.
ta: எங்களிடம் [குறியீடு] அலகுகள் [/குறியீடு] என்ற அகராதி உள்ளது, இது கட்டத்தில் ஒரு செல் நிலையை ஒரு அலகுக்கு வரைபடமாக்குகிறது. A க்கான லூப்பைப் பயன்படுத்தி [குறியீடு] Place_unit () [/code] செயல்பாட்டைப் பயன்படுத்தி, அலகுகள் அகராதியில் ஒவ்வொரு யூனிட்டையும் விளையாட்டு பலகையில் விரும்பிய நிலையில் வைக்கவும்.
zh_hant: 我們有一個名為 [code]units[/code] 的字典，它將格子上的位置對應到要放置的單位。 使用 for 迴圈和 [code]place_unit()[/code] 函式，將 [code]units[/code] 字典中的每個單位放置到棋盤上的指定位置。
