Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-2-your-first-error.po
Languages: cs, da, de, es, fr, ja, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: The code defines an empty function named [code]this_code_is_wrong[/code].
cs: Kód definuje prázdnou funkci s názvem [code]this_code_is_wrong[/code].
da: Koden definerer en tom funktion med navnet [code]this_code_is_wrong[/code].
es: El código define una función vacía llamada [code]this_code_is_wrong[/code].
fr: Le code définit une fonction vide nommée [code]this_code_is_wrong[/code].
ja: このコードでは、[code]this_code_is_wrong[/code] という名前の空の関数を定義しています。
pt_br: O código define uma função vazia nomeada [code]esse_codigo_esta_errado[/code].
ru: Код определяет пустую функцию с именем [code]this_code_is_wrong[/code].
ta: குறியீடு [குறியீடு] this_code_is_wrong [/code] என்ற வெற்று செயல்பாட்டை வரையறுக்கிறது.
tr: Bu kod, içerisinde [code]this_code_is_wrong[/code] isimli boş bir fonksiyonu tanımlıyor (anlamı "bu kod hatalı").
zh_hans: 代码中定义了一个空的函数，叫作 [code]this_code_is_wrong[/code]。

source: To work, the function should use the [code]return[/code] keyword. But this keyword is currently inside a comment, which the computer ignores.
cs: Aby funkce fungovala, měla by používat klíčové slovo [code]return[/code]. Toto klíčové slovo je však v současné době uvnitř komentáře, který počítač ignoruje.
da: For at funktionen skal fungere, skal den bruge nøgleordet [code]return[/code]. Men dette nøgleord er i øjeblikket inde i en kommentar, som computeren ignorerer.
es: Para que funcione, la función debería utilizar la palabra clave [code]return[/code]. Pero esta palabra clave está actualmente dentro de un comentario, que la computadora ignora.
fr: Pour fonctionner, la fonction doit utiliser le mot-clé [code]return[/code]. Mais ce mot-clé se trouve actuellement à l'intérieur d'un commentaire, que l'ordinateur ignore.
ja: この関数が動作するには、[code]return[/code] キーワードを使用する必要があります。しかし、このキーワードは現在コメントの中にあり、コンピュータはこれを無視してしまいます。
pt_br: Para funcionar, a função deve usar a palavra-chave [code]return[/code]. Mas essa palavra-chave está, no momento, dentro de um comentário, e comentários o computador ignora.
ru: Для правильной работы эта функция должна использовать ключевое слово [code]return[/code]. Но оно в настоящее время находится внутри комментария, который компьютер игнорирует.
ta: வேலை செய்ய, செயல்பாடு [குறியீடு] திரும்ப [/குறியீடு] முக்கிய சொற்களைப் பயன்படுத்த வேண்டும். ஆனால் இந்த முக்கிய சொல் தற்போது ஒரு கருத்துக்குள் உள்ளது, இது கணினி புறக்கணிக்கிறது.
tr: Çalışması için, fonksiyonun [code]return[/code] kelimesini kullanması gerekiyor. Ama bu kelime, şu an için bir yorumun içinde ve bilgisayar bunu görmezden geliyor. (yorum satırı)
zh_hans: 要让它正常工作，就应该使用 [code]return[/code] 关键字。不过这个关键字目前位于注释之中，会被计算机忽略。

source: Test the current code by pressing the [i]Run[/i] button.
cs: Otestujte aktuální kód stisknutím tlačítka [i]Run[/i].
da: Test den aktuelle kode ved at trykke på knappen [i]Kør[/i].
es: Prueba el código actual presionando el botón [i]Ejecutar[/i].
fr: Testez le code actuel en appuyant sur le bouton [i]Exécuter[/i].
ja: [i]実行[/i]ボタンを押して、現在のコードを動かしてみてください。
pt_br: Teste o código atual clicando no botão [i]Executar[/i].
ru: Протестируйте текущий код, нажав кнопку [i]Выполнить[/i].
ta: [I] ரன் [/i] பொத்தானை அழுத்துவதன் மூலம் தற்போதைய குறியீட்டைச் சோதிக்கவும்.
tr: Kodu, şu an ki bozuk haliyle denemek için [i]Çalıştır[/i] düğmesine basın.
zh_hans: 请点击[i]运行[/i]按钮测试目前的代码。

source: Then, remove the comment sign (#) to make the code valid.
cs: Poté odstraňte znak komentáře (#), aby byl kód platný.
da: Fjern derefter kommentartegnet (#) for at gøre koden gyldig.
es: Luego, elimina el signo de comentario (#) para que el código sea válido.
fr: Ensuite, supprimez le signe de commentaire (#) pour rendre le code valide.
ja: 次にコメント記号(#)を削除して、コードを正常に直してみてください。
pt_br: Após isso, remova o sinal de comentário (#) para fazer o código ser válido.
ru: Затем удалите знак комментария (#), чтобы сделать код правильным.
ta: பின்னர், குறியீட்டைச் செல்லுபடியாகும் வகையில் கருத்து அடையாளத்தை (#) அகற்றவும்.
tr: Sonra, kodu geçerli hale getirmek için yorum işaretini (#) silin.
zh_hans: 然后，请移除注释标记（#），让代码有效。

source: Be careful not to remove the spacing before [code]return[/code]! Otherwise, that'll cause another error. You may try that too, if you feel like it.
cs: Dejte pozor, abyste neodstranili mezeru před [code]return[/code]! Jinak to způsobí další chybu. Ale můžete si zkusit způsobit i tuto chybu ;-)
da: Vær forsigtig med ikke at fjerne mellemrummet før [code]return[/code]! Ellers vil det forårsage en anden fejl. Du kan også prøve det, hvis du har lyst.
es: ¡Ten cuidado de no eliminar el espacio antes de [code]return[/code]! De lo contrario, eso provocará otro error. Aunque, si te gustaría, puedes intentarlo también.
fr: Attention à ne pas supprimer l'espacement avant [code]return[/code] ! Sinon, cela provoquera une autre erreur. Vous pouvez essayer cela aussi, si vous en avez envie.
ja: このとき、[code]return[/code] の前にあるスペースを削除しないように注意してください！ さもないと別のエラーが発生します。もし気が向いたら、それも試してみてくださいね。
pt_br: Cuidado para não remover o espaço em branco antes da palavra-chave [code]return[/code]! Caso contrário, isso vai causar outro erro. Você pode tentar isso também se quiser ver como esse erro é.
ru: Будьте осторожны, чтобы не удалить пробел перед [code]return[/code]! В противном случае это вызовет еще одну ошибку. Вы можете попробовать вызвать её, если вам этого хочется.
ta: [குறியீடு] திரும்புவதற்கு முன் இடைவெளியை அகற்றாமல் கவனமாக இருங்கள் [/குறியீடு]! இல்லையெனில், அது மற்றொரு பிழையை ஏற்படுத்தும். நீங்கள் அதை உணர்ந்தால் அதையும் முயற்சி செய்யலாம்.
tr: [code]return[/code] kelimesinden önceki boşlukları silmemeye dikkat edin! Aksi halde başka bir hataya sebep olursunuz. İsterseniz bunu da deneyebilirsiniz (bu dil satır başı boşluklarına duyarlıdır). Kodu ilk haline getirmek için "Sıfırla" tuşunu kullanın.
zh_hans: 请小心，不要把 [code]return[/code] 之前的空白也一并移除！否则就会引起另一种报错。如果你喜欢的话，也可以试试。

source: There's an error in this code. We need you to fix it!
cs: V tomto kódu je chyba. Potřebujeme, abyste ji opravili!
da: Der er en fejl i denne kode. Vi har brug for, at du retter den!
de: Dieser Code enthält einen Fehler. Wir brauchen Dich, um es zu reparieren!
es: Hay un error en este código. ¡Necesitamos que lo arregles!
fr: Il y a une erreur dans ce code. Nous avons besoin de vous pour la corriger !
ja: プログラムにエラーがあります。直してみましょう！
pt_br: Existe um erro nesse código. Precisamos que você conserte ele!
ru: В этом коде есть ошибка. Нам нужно, чтобы вы ее исправили!
ta: இந்த குறியீட்டில் பிழை உள்ளது. அதை சரிசெய்ய நீங்கள் தேவை!
tr: Bu kodun içinde bir hata var. Bunu düzeltmenizi istiyoruz!
uk: У цьому коді є помилка. Нам потрібно, щоби ви її виправили!
zh_hans: 这段代码中有一个错误。我们需要你来修正！
zh_hant: 程式碼裡有錯誤。我們需要你修復它！

source: Your First Error
cs: Vaše první chyba
da: Din Første Fejl
de: Dein erster Fehler
es: Tu primer error
fr: Votre première erreur
ja: 最初のエラー
pt_br: Seu primeiro erro
ru: Ваша первая ошибка
ta: உங்கள் முதல் பிழை
tr: İlk Hatanız
uk: Ваша перша помилка
zh_hans: 你的第一个错误
zh_hant: 你的第一個錯誤

source: When you program, you are bound to run into errors. Tons of them. But you shouldn't worry! On the computer, [b]errors are a good thing[/b]. You will encounter errors, and [i]that's okay[/i]: every programmer does. Especially professionals. At school, maybe you learned that mistakes are a bad thing. When you code something, it's not the case: [b]errors help you write correct programs[/b] because they show you what is wrong in your programs.
de: Wenn Du programmierst, treten zwangsläufig Fehler auf. Möglicherweise sehr viele von Ihnen. Aber Du solltest dir keine Sorgen machen! Auf dem Computer sind [b]Fehler eine gute Sache[/b]. Du wirst auf Fehler stoßen, und [i]das ist in Ordnung[/i]: Jeder Programmierer tut es. Vor allem Profis. In der Schule hast du vielleicht gelernt, dass Fehler eine schlechte Sache sind. Wenn Du etwas programmierest, ist das nicht der Fall: [b]Fehler helfen dir, korrekte Programme zu schreiben[/b].
uk: У процесі програмування ви обов'язково зіткнетеся з помилками. Купою помилок. Але не варто турбуватися! Помилки на комп'ютері — [b]штука непогана[/b]. Ви стикатиметеся з помилками, і [i]це нормально[/i]: кожен програміст із ними стикається. Особливо професіонали. У школі, можливо, вас навчили тому, що помилки це погано. Коли ви щось програмуєте, це не так: [b]помилки допомагають вам писати правильні програми[/b], показуючи, що саме не так у ваших програмах.
zh_hant: 當你撰寫程式時，遇到錯誤是難免的，而且會有一堆。 但你不需要擔心！在電腦上，[b]錯誤是好事[/b]。 你會遇到錯誤，[b]那沒關係[/b]：所有程式設計師都會，專業的程式設計師也不例外。 在學校，也許你學過錯誤是壞事。在寫程式時，不是這麼一回事：[b]錯誤幫助你寫出正確的程式[/b]，因為它們會告訴你程式中哪裡有問題。

source: Error messages can look a bit cryptic. This is because they're designed by programmers, for trained programmers. We added an error translator in this app that will help you get started. It shows you why an error happens and what the message means. It also gives you some tips on how to fix it.
de: Fehlermeldungen können etwas kryptisch aussehen. Dies liegt daran, dass sie von anderen Programmierern für ausgebildete Programmierer entwickelt wurden. Wir haben in dieser App einen Fehlerübersetzer hinzugefügt, der den Einstieg erleichtert. Er zeigt dir, warum ein Fehler auftritt und was die Nachricht bedeutet. Er gibt dir auch einige Tipps, wie du es beheben kannst.
uk: Повідомлення про помилки можуть виглядати трохи загадково. Це тому, що їх розробили програмісти для підготовлених програмістів. Ми додали до цієї програми перекладач помилок, який допоможе вам почати роботу. Він показує, чому виникає помилка і що означає повідомлення. Перекладач також дає поради про те, як виправити помилку.
zh_hant: 錯誤訊息看起來可能有點像加密謎題。這是因為那是由程式設計師，設計給受過訓練的程式設計師看的。 我們在應用程式中新增了「錯誤翻譯機」來幫助你踏出第一步。 它會告訴你錯誤為何產生以及訊息的意思。它也會給你一些修復錯誤的秘訣。

source: Error messages are designed on purpose by fellow programmers who came before you. They anticipated you might have specific issues and wanted to help you fix them. You shouldn't think of errors as failures. They are like mentors helping you from the past. Importantly, errors won't break your computer. At least not with GDScript because it's a pretty safe language. Ultimately, you want to fix all the errors in your program. Understanding what is causing the errors, with the help of error messages, is key to fixing them.
de: Fehler sind Nachrichten, die absichtlich von Programmierkollegen entworfen wurden, die vor Dir kamen. Sie erwarteten, dass Du bestimmte Probleme haben könntest. Du solltest Fehler nicht als Fehler betrachten. Sie sind wie Mentoren, die dir aus der Vergangenheit helfen. Wichtig ist, dass Fehler deinen Computer nicht beschädigen. Zumindest nicht mit GDScript, weil es eine ziemlich sichere Sprache ist. Schlussendlich wollen Sie alle Fehler die in ihrem Programm auftreten können lösen. Deren Ursache mit der Hilfe von Fehlermeldungen zu verstehen ist eine Schlüsselfähigkeit.
uk: Помилки — це повідомлення, які створили інші програмісти, що працювали до вас. Вони припускали, що у вас можуть виникнути певні проблеми. Ви не повинні думати про помилки як про невдачі. Вони подібні до наставників, які допомагають вам з минулого. Важливо, що помилки не зламають ваш комп'ютер. Принаймні не помилки в GDScript, тому що ця мова досить безпечна. Зрештою, ви хочете виправити всі помилки у вашій програмі. Розуміння причин помилок за допомогою повідомлень про помилки є ключем до їх виправлення.
zh_hant: 錯誤訊息是在你之前的程式設計師故意設計的。他們預見到你可能會遇到某些問題，並希望幫助你解決它們。 你不應該把錯誤當作失敗。它們就像來自過去的導師，是來幫助你的。重要的是，錯誤不會讓你的電腦壞掉，至少在使用 GDScript 時不會，因為這是一種相當安全的語言。 最終，你的目標是修正程式中的所有錯誤。藉由錯誤訊息的幫助，了解錯誤的原因，這將是修正錯誤的關鍵。

source: Yes, error messages are here to help you! Pay attention to them, and do your best to read and understand them. With experience, you'll learn to make your code work more reliably thanks to error messages.
de: Ja, Fehler sind hier, um dir zu helfen! Achte darauf was sie sagen und tu dein Bestes, um sie zu lesen und zu verstehen. Mit der Erfahrung lernst Du, deinen Code dank Fehlermeldungen zuverlässiger arbeiten zu lassen.
uk: Так, помилки тут, щоб допомогти вам! Звертайте на них увагу та робіть усе можливе, щоб прочитати та зрозуміти їх. З досвідом ви навчитеся робити так, щоб ваш код, завдяки повідомленням про помилки, працював надійніше.
zh_hant: 沒錯，錯誤訊息是來幫助你的！ 仔細注意，並且盡力閱讀理解它們。隨著經驗的累積，你將學會如何根據錯誤訊息讓你的程式運行得更可靠。

source: This code is incorrect and will cause an error when you try to run it. The code defines an empty function named [code]this_code_is_wrong[/code]. To work, the function should use the [code]return[/code] keyword. But this keyword is currently inside a comment, which the computer ignores. Test the current code by pressing the [i]Run[/i] button. Then, remove the comment sign (#) to make the code valid. Be careful not to remove the spacing before [code]return[/code]! Otherwise, that'll cause another error. You may try that too, if you feel like it.
de: Dieser Code ist falsch und verursacht einen Fehler, wenn Du versuchst, ihn auszuführen. Der Code definiert eine leere Funktion mit dem Namen [code]this_code_is_wrong[/code]. Um zu funktionieren, sollte die Funktion das Schlüsselwort [code]return[/code] verwenden. Dieses Schlüsselwort befindet sich aber derzeit in einem Kommentar, den der Computer ignoriert. Teste den aktuellen Code, indem Du auf die Taste [i]Run[/i] klickst. Entferne dann das Kommentarzeichen (#), um den Code gültig zu machen. Achte darauf, den Abstand vor [code]return[/code] nicht zu entfernen! Andernfalls führt dies zu einem weiteren Fehler. Das kannst Du auch versuchen, wenn Du dazu Lust hast.
uk: Цей код хибний і викличе помилку, коли ви спробуєте його виконати. Код визначає порожню функцію з назвою [code]this_code_is_wrong[/code]. Для правильної роботи ця функція має містити ключове слово [code]return[/code]. Але воно зараз перебуває всередині коментаря, який комп'ютер нехтує. Випробуйте поточний код, натиснувши кнопку [i]Запустити[/i]. Потім видаліть знак коментаря (#), щоб зробити код правильним. Будьте обережні, щоб не видалити пропуск перед [code]return[/code]! В іншому випадку це викликає ще одну помилку. Ви можете спробувати викликати її, якщо вам цього хочеться.
zh_hant: 這個程式碼並不正確，會在你嘗試執行時給予錯誤。 這個程式碼定義了一個叫做 [code]this_code_is_wrong[/code] 的空函式。 要讓它正常運作，函式應該使用 [code]return[/code] 關鍵字。但這個關鍵字目前被放在註解中，電腦會忽略它。 按下[b]執行[/b]按鈕測試現在的程式碼。 然後移除註解標誌("#")使程式碼變得可行。 小心不要移除掉 [code]return[/code] 前面的空白！否則會導致另一種錯誤。你想要的話也可以試試看。
