Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-24-access-array-indices.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: When using negative indices, [code]-1[/code] means the [i]last[/i] element in the array. Index [code]-2[/code] will be the second-to-last, thus [code]-3[/code] will be the third-to-last. It can be little confusing as it seems to work differently from positive indices. However, it's because there's no difference between index [code]0[/code] and [code]-0[/code]: they both point to the first item in the array.
cs: Při použití záporných indexů [code]-1[/code] znamená [i]poslední[/i] prvek v poli. Index [code]-2[/code] bude předposlední, tedy [code]-3[/code] bude předpředposlední. Může to být trochu matoucí, protože se zdá, že to funguje jinak než u kladných indexů. Je to však proto, že mezi indexy [code]0[/code] a [code]-0[/code] není žádný rozdíl: oba ukazují na první položku v poli.
de: Bei Verwendung negativer Indizes bedeutet [code]-1[/code] das [i]letzte[/i] Element im Array. Index [code]-2[/code] ist somit das vorletzte und [code]-3[/code] das drittletzte Element. Das wirkt etwas verwirrend, weil es anders funktioniert als bei der Verwendung von positive Indizes. Das liegt jedoch daran, dass es keinen Unterschied zwischen index [code]0[/code] und [code]-0[/code] gibt: Beide verweisen auf das erste Element im Array.
es: Al utilizar índices negativos, [code]-1[/code] significa el [i]último[/i] elemento de la matriz. El índice [code]-2[/code] será el penúltimo, por lo tanto, [code]-3[/code] será el antepenúltimo. Puede ser un poco confuso, ya que parece funcionar de forma diferente a los índices positivos. Sin embargo, esto es porque no hay diferencia entre el índice [code]0[/code] y el [code]-0[/code]: ambos apuntan al primer elemento de la matriz.
it: Quando usi gli indici negativi, [code]-1[/code] significa l'[i]ultimo[/i] elemento nell'array. L'indice [code]-2[/code] sarà il penultimo, dunque [code]-3[/code] sarà il terzultimo. Potrebbe essere un po' confusionario dato che sembrano operare in modo diverso dagli indici positivi. Tuttavia, questo è perchè non vi è alcuna differenza tra l'indice [code]0[/code] e l'indice [code]-0[/code]: entrambi puntano sul primo oggetto nell'array.
ja: 負のインデックスを使用する場合、[code]-1[/code] は配列の[i]最後[/i]の要素を意味します。インデックス [code]-2[/code] は最後から 2 番目になるため、[code]-3[/code] は最後から 3 番目になります。 正のインデックスとは動作が異なるように見えるため、少し混乱する可能性があります。ただし、これはインデックス [code]0[/code] と [code]-0[/code] に違いがなく、どちらも配列の最初の項目を指しているためです。
nl: Wanneer je negatieve indices gebruikt, betekent [code]-1[/code] het [i]laatste[/i] element in de array. Index [code]-2[/code] zal het op-een-na-laatste zijn, dus [code]-3[/code] zal het op-twee-na-laatste zijn. Het kan een beetje verwarrend zijn omdat het anders lijkt te werken dan positieve indices. Dat komt echter doordat er geen verschil is tussen index [code]0[/code] en [code]-0[/code]: ze wijzen allebei naar het eerste element in de array.
pt_br: Ao usar índices negativos, [code]-1[/code] significa o [i]último[/i] elemento no array. O índice [code]-2[/code] será o penúltimo, portanto [code]-3[/code] será o antepenúltimo. Pode ser um pouco confuso, pois parece funcionar de maneira diferente dos índices positivos. No entanto, é porque não há diferença entre o índice [code]0[/code] e [code]-0[/code]: ambos apontam para o primeiro item no array.
ta: எதிர்மறை குறியீடுகளைப் பயன்படுத்தும் போது, [குறியீடு] -1 [/குறியீடு] என்பது வரிசையில் [i] கடைசி [/i] உறுப்பு என்று பொருள். குறியீட்டு [குறியீடு] -2 [/குறியீடு] இரண்டாவது முதல் கடைசி வரை இருக்கும், இதனால் [குறியீடு] -3 [/குறியீடு] மூன்றாவது முதல் கடைசி வரை இருக்கும். நேர்மறையான குறியீடுகளிலிருந்து வித்தியாசமாக செயல்படுவதால் இது கொஞ்சம் குழப்பமாக இருக்கும். இருப்பினும், குறியீட்டு [குறியீடு] 0 [/குறியீடு] மற்றும் [குறியீடு] -0 [/குறியீடு] இடையே எந்த வித்தியாசமும் இல்லாததால் தான்: அவை இரண்டும் வரிசையில் முதல் உருப்படியை சுட்டிக்காட்டுகின்றன.
uk: У разі використання від’ємних індексів [code]-1[/code] означає [i]останній[/i] елемент у масиві. Індекс [code]-2[/code] буде передостаннім, таким чином [code]-3[/code] буде передостаннім. Це може трохи заплутати, оскільки здається, що він працює інакше, ніж позитивні індекси. Однак це тому, що немає різниці між індексами [code]0[/code] і [code]-0[/code]: обидва вони вказують на перший елемент у масиві.
zh_hans: 当使用负索引时，[code]-1[/code] 表示数组中的 [i]最后一个[/i] 元素。 索引 [code]-2[/code] 是倒数第二个，[code]-3[/code] 是倒数第三个。 可能这有点令人困惑，因为似乎它与正索引的工作方式不一样。 但其实是合理的，因为索引 [code]0[/code] 和 [code]-0[/code] 没有区别：都指向数组中的第一项。
zh_hant: 當使用負數索引時，[code]-1[/code] 代表陣列中的[b]最後一個[/b]元素。索引 [code]-2[/code] 則是倒數第二個，依此類推，[code]-3[/code] 代表倒數第三個。 這可能會有點令人混亂，因為它似乎和正數索引的運作方式不同。不過這是因為索引 [code]0[/code] 和 [code]-0[/code] 其實是沒有區別的：它們都指向陣列中的第一個項目。

source: inventory[-3]
ta: சரக்கு [-3]
uk: інвентар[-3]

source: inventory[-2]
ta: சரக்கு [-2]
uk: інвентар[-2]

source: There's a catch with this syntax: if you try to access an index that does not exist, you will get an error. You have to be careful always to access existing elements in the array. There are a couple of ways you can check for valid indices. One of them is checking the array's size.
cs: Tato syntaxe má jeden háček: pokud se pokusíte přistoupit k neexistujícímu indexu, dojde k chybě. Musíte si vždy dávat pozor, abyste přistupovali k existujícím prvkům pole. Existuje několik způsobů, jak můžete kontrolovat platné indexy. Jedním z nich je kontrola velikosti pole.
de: Es gibt einen Haken bei dieser Syntax: Wenn du versuchst, auf einen Index zuzugreifen, der nicht existiert, erhältst du einen Fehler. Daher solltest du immer gut darauf achten nur auf vorhandene Elemente im Array zuzugreifen. Es gibt mehrere Möglichkeiten auf gültige Indizes zu prüfen. Eine davon ist das Prüfen der Array-Größe.
es: Hay un problema con esta sintaxis: si intentas acceder a un índice que no existe, obtendrás un error. Siempre debes tener cuidado de acceder a los elementos existentes en la matriz. Hay un par de formas en las que puedes comprobar si los índices son válidos. Una de ellas es comprobar el tamaño de la matriz.
it: C'è un tranello in questa sintassi: se provi ad accedere un indice che non esiste, otterrai un errore. Devi sempre stare attento e devi accedere sempre elementi esistenti nell'array. Ci sono un paio di modi per controllare gli indici validi. Uno di questi è controllare la grandezza dell'array.
ja: この構文には、存在しないインデックスにアクセスしようとするとエラーになるという落とし穴があります。配列内の既存の要素にアクセスするように常に注意する必要があります。 有効なインデックスを確認する方法はいくつかあります。そのうちの 1 つは、配列のサイズを確認することです。
nl: Er zit een addertje onder het gras bij deze codevorm: als je een index probeert te gebruiken die niet bestaat, krijg je een foutmelding. Je moet altijd voorzichtig zijn om alleen bestaande elementen in de array te gebruiken. Er zijn een paar manieren om te controleren op geldige indices. Eén daarvan is het controleren van de grootte van de array.
pt_br: Há um problema com essa sintaxe: se você tentar acessar um índice que não existe, receberá um erro. Você tem que ter cuidado sempre para acessar os elementos existentes no array. Existem algumas maneiras de verificar se há índices válidos. Uma delas é verificar o tamanho do array.
ta: இந்த தொடரியல் மூலம் ஒரு பிடிப்பு உள்ளது: நீங்கள் இல்லாத ஒரு குறியீட்டை அணுக முயற்சித்தால், உங்களுக்கு பிழை கிடைக்கும். வரிசையில் இருக்கும் கூறுகளை அணுக நீங்கள் எப்போதும் கவனமாக இருக்க வேண்டும். செல்லுபடியாகும் குறியீடுகளை நீங்கள் சரிபார்க்க இரண்டு வழிகள் உள்ளன. அவற்றில் ஒன்று வரிசையின் அளவை சரிபார்க்கிறது.
uk: У цьому синтаксисі є заковика: якщо ви спробуєте отримати доступ до індексу, якого не існує, ви отримаєте помилку. Ви завжди повинні бути обережними, щоб отримати доступ до існуючих елементів у масиві. Є кілька способів перевірити дійсні індекси. Одним із них є перевірка розміру масиву.
zh_hans: 这种索引语法有一个陷阱：如果你试图访问一个不存在的索引，只会得到一个错误。 必须小心，始终只访问数组中现有的元素。 有几种方法可以检查索引是否有效。 其中一种是检查数组的大小。
zh_hant: 這種語法有一個陷阱：如果你嘗試存取一個不存在的索引，會發生錯誤。你必須小心，確保總是存取陣列中已存在的元素。 有幾種方法可以檢查索引是否有效，其中一種是檢查陣列的大小。

source: [b]Checking the size of the array[/b] Arrays come with a member function named [code]size()[/code]. You can call it on the array anytime to know its [i]current[/i] size.
cs: [b]Kontrola velikosti pole[/b] Pole jsou vybavena členskou funkcí [code]size()[/code]. Můžete ji kdykoli zavolat na poli, abyste zjistili jeho [i]aktuální[/i] velikost.
de: [b]Überprüfen der Array-Größe[/b] Ein Array hat eine Memberfunktion namens [code]size()[/code]. Damit kannst du jederzeit seine [i]aktuelle[/i] Größe ermitteln.
es: [b]Comprobación del tamaño de la matriz[/b] Las matrices vienen con una función miembro llamada [code]size()[/code]. Puedes llamarla en la matriz en cualquier momento para conocer su tamaño [i]actual[/i].
it: [b]Controllare la grandezza dell'array[/b] Gli array hanno una funzione membro chiamata [code]size()[/code]. La puoi chiamare sull'array ogni volta che ti pare per sapere la grandezza [i]attuale[/i].
ja: [b]配列のサイズの確認[/b] 配列には、[code]size()[/code] という名前のメンバー関数が付属しています。配列でいつでも呼び出して、[i]現在[/i]のサイズを知ることができます。
nl: [b]De grootte van de array controleren[/b] Arrays hebben een lidfunctie met de naam [code]size()[/code]. Je kunt deze op elk moment op de array aanroepen om de [i]huidige[/i] grootte te weten te komen.
pt_br: [b]Verificando o tamanho do array[/b] Arrays vêm com uma função membro chamada [code]size()[/code]. Você pode chamá-la no array a qualquer momento para saber seu tamanho [i]atual[/i].
ta: [b] வரிசையின் அளவைச் சரிபார்க்கிறது [/b] [குறியீடு] அளவு () [/குறியீடு] என்ற உறுப்பினர் செயல்பாட்டுடன் வரிசைகள் வருகின்றன. அதன் [i] தற்போதைய [/i] அளவை அறிய நீங்கள் எப்போது வேண்டுமானாலும் வரிசையில் அழைக்கலாம்.
uk: [b]Перевірка розміру масиву[/b] Масиви постачаються з функцією-членом під назвою [code]size()[/code]. Ви можете будь-коли викликати його в масиві, щоб дізнатися його [i]поточний[/i] розмір.
zh_hans: [b]检查数组的大小[/b] 数组带有一个名为 [code]size()[/code] （大小）的成员函数。 你可以随时在数组上调用它以了解数组 [i]调用该函数时[/i] 的大小。
zh_hant: [b]檢查陣列的大小[/b] 陣列有一個名為 [code]size()[/code] 的成員函式。你可以隨時在陣列上呼叫它，以獲取陣列的[b]目前[/b]大小。

source: We have train tracks broken down into little chunks in our game. We use them to make modular tracks and draw circuits of all shapes and sizes. However, several chunks are misaligned. You need to find them in the [code]tracks[/code] array and pass them to the [code]align()[/code] function. To do so, you need to access the array by index. This time, though, you need to access them with [i]negative indices[/i].
cs: V naší hře máme vlakové tratě rozdělené na malé kousky. Z nich vytváříme modulové tratě a kreslíme okruhy všech tvarů a velikostí. Několik dílků je však špatně zarovnaných. Je třeba je najít v poli [code]tracks[/code] a předat je funkci [code]align()[/code]. K tomu je třeba přistupovat k poli podle indexu. Tentokrát k nim však musíte přistupovat pomocí [i]záporných indexů[/i].
de: In unserem Spiel haben wir Stücke von Bahngleisen. Die verwenden wir um ein beliebiges Schienennetz in allen Formen und Größen zu aufbauen zu können. Mehrere Abschnitte sind jedoch falsch ausgerichtet. Sie müssen im Array [code]tracks[/code] gefunden werden und an die Funktion [code]align()[/code] übergeben werden. Dazu musst du über den Index auf das Array zugreifen. Diesmal musst du allerdings mit [i]negativen Indizes[/i] auf sie zugreifen.
es: En nuestro juego tenemos vías de tren divididas en pequeños trozos. Los utilizamos para hacer vías modulares y dibujar circuitos de todas las formas y tamaños. Sin embargo, varios trozos están desalineados. Tienes que encontrarlos en el array [code]tracks[/code] y pasarlos a la función [code]align()[/code]. Para ello, tienes que acceder al array con índices. Esta vez, sin embargo, tienes que acceder a los valores del array con [i]índices negativos[/i].
it: Nel nostro gioco ci sono dei binari di un treno rotti in piccoli pezzi. Li possiamo usare per creare dei binari modulati e per disegnare circuiti di ogni forma e grandezza. Tuttavia, molti pezzi sono disallineati. Devi trovarli nell'array [code]tracks[/code] e passarli alla funzione [code]align()[/code]. Pre far questo, devi accedere all'array attraverso l'indice. Questa volta, però, devi accedervi attraverso degli [i]indici negativi[/i].
ja: このゲームでは、線路を小さな塊に分解しています。それらを使用して、モジュラートラックを作成し、あらゆる形状とサイズの回路を描画します。 ただし、いくつかのチャンクの位置がずれています。それらを [code]tracks[/code] 配列で見つけて、[code]align()[/code] 関数に渡す必要があります。 そのためには、インデックスで配列にアクセスする必要があります。 ただし、今回は[i]負のインデックス[/i]でアクセスする必要があります。
nl: In ons spel hebben we treinrails opgedeeld in kleine stukjes. We gebruiken ze om modulaire sporen te maken en circuits in alle vormen en maten te tekenen. Verschillende stukken zijn echter verkeerd uitgelijnd. Je moet ze vinden in de array [code]tracks[/code] en ze doorgeven aan de functie [code]align()[/code]. Om dit te doen, moet je de array raadplegen per index. Deze keer echter, moet je [i]negatieve indices[/i] gebruiken.
pt_br: Temos trilhos de trem divididos em pequenos pedaços em nosso jogo. Nós os usamos para fazer trilhos modulares e desenhar circuitos de todas as formas e tamanhos. No entanto, vários pedaços estão desalinhados. Você precisa encontrá-los no array [code]tracks[/code] e passá-los para a função [code]align()[/code]. Para fazer isso, você precisa acessar o array por índice. Desta vez, porém, você precisa acessá-los com [i]índices negativos[/i].
ta: எங்கள் விளையாட்டில் ரயில் தடங்கள் சிறிய துகள்களாக உடைக்கப்பட்டுள்ளன. மட்டு தடங்களை உருவாக்கவும், அனைத்து வடிவங்கள் மற்றும் அளவுகள் சுற்றுகளை வரையவும் அவற்றைப் பயன்படுத்துகிறோம். இருப்பினும், பல துகள்கள் தவறாக வடிவமைக்கப்பட்டுள்ளன. நீங்கள் அவற்றை [குறியீடு] தடங்கள் [/குறியீடு] வரிசையில் கண்டுபிடித்து அவற்றை [குறியீடு] சீரமை () [/குறியீடு] செயல்பாட்டிற்கு அனுப்ப வேண்டும். அவ்வாறு செய்ய, நீங்கள் குறியீட்டின் மூலம் வரிசையை அணுக வேண்டும். இந்த நேரத்தில், நீங்கள் அவற்றை [i] எதிர்மறை குறியீடுகளுடன் அணுக வேண்டும் [/i].
uk: У нашій грі залізничні колії розбиті на маленькі частини. Ми використовуємо їх для виготовлення модульних доріжок і малювання схем будь-якої форми та розміру. Однак кілька блоків неправильно вирівняні. Вам потрібно знайти їх у масиві [code]tracks[/code] і передати їх у функцію [code]align()[/code]. Для цього вам потрібно отримати доступ до масиву за індексом. Однак цього разу вам потрібно отримати доступ до них за допомогою [i]негативних індексів[/i].
zh_hans: 在我们的游戏中，火车轨道被拆分成小模块。 我们用它们来制作模块化轨道并绘制出各种形状和规模的火车线路。 但是，这里有几块没有对齐。 需要你在 [code]tracks[/code] 数组中找到它们并将它们传递给 [code]align()[/code]（对齐）函数。 为此，你需要用索引访问数组。 不一样的是，这次需要你用 [i] 负索引 [/i] 来访问它们。
zh_hant: 在我們的遊戲中，火車軌道被拆分成許多小軌道。我們使用它們來製作模組化的軌道，並畫出各種形狀和大小的電路。 然而幾個軌道段落沒有對齊。你需要在 [code]tracks[/code] 陣列中找到它們，並將它們傳遞給 [code]align()[/code] 函式。 為了做到這一點，你需要通過索引來訪問陣列。 不過這次你需要使用[b]負數索引[/b]來訪問它們。

source: In our game, the player has an inventory that works as an array under the hood. The player knows they have a sword and a shield somewhere in their inventory, but they don't remember exactly where. You can see the inventory drawn on the right, along with the index of each item in the inventory. Your task is to find one sword and one shield in the array using their index, then call [code]use_item()[/code] on each of them so the player can equip those items. For example, if the first item in the array is what you need, you would call [code]use_item(inventory[0])[/code].
es: En nuestro juego, el jugador tiene un inventario que, bajo el capó, funciona como un array. El jugador sabe que tiene una espada y un escudo en algún lugar de su inventario, pero no recuerda exactamente dónde. Puedes ver el inventario dibujado a la derecha, junto con el índice de cada objeto en el inventario. Tu tarea es encontrar una espada y un escudo en el array usando su índice, luego llamar [code]use_item()[/code] en cada uno de ellos para que el jugador pueda equipar esos objetos. Por ejemplo, si el primer objeto en el array es lo que necesitas, llamarías [code]use_item(inventory[0])[/code].
