Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-6-multiple-function-parameters.po
Languages: cs, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, zh_hans, zh_hant

source: In the previous part, you created a function to draw a square of a fixed size.
de: Im vorherigen Teil hast Du eine Funktion zum Zeichnen eines Quadrats fester Größe erstellt.
fr: Dans la partie précédente, vous avez créé une fonction pour dessiner un carré d'une taille fixe.
it: Nella parte precedente è stata creata una funzione per disegnare un quadrato di dimensioni fisse.
nl: In het vorige hoofdstuk heb je een functie gemaakt om een vierkant met een vaste grootte te tekenen.
pt: Na parte anterior, você criou uma função para desenhar um quadrado de tamanho fixo.
ru: В предыдущей части вы создали функцию для рисования квадрата фиксированного размера.
ta: முந்தைய பகுதியில், ஒரு நிலையான அளவின் சதுரத்தை வரைய ஒரு செயல்பாட்டை உருவாக்கியுள்ளீர்கள்.

source: This function is a bit limiting. Instead, it would be much better if we had a function to draw a square of [i]any[/i] size. Or better: any kind of rectangle (a square is a specific kind of rectangle).
cs: Tato funkce je trochu omezující. Místo toho by bylo mnohem lepší, kdybychom měli funkci pro vykreslení čtverce o [i] libovolné[/i] velikosti. Nebo lépe: libovolný druh obdélníku (čtverec je specifický druh obdélníku).
de: Diese Funktion ist sehr eingeschränkt nutzbar. Besser wäre es, wenn wir mit der Funktion ein Quadrat von [i]beliebiger[/i] Größe zeichnen könnten. Oder noch besser: Jede Art von Rechteck (ein Quadrat ist eine bestimmte Art von Rechteck).
fr: Cependant, cette fonction est un peu restrictive. Il serait bien mieux d'avoir une fonction permettant de dessiner un carré de [i]n'importe quelle[/i] taille. Ou mieux : n'importe quel type de rectangle (un carré est un type spécifique de rectangle).
it: Questa funzione è un po' limitante. Sarebbe invece molto meglio avere una funzione per disegnare un quadrato di [i]qualsiasi[/i] dimensione. O meglio: di qualsiasi tipo di rettangolo (il quadrato è un tipo specifico di rettangolo).
nl: Deze functie is een beetje beperkend. In plaats daarvan zou het veel beter zijn als we een functie hadden om een vierkant van een [i]willekeurige[/i] grootte te tekenen. Of nog beter: elke soort rechthoek (een vierkant is een specifieke soort rechthoek).
pt: Essa função é um pouco limitada. Seria muito melhor se tivéssemos uma função para desenhar um quadrado de [i]qualquer[/i] tamanho. Ou melhor: qualquer tipo de retângulo (um quadrado é um tipo específico de retângulo).
ru: Эта функция немного ограничена. Было бы гораздо полезнее иметь функцию для рисования квадрата [i]любого[/i] размера. Или лучше: любого вида прямоугольника (квадрат - это частный случай прямоугольника).
ta: இந்த செயல்பாடு சற்று கட்டுப்படுத்துகிறது. அதற்கு பதிலாக, [i] ஏதேனும் [/i] அளவின் ஒரு சதுரத்தை வரைய ஒரு செயல்பாடு இருந்தால் அது மிகவும் சிறப்பாக இருக்கும். அல்லது சிறந்தது: எந்த வகையான செவ்வகமும் (ஒரு நாற்கை ஒரு குறிப்பிட்ட வகையான செவ்வகம்).

source: In previous lessons, you used the [code]rotate()[/code] function and gave it an [i]argument[/i].
cs: V předchozích lekcích jste použili funkci [code]rotate()[/code] a zadali jí [i]parametr[/i].
de: In früheren Lektionen hast Du die Funktion [code]rotate()[/code] verwendet und ihr ein [i]Argument[/i] gegeben.
fr: Dans les leçons précédentes, vous avez utilisé la fonction [code]rotate()[/code] et vous lui avez donné un [i]paramètre[/i].
it: Nelle lezioni precedenti, avete usato la funzione [code]rotate()[/code] e le avete dato un [i]argomento[/i].
nl: In vorige lessen gebruikte je de functie [code]rotate()[/code] en gaf je deze een [i]argument[/i].
ru: В предыдущих уроках при вызове функции [code]rotate()[/code] вы передавали ей [i]аргумент[/i].
ta: முந்தைய பாடங்களில், நீங்கள் [குறியீடு] சுழற்சி () [/குறியீடு] செயல்பாட்டைப் பயன்படுத்தினீர்கள், அதற்கு ஒரு [i] வாதத்தை [/i] கொடுத்தீர்கள்.

source: Just like [code]rotate()[/code], we can also give our function [i]parameters[/i]. Parameters are labels you give to values passed to the function.
cs: Stejně jako funkci [code]rotate()[/code] můžeme naší funkci zadat [i]parametry[/i]. Parametry jsou označení, která dáváte hodnotám předávaným funkci.
de: Genau wie [code]rotate()[/code] können wir auch in unserer Funktion [i]Parameter[/i] angeben. Parameter sind Werte mit Namen, die an die Funktion übergeben werden.
es: Al igual que [code]rotate()[/code], también podemos darle a nuestra función [i]parámetros[/i]. Los parámetros son etiquetas que le asignas a los valores que se le pasan a la función.
fr: Tout comme [code]rotate()[/code], nous pouvons également donner à notre fonction des [i]paramètres[/i]. Les paramètres sont des étiquettes que vous donnez aux valeurs passées à la fonction.
it: Così come [code]rotate()[/code], pure noi possiamo dare alle nostre funzioni dei [i]parametri[/i]. I parametri sono nomi che diamo ai valori passati alla funzione.
ja: [code]rotate()[/code] と同じように、関数に [i]パラメータ[/i] を与えることもできます。 パラメーターは、関数に渡される値に付けるラベルです。
nl: Net als [code]rotate()[/code], kunnen we ook onze functie [i]parameters[/i] geven. Parameters zijn labels die je geeft aan waarden die worden meegegeven aan de functie.
pt: Assim como a função [code]rotate()[/code], também podemos dar à nossa função [i]parâmetros[/i]. Os parâmetros são nomes que dá aos valores que são passados à função.
pt_br: Assim como a função [code]rotate()[/code], também podemos dar à nossa função [i]parâmetros[/i]. Os parâmetros são nomes que você dá aos valores que são passados para a função.
ru: Мы можем передать [i]параметры[/i] и нашей функции, подобно тому, как делали это в [code]rotate()[/code]. Параметры — это метки, которые вы даете значениям, передаваемым в функцию.
ta: [குறியீடு] சுழலும் () [/குறியீடு] போலவே, எங்கள் செயல்பாட்டையும் [i] அளவுருக்கள் [/i] ஐ வழங்கலாம். அளவுருக்கள் செயல்பாட்டிற்கு அனுப்பப்பட்ட மதிப்புகளுக்கு நீங்கள் கொடுக்கும் லேபிள்கள்.
zh_hans: 就像 [code]rotate()[/code] 一样，我们也可以给我们的函数 [i]参数[/i]。 参数是你传递给函数的值的标签。
zh_hant: 就像 [code]rotate()[/code] 一樣，我們也可以給我們的函式傳遞[b]參數[/b]。參數是你傳遞給函式的值的標籤。

source: Can I rotate in both directions?
cs: Mohu se otáčet oběma směry?
de: Kann ich in beide Richtungen drehen?
es: ¿Puedo girar en ambas direcciones?
fr: Puis-je pivoter dans les deux sens ?
it: Posso ruotare in entrambe le direzioni?
ja: 両方向に回転できますか?
nl: Kan ik in beide richtingen draaien?
pt_br: Posso rotacionar em ambas as direções?
ru: Могу ли я вращать в обоих направлениях?
ta: நான் இரு திசைகளிலும் சுழல முடியுமா?
zh_hans: 我可以向两个方向旋转吗？
zh_hant: 我可以向兩個方向旋轉嗎？

source: The [code]radians[/code] can be a positive or negative number, which allows you to rotate both clockwise and counter-clockwise.
cs: [code]Radians[/code] mohou být kladné nebo záporné číslo, což umožňuje otáčení ve směru nebo proti směru hodinových ručiček.
de: Das [code]Bogenmaß[/code] kann eine positive oder negative Zahl sein, mit der Du sowohl im Uhrzeigersinn als auch gegen den Uhrzeigersinn drehen kannst.
es: Los [code]radianes[/code] pueden ser un número positivo o negativo, lo que te permite girar tanto en el sentido de las agujas del reloj como en el sentido contrario.
fr: Les [code]radians[/code] peuvent être un nombre positif ou négatif, ce qui vous permet d'effectuer une rotation dans le sens des aiguilles d'une montre ainsi que dans le sens inverse.
it: I [code]radianti[/code] possono essere numeri sia positivi ché negativi, questo ti consente di ruotare sia in senso orario ché antiorario.
ja: [code]radians[/code]には正または負の数値を指定でき、時計回りと反時計回りの両方で回転できます。
nl: De [code]radians[/code] kunnen een positief of negatief getal zijn, waardoor je zowel met de klok mee als tegen de klok in kunt draaien.
pt: O [code]radiano[/code] pode ser um número positivo ou negativo, o que o permite girar no sentido horário e anti-horário.
pt_br: O [code]radiano[/code] pode ser um número positivo ou negativo, o que te permite girar no sentido horário e anti-horário.
ru: Значение [code]radians[/code] может быть положительным или отрицательным числом, что позволяет вам использовать функцию для вращения объекта как по, так и против часовой стрелки.
ta: [குறியீடு] ரேடியன்கள் [/குறியீடு] நேர்மறை அல்லது எதிர்மறை எண்ணாக இருக்கலாம், இது கடிகார திசையில் மற்றும் எதிர்-கடிகார திசையில் சுழற்ற உங்களை அனுமதிக்கிறது.
zh_hans: [code]radians[/code] 可以是正数或负数，它允许你顺时针和逆时针旋转。
zh_hant: [code]radians[/code] 可以是正數或負數，這樣就可以讓你進行順時針或逆時針旋轉。

source: For now, please focus on the first line: [code]func rotate(radians)[/code].
cs: Prozatím se zaměřte na první řádek: [code]func rotate(radians)[/code].
de: Bitte konzentriere dich vorerst auf die erste Zeile: [code]func rotate(radians)[/code].
fr: Pour l'instant, concentrez-vous sur la première ligne : [code]func rotate(radians)[/code].
it: Per ora, concentrati sulla prima riga: [code]func rotate(radians)[/code].
nl: Concentreer je nu op de eerste regel: [code]func rotate(radians)[/code].
pt: Por enquanto, concentre-se na primeira linha: [code]func rotate(radiano)[/code].
ru: А сейчас сосредоточьтесь на этой строке: [code]func rotate(radians)[/code].
ta: இப்போதைக்கு, தயவுசெய்து முதல் வரியில் கவனம் செலுத்துங்கள்: [குறியீடு] FUNC ROTATE (RADIANS) [/CODE].

source: When you call [code]rotate(0.5)[/code], the computer binds the value [code]0.5[/code] to the label [code]radians[/code].
cs: Když zavoláte [code]rotate(0.5)[/code], počítač přiřadí hodnotu [code]0.5[/code] ke značce/identifikátoru [code]radians[/code].
de: Wenn Du [code]rotate(0.5)[/code] aufrufst, bindet der Computer den Wert [code]0.5[/code] an die Bezeichnung [code]radians[/code](Bogenmaß).
fr: Lorsque vous appelez [code]rotate(0.5)[/code], l'ordinateur lie la valeur [code]0.5[/code] à l'étiquette [code]radians[/code].
it: Quando chiami [code]rotate(0.5)[/code], il computer collega il valore [code]0.5[/code] al nome [code]radians[/code].
nl: Wanneer je [code]rotate(0.5)[/code] aanroept, bindt de computer de waarde [code]0.5[/code] aan het label [code]radians[/code].
pt: Quando chama a função [code]rotate(0.5)[/code], o computador vincula o valor [code]0.5[/code] ao nome [code]radiano[/code].
ru: Когда вы вызываете [code]rotate(0.5)[/code], компьютер привязывает значение [code]0.5[/code] к метке [code]radians[/code].
ta: நீங்கள் [குறியீடு] சுழலும் (0.5) [/குறியீடு] என்று அழைக்கும்போது, கணினி [குறியீடு] 0.5 [/குறியீடு] சிட்டை [குறியீடு] ரேடியன்களுடன் [/குறியீடு] பிணைக்கிறது.

source: Wherever the computer sees the identifier [code]radians[/code] inside the function, it replaces it with the [code]0.5[/code] value.
cs: Všude, kde počítač uvidí uvnitř funkce identifikátor [code]radians[/code], nahradí jej hodnotou [code]0,5[/code].
de: Wo immer der Computer den Bezeichner [code]radians[/code] innerhalb der Funktion sieht, ersetzt er ihn durch den Wert [code]0.5[/code].
fr: Chaque fois que l'ordinateur voit l'identifiant [code]radians[/code] dans la fonction, il le remplace par la valeur [code]0.5[/code].
it: Ovunque il computer identifichi [code]radians[/code] all'interno della funzione, lo rimpiazza con il valore [code]0.5[/code].
nl: Overal waar de computer de identifier [code]radialen[/code] in de functie ziet, vervangt hij deze door de waarde [code]0.5[/code].
pt: Sempre que o computador vê o identificador [code]radiano[/code] dentro da função, ele substitui o nome pelo valor [code]0.5[/code].
ru: Везде, где компьютер видит идентификатор [code]radians[/code] внутри функции, он заменяет его значением [code]0.5[/code].
ta: கணினி எங்கிருந்தாலும் அடையாளங்காட்டி [குறியீடு] ரேடியன்கள் [/குறியீடு] செயல்பாட்டிற்குள், அதை [குறியீடு] 0.5 [/குறியீடு] மதிப்புடன் மாற்றுகிறது.

source: The parameter name is always a label you use to refer to a [i]value[/i]. The value in question can be a number, text, or anything else.
cs: Název parametru je vždy označení, které použijete pro odkaz na [i]hodnotu[/i]. Příslušnou hodnotou může být číslo, text nebo cokoli jiného.
de: Der Parametername ist immer eine Bezeichnung, die Du verwendest, um auf einen [i]Wert[/i] zu verweisen. Der fragliche Wert kann eine Zahl, ein Text oder etwas anderes sein.
fr: Le nom du paramètre est toujours une étiquette que vous utilisez pour faire référence à une [i]valeur[/i]. La valeur en question peut être un nombre, du texte ou n'importe quoi d'autre.
it: Il nome del parametro è sempre un'etichetta che utilizziamo per riferisci ad un [i]valore[/i]. Il valore in questione può essere un numero, del testo, o qualsiasi altra cosa.
nl: De parameternaam is altijd een label dat je gebruikt om te verwijzen naar een [i]waarde[/i]. De waarde in kwestie kan een getal, tekst of iets anders zijn.
pt: O nome do parâmetro é sempre um nome que usa para se referir a um [i]valor[/i]. O valor em questão pode ser um número, texto ou qualquer outra coisa.
ru: Имя параметра - это метка, которую вы используете для ссылки на [i]значение[/i]. Это значение может быть числом, текстом или чем-либо ещё.
ta: அளவுரு பெயர் எப்போதும் [i] மதிப்பைக் குறிக்க நீங்கள் பயன்படுத்தும் சிட்டை ஆகும் [/i]. கேள்விக்குரிய மதிப்பு எண், உரை அல்லது வேறு எதையும் இருக்கலாம்.

source: For now, we'll stick to numbers as we have yet to see other value types.
cs: Prozatím zůstaneme u čísel, protože s jinými typy hodnot jsme se ještě nesetkali.
de: Im Moment werden wir uns an Zahlen halten, da wir noch keine anderen Typen gesehen haben.
fr: Pour l'instant, nous nous en tiendrons aux nombres car nous n'avons pas encore vu d'autres types de valeurs.
it: Per ora, utilizzeremo i numeri finché non scopriremo altri tipi di valore.
nl: Voor nu houden we het bij getallen, omdat we nog geen andere soorten waarden hebben gezien.
pt: Por enquanto, vamos continuar a usar números, pois ainda temos que ver outros tipos de valores.
ru: Пока что мы будем придерживаться числовых значений, так как нам ещё предстоит познакомиться с другими типами значений.
ta: இப்போதைக்கு, மற்ற மதிப்பு வகைகளை நாங்கள் இன்னும் காணாததால் எண்களுடன் ஒட்டிக்கொள்வோம்.

source: What is a function parameter?
cs: Co je parametr funkce?
de: Was ist ein Funktionsparameter?
es: ¿Qué es el parámetro de una función?
fr: Qu'est-ce qu'un paramètre de fonction ?
it: Cos'è un parametro di una funzione?
ja: 関数パラメータとは何ですか?
nl: Wat is een functieparameter?
pt: O que é um parâmetro de uma função?
pt_br: O que é um parâmetro de uma função?
ru: Что такое параметр функции?
ta: செயல்பாட்டு அளவுரு என்றால் என்ன?
zh_hans: 什么是函数参数？
zh_hant: 什麼是函式參數？

source: A parameter is a label that represents a value.
cs: Parametr je značka, která představuje hodnotu.
de: Ein Parameter stellt einen Wert mit einer Bezeichnung dar.
fr: Un paramètre est une étiquette qui représente une valeur.
it: Un parametro è un'etichetta che rappresenta un valore.
nl: Een parameter is een label dat een waarde vertegenwoordigt.
pt: Um parâmetro é um nome que representa um valor.
ru: Параметр — это метка, которая представляет собой значение.
ta: ஒரு அளவுரு என்பது ஒரு மதிப்பைக் குறிக்கும் லேபிள்.

source: The value in question can change: it depends on what you put in parentheses when calling a function.
cs: Příslušná hodnota se může měnit: záleží na tom, co uvedete do závorek při volání funkce.
de: Der fragliche Wert kann sich ändern: Es hängt davon ab, was Du beim Aufruf einer Funktion in Klammern setzt.
fr: La valeur en question peut changer : elle dépend de ce que vous mettez entre parenthèses lors de l'appel d'une fonction.
it: Il valore in questione può cambiare: dipende da cosa metti tra le parentesi quando chiami la funzione.
nl: De waarde in kwestie kan veranderen: het hangt af van wat je tussen haakjes zet wanneer je een functie aanroept.
pt: O valor em questão pode mudar: depende do que põe entre parênteses ao chamar uma função.
ru: Значение может меняться: оно зависит от того, что вы помещаете в круглые скобки при вызове функции.
ta: கேள்விக்குரிய மதிப்பு மாறக்கூடும்: இது ஒரு செயல்பாட்டை அழைக்கும்போது நீங்கள் அடைப்புக்குறிக்குள் வைப்பதைப் பொறுத்தது.

source: A label you give to a value the function receives.
cs: Označení, které přidělíte hodnotě, kterou funkce obdrží.
de: Eine Bezeichnung, der Du einen Wert gibst, den die Funktion empfängt.
es: Una etiqueta que le das a un valor que la función recibe.
fr: Une étiquette que vous donnez à une valeur que la fonction reçoit.
it: Un'etichetta che dai ad un valore che la funzione riceve.
ja: 関数が受け取る値に付けるラベル。
nl: Een label dat je geeft aan een waarde die de functie ontvangt.
pt: Um nome que dá a um valor que a função recebe.
pt_br: Um nome que você dá a um valor que a função recebe.
ru: Метка, которой вы помечаете значение, принимаемое функцией.
ta: செயல்பாடு பெறும் மதிப்புக்கு நீங்கள் கொடுக்கும் சிட்டை.
zh_hans: 你为函数接收的值赋予的标签。
zh_hant: 你給函式接收的數值所指定的標籤。

source: A number you use to make calculations.
cs: Číslo, které používáte k provádění výpočtů.
de: Eine Zahl, die Du für Berechnungen verwendest.
es: Un número que utilizas para hacer cálculos.
fr: Un nombre que vous utilisez pour faire des calculs.
it: Un numero che usi per fare dei calcoli.
ja: 計算に使用する数値。
nl: Een getal dat je gebruikt voor berekeningen.
pt: Um número que usa para fazer cálculos.
pt_br: Um número que você usa para fazer cálculos.
ru: Число, которое вы используете для вычислений.
ta: கணக்கீடுகளைச் செய்ய நீங்கள் பயன்படுத்தும் எண்.
zh_hans: 用于计算的数字。
zh_hant: 用於計算的數字。

source: The name of a function.
cs: Název funkce.
de: Der Name einer Funktion.
es: El nombre de una función.
fr: Le nom d'une fonction.
it: Il nome di una funzione.
ja: 関数の名前。
nl: De naam van een functie.
pt: O nome de uma função.
pt_br: O nome de uma função.
ru: Имя функции.
ta: ஒரு செயல்பாட்டின் பெயர்.
zh_hans: 函数的名称。
zh_hant: 函式的名稱。

source: How to create functions with parameters
cs: Jak vytvářet funkce s parametry
de: So erstellst Du Funktionen mit Parametern
es: Cómo crear funciones con parámetros
fr: Comment créer des fonctions avec des paramètres
it: Come creare una funzione con parametri
ja: パラメーターを使用して関数を作成する方法
nl: Functies met parameters maken
pt: Como criar funções com parâmetros
pt_br: Como criar funções com parâmetros
ru: Как создавать функции с параметрами
ta: அளவுருக்கள் மூலம் செயல்பாடுகளை எவ்வாறு உருவாக்குவது
zh_hans: 如何创建带参数的函数
zh_hant: 如何建立帶有參數的函式

source: You can give your function parameters when writing its [i]definition[/i] (the line starting with the [code]func[/code] keyword).
cs: Parametry funkce můžete zadat při psaní její [i]definice[/i] (řádek začínající klíčovým slovem [code]func[/code]).
de: Du kannst in deiner Funktion Parameter angeben, wenn Du ihre [i]Definition[/i] schreibst (die Zeile, die mit dem Schlüsselwort [code]func[/code] beginnt).
fr: Vous pouvez donner des paramètres à votre fonction lorsque vous écrivez sa [i]définition[/i] (la ligne commençant par le mot-clé [code]func[/code]).
it: Puoi dare dei parametri pure alle tue funzioni quando scrivi la loro [i]definizione[/i] (la riga che inizia con la parola chiave [code]func[/code]).
nl: Je kunt je functie parameters geven wanneer je de [i]definitie[/i] ervan schrijft (de regel die begint met het [code]func[/code] sleutelwoord).
pt: Pode dar parâmetros às suas funções ao escrever a [i]definição[/i] deles (a linha que começa com a palavra-chave [code]func[/code]).
ru: Вы можете задать параметры вашей функции при написании её [i]определения[/i] (строки, начинающейся с ключевого слова [code]func[/code]).
ta: உங்கள் செயல்பாட்டு அளவுருக்களை அதன் [i] வரையறையை எழுதும்போது [/i] ([குறியீடு] FUNC [/code] முக்கிய சொல்லுடன் தொடங்கும் வரி) கொடுக்கலாம்.

source: To do so, you add a name inside of the parentheses.
cs: Chcete-li tak učinit, přidejte název parametru do závorek.
de: Dazu fügst Du einen Namen innerhalb der Klammern hinzu.
fr: Pour ce faire, vous ajoutez un nom à l'intérieur des parenthèses.
it: Per fare questo, aggiungi un nome all'interno delle parentesi.
nl: Om dit te doen, voeg je een naam toe tussen de haakjes.
pt: Para fazer isso, adicione um nome entre parênteses.
ru: Для этого нужно добавить имя внутрь круглых скобок.
ta: அவ்வாறு செய்ய, நீங்கள் அடைப்புக்குறிக்குள் ஒரு பெயரைச் சேர்க்கிறீர்கள்.

source: You can give parameters any name. How you name functions and parameters is up to you.
cs: Parametry můžete pojmenovat libovolně. Jak pojmenujete funkce a parametry, je jen na vás.
de: Du kannst Parametern einen beliebigen Namen geben. Wie Du Funktionen und Parameter benennst, bleibt dir überlassen.
fr: Vous pouvez donner n'importe quel nom aux paramètres. La façon dont vous nommez les fonctions et les paramètres dépend de vous.
it: Puoi dare ai parametri ogni nome. Sta a te dare i nomi alle funzioni e ai parametri.
nl: Je kunt parameters een willekeurige naam geven. Hoe je functies en parameters noemt is helemaal aan jou.
pt: Pode dar qualquer nome aos parâmetros. Decide como nomear as funções e parâmetros deles.
ru: Вы можете дать параметрам любое имя. Как назвать функции и параметры — решаете вы.
ta: நீங்கள் அளவுருக்கள் எந்த பெயரையும் கொடுக்கலாம். செயல்பாடுகள் மற்றும் அளவுருக்கள் எவ்வாறு பெயரிடப்படுகின்றன என்பது உங்களுடையது.

source: Just remember that names cannot contain spaces. To write parameter names with multiple words, you need to use underscores.
cs: Jen nezapomeňte, že názvy nesmí obsahovat mezery. Chcete-li napsat názvy parametrů s více slovy, musíte použít podtržítka.
de: Denke daran, dass Namen keine Leerzeichen enthalten können. Um Parameternamen mit mehreren Wörtern zu schreiben, musst Du Unterstriche verwenden.
fr: Toutefois, n'oubliez pas que les noms ne peuvent pas contenir d'espaces. Aussi, pour écrire des noms de paramètres avec plusieurs mots, vous devez utiliser des tirets bas.
it: Ricorda soltanto che i nomi non possono contenere spazi. Per scrivere nomi di parametri con più parole, devi usare il trattino basso.
nl: Onthoud wel dat namen geen spaties mogen bevatten. Om parameternamen met meerdere woorden te schrijven, zul je lage streepjes moeten gebruiken.
pt: Lembre-se que os nomes não podem conter espaços. Para escrever nomes de parâmetros com várias palavras, precisa usar o sinal de underscore.
ru: Просто помните, что имена не могут содержать пробелов. Для записи имен параметров, состоящих из нескольких слов, необходимо использовать символы подчёркивания.
ta: பெயர்கள் இடைவெளிகளைக் கொண்டிருக்க முடியாது என்பதை நினைவில் கொள்ளுங்கள். பல சொற்களுடன் அளவுரு பெயர்களை எழுத, நீங்கள் அடிக்கோடிட்டுக் காட்ட வேண்டும்.

source: The following function definition is exactly equivalent to the previous one.
cs: Následující definice funkce je ekvivalentní předchozí.
de: Die folgende Funktionsdefinition entspricht genau der vorherigen.
fr: La définition de fonction suivante est exactement équivalente à la précédente.
it: La seguente definizione di funzione è esattamente equivalente alla precedente.
nl: De volgende functiedefinitie komt precies overeen met de vorige.
pt: A definição de função a seguir é exatamente equivalente à anterior.
ru: Следующее определение функции в точности эквивалентно предыдущему.
ta: பின்வரும் செயல்பாட்டு வரையறை முந்தையவருக்கு சமமானதாகும்.

source: Parameters make your code easier to reuse.
cs: Parametry usnadňují opětovné použití kódu.
de: Parameter erleichtern die Wiederverwendung deines Codes.
fr: Les paramètres facilitent la réutilisation de votre code.
it: I parametri rendono il tuo codice più facile da riutilizzare.
nl: Parameters maken je code gemakkelijker te hergebruiken.
pt: Os parâmetros facilitam a reutilização do seu código.
ru: Параметры облегчают повторное использование кода.
ta: அளவுருக்கள் உங்கள் குறியீட்டை மீண்டும் பயன்படுத்த எளிதாக்குகின்றன.
