Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-20-looping-over-arrays.po
Languages: cs, da, de, es, it, ja, pt_br, ru, ta, tr, uk, zh_hant

source: In that case, we use an array, a loop, and a condition together.
da: I så fald bruger vi et array, en løkke og en betingelse sammen.
de: In diesem Fall verwenden wir ein Array, eine Schleife und eine Bedingung zusammen.
es: En este caso, utilizamos una matriz, un bucle y una condición juntos.
it: In questo caso, usiamo un array, un ciclo e una condizione tutti insieme.
ja: その場合は、配列、ループ、条件を一緒に使用します。
pt_br: Nesse caso, usamos um array, um loop e uma condição juntos.
ru: В этом случае мы используем массив, цикл и условие вместе.
ta: அவ்வாறான நிலையில், நாங்கள் ஒரு வரிசை, ஒரு வளையத்தையும், ஒரு நிலையையும் ஒன்றாகப் பயன்படுத்துகிறோம்.
tr: Bu durumda, bir dizi, bir döngü ve bir koşulu birlikte kullanırız.
uk: У цьому випадку ми використовуємо масив, цикл і умову разом.

source: The code above uses several features you haven't learned yet:
da: Ovenstående kode bruger flere funktioner, du ikke har lært om endnu:
de: Der obige Code verwendet mehrere Funktionen, die Du noch nicht gelernt hast:
es: El código anterior utiliza varios componentes que aún no has aprendido:
it: Il codice qua sopra usa diverse funzionalità che non hai ancora imparato:
ja: 上記のコードでは、まだ学習していないいくつかの機能を使用しています。
pt_br: O código acima usa vários recursos que você ainda não aprendeu:
ru: В приведённом выше коде есть несколько особенностей, с которыми вы ещё не знакомы:
ta: மேலே உள்ள குறியீடு நீங்கள் இதுவரை கற்றுக்கொள்ளாத பல அம்சங்களைப் பயன்படுத்துகிறது:
tr: Yukarıdaki kod, henüz öğrenmediğiniz birkaç özelliği kullanıyor:
uk: Наведений вище код використовує кілька функцій, про які ви ще не вивчили:

source: - In a condition, the [code]in[/code] keyword allows you to check if a value exists [i]in[/i] an array. - The array's [code]append()[/code] function appends a new value at the end of the array.
da: - I en betingelse giver nøgleordet [code]in[/code] dig mulighed for at kontrollere, om en værdi findes [i]i[/i] et array. - Arrayets funktion [code]append()[/code] tilføjer en ny værdi i slutningen af arrayet.
de: - In einer Bedingung kannst Du mit dem Schlüsselwort [code]in[/code] überprüfen, ob ein Wert [i]in[/i] einem Array vorhanden ist. - Die Funktion [code]append()[/code] des Arrays hängt einen neuen Wert am Ende des Arrays an.
es: - En una condición, la palabra clave [code]in[/code] te permite comprobar si un valor existe [i]en[/i] una matriz. - La función [code]append()[/code] de la matriz agrega un nuevo valor al final de la matriz.
it: - In una condizione, la parola chiave [code]in[/code] ti permette di controllare se un valore esiste [i]in[/i] un array. - La funzione [code]append()[/code] degli array accoda una nuova variabile alla fine di un array.
ja: - 条件では、[code]in[/code]キーワードを使用すると、配列に[i]in[/i]の値が存在するかどうかを確認できます。 - 配列の [code]append()[/code] 関数は、配列の末尾に新しい値を追加します。
pt_br: - Em uma condição, a palavra-chave [code]in[/code] permite verificar se existe um valor [i]dentro[/i] de um array. - A função [code]append()[/code] do array adiciona um novo valor no final do array.
ru: - В условии, ключевое слово [code]in[/code] (в) позволяет вам проверить, существует ли конкретное значение [i]в[/i] массиве. - Функция массива [code]append()[/code] добавляет новое значение в конец массива.
ta: - ஒரு நிபந்தனையில், [/குறியீடு] முக்கிய சொற்களில் உள்ள [குறியீடு] ஒரு வரிசையில் [/i] ஒரு மதிப்பு இருக்கிறதா என்று சரிபார்க்க உங்களை அனுமதிக்கிறது. - வரிசையின் [குறியீடு] பிற்சேர் () [/code] செயல்பாடு வரிசையின் முடிவில் புதிய மதிப்பைச் சேர்க்கிறது.
tr: - Bir koşul yazımında, [code]in[/code] anahtar kelimesi, bir değerin, bir dizinin [i]içinde[/i] var olup olmadığını kontrol etmenizi sağlar. - Dizinin [code]append()[/code] üye fonksiyonu, dizinin sonuna yeni bir değer ekler.
uk: - В умові ключове слово [code]in[/code] дозволяє перевірити, чи існує значення [i]в[/i] масиві. - Функція [code]append()[/code] масиву додає нове значення в кінець масиву.

source: Notice the use of a period after the [code]selected_units[/code] variable, to call the [code]append()[/code] function. It's because this function exists only on arrays.
da: Bemærk brugen af et punktum efter variablen [code]selected_units[/code] for at kalde funktionen [code]append()[/code]. Det skyldes, at denne funktion kun findes på arrays.
de: Beachte die Verwendung eines Punkts nach der Variablen [code]selected_units[/code], um die Funktion [code]append()[/code] aufzurufen. Dies liegt daran, dass diese Funktion nur für Arrays vorhanden ist.
es: Fíjate en el uso de un punto después de la variable [code]selected_units[/code], para llamar a la función [code]append()[/code]. Esto se debe a que esta función sólo existe en las matrices.
it: Nota bene l'uso del punto dopo la variabile [code]selected_units[/code], per chiamare la funzione [code]append()[/code]. Questo avviene perchè questa funzione esiste solo sugli array.
ja: [code]append()[/code] 関数を呼び出すために、[code]selected_units[/code] 変数の後にピリオドが使用されていることに注意してください。これは、この関数が配列にのみ存在するためです。
pt_br: Observe o uso de um ponto final após a variável [code]selected_units[/code] para chamar a função [code]append()[/code]. É porque essa função existe apenas em arrays.
ru: Обратите внимание на использование точки после имени переменной [code]selected_units[/code] для вызова функции [code]append()[/code]. Точка необходима, так как эта функция существует только в массивах.
ta: . ஏனென்றால் இந்த செயல்பாடு வரிசைகளில் மட்டுமே உள்ளது.
tr: [code]append()[/code] fonksiyonunu çağırmak için, [code]selected_units[/code] değişkeninden sonra bir nokta kullanıldığına dikkat edin. Bunun nedeni, bu fonksiyonun yalnızca dizilerde bulunmasıdır.
uk: Зверніть увагу на використання крапки після змінної [code]selected_units[/code] для виклику функції [code]append()[/code]. Це тому, що ця функція існує лише в масивах.

source: When functions exist only on a specific value type, you write a dot after the value to call the function on it.
da: Når funktioner kun findes på en bestemt værditype, skriver du et punktum efter værdien for at kalde funktionen på den.
de: Wenn Funktionen nur für einen bestimmten Werttyp vorhanden sind, schreibst du einen Punkt nach dem Wert, um die Funktion aufzurufen.
es: Cuando las funciones sólo existen en un tipo de valor específico, se escribe un punto después del valor para llamar a la función en él.
it: Quando le funzioni esistono solo su un particolare tipo di valore, inserisci un punto dopo il valore per chiamare la funzione su di esso.
ja: 関数が特定の値型にのみ存在する場合は、値の後にドットを記述して、その値に対して関数を呼び出します。
pt_br: Quando as funções existem apenas em um tipo de valor específico, você escreve um ponto final após o valor para chamar a função nele.
ru: Когда функция существует только в определённом типе значений, вы должны использовать точку после значения для вызова функции для него
ta: செயல்பாடுகள் ஒரு குறிப்பிட்ட மதிப்பு வகையில் மட்டுமே இருக்கும்போது, அதன் செயல்பாட்டை அழைக்க மதிப்புக்குப் பிறகு ஒரு புள்ளியை எழுதுகிறீர்கள்.
tr: Fonksiyonlar, eğer yalnızca belirli bir değer tipinde mevcut ise, fonksiyonu bu değer üzerinden çağırmak için, değerden sonra bir nokta yazarsınız.
uk: Якщо функції існують лише для певного типу значення, ви пишете крапку після значення, щоб викликати функцію для нього.

source: We'll revisit those two features again in the following lessons.
da: Vi vil gennemgå disse to funktioner igen i de følgende lektioner.
de: Wir werden diese beiden Merkmale in den folgenden Lektionen noch einmal aufgreifen.
es: Revisaremos estos dos componentes nuevamente en las siguientes lecciones.
it: Rivisiteremo quelle due funzionalità di nuovo nelle prossime lezioni.
ja: この 2 つの機能については、次のレッスンでもう一度説明します。
pt_br: Vamos rever esses dois recursos novamente nas lições a seguir.
ru: Мы ещё встретимся с этими особенностями в последующих уроках.
ta: அந்த இரண்டு அம்சங்களையும் பின்வரும் பாடங்களில் மீண்டும் பார்வையிடுவோம்.
tr: Bu iki özelliği, ilerleyen derslerde tekrar gözden geçireceğiz.
uk: Ми знову розглянемо ці дві функції в наступних уроках.

source: The beauty of loops is that they work regardless of the size of your arrays.
da: Det smukke ved loops er, at de fungerer uanset størrelsen på dine arrays.
de: Das Schöne an Schleifen ist, dass sie unabhängig von der Größe deiner Arrays funktionieren.
es: Lo maravilloso de los bucles es que funcionan independientemente del tamaño de tus matrices
it: La bellezza dei cicli sta nel fatto che funzionano indipendentemente dalla grandezza dell'array.
ja: ループの優れた点は、配列のサイズに関係なく機能することです。
pt_br: A beleza dos loops é que eles funcionam independentemente do tamanho de seus arrays.
ru: Циклы прекрасны тем, что они работают независимо от размера ваших массивов.
ta: சுழல்களின் அழகு என்னவென்றால், அவை உங்கள் வரிசைகளின் அளவைப் பொருட்படுத்தாமல் செயல்படுகின்றன.
tr: Döngülerin güzelliği, dizilerinizin boyutundan bağımsız olarak çalışmasıdır.
uk: Принадність циклів полягає в тому, що вони працюють незалежно від розміру ваших масивів.

source: The code just works whether you have one or ten thousand units to select. It is all accomplished with only a couple lines of code.
da: Koden fungerer, uanset om du har én eller ti tusind enheder at vælge. Det hele opnås med kun et par linjer kode.
de: Der Code funktioniert einfach, egal ob Du eine oder 10.000 Einheiten zur Auswahl hast. Und das mit nur ein paar Zeilen Code.
es: El código funciona tanto si tienes una como si tienes diez mil unidades que seleccionar. Y eso con sólo un par de líneas de código.
it: Il codice opera semplicemente, che tu abbia uno o dieci mila unità da selezionare. Ed è tutto realizzato con poche righe di codice.
ja: このコードは、選択するユニットが 1 つであろうと 1 万個であろうと機能します。これらはすべて、わずか数行のコードで実現されます。
pt_br: O código funciona igualmente se você tiver uma ou 10.000 unidades para selecionar. E isso com apenas algumas linhas de código.
ru: Код будет работать одинаково при выборе одного или десяти тысяч юнитов. Всё это делается в несколько строчек кода.
ta: நீங்கள் தேர்ந்தெடுக்க ஒன்று அல்லது பத்தாயிரம் அலகுகள் இருக்கிறதா என்று குறியீடு செயல்படுகிறது. இவை அனைத்தும் இரண்டு குறியீட்டைக் கொண்டு நிறைவேற்றப்படுகின்றன.
tr: Kod, seçilecek bir veya on bin biriminiz olsa da çalışır. Tüm bunlar sadece birkaç satır kod ile gerçekleştirilir.
uk: Код просто працює незалежно від того, чи є у вас одна чи десять тисяч одиниць для вибору. Все це досягається лише за допомогою пари рядків коду.

source: That's the power of computer programming.
da: Det er styrken ved computerprogrammering.
de: Das ist die Macht der Computerprogrammierung.
es: Ese es el poder de la programación informática.
it: Questo è il potere della programmazione.
ja: それがコンピュータプログラミングの力です。
pt_br: Esse é o poder da programação.
ru: В этом и заключается сила компьютерного программирования.
ta: அது கணினி நிரலாக்கத்தின் சக்தி.
tr: Bu bilgisayar programcılığının gücüdür.
uk: Це сила комп’ютерного програмування.

source: In the following practices, you will use arrays combined with [code]for[/code] loops to achieve similar results.
da: I de følgende øvelser vil du bruge arrays kombineret med [code]for[/code]-løkker for at opnå lignende resultater.
de: In den folgenden Übungen verwendest Du Arrays in Kombination mit [code]for[/code]-Schleifen, um ähnliche Ergebnisse zu erzielen.
es: En las siguientes prácticas, utilizarás matrices combinadas con bucles [code]for[/code] para conseguir resultados similares.
it: Nelle seguenti pratiche, userai array insieme a dei cicli [code]for[/code] per raggiungere risultati simili.
ja: 次の演習では、配列を [code]for[/code] ループと組み合わせて使用し、同様の結果を実現します。
pt_br: Nas práticas a seguir, você vai usar arrays combinadas com loops [code]for[/code] para obter resultados semelhantes.
ru: В следующих упражнениях вы будете использовать массивы в сочетании с циклами [code]for[/code] для достижения подобных результатов.
ta: பின்வரும் நடைமுறைகளில், இதேபோன்ற முடிவுகளை அடைய [/குறியீடு] சுழல்களுக்கான [குறியீடு] உடன் இணைந்து வரிசைகளைப் பயன்படுத்துவீர்கள்.
tr: Sıradaki alıştırmalarda, benzer sonuçlar elde etmek için, [code]for[/code] döngüleriyle birlikte dizileri kullanacaksınız.
uk: У наступних вправах ви використовуватимете масиви в поєднанні з циклами [code]for[/code] для досягнення подібних результатів.

source: Move the robot along the path
cs: Pohyb robota po cestě
da: Flyt robotten langs stien
de: Bewege den Roboter entlang des Pfades
es: Mover el robot a lo largo de la trayectoria
it: Sposta il robot lungo il percorso
ja: ロボットを経路に沿って移動させる
pt_br: Mova o robô ao longo do caminho
ru: Перемещаем робота по пути
ta: ரோபோவை பாதையில் நகர்த்தவும்
tr: Robotu , verilen yol boyunca hareket ettirin
uk: Перемістіть робота по доріжці
zh_hant: 讓機器人沿著路徑移動

source: Our AI pathfinding algorithm provided a path for the robot to move to the right edge of the grid. Your task is to use a [code]for[/code] loop to make the robot move.
da: Vores AI-stifindingsalgoritme gav robotten en sti, så den kunne bevæge sig til højre kant af gitteret. Din opgave er at bruge en [code]for[/code]-løkke til at få robotten til at bevæge sig.
de: Unser KI-Pfadfindungsalgorithmus stellte einen Pfad für den Roboter bereit, um sich an den rechten Rand des Rasters zu bewegen. Ihre Aufgabe ist es, eine [code]for[/code]-Schleife zu verwenden, um den Roboter in Bewegung zu bringen.
es: Nuestro algoritmo de búsqueda de rutas de la IA proporcionó una trayectoria para que el robot se moviera hasta el borde derecho de la cuadrícula. Tu tarea es utilizar un bucle [code]for[/code] para que el robot se mueva.
it: Il nostro algoritmo di pathfinding ci ha fornito un percorso per portare il robot all'angolo destro della griglia. Il tuo obiettivo è utilizzare un ciclo [code]for[/code] per far muovere un robot.
ja: AI経路探索アルゴリズムは、ロボットがグリッドの右端に移動するための経路を提供しました。あなたの仕事は、[code]for[/code]ループを使用してロボットを動かすことです。
pt_br: Nosso algoritmo de busca de IA forneceu um caminho para o robô se mover para a borda direita do grid. Sua tarefa é usar um loop [code]for[/code] para fazer o robô se mover.
ru: Алгоритм поиска пути нашего ИИ предоставил путь, по которому робот может переместиться в правый угол сетки. Ваша задача — использовать цикл [code]for[/code], чтобы заставить робота двигаться.
ta: எங்கள் AI பாத்ஃபைண்டிங் அல்காரிதம் ரோபோ கட்டத்தின் வலது விளிம்பிற்கு செல்ல ஒரு பாதையை வழங்கியது. ரோபோவை நகர்த்த [/குறியீடு] வளையத்திற்கு [குறியீடு] பயன்படுத்துவதே உங்கள் பணி.
tr: Yapay zeka yol bulma algoritmamız, robotun ızgaranın sağ kenarına gitmesi için bir yol verdi. Sizin göreviniz, robotu hareket ettirmek için bir [code]for[/code] döngüsü kullanmak.
uk: Наш алгоритм штучного інтелекту запропонував роботі шлях до правого краю сітки. Ваше завдання полягає в тому, щоб за допомогою циклу [code]for[/code] робот рухався.

source: To move the robot, call [i]its[/i] [code]move_to()[/code] function, like so: [code]robot.move_to()[/code].
da: For at bevæge robotten skal du kalde [i]dens[/i] [code]move_to()[/code]-funktion, således: [code]robot.move_to()[/code].
de: Um den Roboter zu bewegen, rufe [i]dessen[/i] Funktion [code]move_to()[/code] wie folgt auf: [code]robot.move_to()[/code].
es: Para mover el robot, llama a [i]su[/i] función [code]move_to()[/code], así: [code]robot.move_to()[/code].
it: Per muovere il robot, chiama la [i]sua[/i] funzione [code]move_to()[/code], così: [code]robot.move_to()[/code].
ja: ロボットを動かすには、[code]robot.move_to()[/code] のように[i]その[/i] [code]move_to()[/code] 関数を呼び出します。
pt_br: Para mover o robô, chame a função [code]move_to()[/code] [i]dele[/i], assim: [code]robot.move_to()[/code].
ru: Для перемещения робота, вызовите [i]его[/i] функцию [code]move_to()[/code], как в этом примере: [code]robot.move_to()[/code].
ta: ரோபோவை நகர்த்த, [i] அதன் [/i] [குறியீடு] MOVE_TO () [/குறியீடு] செயல்பாட்டை அழைக்கவும், எனவே: [குறியீடு] robot.move_to () [/code].
tr: Robotu hareket ettirmek için, onun [i]kendi[/i] [code]move_to()[/code] fonksiyonunu şu şekilde çağırın: [code]robot.move_to()[/code].
uk: Щоб перемістити робота, викличте [i]його[/i] [code]move_to()[/code] функцію, наприклад: [code]robot.move_to()[/code].

source: The [code]move_to()[/code] function only exists on the robot, which is why you need to access it this way.
da: Funktionen [code]move_to()[/code] findes kun på robotten, hvilket er grunden til, at du skal tilgå den på denne måde.
de: Die Funktion [code]move_to()[/code] existiert nur für den Roboter, weshalb Du auf diese Weise darauf zugreifen musst.
es: La función [code]move_to()[/code] sólo existe en el robot, por lo que tienes que acceder a ella de esta manera.
it: La funzione [code]move_to()[/code] esiste solo sul robot, per questo motivo devi accedervi in questo modo.
ja: [code]move_to()[/code] 関数はロボットにのみ存在するため、この方法でアクセスする必要があります。
pt_br: A função [code]move_to()[/code] existe apenas no robô, e é por isso que você precisa acessá-la dessa maneira.
ru: Функция [code]move_to()[/code] существует только в роботе, поэтому получить к ней доступ вы можете только таким образом.
ta: [குறியீடு] MOVE_TO () [/குறியீடு] செயல்பாடு ரோபோவில் மட்டுமே உள்ளது, அதனால்தான் நீங்கள் இதை இந்த வழியில் அணுக வேண்டும்.
tr: [code]move_to()[/code] fonksiyonu sadece robot üzerinde mevcuttur, bu yüzden bu şekilde erişmeniz gerekiyor.
uk: Функція [code]move_to()[/code] існує лише на роботі, тому вам потрібно отримати до неї доступ таким чином.

source: Our AI pathfinding algorithm is giving us a path to move the robot. Now, you need to make the turtle move along the path.
cs: Náš algoritmus pro hledání cesty s umělou inteligencí nám určuje cestu, po které se má robot pohybovat. Nyní je třeba, aby se po této cestě pohybovala želva.
da: Vores AI-stifindingsalgoritme giver os en rute til at bevæge robotten. Nu skal du få skildpadden til at bevæge sig langs stien.
de: Unser KI-Pfadfindungsalgorithmus gibt uns einen Weg, um den Roboter zu bewegen. Jetzt musst Du die Schildkröte dazu bringen, sich auf dem Weg zu bewegen.
es: Nuestro algoritmo de búsqueda de rutas de la IA nos da una trayectoria para mover el robot. Ahora, tienes que hacer que la tortuga se mueva a lo largo de la trayectoria.
it: Il nostro algoritmo pathfinding ci fornisce un percorso per fa muovere il robot. Ora, devi far muovere la tartaruga lungo il percorso.
ja: 私たちのAI経路探索アルゴリズムは、ロボットを動かすための経路を与えてくれます。次に、カメをパスに沿って移動させる必要があります。
pt_br: Nosso algoritmo de busca de IA está nos dando um caminho para mover o robô. Agora, você precisa fazer a tartaruga se mover ao longo do caminho.
ru: Алгоритм поиска пути нашего ИИ предоставил нам путь по которому должен двигаться робот. Теперь вам нужно заставить робота двигаться по нему.
ta: எங்கள் AI பாத்ஃபைண்டிங் வழிமுறை ரோபோவை நகர்த்துவதற்கான ஒரு பாதையை நமக்குத் தருகிறது. இப்போது, நீங்கள் ஆமை பாதையில் செல்ல வேண்டும்.
tr: Yapay zeka yol bulma algoritmamız bize robotu hareket ettirmek için bir yol verdi. Şimdi, kaplumbağayı, bu yol boyunca hareket ettirmeniz gerekiyor.
uk: Наш алгоритм штучного інтелекту визначає шлях для переміщення робота. Тепер вам потрібно змусити черепаху рухатися по стежці.
zh_hant: 我們的 AI 路徑尋找演算法已經提供了一條路徑來移動機器人。現在你需要讓烏龜沿著這條路徑移動。

source: Back to the drawing board
cs: Zpět k rýsovacímu prknu
da: Tilbage til tegnebrættet
de: Zurück zur Planung
es: De vuelta a la mesa de dibujo
it: Ricominciamo da capo
ja: 白紙に戻す
pt_br: De volta à prancheta de planejamento
ru: Возвращаемся к доске для рисования
ta: வரைதல் வாரியத்திற்குத் திரும்பு
tr: Çizim tahtasına geri dönüş
uk: Назад до креслярської дошки
zh_hant: 回到畫板

source: We want to draw many rectangles, something surprisingly common in games.
da: Vi vil gerne tegne mange rektangler, noget der er overraskende almindeligt i spil.
de: Wir wollen viele Rechtecke zeichnen, was in Spielen überraschend häufig vorkommt.
es: Queremos dibujar muchos rectángulos, algo sorprendentemente común en los juegos.
it: Vogliamo disegnare molti rettangoli, qualcosa di sorprendentemente comune nei giochi.
ja: 矩形をたくさん描きたいのですが、これはゲームでは意外とよくあることです。
pt_br: Queremos desenhar muitos retângulos, algo surpreendentemente comum em jogos.
ru: Мы хотим нарисовать много прямоугольников, что на удивление часто встречается в играх.
ta: நாங்கள் பல செவ்வகங்களை வரைய விரும்புகிறோம், விளையாட்டுகளில் வியக்கத்தக்க ஒன்று.
tr: Oyunlarda, şaşırtıcı derecede yaygın olan, çok sayıda dikdörtgen çizmek istiyoruz.
uk: Ми хочемо намалювати багато прямокутників, що напрочуд часто зустрічається в іграх.

source: However, writing this code by hand can get tedious. Instead, you could store the size of your shapes in arrays and use a loop to draw them all in batches.
da: Det kan dog blive kedeligt at skrive denne kode i hånden. I stedet kan du gemme størrelsen på dine figurer i arrays og bruge en løkke til at tegne dem alle i batches.
de: Dies von Hand zu programmieren ist sehr mühsam. Stattdessen kannst Du die Maße deiner Rechtecke in einem Array hinterlegen und dann eine Schleife verwenden und sie stapelweise zu zeichnen.
es: Sin embargo, escribir el código a mano resulta tedioso. En su lugar, a menudo almacenarás el tamaño de tus formas en matrices y utilizarás un bucle para dibujarlas todas en lotes.
it: Tuttavia, scrivere questo codice a mano può essere tedioso. Invece, potresti conservare la grandezza delle tue forme in degli array e usare un ciclo per disegnale tutte in blocchi.
ja: ただし、このコードを手作業で記述するのは面倒な場合があります。代わりに、図形のサイズを配列に格納し、ループを使用してすべての図形をバッチで描画できます。
pt_br: Ao escrever o código à mão, torna-se tedioso ao longo do tempo. Ao invés disso, você geralmente vai armazenar o tamanho de suas formas em arrays e usa um loop para desenhá-las em lotes.
ru: Однако, писать код вручную было бы утомительно. Вместо этого вы можете записать размер всех фигур в массив и использовать цикл для рисования всех их разом.
ta: இருப்பினும், இந்த குறியீட்டை கையால் எழுதுவது கடினமானது. அதற்கு பதிலாக, உங்கள் வடிவங்களின் அளவை வரிசைகளில் சேமித்து, அவை அனைத்தையும் தொகுதிகளில் வரைய ஒரு வளையத்தைப் பயன்படுத்தலாம்.
tr: Ancak bu kodu elle yazmak sıkıntılı olabilir. Bunun yerine, şekillerinin boyutlarını dizilerde saklayabilir, ve hepsini toplu olarak çizmek için bir döngü kullanabilirsiniz.
uk: Однак написання цього коду вручну може стати втомливим. Замість цього ви можете зберігати розмір своїх фігур у масивах і використовувати цикл, щоб малювати їх усі партіями.

source: That's what you'll do in this practice.
da: Det er det, du skal gøre i denne øvelse.
de: Das werden wir nun üben.
es: Eso es lo que harás en esta práctica.
it: Questo è quello che farai in questa pratica.
ja: それがこの演習で行うことです。
pt_br: Isso é o que você vai fazer nessa prática.
ru: Это именно то, что вы будете делать в этом упражнении.
ta: இந்த நடைமுறையில் நீங்கள் என்ன செய்வீர்கள்.
tr: Bu uygulamada yapacağınız şey tam da bu.
uk: Ось що ви будете робити в цій практиці.
