Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-13-conditions.po
Languages: cs, da, es, it, ja, nl, pt, ru, ta, tr, uk, zh_hant

source: Suppose our character has [code]100[/code] health. What would the value of health be if we called [code]take_damage(25)[/code] [b]five times[/b]?
cs: Předpokládejme, že naše postava má [code]100[/code] zdraví. Jaká by byla hodnota zdraví, kdybychom zavolali [code]take_damage(25)[/code] [b] pětkrát[/b]?
es: Supongamos que nuestro personaje tiene [code]100[/code] de salud. ¿Cuál sería el valor de la salud si llamáramos a [code]take_damage(25)[/code] [b]cinco veces[/b]?
ta: எங்கள் பாத்திரத்தில் [குறியீடு] 100 [/குறியீடு] உடல்நலம் உள்ளது என்று வைத்துக்கொள்வோம். நாங்கள் [குறியீடு] டேக்_டேச் (25) [/குறியீடு] [பி] ஐந்து முறை [/b] என்று அழைத்தால் ஆரோக்கியத்தின் மதிப்பு என்னவாக இருக்கும்?
uk: Припустимо, у нашого персонажа [code]100[/code] здоров'я. Якою буде цінність здоров’я, якщо ми викликаємо [code]take_damage(25)[/code] [b]п’ять разів[/b]?
zh_hant: 假設我們的角色有 [code]100[/code] 生命值。 如果我們呼叫 [code]take_damage(25)[/code] [b]五次[/b]，那麼生命值的值會是多少？

source: Calling [code]take_damage(25)[/code] five times would subtract a total of [code]125[/code] from [code]100[/code]. 100 75 50 25 0 -25
cs: Pětkrát zavoláním [code]take_damage(25)[/code] se od [code]100[/code] odečte celkem [code]125[/code]. 100 75 50 25 0 -25
es: Llamar a [code]take_damage(25)[/code] cinco veces restaría un total de [code]125[/code] a [code]100[/code]. 100 75 50 25 0 -25
ta: [குறியீடு] டேக்_டாமேச் (25) [/குறியீடு] ஐந்தை ஐந்து முறை அழைப்பது [குறியீடு] 100 [/குறியீடு] இலிருந்து மொத்தம் [குறியீடு] 125 [/குறியீடு] ஐக் கழிக்கும். 100 75 50 25 0 -25
uk: Виклик [code]take_damage(25)[/code] п’ять разів призведе до віднімання [code]125[/code] із [code]100[/code]. 100 75 50 25 0 -25
zh_hant: 呼叫 [code]take_damage(25)[/code] 五次會從 [code]100[/code] 中扣除總共 [code]125[/code]。 100 75 50 25 0 -25

source: We can use conditions to run actions [b]selectively[/b]. Conditions make your code branch into two paths: if the condition is met, the computer will run the corresponding instructions. Otherwise, those instructions will not run at all.
cs: Pomocí podmínek můžeme spouštět akce [b]selektivně[/b]. Podmínky způsobí, že se váš kód rozvětví na dvě cesty: pokud je podmínka splněna, počítač spustí odpovídající instrukce. V opačném případě se tyto instrukce vůbec nespustí.
es: Podemos usar condiciones para ejecutar acciones [b]selectivamente[/b]. Las condiciones hacen que tu código se ramifique en dos caminos: si la condición se cumple, la computadora ejecutará las instrucciones correspondientes. De lo contrario, esas instrucciones no se ejecutarán.
ta: செயல்களை இயக்க நிபந்தனைகளைப் பயன்படுத்தலாம் [b] தேர்ந்தெடுக்கப்பட்ட முறையில் [/b]. நிபந்தனைகள் உங்கள் குறியீடு கிளையை இரண்டு பாதைகளாக மாற்றுகின்றன: நிபந்தனை நிறைவு செய்யப்பட்டால், கணினி தொடர்புடைய வழிமுறைகளை இயக்கும். இல்லையெனில், அந்த வழிமுறைகள் இயங்காது.
uk: Ми можемо використовувати умови для виконання дій [b]вибірково[/b]. Умови роблять ваш код розгалуженим на два шляхи: якщо умова виконана, комп’ютер виконає відповідні інструкції. Інакше ці інструкції не виконуватимуться взагалі.
zh_hant: 我們可以使用條件來 [b]選擇性地[/b] 執行動作。 條件使你的程式碼分成兩條路徑：如果條件成立，電腦將執行對應的指令。否則，這些指令將完全不執行。

source: When the computer checks a condition, this is called [b]to evaluate[/b] a condition. All conditions [b]evaluate[/b] to either [code]true[/code] or [code]false[/code]. Either the player is pressing the button, or not. Either the character is touching an enemy, or not. In our case, [i]if[/i] the health goes over a maximum value, we want to reset it to the maximum. To define a condition, we use the [code]if[/code] keyword. We write a line starting with [code]if[/code], [ignore]type the condition to evaluate, and end the line with a colon.
ta: கணினி ஒரு நிபந்தனையை சரிபார்க்கும்போது, இது [/b] ஒரு நிபந்தனையை மதிப்பிடுவதற்கு [B] என்று அழைக்கப்படுகிறது. அனைத்து நிபந்தனைகளும் [b] [/b] ஐ [குறியீடு] உண்மை [/குறியீடு] அல்லது [குறியீடு] தவறான [/குறியீடு] என மதிப்பிடுகின்றன. வீரர் பொத்தானை அழுத்துகிறார், இல்லையா. பாத்திரம் ஒரு எதிரியைத் தொடுகிறது, இல்லையா. எங்கள் விசயத்தில், [i] [/i] உடல்நலம் அதிகபட்ச மதிப்புக்கு மேல் சென்றால், அதை அதிகபட்சமாக மீட்டமைக்க விரும்புகிறோம். ஒரு நிபந்தனையை வரையறுக்க, [/குறியீடு] முக்கிய சொல்லைப் பயன்படுத்துகிறோம். [/குறியீடு] உடன் தொடங்கி [/குறியீடு], [புறக்கணிக்கவும்] மதிப்பிடுவதற்கான நிபந்தனையைத் தட்டச்சு செய்து, ஒரு பெருங்குடலுடன் வரியை முடிக்கிறோம்.
uk: Коли комп’ютер перевіряє умову, це називається [b]оцінкою[/b] умови. Усі умови [b]оцінюються[/b] як [code]true[/code] або [code]false[/code]. Гравець або натискає кнопку, або ні. Або персонаж торкається ворога, або ні. У нашому випадку, [i]якщо[/i] здоров’я перевищує максимальне значення, ми хочемо скинути його до максимуму. Щоб визначити умову, ми використовуємо ключове слово [code]if[/code]. Ми пишемо рядок, починаючи з [code]if[/code], [ignore]вводимо умову для оцінки та закінчуємо рядок двокрапкою.
zh_hant: 當電腦檢查條件時，這稱為 [b]評估[/b] 條件。所有條件都會[b]評估[/b]為 [code]true[/code] 或 [code]false[/code]。 要麼玩家正在按下按鈕，要麼沒有。要麼角色碰到敵人，要麼沒有。 在我們的情況中，[b]如果[/b]生命值超過最大值，我們希望將其重置為最大值。 要定義條件，我們使用 [code]if[/code] 關鍵字。我們寫一行以 [code]if[/code] 開頭，輸入要評估的條件，並以冒號結尾。

source: Notice the [code]>[/code] comparison sign. We read this symbol as "greater than". We've seen how function definitions use a colon at the end of the first line and nest content inside. In GDScript, this syntax is a recurring pattern for all code blocks. The computer knows which instructions belong to the condition because they are indented.
ta: [குறியீடு]> [/குறியீடு] ஒப்பீட்டு அடையாளத்தைக் கவனியுங்கள். இந்த சின்னத்தை "விட பெரியது" என்று படிக்கிறோம். செயல்பாட்டு வரையறைகள் முதல் வரியின் முடிவில் ஒரு பெருங்குடலையும் உள்ளே கூடு உள்ளடக்கத்தையும் எவ்வாறு பயன்படுத்துகின்றன என்பதை நாங்கள் கண்டோம். GDSCRIPT இல், இந்த தொடரியல் அனைத்து குறியீடு தொகுதிகளுக்கும் தொடர்ச்சியான வடிவமாகும். அவை உள்தள்ளப்பட்டதால் எந்த வழிமுறைகள் நிலைக்கு சொந்தமானவை என்பது கணினியைத் தெரியும்.
uk: Зверніть увагу на знак порівняння [code]>[/code]. Ми читаємо цей символ як «більше ніж». Ми бачили, як визначення функцій використовують двокрапку в кінці першого рядка та вкладають вміст усередину. У GDScript цей синтаксис є повторюваним шаблоном для всіх блоків коду. Комп’ютер знає, які інструкції належать до умови, оскільки вони мають відступ.
zh_hant: 注意到 [code]>[/code] 這個比較符號，我們將此符號讀作「大於」。 我們已經看到函式定義在第一行結尾處使用冒號，並將內容縮排在內部。 在 GDScript 中，這種語法是所有程式區塊的重複模式。 電腦知道哪些指令屬於條件，因為它們是縮排的。

source: In the above example, we used the [code]>[/code] syntax to mean "greater than". We can compare numbers in other ways too. [code]>[/code] means "greater than" [code]<[/code] means "less than" [code]==[/code] means "equal to" [code]!=[/code] means "not equal to" Here's how we might use these in [code]if[/code] statements.
cs: Ve výše uvedeném příkladu jsme použili syntaxi [code]>[/code], která znamená "větší než". Čísla můžeme porovnávat i jinými způsoby. [code]>[/code] znamená "větší než" [code]<[/code] znamená "menší než" [code]==[/code] znamená "rovná se" [code]!=[/code] znamená "nerovná se" Tady je uvedeno, jak bychom je mohli použít v příkazech [code]if[/code].
es: En el ejemplo anterior, usamos la sintaxis [code]>[/code] para designar "mayor que". También podemos comparar números de otras formas. [code]>[/code] significa "mayor que" [code]<[/code] significa "menor que" [code]==[/code] significa "igual a" [code]=[/code] significa "no igual a" Así es como podríamos utilizarlos en las declaraciones [code]if[/code].
ta: மேலே உள்ள எடுத்துக்காட்டில், [குறியீடு]> [/குறியீடு] தொடரியல் பயன்படுத்தினோம். எண்களை வேறு வழிகளிலும் ஒப்பிடலாம். [குறியீடு]> [/குறியீடு] என்றால் "விட பெரியது" [குறியீடு] <[/குறியீடு] என்றால் "குறைவாக" [குறியீடு] == [/குறியீடு] என்றால் "சமம்" [குறியீடு]! = [/குறியீடு] என்றால் "சமமாக இல்லை" [/குறியீடு] அறிக்கைகளில் இவற்றை [குறியீடு] இல் எவ்வாறு பயன்படுத்தலாம் என்பது இங்கே.
uk: У наведеному вище прикладі ми використали синтаксис [code]>[/code] для значення «більше ніж». Ми можемо порівнювати числа й іншими способами. [code]>[/code] означає "більше ніж" [code]<[/code] означає "менше ніж" [code]==[/code] означає "дорівнює" [code]!=[/code] означає "не дорівнює" Ось як ми можемо використовувати їх у операторах [code]if[/code].
zh_hant: 在上面的範例中，我們使用了 [code]>[/code] 語法來表示「大於」。 我們也可以用其他方式來比較數字。 [code]>[/code] 代表「大於」 [code]<[/code] 代表「小於」 [code]==[/code] 代表「等於」 [code]!=[/code] 代表「不等於」 以下是我們可能在 [code]if[/code] 語句中使用這些的方式。

source: The [code]pass[/code] keyword prevents errors in our code when a line cannot be empty. For example, we must have a line of code after a function definition or an [code]if[/code] block. When you don't know what to write yet, you can use the [code]pass[/code] keyword as a placeholder, and Godot won't give any errors. In the previous example, if there was nothing below the [code]if[/code] lines, Godot would give us an "Expected an indented block after 'if' " error.
cs: Klíčové slovo [code]pass[/code] zabraňuje chybám v našem kódu, v případě že řádek nemůže být prázdný. Například za definicí funkce nebo bloku [code]if[/code] musíme mít řádek kódu. Pokud ještě nevíte, co máte napsat, můžete použít klíčové slovo [code]pass[/code] jako zástupný znak a Godot nebude hlásit žádné chyby. V předchozím příkladu, kdyby pod řádky [code]if[/code] nic nebylo, Godot by nám vyhodil chybu "Expected an indented block after 'if' ".
ta: [குறியீடு] பாச் [/குறியீடு] முக்கிய சொல் ஒரு வரி காலியாக இருக்கும்போது எங்கள் குறியீட்டில் உள்ள பிழைகளைத் தடுக்கிறது. எடுத்துக்காட்டாக, ஒரு செயல்பாட்டு வரையறை அல்லது [/குறியீடு] தொகுதியால் [/குறியீடு] ஒரு குறியீட்டின் வரி இருக்க வேண்டும். இன்னும் என்ன எழுதுவது என்று உங்களுக்குத் தெரியாதபோது, நீங்கள் [குறியீடு] பாச் [/குறியீடு] முக்கிய சொல்லை ஒரு ஒதுக்கிடமாகப் பயன்படுத்தலாம், மேலும் கோடோட் எந்த பிழைகளையும் கொடுக்க மாட்டார். முந்தைய எடுத்துக்காட்டில், [/குறியீடு] வரிகளுக்குக் கீழே எதுவும் இல்லை என்றால், கோடோட் எங்களுக்கு ஒரு "'என்றால்'" பிழையின் பின்னர் ஒரு உள்தள்ளப்பட்ட தொகுதியை எதிர்பார்க்கலாம்.
uk: Ключове слово [code]pass[/code] запобігає помилкам у нашому коді, коли рядок не може бути порожнім. Наприклад, ми повинні мати рядок коду після визначення функції або блоку [code]if[/code]. Якщо ви ще не знаєте, що писати, ви можете використовувати ключове слово [code]pass[/code] як заповнювач, і Godot не видаватиме жодних помилок. У попередньому прикладі, якщо під рядками [code]if[/code] нічого не було, Godot видасть нам помилку «Очікується блок із відступом після 'if'».
zh_hant: [code]pass[/code] 關鍵字可以防止當某一行無法留空時產生錯誤。 例如，我們必須在函式定義或 [code]if[/code] 區塊之後寫一行程式碼。當你還不知道要寫什麼時，可以使用 [code]pass[/code] 關鍵字作為佔位符，這樣 Godot 就不會給出錯誤。 在前面的範例中，如果 [code]if[/code] 區塊下方沒有任何內容，Godot 會顯示「Expected an indented block after 'if'」錯誤訊息。

source: The comparison [code]3 > 1[/code] means "three is greater than one" which is [b]true[/b]. The comparison [code]2 < 3[/code] means "two is less than three" which is [b]true[/b]. The comparison [code]1 != 3[/code] means "one is not equal to three" which is [b]true[/b]. The comparison [code]2 == 1[/code] means "two is equal to one" which is [b]false[/b]. The comparison [code]3 < 1[/code] means "three is less than one" which is [b]false[/b].
cs: Porovnání [code]3 > 1[/code] znamená "tři je větší než jedna", což je [b]pravda[/b]. Porovnání [code]2 < 3[/code] znamená "dva je méně než tři", což je [b]pravda[/b]. Porovnání [code]1 != 3[/code] znamená "jedna není rovna třem", což je [b]pravda[/b]. Porovnání [code]2 == 1[/code] znamená "dvě se rovná jedné", což je [b]nepravda[/b]. Porovnání [code]3 < 1[/code] znamená "tři je méně než jedna", což je [b]nepravda[/b].
es: La comparación [code]3 > 1[/code] significa "tres es mayor que uno", lo cual es [b]verdadero[/b]. La comparación [code]2 < 3[/code] significa "dos es menor que tres", lo cual es [b]verdadero[/b]. La comparación [code]1 != 3[/code] significa "uno no es igual a tres", lo cual es [b]verdadero[/b]. La comparación [code]2 == 1[/code] significa "dos es igual a uno", lo cual es [b]falso[/b]. La comparación [code]3 < 1[/code] significa "tres es menor que uno", lo cual es [b]falso[/b].
ta: ஒப்பீடு [குறியீடு] 3> 1 [/குறியீடு] என்பது "மூன்று ஒன்றை விட பெரியது" என்று பொருள் [b] உண்மை [/b]. ஒப்பீடு [குறியீடு] 2 <3 [/குறியீடு] என்பது "இரண்டு மூன்றுக்கும் குறைவானது" என்று பொருள் [b] உண்மை [/b]. ஒப்பீடு [குறியீடு] 1! = 3 [/குறியீடு] என்பது "ஒன்று மூன்றுக்கு சமமானதல்ல" என்று பொருள் [b] உண்மை [/b]. ஒப்பீடு [குறியீடு] 2 == 1 [/குறியீடு] என்பது "இரண்டு ஒன்றுக்கு சமம்" என்று பொருள் [b] பொய் [/b]. ஒப்பீடு [குறியீடு] 3 <1 [/குறியீடு] என்பது "மூன்று ஒன்றுக்கு குறைவாக உள்ளது" என்று பொருள் [b] பொய் [/b].
uk: Порівняння [code]3 > 1[/code] означає «три більше за один», що [b]вірно[/b]. Порівняння [code]2 < 3[/code] означає «два менше трьох», що [b]вірно[/b]. Порівняння [code]1 != 3[/code] означає «один не дорівнює трьом», що [b]вірно[/b]. Порівняння [code]2 == 1[/code] означає "два дорівнює одному", що є [b]хибним[/b]. Порівняння [code]3 < 1[/code] означає, що «три менше одиниці», що є [b]хибним[/b].
zh_hant: 比較 [code]3 > 1[/code] 表示「三大於一」，這是 [b]正確的[/b]。 比較 [code]2 < 3[/code] 表示「二小於三」，這是 [b]正確的[/b]。 比較 [code]1 != 3[/code] 表示「一不等於三」，這是 [b]正確的[/b]。 比較 [code]2 == 1[/code] 表示「二等於一」，這是 [b]錯誤的[/b]。 比較 [code]3 < 1[/code] 表示「三小於一」，這是 [b]錯誤的[/b]。

source: The [code]if[/code] keyword comes with a complementary [code]else[/code] keyword. You can write an [code]else[/code] block after an [code]if[/code] block, like so.
cs: Klíčové slovo [code]if[/code] je doplněno doplňkovým klíčovým slovem [code]else[/code]. Blok [code]else[/code] můžete napsat za blok [code]if[/code], například takto.
es: La palabra clave [code]if[/code] viene acompañada de una palabra clave complementaria [code]else[/code], que significa "si no". Puedes escribir un bloque [code]else[/code] después de un bloque [code]if[/code], así.
ta: [/குறியீடு] [/குறியீடு] முக்கிய சொல் ஒரு நிரப்பு [குறியீடு] வேறு [/குறியீடு] முக்கிய சொற்களுடன் வந்தது. [/குறியீடு] [/குறியீடு] தொகுதிக்குப் பிறகு நீங்கள் ஒரு [/குறியீடு] தொகுதிக்குப் பிறகு எழுதலாம்.
uk: Ключове слово [code]if[/code] супроводжується додатковим ключовим словом [code]else[/code]. Ви можете написати блок [code]else[/code] після блоку [code]if[/code], ось так.
zh_hant: [code]if[/code] 關鍵字有一個對應的 [code]else[/code] 關鍵字。 你可以在 [code]if[/code] 區塊後面寫一個 [code]else[/code] 區塊，如下所示。

source: This series of [code]if[/code] statements is all wrong. Change the comparisons so each comparison matches the instruction below it. Keep the values and statements as they are; only change the comparison signs. As a reminder, the comparison signs are: [code] > greater than < less than == equal to != not equal to [/code] The line [code]health < 5:[/code] means "health is less than 5". Because [code]health = 100[/code], this is false so [code]print("health is greater than five.")[/code] won't run.
ta: [/குறியீடு] அறிக்கைகள் அனைத்தும் தவறு என்றால் இந்த [குறியீடு]. ஒப்பீடுகளை மாற்றவும், எனவே ஒவ்வொரு ஒப்பீடும் அதற்குக் கீழே உள்ள வழிமுறைகளுடன் பொருந்துகிறது. மதிப்புகள் மற்றும் அறிக்கைகளை அவை போலவே வைத்திருங்கள்; ஒப்பீட்டு அறிகுறிகளை மட்டுமே மாற்றவும். ஒரு நினைவூட்டலாக, ஒப்பீட்டு அறிகுறிகள்: [குறியீடு] > விட பெரியது <குறைவாக == சமமானது ! = சமமாக இல்லை [/குறியீடு] வரி [குறியீடு] உடல்நலம் <5: [/குறியீடு] என்றால் "உடல்நலம் 5 க்கும் குறைவாக உள்ளது". [குறியீடு] உடல்நலம் = 100 [/குறியீடு] ஏனெனில், இது தவறானது, எனவே [குறியீடு] அச்சு ("ஆரோக்கியம் ஐந்தை விட அதிகமாக உள்ளது.") [/குறியீடு] இயங்காது.
uk: Ця серія операторів [code]if[/code] є неправильною. Змініть порівняння так, щоб кожне порівняння відповідало інструкції під ним. Зберігайте значення та твердження такими, якими вони є; тільки змінюють знаки порівняння. Нагадуємо, що знаками порівняння є: [код] > більше ніж < менше ніж == дорівнює != не дорівнює [/код] Рядок [code]health < 5:[/code] означає «здоров'я менше 5». Оскільки [code]health = 100[/code], це помилка, тому [code]print("health is larger than five.")[/code] не запускається.
zh_hant: 這一系列的 [code]if[/code] 判斷式是錯誤的。請更改比較運算符，使每個比較運算符符合下面的指令。 保留數值和陳述，僅更改比較運算符。 提醒一下，常見的比較運算符如下： [code] > 大於（is greater than） < 小於（is less than） == 等於（is equal to） != 不等於（is not equal to） [/code] 以下是這段程式碼的說明：[code]health < 5:[/code] 意思是「生命值小於 5」。 因為 [code]health = 100[/code]，這會是 false，所以 [code]print("health is greater than five.")[/code] 這行程式碼不會執行。

source: We have a heal function that adds an amount to the character's health. Add to the function so the character's health is never greater than [code]80[/code].
cs: Máme funkci léčení, která přidává určitou hodnotu ke zdraví postavy. Přidejte do funkce podmínku, aby zdraví postavy nebylo nikdy větší než [code]80[/code].
es: Tenemos una función de curación que agrega una cantidad a la salud del personaje. Agrega código a la función para que la salud del personaje nunca sea mayor que [code]80[/code].
ta: கதாபாத்திரத்தின் ஆரோக்கியத்திற்கு ஒரு தொகையைச் சேர்க்கும் ஒரு குணப்படுத்தும் செயல்பாடு எங்களிடம் உள்ளது. செயல்பாட்டில் சேர்க்கவும், இதனால் கதாபாத்திரத்தின் உடல்நலம் ஒருபோதும் [குறியீடு] 80 [/குறியீடு] ஐ விட அதிகமாக இல்லை.
uk: У нас є функція лікування, яка додає певну суму до здоров’я персонажа. Додайте до функції, щоб здоров’я персонажа ніколи не перевищувало [code]80[/code].
zh_hant: 我們有一個治療函式，它會將數值加到角色的生命值上。 請修改這個函式，讓角色的生命值永遠不會超過 [code]80[/code]。

source: When the robot takes damage, its health can be negative. We might want to display the health number on screen, like in Japanese RPGs. We don't want negative numbers. We want to stop at zero instead. Calling the function should reduce [code]health[/code] by [code]amount[/code]. If [code]health[/code] goes below [code]0[/code], set it to [code]0[/code] again.
cs: Když robot utrpí poškození, jeho zdraví může být záporné. Možná budeme chtít zobrazit číslo zdraví na obrazovce, jako je tomu v japonských RPG hrách. Nechceme záporná čísla. Místo toho se chceme zastavit na nule. Volání funkce by mělo snížit [code]health[/code] o [code]amount[/code]. Pokud [code]health[/code] klesne pod [code]0[/code], nastavte jej opět na [code]0[/code].
es: Cuando el robot recibe daño, su salud puede ser negativa. Puede que queramos mostrar el número de salud en la pantalla, como en los RPGs japoneses. No queremos números negativos. En su lugar, queremos detenernos en cero. Llamar a la función debería reducir [code]health[/code] por [code]amount[/code]. Si la [code]health[/code] cae por debajo de [code]0[/code], ponla de nuevo en [code]0[/code].
ta: ரோபோ சேதத்தை எடுக்கும்போது, அதன் உடல்நலம் எதிர்மறையாக இருக்கும். சப்பானிய ஆர்பிசிக்களைப் போலவே சுகாதார எண்ணையும் திரையில் காட்ட விரும்பலாம். எதிர்மறை எண்களை நாங்கள் விரும்பவில்லை. அதற்கு பதிலாக பூச்சியத்தில் நிறுத்த விரும்புகிறோம். செயல்பாட்டை அழைப்பது [குறியீடு] உடல் [/குறியீடு] [குறியீடு] தொகை [/குறியீடு] மூலம் குறைக்க வேண்டும். [குறியீடு] உடல்நலம் [/குறியீடு] [குறியீடு] 0 [/குறியீடு] க்கு கீழே சென்றால், அதை மீண்டும் [குறியீடு] 0 [/குறியீடு] என அமைக்கவும்.
uk: Коли робот отримує пошкодження, його здоров'я може бути негативним. Можливо, ми захочемо відобразити на екрані число здоров’я, як у японських рольових іграх. Ми не хочемо від’ємних чисел. Натомість ми хочемо зупинитися на нулі. Виклик функції має зменшити [code]здоров'я[/code] на [code]кількість[/code]. Якщо [code]здоров'я[/code] стає нижче [code]0[/code], знову встановіть [code]0[/code].
zh_hant: 當機器人受到傷害時，它的生命值可能會變成負數。 我們可能希望在畫面上顯示生命值數字，就像 JRPG 一樣。 我們不希望生命值變成負數。我們希望生命值停在零就好。 呼叫這個函式應該會讓 [code]health[/code] 減少 [code]amount[/code]。 如果 [code]health[/code] 低於 [code]0[/code]，就將它重設為 [code]0[/code]。

source: When the computer checks a condition, this is called [b]to evaluate[/b] a condition. All conditions [b]evaluate[/b] to either [code]true[/code] or [code]false[/code]. Either the player is pressing the button, or not. Either the character is touching an enemy, or not. In our case, [i]if[/i] the health goes over a maximum value, we want to reset it to the maximum. To define a condition, we use the [code]if[/code] keyword. We write a line starting with [code]if[/code], type the condition to evaluate, and end the line with a colon.
es: Cuando la computadora verifica una condición, esto se llama [b]evaluar[/b] una condición. Todas las condiciones [b]se evalúan[/b] como [code]true[/code] o como [code]false[/code]. O el jugador está pulsando el botón, o no. O el personaje está tocando a un enemigo, o no En nuestro caso, [i]si[/i] la salud supera un valor máximo, queremos restablecerla a dicho valor máximo. Para definir una condición, utilizamos la palabra clave [code]if[/code]. Escribimos una línea que empiece con [code]if[/code], escribimos la condición que se debe evaluar y terminamos la línea con dos puntos.

source: Notice the [code]>[/code] comparison sign. We read this symbol as "greater than". We've seen how function definitions use a colon at the end of the first line and nest content inside. In GDScript, this syntax is a recurring pattern for all code blocks. The computer knows which instructions belong to the condition because they are indented.
es: Observa el signo de comparación [code]>[/code]. Este símbolo se lee como "mayor que". Hemos visto cómo las definiciones de funciones utilizan dos puntos al final de la primera línea y anidan el contenido en su interior. En GDScript, esta sintaxis es un patrón recurrente para todos los bloques de código. La computadora sabe qué instrucciones pertenecen a la condición porque tienen sangría.

source: This series of [code]if[/code] statements is all wrong. Change the comparisons so each comparison matches the instruction below it. Keep the values and statements as they are; only change the comparison signs. As a reminder, the comparison signs are: [code] > greater than < less than == equal to != not equal to [/code] The line [code]health < 5:[/code] means "health is less than 5". Because [code]health = 100[/code], this is false so [code]print("health is greater than five.")[/code] won't run.
es: Esta serie de sentencias [code]if[/code] está incorrecta. Cambia las comparaciones para que cada una de ellas coincida con la instrucción que está debajo de ella. Mantén los valores y las sentencias como están; sólo cambia los signos de comparación. Como recordatorio, los signos de comparación son: [code] > mayor que < menor que == igual a != no igual a [/code] La línea [code]health < 5:[/code] significa "la salud es inferior a 5" Debido a que [code]health = 100[/code], esto es falso, por lo que [code]print("health is greater than five.")[/code] no se ejecutará.
