Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-24-access-array-indices.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: You learned to loop over all the values in an array using the [code]for[/code] keyword.
cs: Naučili jste se procházet všechny hodnoty v poli pomocí klíčového slova [code]for[/code].
da: Du lærte at loope over alle værdier i et array ved hjælp af [code]for[/code] nøgleordet.
de: Du hast gelernt wie man alle Werte in einem Array mit dem Schlüsselwort [code]for[/code] durchläuft.
es: Aprendiste a hacer un bucle sobre todos los valores de una matriz utilizando la palabra clave [code]for[/code].
fr: Vous avez appris à boucler sur toutes les valeurs d'un tableau en utilisant le mot-clé [code]for[/code].
it: Hai imparato a ciclare tutti i valori di un array usando la parola chiave [code]for[/code].
ja: [code]for[/code] キーワードを使用して、配列内のすべての値をループする方法を学習しました。
nl: Je hebt geleerd om over alle waarden in een array te lussen met behulp van het sleutelwoord [code]for[/code].
pt: Aprendeu a fazer um loop sobre todos os valores num array usando a palavra-chave [code]for[/code].
pt_br: Você aprendeu a fazer um loop sobre todos os valores em um array usando a palavra-chave [code]for[/code].
ru: Вы научились перебирать значения массива циклом при помощи ключевого слова [code]for[/code].
ta: [/குறியீடு] முக்கிய சொல்லைப் பயன்படுத்தி ஒரு வரிசையில் உள்ள அனைத்து மதிப்புகளையும் சுழற்ற கற்றுக்கொண்டீர்கள்.
tr: [code]for[/code] anahtar kelimesini kullanarak bir dizideki tüm değerler üzerinde döngü yapmayı öğrendiniz.
uk: Ви навчилися проходити в циклі всі значення в масиві за допомогою ключового слова [code]for[/code].
zh_hans: 你已经学会了如何使用 [code]for[/code] 关键字循环遍历数组中所有的值。
zh_hant: 你已學會使用 [code]for[/code] 關鍵字來迴圈遍歷陣列中的所有值。

source: But what if you need to access the third item in the player's inventory? The tenth item?
da: Men hvad hvis du har brug for at få adgang til den tredje genstand i spillerens lagerbeholdning? Den tiende genstand?
fr: Mais que se passe-t-il si vous avez besoin d'accéder au troisième objet de l'inventaire du joueur ? Le dixième objet ?
pt: Mas e se precisar de aceder o terceiro item no inventário do jogador? O décimo item?
ru: Но что, если вам нужно получить доступ к третьему предмету в инвентаре игрока? А к десятому предмету?
tr: Peki ya oyuncunun envanterindeki üçüncü öğeye erişmeniz gerekiyorsa? Ya onuncu eşyaya?

source: There's a dedicated notation to access one element in an array by index.
da: Der er en dedikeret notation til at få adgang til et element som index i et array.
fr: Il existe une notation dédiée pour accéder à un élément d'un tableau par indice.
pt: Há uma notação dedicada para aceder um elemento num array por índice.
ru: Для этого существует специальная нотация получения конкретного элемента массива по индексу.
tr: Bir dizideki bir elemana, yer numarasına (dizin, indeks) göre erişmek için özel bir gösterim vardır.

source: To do so, you use square brackets with a number inside the brackets.
da: For at gøre dette, skal du bruge firkantede parenteser med et nummer inde i parenteserne.
fr: Pour ce faire, vous utilisez des crochets avec un nombre à l'intérieur des crochets.
pt: Para fazê-lo, use colchetes com um número entre eles.
ru: Для получения элемента используйте квадратные скобки с числом — индексом внутри.
tr: Bunu yapmak için köşeli parantezler ve parantezlerin içinde bir sayı kullanırsınız.

source: Index zero is the [i]first[/i] element in the array.
cs: Index nula je [i]první[/i] prvek pole.
da: Index nul er [i]først[/i] elementet i arrayet.
de: Index Null ist das [i]erste[/i]-Element im Array.
es: El índice cero es el [i]primer[/i] elemento de la matriz.
fr: L'indice zéro est le [i]premier[/i] élément du tableau.
it: L'indice zero è il [i]primo[/i] elemento nell'array.
ja: インデックス 0 は、配列の[i]最初[/i]の要素です。
nl: Index nul is het [i]eerste[/i] element in de array.
pt: O índice zero é o [i]primeiro[/i] elemento no array.
pt_br: O índice zero é o [i]primeiro[/i] elemento no array.
ru: Элемент под индексом ноль — это [i]первый[/i] элемент массива.
ta: குறியீட்டு பூச்சியம் என்பது வரிசையில் உள்ள [i] முதல் [/i] உறுப்பு.
tr: Sıfır (0) dizini, dizideki [i]ilk[/i] elemandır.
uk: Індекс нуль є [i]першим[/i] елементом у масиві.
zh_hans: 数组的 [i]第一个[/i] 元素的索引是0。
zh_hant: 索引 0 是陣列中的[b]第一個[/b]元素。

source: Index one is the [i]second[/i] element in the array, and so on.
da: Indeks èt er det [i]andet[/i] element i arrayet, og så videre.
fr: L'indice un est le [i]deuxième[/i] élément du tableau, et ainsi de suite.
pt: O índice número um é o [i]segundo[/i] elemento no array e assim por diante.
ru: Элемент под индексом один — это [i]второй[/i] элемент массива, и так далее.
tr: Birinci dizin, dizideki [i]ikinci[/i] elemandır ve bu böyle devam eder.

source: You would access the [i]fourth[/i] element in the [code]inventory[/code] array like so.
da: Du ville tilgå det [i]fjerde[/i] element i [code]inventory[/code] arrayet på denne måde.
fr: Vous accéderiez au [i]quatrième[/i] élément du tableau [code]inventaire[/code] comme suit.
pt: Assim acederia o [i]quarto[/i] elemento no array [code]inventory[/code].
ru: Получить [i]четвёртый[/i] элемент массива [code]inventory[/code] можно таким образом.
tr: [code]inventory[/code] dizisindeki [i]dördüncü[/i] elemana şu şekilde erişirdiniz.

source: How would you access the [i]third[/i] item in the [code]inventory[/code] array?
cs: Jak byste získali přístup k [i]třetí[/i] položce v poli [code]inventory[/code]?
da: Hvordan ville du få adgang til den [i]tredje[/i] genstand i [code]inventory[/code] arrayet?
de: Wie würdest du auf das [i]dritte[/i] Element im [code]inventory[/code]-Array zugreifen?
es: ¿Cómo accederías al [i]tercer[/i] elemento de la matriz [code]inventory[/code]?
fr: Comment accéderiez-vous au [i]troisième[/i] élément du tableau [code]inventory[/code] ?
it: Come accederesti al [i]terzo[/i] oggetto nell'array [code]inventory[/code]?
ja: [code]inventory[/code]配列の[i]3番目[/i]のアイテムにどのようにアクセスしますか?
nl: Hoe kun je het [i]derde[/i] element van de [code]inventory[/code] array bereiken?
pt: Como acederia o [i]terceiro[/i] item no array [code]inventory[/code]?
pt_br: Como você acessaria o [i]terceiro[/i] item no array [code]inventory[/code]?
ru: Как получить [i]третий[/i] элемент массива [code]inventory[/code]?
ta: [குறியீடு] சரக்கு [/குறியீடு] வரிசையில் [i] மூன்றாவது [/i] உருப்படியை எவ்வாறு அணுகுவீர்கள்?
tr: [code]inventory[/code] dizisinin [i]üçüncü[/i] öğesine nasıl erişirsiniz?
uk: Як би ви отримали доступ до [i]третього[/i] елемента в масиві [code]inventory[/code]?
zh_hans: 怎样访问 [code]inventory[/code] 数组中的 [i]第三[/i] 项？
zh_hant: 怎麼存取在 [code]inventory[/code] 陣列中的[b]第三個[/b]項目？

source: Indices start at zero, so the index of the [i]third[/i] item is [code]2[/code]. That's why you need to write [code]inventory[2][/code].
cs: Indexy začínají nulou, takže index [i]třetího[/i] prvku je [code]2[/code]. Proto je třeba napsat [code]inventory[2][/code].
da: Indekser starter ved nul, så indekset for den [i]tredje[/i] genstand er [code]2[/code]. Derfor skal du skrive [code]inventory[2][/code].
de: Indizes beginnen bei Null, so dass der Index des [i]dritten[/i]-Elements [code]2[/code] ist. Deshalb musst du [code]inventory[2][/code] schreiben.
es: Los índices empiezan en cero, por lo que el índice del [i]tercer[/i] elemento es [code]2[/code]. Es por eso que tienes que escribir [code]inventory[2][/code].
fr: Les indices commencent à zéro, donc l'indice du [i]troisième[/i] élément est [code]2[/code]. C'est pourquoi vous devez écrire [code]inventory[2][/code].
it: Gli indici iniziano da zero, quindi il [i]terzo[/i] oggetto ha indice [code]2[/code]. Per questo motivo scriviamo [code]inventory[2][/code].
ja: インデックスは 0 から始まるため、[i]3 番目[/i]の項目のインデックスは [code]2[/code] です。そのため、[code]inventory[2][/code]と書く必要があります。
nl: Indices beginnen bij nul, dus de index van het [i]derde[/i] item is [code]2[/code]. Daarom moet je [code]inventory[2][/code] schrijven.
pt: Os índices começam com zero, então o índice do [i]terceiro[/i] item é [code]2[/code]. É por isso que deve escrever [code]inventory[2][/code].
pt_br: Os índices começam em zero, então o índice do [i]terceiro[/i] item é [code]2[/code]. É por isso que você precisa escrever [code]inventory[2][/code].
ru: Индексы начинаются с нуля, поэтому индекс [i]третьего[/i] предмета — это [code]2[/code]. Для получения элемента вам нужно написать [code]inventory[2][/code].
ta: குறியீடுகள் பூச்சியத்தில் தொடங்குகின்றன, எனவே [i] மூன்றாவது [/i] உருப்படியின் குறியீடு [குறியீடு] 2 [/குறியீடு]. அதனால்தான் நீங்கள் [குறியீடு] சரக்குகளை எழுத வேண்டும் [2] [/குறியீடு].
tr: Dizinler sıfırdan başlar, bu nedenle [i]üçüncü[/i] öğenin dizin numarası [code]2[/code]'dir. Bu nedenle [code]inventory[2][/code] yazmanız gerekir.
uk: Індекси починаються з нуля, тому індекс [i]третього[/i] елемента дорівнює [code]2[/code]. Ось чому вам потрібно написати [code]інвентар[2][/code].
zh_hans: 索引从零开始，因此[i]第三[/i] 项的索引是[code]2[/code]。 这就是为什么写的是 [code]inventory[2][/code]。
zh_hant: 索引從零開始，所以[b]第三個[/b]項目的索引是 [code]2[/code]。這就是為什麼你需要寫 [code]inventory[2][/code]。

source: Accessing the last values with negative indices
cs: Přístup k posledním hodnotám pomocí záporných indexů
da: Få adgang til de sidste værdier med negative indekser
de: Zugriff auf die Werte am Ende mit negativen Indizes
es: Acceder a los últimos valores con índices negativos
fr: Accéder aux dernières valeurs avec des indices négatifs
it: Accedere agli ultimi valori con gli indici negativi
ja: 負のインデックスを持つ最後の値へのアクセス
nl: Toegang tot de laatste waarden met negatieve indices
pt: Acessando os últimos valores com índices negativos
pt_br: Acessando os últimos valores com índices negativos
ru: Получение последних значений при помощи отрицательных индексов
ta: எதிர்மறை குறியீடுகளுடன் கடைசி மதிப்புகளை அணுகும்
tr: Sondaki değerlere negatif dizinler ile erişim
uk: Доступ до останніх значень з від’ємними індексами
zh_hans: 使用负索引访问倒数几个的值
zh_hant: 使用負索引存取最後幾個值

source: What if you want to access the last or second-before-last item in the [code]inventory[/code]?
da: Hvad hvis du vil have adgang til det sidste eller næstførsidste genstand i [code]inventory[/code]?
fr: Et si vous voulez accéder au dernier ou à l'avant-dernier objet du tableau [code]inventory[/code] ?
pt: E se quiser aceder o último ou penúltimo item no array [code]inventory[/code]?
ru: Что если вы хотите получить последний или предпоследний элемент из [code]inventory[/code]?
tr: Peki ya [code]inventory[/code] (envanter) dizisindeki son veya sondan bir önceki öğeye erişmek istiyorsanız?

source: In that case, you can use negative indices. If you write [code]-1[/code] in the brackets, you will get the last item in the array. You will get the second-to-last item if you write [code]-2[/code].
da: I det tilfælde, kan du bruge negative indekser. Hvis du skriver [code]-1[/code] i parenteserne, får du det sidste genstand i arrayet. Du får det næstsidste genstand, hvis du skriver [code]-2[/code].
fr: Dans ce cas, vous pouvez utiliser des indices négatifs. Si vous écrivez [code]-1[/code] dans les parenthèses, vous obtiendrez le dernier élément du tableau. Vous obtiendrez l'avant-dernier élément si vous écrivez [code]-2[/code].
pt: Nesse caso, pode usar índices negativos. Se escrever [code]-1[/code] nos colchetes, vai obter o último item do array. Vai obter o penúltimo item se escrever [code]-2[/code].
ru: В этом случае вы можете использовать отрицательные индексы. Если указать в скобках [code]-1[/code], то вы получите последний элемент массива. Для получения предпоследнего элемента, можно использовать [code]-2[/code].
tr: Bu durumda, negatif dizinler kullanabilirsiniz. Parantez içine [code]-1[/code] yazarsanız, dizideki son öğeyi alırsınız. [code] -2[/code] yazarsanız, sondan ikinci öğeyi elde edersiniz.

source: That's very convenient when you need to quickly access elements from the end of the list.
cs: Toto je velmi pohodlné řešení, když potřebujete rychle přistupovat k prvkům z konce seznamu.
da: Det er meget praktisk, når du hurtigt har brug for at få adgang til elementer fra slutningen af listen.
de: Das ist ziemlich praktisch, um schnell auf Elemente vom Ende der Liste zuzugreifen.
es: Esto es muy práctico cuando necesitas acceder rápidamente a elementos del final de la lista.
fr: C'est très pratique lorsque vous avez besoin d'accéder rapidement aux éléments de la fin de la liste.
it: Questo può tornare molto comodo quando devi accedere rapidamente agli oggetti alla fine della lista.
ja: これは、リストの最後から要素にすばやくアクセスする必要がある場合に非常に便利です。
nl: Dat is erg handig als je snel elementen aan het einde van de lijst wilt gebruiken.
pt: Isso é muito conveniente quando precisa aceder rapidamente os elementos do final da lista.
pt_br: Isso é muito conveniente quando você precisa acessar rapidamente os elementos do final da lista.
ru: Это очень удобно, в случаях, когда вам нужно быстро получить последний элемент списка.
ta: பட்டியலின் முடிவில் இருந்து உறுப்புகளை விரைவாக அணுக வேண்டியிருக்கும் போது அது மிகவும் வசதியானது.
tr: Listenin öğelerine sondan başlayıp hızlı bir şekilde erişmeniz gerektiğinde bu çok kullanışlıdır.
uk: Це дуже зручно, коли потрібно швидко отримати доступ до елементів з кінця списку.
zh_hans: 当你要快速访问列表末尾的元素时，这非常方便。
zh_hant: 當你需要快速存取列表末端的元素時，這將會非常方便。

source: How would you access the third-to-last item in the inventory array?
cs: Jak byste získali přístup k předpředposlední (třetí od konce) položce v poli inventáře?
da: Hvordan ville du få adgang til den tredjesidste genstand i inventory arrayet?
de: Wie würdest du auf das drittletzte Element im Inventar-Array zugreifen?
es: ¿Cómo accederías al antepenúltimo elemento de la matriz [code]inventory[/code]?
fr: Comment accéderiez-vous à l'élément qui précède l'avant-dernier élément du tableau d'inventaire ?
it: Come accederesti al terzultimo oggetto nell'array inventario?
ja: 在庫配列の最後から 3 番目の項目にどのようにアクセスしますか?
nl: Hoe krijg je toegang tot het op twee na laatste item in de inventarisarray?
pt: Como acederia o antepenúltimo item no array inventory ?
pt_br: Como você acessaria o antepenúltimo item no array inventory ?
ru: Как получить перед-предпоследний элемент из массива inventory?
ta: சரக்கு வரிசையில் மூன்றாவது முதல் கடைசி உருப்படியை எவ்வாறு அணுகுவீர்கள்?
tr: inventory dizisindeki sondan üçüncü öğeye nasıl erişirsiniz?
uk: Як би ви отримали доступ до передостаннього елемента в масиві інвентарю?
zh_hans: 如何访问inventory数组中倒数第三个物品？
zh_hant: 你會如何存取 inventory 陣列中的倒數第三個項目？

source: When using negative indices, [code]-1[/code] means the [i]last[/i] element in the array. Index [code]-2[/code] will be the second-to-last, thus [code]-3[/code] will be the third-to-last.
da: Når man bruger negative indekses, betyder [code]-1[/code] det [i]sidste[/i] element i arrayet. Indeks [code]-2[/code] vil være det næstsidste, og dermed vil [code]-3[/code] være det tredjesidste.
fr: Lorsque vous utilisez des indices négatifs, [code]-1[/code] signifie le [i]dernier[/i] élément du tableau. L'indice [code]-2[/code] sera l'avant-dernier, donc [code]-3[/code] sera l'élément qui précède l'avant-dernier.
pt: Ao usar índices negativos, [code]-1[/code] significa o [i]último[/i] elemento no array. O índice [code]-2[/code] será o penúltimo, portanto [code]-3[/code] será o antepenúltimo.
ru: При использовании отрицательных индексов, [code]-1[/code] означает [i]последний[/i] элемент массива. Индекс [code]-2[/code] — второй с конца, [code]-3[/code] третий с конца и так далее.
tr: Negatif dizinler kullanıldığında, [code]-1[/code] dizideki [i]son[/i] eleman anlamına gelir. [code]-2[/code] dizini sondan ikinci, dolayısıyla [code]-3[/code]'de sondan üçüncü olacaktır.

source: It can be little confusing as it seems to work differently from positive indices. However, it's because there's no difference between index [code]0[/code] and [code]-0[/code]: they both point to the first item in the array.
da: Det kan være lidt forvirrende, da det ser ud til at fungere anderledes end positive indeks. Det er dog fordi, der ikke er nogen forskel mellem indeks [code]0[/code] og [code]-0[/code]: de peger begge på det første element i arrayet.
fr: Cela peut être un peu déroutant car il semble fonctionner différemment des indices positifs. Cependant, c'est parce qu'il n'y a pas de différence entre les indices [code]0[/code] et [code]-0[/code] : ils pointent tous les deux vers le premier élément du tableau.
pt: Pode ser um pouco confuso, pois parece funcionar de maneira diferente dos índices positivos. No entanto, é porque não há diferença entre o índice [code]0[/code] e [code]-0[/code]: ambos apontam para o primeiro item no array.
ru: Это может немного запутать, ведь всё выглядит так, будто отрицательные и положительные индексы работают по-разному. На самом же деле, они работают одинаково, просто между индексами [code]0[/code] и [code]-0[/code] нет разницы: они оба указывают на первый элемент массива.
tr: Pozitif dizinlerden farklı çalışıyormuş gibi göründüğü için biraz kafa karıştırıcı olabilir. Ancak, bunun nedeni [code]0[/code] ve [code]-0[/code] dizinleri arasında bir fark olmamasıdır: ikisi de sıfırdır yani her ikisi de dizideki ilk öğeye işaret eder.

source: You can't access non-existent indices
cs: K neexistujícím indexům přistupovat nelze
da: Du kan ikke få adgang til ikke-eksisterende indekser
de: Du kannst nicht auf nicht vorhandene Indizes zugreifen
es: No puedes acceder a índices inexistentes
fr: Vous ne pouvez pas accéder à des index inexistants
it: Non puoi accedere a degli indici non esistenti
ja: 存在しないインデックスにはアクセスできません
nl: Je kunt geen niet-bestaande indices gebruiken
pt: Não pode aceder índices que não existem
pt_br: Você não pode acessar índices que não existem
ru: Нельзя получить отсутствующий элемент по индексу
ta: இல்லாத குறியீடுகளை நீங்கள் அணுக முடியாது
tr: Var olmayan dizinlere erişemezsiniz
uk: Ви не можете отримати доступ до неіснуючих індексів
zh_hans: 不存在的索引是无法访问的
zh_hant: 你沒辦法存取不存在的索引

source: There's a catch with this syntax: if you try to access an index that does not exist, you will get an error. You have to be careful always to access existing elements in the array.
da: Der er en hage ved denne syntaks: hvis du forsøger at tilgå et indeks, der ikke findes, får du en fejl. Du skal være forsigtig med altid at tilgå eksisterende elementer i arrayet.
fr: Il y a un piège avec cette syntaxe : si vous essayez d'accéder à un indice qui n'existe pas, vous obtiendrez une erreur. Vous devez toujours faire attention à accéder aux éléments existants dans le tableau.
pt: Há um problema com essa sintaxe: se tentar aceder um índice que não existe, receberá um erro. Tem que ter cuidado sempre a aceder elementos existentes no array.
ru: В этом синтаксисе есть небольшая ловушка: если вы попытаетесь получить по индексу элемент, которого не существует, вы получите ошибку. Всегда соблюдайте осторожность при получении элемента массива по индексу.
tr: Bu sözdiziminde bir tuzak vardır: var olmayan bir dizine erişmeye çalışırsanız hata alırsınız. Dizideki mevcut öğelere erişme konusunda her zaman dikkatli olmalısınız.

source: There are a couple of ways you can check for valid indices. One of them is checking the array's size.
da: Der er et par måder, du kan kontrollere for gyldige indekser. En af dem er at kontrollere arrayets størrelse.
fr: Il existe plusieurs façons de vérifier les indices valides. L'une d'entre elles consiste à vérifier la taille du tableau.
pt: Existem algumas maneiras de verificar se há índices válidos. Uma delas é verificar o tamanho do array.
ru: Есть несколько способов, которыми можно проверить, присутствует ли элемент под индексом в массиве. Один из них — посмотреть на размер массива.
tr: Geçerli dizinleri kontrol etmenizin birkaç yolu vardır. Bunlardan biri dizi boyutunu kontrol etmektir.

source: [b]Checking the size of the array[/b]
da: [b]Kontrol af størrelsen på arrayet[/b]
fr: [b]Vérifier la taille du tableau[/b]
pt: [b]Verificar o tamanho do array[/b]
ru: [b]Проверка количества элементов в массиве[/b]
tr: [b]Dizi boyutunu kontrol etme[/b]

source: Arrays come with a member function named [code]size()[/code]. You can call it on the array anytime to know its [i]current[/i] size.
da: Arrays leveres med en medlemsfunktion kaldet [code]size()[/code]. Du kan til enhver tid kalde den på arrayet for at finde dets [i]aktuelle[/i] størrelse.
fr: Les tableaux sont fournis avec une fonction membre nommée [code]size()[/code]. Vous pouvez l'appeler sur le tableau à tout moment pour connaître sa taille [i]actuelle[/i].
pt: Arrays vêm com uma função membro chamada [code]size()[/code]. Pode chamá-la no array a qualquer momento para saber o tamanho [i]atual[/i] dele.
ru: Массивы имеют внутреннюю функцию [code]size()[/code]. Вы можете вызвать её в любое время, чтобы узнать [i]текущий[/i] размер массива.
tr: Diziler, [code]size()[/code] (boyut) adlı bir üye fonksiyon ile birlikte gelir. Bu fonksiyonu dizinin [i]mevcut[/i] boyutunu öğrenmek için istediğiniz zaman çağırabilirsiniz.

source: The maximum index you can access in an array is [code]array.size() - 1[/code]: it's the last item in the array.
cs: Maximální index, ke kterému můžete v poli přistupovat, je [code]array.size() - 1[/code]: je to poslední položka v poli.
da: Det maksimale indeks, du kan tilgå i et array, er [code]array.size() - 1[/code]: det er det sidste element i arrayet.
de: Der maximale Index, auf den du in einem Array zugreifen kannst, ist [code]array.size() - 1[/code]: Es ist das letzte Element im Array.
es: El índice máximo al que puedes acceder en un array es [code]array.size() - 1[/code]: este es el último elemento del array.
fr: L'indice maximum auquel vous pouvez accéder dans un tableau est [code]array.size() - 1[/code] : c'est le dernier élément du tableau.
it: L'indice massimo che puoi accedere in un array è [code]array.size() - 1[/code]: questo è l'ultimo oggetto nell'array.
ja: 配列でアクセスできる最大インデックスは [code]array.size() - 1[/code]: 配列の最後の項目です。
nl: De grootste index die je kunt gebruiken met een array is [code]array.size() - 1[/code]: het is die van het laatste element in de array.
pt: O índice máximo que pode aceder num array é [code]array.size() - 1[/code]: é o último item do array.
pt_br: O índice máximo que você pode acessar em um array é [code]array.size() - 1[/code]: é o último item do array.
ru: Максимальный индекс, он же индекс последнего элемента в массиве, всегда равен [code]array.size() - 1[/code].
ta: ஒரு வரிசையில் நீங்கள் அணுகக்கூடிய அதிகபட்ச குறியீடு [குறியீடு] வரிசை.
tr: Bir dizide erişebileceğiniz en büyük dizin numarası [code]dizi.size() - 1[/code]: yani dizideki son öğedir. (Dizi 5 elemanlı ise, son öğe 4 dizin numaralıdır).
uk: Максимальний індекс, до якого ви можете отримати доступ у масиві, це [code]array.size() - 1[/code]: це останній елемент у масиві.
zh_hans: 数组中你能访问到的最大索引是 [code]array.size() - 1[/code]（数组大小-1）：它是数组的最后一项。
zh_hant: 你可以在陣列中訪問的最大索引是 [code]array.size() - 1[/code]：它是陣列中的最後一個項目。
