Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-14-multiplying.po
Languages: cs, da, de, es, fr, it, ja, pt, ru, ta, zh_hant

source: Reducing damage at higher levels
cs: Snížení poškození na vyšších úrovních
da: Reducerer skade på højere level
de: Reduzierung von Schäden auf höhere Stufe
es: Reducir el daño en niveles más altos
fr: Réduire les dégâts à des niveaux plus élevés
it: Riducendo il danno a livelli più elevati
ja: 高レベルでのダメージ軽減
pt: Reduzindo o dano que a personagem recebe em níveis mais altos
ru: Уменьшение принимаемого урона на высоких уровнях
ta: அதிக அளவில் சேதத்தை குறைத்தல்
zh_hant: 等級高時會減少傷害量

source: When our robot's [code]level[/code] is [code]3[/code] or more, we want it to take a lot less damage.
da: Når vores robots [code]level[/code] er [code]3[/code] eller mere, ønsker vi, at den tager meget mindre skade.
fr: Lorsque le [code]level[/code] de notre robot est de [code]3[/code] ou plus, nous voulons qu'il subisse beaucoup moins de dégâts.
it: Quando il [code]level[/code] del nostro robot è [code]3[/code] o di più, vogliamo che prenda molto meno danno.
ja: ロボットの [code]level[/code] が [code]3[/code] 以上の場合、受けるダメージを大幅に減らしたい。
pt: Quando o [code]nível[/code] do nosso robô for [code]3[/code] ou mais, queremos que ele sofra muito menos danos.
ru: Мы хотим, чтобы наш робот получал гораздо меньше урона, когда его [code]level[/code] равен [code]3[/code] или больше.

source: Add to the [code]take_damage()[/code] function so the following happens:
da: Læg følgende til funktionen [code]take_damage()[/code] så følgende sker:
fr: Ajoutez du code à la fonction [code]take_damage()[/code] pour ce qui suit se produise :
it: Aggiungi alla funzione [code]take_damage()[/code] così ché faccia le seguenti cose:
ja: [code]take_damage()[/code]関数に追加すると、次のようになります。
pt: Adicione na função [code]take_damage()[/code] alguma coisa para que aconteça o seguinte:
ru: Доработайте функцию [code]take_damage()[/code], чтобы при её вызове случалось это:

source: - [code]if[/code] the robot's [code]level[/code] is greater than [code]2[/code], reduce the damage [code]amount[/code] by 50%
da: - [code]if[/code] robottens [code]level[/code] er større end [code]2[/code], reducer skademængden [code]amount[/code] med 50%
fr: - Si ( « [code]if[/code] » dans le code) le [code]level[/code] du robot est supérieur à [code]2[/code], réduisez l'[code]amount[/code] des dégâts de 50%
it: - [code]se[/code] il [code]level[/code] del robot è maggiore di [code]2[/code], riduci la [code]amount[/code] di danno del 50%.
ja: -[code]if[/code] ロボットの [code]level[/code] が [code]2[/code] より大きい場合、ダメージ [code]amount[/code] が 50% 減少します
pt: - [code]se[/code] o [code]level[/code] do robô for maior que [code]2[/code], reduza o [code]amount[/code] (a quantidade) de dano em 50%
ru: - [code]если[/code] [code]level[/code] робота больше чем [code]2[/code], уменьшить [code]amount[/code] принимаемого им урона на 50%

source: The robot is level 3. An enemy is going to attack for 10 damage. This damage should reduce to 5.
da: Robotten er level 3. En fjende vil angribe for 10 skade. Denne skade bør reduceres til 5.
fr: Le robot est de niveau 3. Un ennemi va attaquer et infliger 10 points de dégâts. Ces dégâts devraient être réduits à 5.
it: Il robot è di livello 3. Un nemico lo attaccherà con 10 di danno. Questo danno dovrebbe ridursi di 5.
ja: ロボットはレベル3です。敵は10ダメージで攻撃します。このダメージは5に減るはずです。
pt: O robô é nível 3. Um inimigo vai atacar dando 10 de dano. Este dano deve ser reduzido para 5.
ru: У Робота 3 уровень. Враг собирается нанести 10 урона своей атакой. Этот урон должен уменьшиться до 5.

source: At higher levels, we want our robot to be super tough and take even less damage!
cs: Na vyšších úrovních chceme, aby byl náš robot super odolný a utrpěl ještě menší poškození!
da: På højere niveauer ønsker vi, at vores robot skal være super sej og tage endnu mindre skade!
de: Wir wollen, dass unser Roboter super robust ist und noch weniger Schaden nimmt, wenn er eine hohe Stufe besitzt!
es: ¡En los niveles más altos, queremos que nuestro robot sea súper resistente y que reciba aún menos daño!
fr: À des niveaux plus élevés, nous voulons que notre robot soit super résistant et qu'il subisse encore moins de dégâts !
it: A livelli più elevati, vogliamo che il nostro robot sia super resistente e che prenda ancora meno danni!
ja: より高いレベルでは、ロボットを非常にタフにして、ダメージをさらに少なくしたいと考えています！
pt: Em níveis mais altos, queremos que nosso robô seja super resistente e sofra ainda menos dano!
ru: Мы хотим, чтобы на высоких уровнях наш робот становился сверхпрочным и получал ещё меньше повреждений!
ta: உயர் மட்டங்களில், எங்கள் ரோபோ மிகவும் கடினமாக இருக்க வேண்டும் மற்றும் இன்னும் குறைவான சேதத்தை எடுக்க வேண்டும் என்று நாங்கள் விரும்புகிறோம்!
zh_hant: 在更高等級時，我們希望機器人變得更加耐打，受到的傷害進一步減少！

source: Multiplying
cs: Násobení
da: Multiplikation
de: Multiplikation
es: Multiplicar
fr: Multiplication
it: Moltiplicare
ja: 乗算する
pt: Multiplicando
ru: Умножение
ta: பெருக்கல்
zh_hant: 使用乘法

source: The variable [code]max_health[/code] is the maximum amount the robot's [code]health[/code] can be. We change our [code]take_damage()[/code] function to use this variable.
pt: A variável [code]max_health[/code] é a quantidade máxima que a vida do robô (representado pela variável [code]health[/code]) pode ter. Alteramos nossa função [code]take_damage()[/code] para usar essa variável.

source: Our robot's health is always between [code]0[/code] and [code]100[/code]. But as our robot fights, we want to increase its strength and toughness. When a character levels up, it might deal more damage to enemies, gain new abilities or, in our case, gain more health.
cs: Zdraví našeho robota je vždy mezi [code]0[/code] a [code]100[/code]. Ale jak náš robot bojuje, chceme zvýšit jeho pevnost a houževnatost. Když se postava dostane na vyšší úroveň, může způsobit více poškození nepřátelům, získat nové schopnosti nebo v našem případě získat více zdraví.
de: Das Leben unseres Roboters liegt immer zwischen [code]0[/code] und [code]100[/code]. Mit genug Kampferfahrung wollen wir seine Stärke und Zähigkeit erhöhen. Wenn die Charakterstufe sich erhöht, kann er Feinden mehr Schaden zufügen, neue Fähigkeiten erlangen oder, in unserem Fall, mehr Leben erlangen.
es: La salud de nuestro robot está siempre entre [code]0[/code] y [code]100[/code]. Pero a medida que nuestro robot lucha, queremos aumentar su fuerza y resistencia. Cuando un personaje sube de nivel, puede causar más daño a los enemigos, obtener nuevas habilidades o, en nuestro caso, ganar más salud.
ta: எங்கள் ரோபோவின் உடல்நலம் எப்போதும் [குறியீடு] 0 [/குறியீடு] மற்றும் [குறியீடு] 100 [/குறியீடு] க்கு இடையில் இருக்கும். ஆனால் எங்கள் ரோபோ போராடும்போது, அதன் வலிமையையும் கடினத்தன்மையையும் அதிகரிக்க விரும்புகிறோம். ஒரு பாத்திரம் அதிகரிக்கும் போது, அது எதிரிகளுக்கு அதிக சேதத்தை சமாளிக்கக்கூடும், புதிய திறன்களைப் பெறலாம் அல்லது எங்கள் விசயத்தில், அதிக ஆரோக்கியத்தைப் பெறலாம்.
zh_hant: 我們機器人的血量總是介於 [code]0[/code] 和 [code]100[/code] 之間。 但在機器人戰鬥時，我們希望能提升它的力量和韌性。 當角色升級時，可能會對敵人造成更多傷害、獲得新技能，或者在我們的情況下，增加更多血量。

source: We define a [code]level[/code] variable to keep track of the level of the robot. It starts at level one. When the robot has defeated enough enemies, we call the [code]level_up()[/code] function to increment the robot's level.
cs: Definujeme proměnnou [code]úroveň[/code] pro sledování úrovně robota. Začíná na úrovni jedna. Když robot porazil dostatek nepřátel, zavoláme funkci [code]level_up()[/code] ke zvýšení úrovně robota.
de: Wir definieren eine [code]level[/code]-Variable, um die Stufe des Roboters im Auge zu behalten. Er beginnt auf Stufe 1. Wenn der Roboter genügend Feinde besiegt hat, rufen wir die Funktion [code]level_up()[/code] auf, um die Stufe des Roboters zu erhöhen.
es: Definimos una variable [code]level[/code] para mantener un seguimiento del nivel del robot. Esta comienza en el nivel uno. Cuando el robot haya derrotado a suficientes enemigos, llamamos a la función [code]level_up()[/code] para incrementar el nivel del robot.
ta: ரோபோவின் அளவைக் கண்காணிக்க ஒரு [குறியீடு] நிலை [/குறியீடு] மாறியை வரையறுக்கிறோம். இது ஒன்றில் தொடங்குகிறது. ரோபோ போதுமான எதிரிகளை தோற்கடித்தால், ரோபோவின் அளவை அதிகரிக்க [குறியீடு] நிலை_அப் () [/குறியீடு] செயல்பாட்டை அழைக்கிறோம்.
zh_hant: 我們定義一個 [code]level[/code] 變數來追蹤機器人的等級。它一開始是等級一。 當機器人擊敗足夠的敵人後，我們會呼叫 [code]level_up()[/code] 函式來提高機器人的等級。

source: In this lesson, we'll just focus on increasing the robot's [code]max_health[/code]. The variable [code]max_health[/code] is the maximum amount the robot's [code]health[/code] can be. We change our [code]heal()[/code] function to use this variable.
de: In dieser Lektion konzentrieren wir uns nur darauf das Leben([code]max_health[/code]) des Roboters zu erhöhen. Die Variable [code]max_health[/code] ist der maximale Betrag, den das Leben([code]health[/code]) des Roboters betragen kann. Wir ändern unsere Funktion [code]take_damage()[/code], um diese Variable zu verwenden.
ta: இந்த பாடத்தில், ரோபோவின் [குறியீடு] MAX_HEALTH [/code] ஐ அதிகரிப்பதில் கவனம் செலுத்துவோம். மாறி [குறியீடு] MAX_HEALTH [/code] என்பது ரோபோவின் [குறியீடு] உடல்நலம் [/குறியீடு] இருக்கக்கூடிய அதிகபட்ச தொகை. இந்த மாறியைப் பயன்படுத்த எங்கள் [குறியீடு] குணப்படுத்தும் () [/குறியீடு] செயல்பாட்டை மாற்றுகிறோம்.
zh_hant: 在這一堂課中，我們將專注於增加機器人的 [code]max_health[/code]。 [code]max_health[/code] 變數是機器人 [code]health[/code] 的最大值。我們會更改 [code]heal()[/code] 函數來使用這個變數。

source: This would increase [code]max_health[/code] the same amount every time. If we graphed [code]max_health[/code], it'd look something like this.
cs: Tím by se [code]max_health[/code] pokaždé zvýšilo o stejnou hodnotu. Kdybychom do grafu vynesli [code]max_health[/code], vypadalo by to asi takto.
de: Dies würde [code]max_health[/code] jedes Mal um den gleichen Betrag erhöhen. Wenn wir [code]max_health[/code] grafisch darstellen würden, würde es ungefähr so aussehen.
es: Esto aumentaría [code]max_health[/code] la misma cantidad cada vez. Si graficamos [code]max_health[/code], se vería algo como esto.
ta: இது ஒவ்வொரு முறையும் அதே தொகையை [குறியீடு] அதிகபட்சம் [/குறியீடு] அதிகரிக்கும். நாங்கள் [குறியீடு] max_health [/code] ஐ வரைபடமாக்கினால், அது இதுபோன்றதாக இருக்கும்.
zh_hant: 這樣每次都會增加相同數量的 [code]max_health[/code]。 如果我們將 [code]max_health[/code] 畫成圖表，會像這樣。

source: This growth is [b]linear[/b]. In our case, we want a feeling of more and more power as the robot levels up. We want a graph like this.
cs: Tento růst je [b]lineární[/b]. V našem případě chceme mít pocit stále větší síly s tím, jak robot roste na vyšší úroveň. Chceme takovýto graf.
de: Dieses Wachstum ist [b]linear[/b]. In unserem Fall wollen wir ein Gefühl von immer mehr Kraft, je weiter die Stufe des Roboters aufsteigt. Wir wollen einen Graphen wie diesen.
es: Este crecimiento es [b]lineal[/b]. En nuestro caso, queremos una sensación de más y más potencia a medida que el robot sube de nivel. Queremos un gráfico como este.
ta: இந்த வளர்ச்சி [b] நேரியல் [/b]. எங்கள் விசயத்தில், ரோபோ சமன் செய்வதால் மேலும் மேலும் சக்தியின் உணர்வை நாங்கள் விரும்புகிறோம். இது போன்ற ஒரு வரைபடத்தை நாங்கள் விரும்புகிறோம்.
zh_hant: 這樣的成長是 [b]線性[/b]的。 在我們的情況下，我們希望當機器人升級時，能夠感受到越來越強大的感覺。 我們希望圖表像這樣。

source: This growth is [b]exponential[/b]. With each level, more [code]max_health[/code] is added than the previous level up. To get the exponential growth, we multiply the [code]max_health[/code] by an amount greater than [code]1[/code] each time the robot levels up. To multiply values together, we use [code]*[/code].
cs: Tento růst je [b]exponenciální[/b]. S každou úrovní přibývá více [code]max_zdraví[/code] než s předchozí úrovní nahoru. Exponenciální růst získáme tak, že při každém zvýšení úrovně robota vynásobíme [code]max_health[/code] částkou větší než [code]1[/code]. Pro vynásobení hodnot dohromady použijeme [code]*[/code].
de: Dieses Wachstum ist [b]exponentiell[/b]. Mit jeder Stufe wird das maximale Leben([code]max_health[/code]) mehr erhöht als in der vorherigen Stufe. Um exponentielles Wachstum zu erhalten, multiplizieren wir die Variable [code]max_health[/code] jedes Mal, wenn der Roboter aufsteigt, mit einem Betrag, der größer als [code]1[/code] ist. Um Werte miteinander zu multiplizieren, verwenden wir [code]*[/code].
es: Este crecimiento es [b]exponencial[/b]. Con cada nivel, se añade más [code]max_health[/code] que en el nivel anterior. Para obtener el crecimiento exponencial, multiplicamos el [code]max_health[/code] por una cantidad superior a [code]1[/code] cada vez que el robot sube de nivel. Para multiplicar valores entre sí, utilizamos [code]*[/code].
ta: இந்த வளர்ச்சி [b] அதிவேகமானது [/b]. ஒவ்வொரு மட்டத்திலும், முந்தைய நிலையை விட அதிகமான [குறியீடு] MAX_HEALTH [/code] சேர்க்கப்படுகிறது. அதிவேக வளர்ச்சியைப் பெற, [குறியீடு] அதிகபட்சம் [/குறியீடு] ஒவ்வொரு முறையும் ரோபோ அதிகரிக்கும் போது [குறியீடு] 1 [/குறியீடு] ஐ விட அதிகமான தொகையால் பெருக்குகிறோம். மதிப்புகளை ஒன்றாக பெருக்க, நாங்கள் [குறியீடு]*[/குறியீடு] ஐப் பயன்படுத்துகிறோம்.
zh_hant: 這樣的成長是 [b]指數型[/b]的。 每次升級時，會比上次升級時增加更多的 [code]max_health[/code]。 要實現指數型成長，我們每次升級時將 [code]max_health[/code] 乘以大於 [code]1[/code] 的數字。 要將數值相乘，我們使用 [code]*[/code]。

source: [code] var level = 5 var power = 3 func calculate_damage(): var damage = power * level [/code]
ta: [குறியீடு] var நிலை = 5 var ஆற்றல் = 3 func calculate_damage (): var சேதம் = ஆற்றல் * நிலை [/குறியீடு]

source: [code] var level = 5 var power = 3 func calculate_damage(): var damage = power * level damage *= 2 [/code]
ta: [குறியீடு] var நிலை = 5 var ஆற்றல் = 3 func calculate_damage (): var சேதம் = ஆற்றல் * நிலை சேதம் *= 2 [/குறியீடு]

source: The value of [code]damage[/code] starts as [code]15[/code]. Then, [code]damage *= 2[/code] multiplies it by [code]2[/code] to get [code]30[/code].
cs: Hodnota [code]damage[/code] začíná jako [code]15[/code]. Pak pomocí [code]damage *= 2[/code] vynásobíme [code]2[/code] a získáme [code]30[/code].
de: Der Wert von [code]damage[/code] beginnt mit [code]15[/code]. Dann multipliziert [code]damage *= 2[/code] den Wert mit [code]2[/code], um [code]30[/code] zu erhalten.
es: El valor del [code]damage[/code] comienza siendo [code]15[/code]. Luego, [code]damage *= 2[/code] lo multiplica por [code]2[/code] para obtener [code]30[/code].
ta: [குறியீடு] சேதத்தின் மதிப்பு [/குறியீடு] [குறியீடு] 15 [/குறியீடு] ஆகத் தொடங்குகிறது. பின்னர், [குறியீடு] சேதம் *= 2 [/குறியீடு] [குறியீடு] 2 [/குறியீடு] மூலம் [குறியீடு] 30 [/குறியீடு] ஐப் பெறுகிறது.
zh_hant: [code]damage[/code] 的值從 [code]15[/code] 開始。 然後 [code]damage *= 2[/code] 是將 damage 乘以 [code]2[/code]，得到 [code]30[/code]。

source: Let's make the robot stronger when it levels up. Add to the [code]level_up()[/code] function so it does the following: - Increases [code]level[/code] by one. - Increases [code]max_health[/code] by 10%.
cs: Udělejme robota silnějšího, až se dostane na vyšší úroveň. Přidejte do funkce [code]level_up()[/code] instrukce, aby provedla: - Zvýšení [code]úroveň[/code] o jedna. - Zvýšení [code]max_health[/code] o 10 %.
de: Lasse uns den Roboter stärker machen, wenn seine Stufe sich erhöht. Füge der Funktion [code]level_up()[/code] Folgendes hinzu: - Erhöht [code]level[/code] um eins. - Erhöht [code]max_health[/code] um 10%.
es: Hagamos que el robot sea más fuerte cuando suba de nivel. Añade código a la función [code]level_up()[/code] para que haga lo siguiente: - Aumentar el [code]level[/code] en uno. - Aumentar la [code]max_health[/code] en un 10%.
ta: ரோபோ அதிகரிக்கும் போது அதை வலிமையாக்குவோம். [குறியீடு] level_up () [/code] செயல்பாட்டில் சேர்க்கவும், எனவே இது பின்வருவனவற்றைச் செய்கிறது: - [குறியீடு] நிலை [/குறியீடு] ஐ ஒருவரால் அதிகரிக்கிறது. - [குறியீடு] MAX_HEALTH [/code] ஐ 10%அதிகரிக்கிறது.
zh_hant: 讓我們使機器人在升級時變得更強。 在 [code]level_up()[/code] 函式中加入以下功能： - 將 [code]level[/code] 增加 1。 - 將 [code]max_health[/code] 增加 10%。

source: When our robot's [code]level[/code] is [code]3[/code] or more, we want it to take a lot less damage. Add to the [code]take_damage()[/code] function so the following happens: - [code]if[/code] the robot's [code]level[/code] is greater than [code]2[/code], reduce the damage [code]amount[/code] by 50% The robot is level 3. An enemy is going to attack for 10 damage. This damage should reduce to 5.
cs: Když je náš robot[code]level[/code] [code]3[/code] nebo vyšší, chceme, aby utrpěl mnohem menší poškození. Přidejte instrukce do funkce [code]take_damage()[/code], aby se stalo následující: - [code]if[/code] je [code]level[code] robota větší než [code]2 [/code], snížíme [code]amount[/code](hodnotu) poškození o 50%. Robot je na úrovni 3. Nepřítel zaútočí za 10 poškození. Toto poškození by se mělo snížit na 5.
de: Wenn die Variable [code]level[/code] unseres Roboters [code]3[/code] oder mehr ist, möchten wir, dass er viel weniger Schaden nimmt. Ändere die Funktion [code]take_damage()[/code], damit Folgendes geschieht: [code]Wenn[/code] die Stufe([code]level[/code]) unseres Roboters größer als [code]2[/code] ist, dann verringere den Schaden um einen Wert([code]amount[/code]) von 50% Der Roboter ist Stufe 3. Ein Feind wird versuchen 10 Schaden zu machen. Dieser Schaden sollte sich auf 5 reduzieren.
es: Cuando el [code]level[/code] de nuestro robot sea [code]3[/code] o más, queremos que este reciba mucho menos daño. Agrega código a la función [code]take_damage()[/code] para que suceda lo siguiente: - Si ([code]if[/code]) el [code]level[/code] del robot es mayor que [code]2[/code], reduce la [code]amount[/code] del daño en un 50%. El robot está en nivel 3. Un enemigo va a atacar para causar 10 de daño. Este daño debería reducirse a 5.
ta: எங்கள் ரோபோவின் [குறியீடு] நிலை [/குறியீடு] [குறியீடு] 3 [/குறியீடு] அல்லது அதற்கு மேற்பட்டதாக இருக்கும்போது, இது மிகவும் குறைவான சேதத்தை எடுக்க வேண்டும் என்று நாங்கள் விரும்புகிறோம். [குறியீடு] டேக்_டேச் () [/குறியீடு] செயல்பாட்டில் சேர்க்கவும், எனவே பின்வருபவை நிகழ்கிறது: . ரோபோ நிலை 3. ஒரு எதிரி 10 சேதங்களுக்கு தாக்கப் போகிறார். இந்த சேதம் 5 ஆக குறைக்க வேண்டும்.
zh_hant: 當我們的機器人 [code]等級[/code] 為 [code]3[/code] 或更高時，我們希望它受到的傷害大幅減少。 修改 [code]take_damage()[/code] 函式，使其符合以下條件： - [code]if[/code] 機器人的 [code]level[/code] 大於 [code]2[/code]，則將傷害 [code]amount[/code] 減少 50% 機器人目前的等級為 3。敵人即將造成 10 點傷害，最終傷害應該減少到 5 點。

source: In this lesson, we'll just focus on increasing the robot's [code]max_health[/code]. The variable [code]max_health[/code] is the maximum amount the robot's [code]health[/code] can be. We change our [code]take_damage()[/code] function to use this variable.
es: En esta lección, sólo nos centraremos en aumentar la salud máxima, o [code]max_health[/code], del robot. La variable [code]max_health[/code] es la cantidad máxima que puede tener la [code]health[/code] del robot. Cambiamos nuestra función [code]take_damage()[/code] para utilizar esta variable.
