Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-16-2d-vectors.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: The robot's level has increased a lot, and so has its size! Let's fix this by resetting the robot's [code]scale[/code] and [code]position[/code] values. Create a function named [code]reset_robot()[/code] that sets the [code]scale[/code] and [code]position[/code] of the robot. The [code]x[/code] and [code]y[/code] sub-variables of the robot's [code]scale[/code] need to be [code]1.0[/code]. The robot's [code]position[/code] needs to be [code]Vector2(0, 0)[/code]. As in the previous practice, make sure to use vectors when dealing with scale and position.
it: Il livello del robot è salito di un sacco, anche la sua grandezza! Aggiustiamo questo resettando la [code]scale[/code]del robot e la sua [code]position[/code]. Crea una funzione chiamata [code]reset_robot()[/code] che setta la [code]scale[/code] e la [code]position[/code] del robot. Le sotto-variabili [code]x[/code] e [code]y[/code] della [code]scale[/code] del robot devono essere [code]1.0[/code]. La [code]position[/code] del robot deve essere [code]Vector2(0, 0)[/code]. Come nella precedente pratica, fa sì di utilizzare i vettori quando tratti la grandezza e la posizione.
nl: Het niveau van de robot is sterk toegenomen, net als zijn omvang! Laten we dit oplossen door de waarden [code]scale[/code] en [code]position[/code] van de robot te resetten. Maak een functie met de naam [code]reset_robot()[/code] die de [code]scale[/code] en [code]position[/code] van de robot instelt. De deelvariabelen [code]x[/code] en [code]y[/code] van de [code]scale[/code] van de robot moeten [code]1.0[/code] zijn. De [code]position[/code] van de robot moet [code]Vector2(0, 0)[/code] zijn. Net als in de vorige oefening moet je vectoren gebruiken wanneer je te maken hebt met schaal en positie.
pt_br: O nível do robô aumentou muito, assim como seu tamanho! Vamos corrigir isso redefinindo os valores de [code]scale[/code] e [code]position[/code] do robô. Crie uma função chamada [code]reset_robot()[/code] que defina as variáveis [code]scale[/code] e [code]position[/code] do robô. As sub-variáveis [code]x[/code] e [code]y[/code] da [code]scale[/code] do robô precisam ser [code]1.0[/code]. A [code]position[/code] do robô precisa ser [code]Vector2(0, 0)[/code]. Assim como na prática anterior, certifique-se de usar vetores ao lidar com escala e posição.
ru: Уровень робота очень сильно увеличился, как и его размер! Давайте исправим это сбросом значений [code]scale[/code] и [code]position[/code] робота. Создайте функцию [code]reset_robot()[/code], сбрасывающую [code]scale[/code] и [code]position[/code] робота. Вложенные значения [code]x[/code] и [code]y[/code] переменной [code]scale[/code] робота должны быть установлены в [code]1.0[/code]. [code]position[/code] робота должна быть установлена в [code]Vector2(0, 0)[/code]. Как и в предыдущем упражнении, убедитесь что вы используете векторы при изменении размера и позиции.
ta: ரோபோவின் நிலை நிறைய அதிகரித்துள்ளது, மேலும் அதன் அளவு உள்ளது! ரோபோவின் [குறியீடு] அளவு [/குறியீடு] மற்றும் [குறியீடு] நிலை [/குறியீடு] மதிப்புகளை மீட்டமைப்பதன் மூலம் இதை சரிசெய்வோம். ரோபோவின் [குறியீடு] reset_robot () [/code] என்ற பெயரில் [குறியீடு] அளவு [/குறியீடு] மற்றும் [குறியீடு] நிலை [/குறியீடு] அமைக்கும் செயல்பாட்டை உருவாக்கவும். [குறியீடு] ஃச் [/குறியீடு] மற்றும் [குறியீடு] ஒய் [/குறியீடு] ரோபோவின் [குறியீடு] அளவின் துணை மாறுபாடுகள் [/குறியீடு] [குறியீடு] 1.0 [/குறியீடு] ஆக இருக்க வேண்டும். ரோபோவின் [குறியீடு] நிலை [/குறியீடு] [குறியீடு] திசையன் 2 (0, 0) [/குறியீடு] ஆக இருக்க வேண்டும். முந்தைய நடைமுறையைப் போலவே, அளவு மற்றும் நிலையை கையாளும் போது திசையன்களைப் பயன்படுத்துவதை உறுதிசெய்க.
zh_hans: 机器人的等级提升了很多，体型也变大了！ 让我们通过重置机器人的 [code]scale[/code] 和 [code]position[/code] 来让它回到原样。 创建一个名为 [code]reset_robot()[/code] （重置机器人）的函数，用于设置机器人的 [code]scale[/code] 和 [code]position[/code]。 机器人的[code]scale[/code]的子变量[code]x[/code]和[code]y[/code]需要设为[code]1.0[/code]。 机器人的 [code]position[/code] 需要设为 [code]Vector2(0, 0)[/code]。 与之前的做法一样，在处理缩放比例和位置时，请使用矢量。
zh_hant: 機器人的等級大幅提升，體型也跟著變大了！ 讓我們透過重設機器人的 [code]scale[/code] 和 [code]position[/code] 來修正這個問題。 請建立一個名為 [code]reset_robot()[/code] 的函式，用於設定機器人的 [code]scale[/code] 和 [code]position[/code] 。 機器人 [code]scale[/code] 的 [code]x[/code] 和 [code]y[/code] 子變數應設為 [code]1.0[/code]。 機器人 [code]position[/code] 應設為 [code]Vector2(0, 0)[/code]。 與前一個練習一樣，請確保在處理縮放與位置時使用向量。
