Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-19-creating-arrays.po
Languages: cs, da, de, es, fr, it, nl, pt_br, ru, ta, tr, uk, zh_hant

source: Let's look at a widespread use of arrays in games: finding and following a path.
da: Lad os se på en udbredt brug af arrays i spil: at finde og følge en sti.
fr: Examinons une utilisation très répandue des tableaux dans les jeux : trouver et suivre un chemin.
it: Vediamo un uso diffuso degli array nei giochi: trovare e seguire un percorso.
nl: Laten we eens kijken naar een veelvoorkomend gebruik van arrays in spellen: het vinden en volgen van een pad.
pt_br: Vamos ver um uso bem comum de arrays em jogos: encontrar e seguir um caminho.
ru: Давайте посмотрим шире на использование массивов в играх: поиск и следование пути.
tr: Dizilerin, oyunlardaki yaygın bir kullanımına bakalım: bir yolu bulmak ve onu takip etmek.
uk: Давайте подивимося на широке використання масивів в іграх: пошук і проходження шляху.

source: In games, you need allies or monsters to find their way to their target, whether it's the player or some point of interest.
da: I spil har du brug for at allierede eller monstre kan finde vej til deres mål, uanset om det er spilleren eller et interessepunkt.
fr: Dans les jeux, vous avez besoin que les alliés ou les monstres trouvent leur chemin vers leur cible, que ce soit le joueur ou un point d'intérêt.
it: Nei giochi, è necessario che gli alleati o i mostri trovino la strada per raggiungere il loro obiettivo, che sia il giocatore o un punto di interesse.
nl: In spellen moet je bondgenoten of monsters hun weg laten vinden naar hun doel, of dat nu de speler of een belangrijke plek is.
pt_br: Em jogos, você precisa que aliados ou monstros encontrem o caminho até o alvo deles, seja o jogador ou algum ponto de interesse.
ru: В играх вам нужно, чтобы союзники и монстры находили пути к своим целям, вне зависимости от того, где находится игрок или какая-либо интересующая точка.
tr: Oyunlarda, müttefik oyuncular veya canavarların, hedeflerine giden yolu, mesela oyuncuya ya da ilgi çekici bir noktaya doğru, bulmalarına ihtiyacınız vardır.
uk: В іграх вам потрібні союзники або монстри, щоб знайти шлях до своєї цілі, чи то гравець, чи якась визначна точка.

source: To achieve that, we use [i]pathfinding algorithms[/i]. As the name suggests, those algorithms find the path between two points and allow AIs to traverse the game.
da: For at opnå det bruger vi [i]stifindingsalgoritmer[/i]. Som navnet antyder, finder disse algoritmer stien mellem to punkter og tillader AI'er at gennemløbe spillet.
fr: Pour y parvenir, nous utilisons des [i]algorithmes de recherche de chemin[/i]. Comme leur nom l'indique, ces algorithmes trouvent le chemin entre deux points et permettent aux IA de traverser le jeu.
it: Per raggiungere questo obiettivo, utilizziamo [i]algoritmi di pathfinding[/i]. Come suggerisce il nome, questi algoritmi trovano il percorso tra due punti e permettono alle IA di attraversare il gioco.
nl: Om dat te bereiken, gebruiken we [i]padzoekalgoritmen[/i]. Zoals de naam al suggereert, vinden deze algoritmen het pad tussen twee punten en laten ze AI's door het spel bewegen.
pt_br: Para conseguir isso, usamos [i]algoritmos de busca de caminho[/i] (chamado de pathfinding). Como o nome sugere, esses algoritmos encontram o caminho entre dois pontos e permitem que as IAs andem pelo jogo.
ru: Для достижения этого, мы используем [i]алгоритмы поиска пути[/i]. Как следует из названия, эти алгоритмы используются для поиска пути между двумя точками и позволяют персонажу с искусственным интеллектом перемещаться по миру игры.
tr: Bunu başarmak için [i]yol-bulma algoritmaları [/i] kullanıyoruz. Adından da anlaşılacağı gibi, bu algoritmalar iki nokta arasındaki yolu bulur, ve AI'ların (yapay zeka, Artificial Intelligence) oyunda dolaşmasına olanak sağlar.
uk: Для цього ми використовуємо [i]алгоритми пошуку шляху[/i]. Як випливає з назви, ці алгоритми знаходять шлях між двома точками та дозволяють ШІ проходити гру.

source: Many of those algorithms use arrays of [code]Vector2[/code] coordinates to represent the path.
da: Mange af disse algoritmer bruger arrays af [code]Vector2[/code] koordinater til at repræsentere stien.
fr: Beaucoup de ces algorithmes utilisent des tableaux de coordonnées [code]Vector2[/code] pour représenter le chemin.
it: Molti di questi algoritmi usano array di coordinate in [code]Vector2[/code] che rappresentato un percorso.
nl: Veel van deze algoritmen gebruiken arrays van [code]Vector2[/code] coördinaten om het pad weer te geven.
pt_br: Muitos desses algoritmos usam arrays de coordenadas do tipo[code]Vector2[/code] para representar o caminho.
ru: Многие из этих алгоритмов используют массивы координат, записанных в виде [code]Vector2[/code], представляющие путь.
tr: Bu algoritmaların çoğu, yolu temsil etmek için [code]Vector2[/code] tipinde konum dizilerini kullanır.
uk: Багато з цих алгоритмів використовують масиви координат [code]Vector2[/code] для представлення шляху.

source: Take this turtle pet. It wants to follow the robot, but there are rocks in the way.
da: Tag dette skildpaddekæledyr. Den vil følge robotten, men der er sten i vejen.
fr: Prenez cette tortue de compagnie. Elle veut suivre le robot, mais il y a des rochers sur le chemin.
it: Guarda questo cucciolo di tartaruga. Vuole seguire il robot, ma ci sono rocce ad ostacolarla.
nl: Neem deze schildpad. Het wil de robot volgen, maar er liggen rotsen in de weg.
pt_br: Veja essa tartaruga de estimação. Ele quer seguir o robô, mas há pedras no caminho.
ru: Посмотрите на эту черепаху. Она хочет следовать за роботом, но её путь преграждают камни.
tr: Bu evcil kaplumbağayı ele alalım. Robotu takip etmek istiyor ama önünde kayalar var.
uk: Візьміть цю черепаху. Він хоче слідувати за роботом, але на його шляху є каміння.

source: How can we tell it where to walk to reach the robot? With an array!
da: Hvordan kan vi fortælle den, hvor den skal gå for at nå robotten? Med et array!
fr: Comment pouvons-nous lui dire où marcher pour atteindre le robot ? Avec un tableau !
it: Come possiamo dirle dove andare per raggiungere il robot? Con un array!
nl: Hoe kunnen we hem vertellen waar hij heen moet lopen om de robot te bereiken? Met een array!
pt_br: Como podemos dizer a ela para onde caminhar até chegar no robô? Com um array!
ru: Как мы можем объяснить ей, куда нужно идти, чтобы прийти к роботу? При помощи массивов!
tr: Robota ulaşmak için nereden yürümesi gerektiğini nasıl söyleyebiliriz? Bir dizi ile!
uk: Як ми можемо вказати йому, куди йти, щоб дістатися до робота? З масивом!

source: Every value in the array is a [code]Vector2[/code] and represents a cell the turtle needs to walk through.
da: Hver værdi i arrayet er en [code]Vector2[/code] og repræsenterer en celle, som skildpadden skal gå igennem.
fr: Chaque valeur du tableau est un [code]Vector2[/code] et représente une case que la tortue doit traverser.
it: Ogni valore nell'array [code]Vector2[/code] e rappresenta una cella che la tartaruga deve attraversare.
nl: Elke waarde in de array is een [code]Vector2[/code] en vertegenwoordigt een cel waar de schildpad doorheen moet lopen.
pt_br: Cada valor no array é uma variável do tipo [code]Vector2[/code] e representa a célula que a tartaruga precisa percorrer.
ru: Каждое значение массива — это [code]Vector2[/code], представляющий ячейку, через которую черепаха должна пройти.
tr: Dizideki her değer bir [code]Vector2[/code] değeridir ve kaplumbağanın geçmesi gereken bir hücreyi temsil eder.
uk: Кожне значення в масиві є [code]Vector2[/code] і представляє комірку, яку черепашка має пройти.

source: Together, all the values in the array represent a path we can draw.
da: Tilsammen repræsenterer alle værdierne i arrayet en sti, vi kan tegne.
fr: Ensemble, toutes les valeurs du tableau représentent un chemin que nous pouvons dessiner.
it: Insieme, tutti i valori dell'array rappresentano un percorso che noi possiamo designare.
nl: Samen vertegenwoordigen alle waarden in de array een pad dat we kunnen tekenen.
pt_br: Juntos, todos os valores no array representam um caminho que podemos desenhar.
ru: Вместе все значения в массиве представляют путь, который мы можем нарисовать.
tr: Birlikte, dizideki değerlerin tümü bize, çizebileceğimiz bir yolu gösterir.
uk: Разом усі значення в масиві представляють шлях, який ми можемо намалювати.

source: In upcoming lessons, you will see how we can use arrays to store player inventories or design attack combos.
da: I kommende lektioner vil du se, hvordan vi kan bruge arrays til at gemme spillerinventarer eller designe angrebskombinationer.
fr: Dans les prochaines leçons, vous verrez comment nous pouvons utiliser des tableaux pour stocker les inventaires des joueurs ou concevoir des combos d'attaque.
it: Nelle prossime lezioni, vedrai come usiamo gli array per immagazzinare inventari di giocatori o per progettare combo di attacchi.
nl: In de volgende lessen zul je zien hoe we arrays kunnen gebruiken om spelersinventarissen op te slaan of aanvalscombinaties te ontwerpen.
pt_br: Nas próximas lições, você vai ver como podemos usar arrays para armazenar inventários de jogadores ou criar combos de ataque.
ru: В будущих уроках вы увидите как можно использовать массивы для хранения предметов в инвентаре игрока или определения комбинации атак.
tr: İlerleyen derslerde, oyuncunun eşya deposunu tutmak veya birleşik saldırılar tasarlamak için dizileri nasıl kullanabileceğimizi göreceksiniz.
uk: У наступних уроках ви побачите, як ми можемо використовувати масиви для зберігання інвентарю гравців або розробки комбінацій атак.

source: For now, let's practice creating arrays.
da: Lad os nu øve os i at oprette arrays.
fr: Pour l'instant, exerçons-nous à créer des tableaux.
it: Per ora, facciamo pratica a creare array.
nl: Laten we nu oefenen met het maken van arrays.
pt_br: Por enquanto, vamos praticar a criação de arrays.
ru: А сейчас давайте поупражняемся в создании массивов.
tr: Ama şimdilik, dizi oluşturma alıştırması yapalım.
uk: А поки потренуємося створювати масиви.

source: Walking to the robot
cs: Chůze k robotovi
da: Gå hen til robotten
de: Zum Roboter laufen
es: Caminar hacia el robot
fr: Marcher vers le robot
it: Arrivare fino al robot
nl: Naar de robot toe lopen
pt_br: Andando até o robô
ru: Перемещение к роботу
ta: ரோபோவுக்கு நடப்பது
tr: Robota doğru yürümek
uk: Йду до робота
zh_hant: 走向機器人

source: The turtle wants to meet the robot! But it cannot find it on its own.
da: Skildpadden vil gerne møde robotten! Men den kan ikke finde den på egen hånd.
fr: La tortue veut rencontrer le robot ! Mais elle ne peut pas le trouver toute seule.
it: La tartaruga vuole incontrare il robot! Ma non può farlo da sola.
nl: De schildpad wil de robot ontmoeten! Maar hij kan hem niet alleen vinden.
pt_br: A tartaruga quer conhecer o robô! Mas não consegue encontrá-lo por conta própria.
ru: Черепаха хочет встретиться с роботом! Но она не может найти его самостоятельно.
tr: Kaplumbağa, robotla tanışmak istiyor! Ama onu kendi başına bulamaz.
uk: Черепаха хоче познайомитися з роботом! Але воно не може знайти його самостійно.

source: Fill the [code]turtle_path[/code] array with [code]Vector2[/code] coordinates indicating where the turtle should move to avoid the obstacles and arrive safely to the robot.
da: Udfyld [code]turtle_path[/code]-arrayet med [code]Vector2[/code]-koordinater, der angiver, hvor skildpadden skal bevæge sig hen for at undgå forhindringerne og komme sikkert frem til robotten.
fr: Remplissez le tableau [code]turtle_path[/code] avec les coordonnées [code]Vector2[/code] indiquant où la tortue doit se déplacer pour éviter les obstacles et arriver en toute sécurité au robot.
it: Riempi l'array [code]turtle_path[/code] con coordinate [code]Vector2[/code] che indicano dove la tartaruga dovrebbe andare per evitare gli ostacoli e arrivare in sicurezza al robot.
nl: Vul de array [code]turtle_path[/code] met [code]Vector2[/code] coördinaten die aangeven waar de schildpad naartoe moet bewegen om de obstakels te vermijden en veilig bij de robot aan te komen.
pt_br: Preencha o array [code]turtle_path[/code] com as coordenadas [code]Vector2[/code] indicando onde a tartaruga deve se mover para evitar os obstáculos e chegar com segurança até o robô.
ru: Заполните массив [code]turtle_path[/code] координатами [code]Vector2[/code], сообщающими, куда черепаха должна двигаться чтобы обойти препятствия и безопасно добраться до робота.
tr: [code]turtle_path[/code] dizisini, kaplumbağanın engellerden kaçınmak ve robota güvenli bir şekilde ulaşmak için nereye hareket etmesi gerektiğini gösteren [code]Vector2[/code] koordinatlarıyla doldurun.
uk: Заповніть масив [code]turtle_path[/code] координатами [code]Vector2[/code], які вказують, куди повинна рухатися черепаха, щоб уникнути перешкод і безпечно дістатися до робота.

source: The turtle can move up, down, left, or right. It cannot move diagonally.
da: Skildpadden kan bevæge sig op, ned, til venstre eller til højre. Den kan ikke bevæge sig diagonalt.
fr: La tortue peut se déplacer vers le haut, le bas, la gauche ou la droite. Elle ne peut pas se déplacer en diagonale.
it: La tartaruga si può muovere sopra, sotto, a destra e a sinistra. Non si può muovere diagoonalmente.
nl: De schildpad kan omhoog, omlaag, naar links of naar rechts bewegen. Hij kan niet diagonaal bewegen.
pt_br: A tartaruga pode se mover para cima, para baixo, para a esquerda ou para a direita. Ele não pode se mover na diagonal.
ru: Черепаха может двигаться вверх, вниз, влево и вправо. Она не может двигаться по диагонали.
tr: Kaplumbağa yukarı, aşağı, sola veya sağa hareket edebilir. Ancak çapraz hareket edemez.
uk: Черепаха може рухатися вгору, вниз, вліво або вправо. Він не може рухатися по діагоналі.

source: We recommend copying and pasting to fill the array with comma-separated [code]Vector2[/code] values quickly.
da: Vi anbefaler at kopiere og indsætte for hurtigt at udfylde arrayet med kommaseparerede [code]Vector2[/code]-værdier.
fr: Nous vous recommandons de copier et de coller pour remplir plus rapidement le tableau avec des valeurs [code]Vector2[/code] séparées par des virgules.
it: Ti consigliamo di copiare e incollare per riempire rapidamente l'array con valori [code]Vector2[/code] separati da virgole.
nl: We raden kopiëren en plakken aan om de matrix snel te vullen met door komma's gescheiden [code]Vector2[/code] waarden.
pt_br: Recomendamos copiar e colar para preencher o array com valores [code]Vector2[/code] separados por vírgulas.
ru: Мы рекомендуем использовать копирование и вставку для быстрого заполнения массива значениями [code]Vector2[/code].
tr: Diziyi virgülle ayrılmış [code]Vector2[/code] değerleriyle hızlı bir şekilde doldurmak için, kopyala-yapıştır yapmanızı öneririz.
uk: Ми рекомендуємо скопіювати та вставити, щоб швидко заповнити масив значеннями [code]Vector2[/code], розділеними комами.

source: Help the turtle find its way to the robot! Give it a path to follow to reach the robot.
cs: Pomozte želvě najít cestu k robotovi! Ukažte jí cestu, po které se má k robotovi dostat.
da: Hjælp skildpadden med at finde vej til robotten! Giv den en sti at følge for at nå frem til robotten.
de: Hilf der Schildkröte, ihren Weg zum Roboter zu finden! Gib ihr einen Weg vor, der sie folgen kann, um den Roboter zu erreichen.
es: ¡Ayuda a la tortuga a encontrar el camino hacia el robot! Indícale el camino que debe seguir para llegar al robot.
fr: Aidez la tortue à trouver son chemin vers le robot ! Donnez-lui un chemin à suivre pour atteindre le robot.
it: Aiuta la tartaruga ad arrivare dal robot! Dagli un percorso da seguire per raggiungere il robot.
nl: Help de schildpad de weg naar de robot te vinden! Geef hem een pad dat hij moet volgen om bij de robot te komen.
pt_br: Ajude a tartaruga a encontrar o caminho até o robô! Faça um caminho pra ela seguir até alcançar o robô.
ru: Помогите черепахе найти путь к роботу! Укажите ей дорогу, которой она сможет до него добраться.
ta: ஆமை ரோபோவுக்கு அதன் வழியைக் கண்டுபிடிக்க உதவுங்கள்! ரோபோவை அடைய அதைப் பின்பற்ற ஒரு பாதையைக் கொடுங்கள்.
tr: Kaplumbağanın robota giden yolu bulmasına yardım edin! Robota ulaşmak için, izlemesi gereken bir yol verin.
uk: Допоможіть черепахі знайти шлях до робота! Дайте йому дорогу, щоб дістатися до робота.
zh_hant: 幫助海龜找到通往機器人的路！為它提供一條路徑，讓它能順利到達機器人的位置。

source: Selecting units
cs: Výběr jednotek
da: Valg af enheder
de: Einheiten auswählen
es: Selección de unidades
fr: Sélection des unités
it: Selezionando unità
nl: Spelstukken selecteren
pt_br: Selecionando unidades
ru: Выбор юнитов
ta: அலகுகளைத் தேர்ந்தெடுப்பது
tr: Birimlerin seçilmesi
uk: Вибір одиниць
zh_hant: 選擇單位

source: In this tactical game, the player and computer can select multiple units at once. You need to call the [code]select_units()[/code] function and pass it an array of [code]Vector2[/code] coordinates to know which units to select.
da: I dette taktiske spil kan spilleren og computeren vælge flere enheder på én gang. Du skal kalde funktionen [code]select_units()[/code] og sende et array af [code]Vector2[/code]-koordinater til den for at vide, hvilke enheder der skal vælges.
fr: Dans ce jeu tactique, le joueur et l'ordinateur peuvent sélectionner plusieurs unités à la fois. Vous devez appeler la fonction [code]select_units()[/code] et lui passer un tableau de coordonnées [code]Vector2[/code] pour savoir quelles unités sélectionner.
it: In questo gioco tattico, il giocatore e il computer possono selezionare più unità allo stesso momento. Devi chiamare la funzione [code]select_units()[/code] e passarle un array di coordinate [code]Vector2[/code] per sapere quale unità selezionare.
nl: In dit tactische spel kunnen de speler en de computer meerdere spelstukken tegelijk selecteren. Je moet de functie [code]select_units()[/code] aanroepen en een array van [code]Vector2[/code] coördinaten meegeven om te weten welke eenheden je moet selecteren.
pt_br: Nesse jogo tático, o jogador e o computador podem selecionar várias unidades ao mesmo tempo. Você precisa chamar a função [code]select_units()[/code] e passar um array de coordenadas [code]Vector2[/code] para saber quais unidades selecionar.
ru: В этой тактической игре игрок и компьютер могут выбирать несколько юнитов одновременно. Вам нужно вызвать функцию [code]select_units()[/code] с массивом координат типа [code]Vector2[/code], чтобы она знала, каких юнитов выбирать.
tr: Bu taktiksel oyunda, oyuncu ve bilgisayar aynı anda birden fazla birim seçebilir. Hangi birimlerin seçileceğini bilmek için, [code]select_units()[/code] fonksiyonunu çağırmanız ve ona [code]Vector2[/code] konumlarında oluşan bir dizi vermeniz gerekiyor.
uk: У цій тактичній грі гравець і комп’ютер можуть вибрати кілька одиниць одночасно. Вам потрібно викликати функцію [code]select_units()[/code] і передати їй масив координат [code]Vector2[/code], щоб знати, які одиниці вибрати.

source: Each [code]Vector2[/code] in the array represents a cell with a unit.
da: Hver [code]Vector2[/code] i arrayet repræsenterer en celle med en enhed.
fr: Chaque [code]Vector2[/code] du tableau représente une case avec une unité.
it: Ogni [code]Vector2[/code] nell'array rappresenta una cella con un'unità.
nl: Elke [code]Vector2[/code] in de array vertegenwoordigt een cel met een spelstuk.
pt_br: Cada [code]Vector2[/code] no array representa uma célula com uma unidade.
ru: Каждый [code]Vector2[/code] в массиве представляет ячейку с юнитом.
tr: Dizideki her bir [code]Vector2[/code] değeri, bir hücreyi temsil eder.
uk: Кожен [code]Вектор2[/code] у масиві представляє комірку з одиницею.

source: You can pass arrays in function calls as arguments. As an array is a value type the computer recognizes, you can pass the whole array as a single function argument.
da: Du kan sende arrays i funktionskald som argumenter. Da et array er en værditype, som computeren genkender, kan du sende hele arrayet som et enkelt funktionsargument.
fr: Vous pouvez passer des tableaux dans les appels de fonction en tant qu'arguments. Comme un tableau est un type de valeur que l'ordinateur reconnaît, vous pouvez passer le tableau entier comme un seul argument de fonction.
it: Puoi passare array quando chiami delle funzioni come argomenti. Dato che l'array è un tipo di valore che il computer riconosce, puoi passare un'intero array come un singolo argomento di una funzione.
nl: Je kunt arrays als argumenten doorgeven in functieaanroepen. Aangezien een array een waardentype is dat de computer herkent, kun je de hele array als een enkel functieargument doorgeven.
pt_br: Você pode passar arrays em chamadas de função como argumentos. Como um array é um tipo de valor que o computador reconhece, você pode passar o array inteiro como um único argumento de função.
ru: Вы можете передать массив при вызове функции в качестве аргумента. Так как массив является типом значений, компьютер поймёт, что вы передали целый массив одним аргументом функции.
tr: Dizileri fonksiyon çağrılarında girilen değişken olarak geçirebilirsiniz. Bir dizi, bilgisayarın tanıdığı bir değer tipi olduğundan, tüm diziyi tek bir girdi değişkeni olarak geçirebilirsiniz.
uk: Ви можете передавати масиви у викликах функцій як аргументи. Оскільки масив є типом значення, який розпізнає комп’ютер, ви можете передати весь масив як один аргумент функції.

source: Select all units on the board by passing the correct array to the [code]select_units()[/code] function.
da: Vælg alle enheder på spillepladen ved at sende det korrekte array til funktionen [code]select_units()[/code].
fr: Sélectionnez toutes les unités du plateau en passant le tableau correct à la fonction [code]select_units()[/code].
it: Seleziona tutte le unità sulla tavola passandogli l'array corretto alla funzione [code]select_units()[/code].
nl: Selecteer alle spelstukken op het bord door de juiste array door te geven aan de functie [code]select_units()[/code].
pt_br: Selecione todas as unidades no tabuleiro passando o array correto para a função [code]select_units()[/code].
ru: Выберите всех юнитов на доске передачей правильного массива в функцию [code]select_units()[/code].
tr: [code]select_units()[/code] fonksiyonuna doğru diziyi geçirerek tahta üstündeki tüm birimleri seçin. (birimlerin durduğu hücrelerin konum sayılarını, diğer sayılara bakıp çıkarabilirsiniz).
uk: Виберіть усі одиниці на дошці, передавши правильний масив у функцію [code]select_units()[/code].

source: Write an array to select all units on the board in this strategy game.
cs: Napište pole pro výběr všech jednotek na hrací ploše v této strategické hře.
da: Skriv et array for at vælge alle enheder på brættet i dette strategispil.
de: Schreibe ein Array, um alle Einheiten auf dem Spielfeld in diesem Strategiespiel auszuwählen.
es: Escribe una matriz para seleccionar todas las unidades del tablero en este juego de estrategia.
fr: Écrivez un tableau pour sélectionner toutes les unités sur le plateau dans ce jeu de stratégie.
it: Scrivi un array per selezionare tutte le unità sulla tavola in questo gioco di strategia.
nl: Schrijf een array om alle spelstukken op het bord te selecteren in dit strategiespel.
pt_br: Escreva um array para selecionar todas as unidades no tabuleiro nesse jogo de estratégia.
ru: Напишите массив, чтобы выбрать всех юнитов на доске в этой стратегической игре.
ta: இந்த மூலோபாய விளையாட்டில் போர்டில் உள்ள அனைத்து அலகுகளையும் தேர்ந்தெடுக்க ஒரு வரிசையை எழுதுங்கள்.
tr: Bu strateji oyununda, tüm birimleri seçmek için bir dizi yazın.
uk: Напишіть масив, щоб вибрати всі одиниці на дошці в цій стратегічній грі.
zh_hant: 在策略遊戲裡寫一個陣列來選擇所有棋盤上的單位。

source: Creating arrays
cs: Vytváření polí
da: Oprettelse af arrays
de: Erstellen von Arrays
es: Crear matrices
fr: Créer des tableaux
it: Creare array
nl: Arrays maken
pt_br: Criando arrays
ru: Создание массивов
ta: வரிசைகளை உருவாக்குதல்
tr: Diziler oluşturmak
uk: Створення масивів
zh_hant: 創建陣列
