Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-4-drawing-a-rectangle.po
Languages: cs, da, de, es, it, ja, pt, ru, ta, tr, uk, zh_hans, zh_hant

source: We'll use code created by others like we did in the previous lesson. This time, we'll solve a more complicated problem: drawing shapes.
cs: Stejně jako v předchozí lekci použijeme kód vytvořený jinými uživateli. Tentokrát budeme řešit složitější problém: kreslení tvarů.
da: Vi vil bruge kode skabt af andre som vi gjorde i den forrige lektion. Denne gang vil vi løse et mere kompliceret problem: tegning af former.
de: Wir verwenden Code, der von anderen erstellt wurde, wie wir es in der vorherigen Lektion getan haben. Dieses Mal lösen wir ein komplizierteres Problem: das Zeichnen von Formen.
es: Utilizaremos código creado por otros, como lo hicimos en la lección anterior. Esta vez, resolveremos un problema más complicado: dibujar formas.
it: Useremo codice creato da altri proprio come nelle scorse successive. Questa volta risolveremo un problema più complicato: disegnare delle forme geometriche.
ja: 前回のレッスンと同様に他の人が作ったコードを使います。今回はもう少し複雑な問題の「図形を描く」ことにチャレンジします。
pt: Vamos usar código feitos por outros programadores assim como fizemos na lição anterior. Desta vez, vamos resolver um problema mais complicado: desenhar formas.
ru: Как и в предыдущем уроке, мы будем использовать код, созданный другими программистами. На этот раз мы будем решать более сложную задачу: рисовать фигуры.
ta: முந்தைய பாடத்தில் நாங்கள் செய்ததைப் போல மற்றவர்களால் உருவாக்கப்பட்ட குறியீட்டைப் பயன்படுத்துவோம். இந்த நேரத்தில், நாங்கள் மிகவும் சிக்கலான சிக்கலைத் தீர்ப்போம்: வரைதல் வடிவங்கள்.
tr: Daha önceki derslerde olduğu gibi, başkalarının yazdığı kodları kullanacağız. Ama bu sefer, daha karmaşık bir sorunu çözeceğiz: şekilleri çizdirmek.
uk: Як і в попередньому уроці, ми використовуватимемо код, створений іншими програмістами. Цього разу ми розв'язуватимемо складніше завдання: малювати фігури.
zh_hans: 我们将使用其他人创建的代码，就像我们在上一课中所做的那样。 这一次，我们将解决一个更复杂的问题：绘制形状。
zh_hant: 我們要像在前面的課程一樣，使用其他人創建的程式碼。這次我們將解決一個更複雜的問題：繪製圖形。

source: Meet the turtle
cs: Seznamte se s želvou
da: Mød skildpadden
de: Lerne die Schildkröte kennen
es: Conoce a la tortuga
it: Ti presentiamo la tartaruga
ja: カメの登場
pt: Conheça a tartaruga
ru: Познакомьтесь с черепахой
ta: ஆமை சந்திக்கவும்
tr: Kaplumbağa ile tanışın
uk: Познайомтеся з черепашкою
zh_hans: 认识小海龟
zh_hant: 海龜登場

source: We present you: the turtle! We created the turtle to teach you how to call functions.
cs: Představujeme vám: želvu! Želvu jsme vytvořili, abychom vás naučili volat funkce.
da: Vi præsenterer for dig: skildpadden! Vi skabte skildpadden for at lære dig, hvordan du kalder funktioner.
de: Wir präsentieren dir: Die Schildkröte! Wir haben die Schildkröte entwickelt, um dir beizubringen, wie man Funktionen aufruft.
es: Te presentamos a: ¡la tortuga! Hemos creado la tortuga para enseñarte cómo llamar funciones.
it: Ti presentiamo: la tartaruga! Abbiamo creato la tartaruga per insegnarti a chiamare le funzioni.
ja: まずはじめにカメを紹介します。このカメを使って関数の呼び方を覚えましょう。
pt: Apresentamos-lhe: a tartaruga! Criamos a tartaruga para lhe ensinar como chamar funções.
ru: Представляем вам черепаху! Мы создали черепаху, чтобы научить вас вызывать функции.
ta: நாங்கள் உங்களை முன்வைக்கிறோம்: ஆமை! செயல்பாடுகளை எவ்வாறு அழைப்பது என்பதை உங்களுக்குக் கற்பிக்க நாங்கள் ஆமை உருவாக்கினோம்.
tr: Ve karşınızda: kablumbağa! Bu kaplumbağayı, size fonksiyon çağırmalarını öğretmek için tasarladık.
uk: Представляємо вам черепашку! Ми створили черепаху, щоб навчити вас викликати функції.
zh_hans: 我们向你介绍：小海龟！ 我们制做了这只小海龟来教你如何调用函数。
zh_hant: 我們向你介紹：海龜！我們創建這隻海龜來教你如何呼叫函式。

source: The turtle is a little machine that moves forward, turns, and draws lines along its path.
da: Skildpadden er en lille maskine, der bevæger sig fremad, drejer og tegner linjer langs sin bane.
it: La tartaruga è una piccola macchina che si muove in avanti, si gira e disegna linee lungo il suo percorso.
ja: このカメは前に進んだり、曲がったりして、その軌道に沿って線を描く小さなロボットです。
pt: A tartaruga é uma pequena máquina se move para frente, rotaciona e desenha uma linha ao longo do seu caminho.
ru: Черепашка - это маленькая машинка, которая движется вперед, поворачивает и рисует линии на своем пути.
tr: Kaplumbağamız, sadece ileri hareket eden, dönebilen, ve gittiği yol boyunca çizgi çizebilen küçük bir makine.
uk: Черепашка - це маленька машинка, яка рухається вперед, повертає та малює лінії на своєму шляху.

source: To make it draw, you give it a list of instructions: on each code line, you call one specific function.
da: For at få den til at tegne, giver du den en liste med instruktioner: på hver kodelinje kalder du en specifik funktion.
it: Per farla disegnare, si dà un elenco di istruzioni: in ogni riga di codice si chiama una funzione specifica.
ja: このロボットに図形を描かせるには、各行に1つの関数を呼び出すように指示を出します。
pt: Para fazê-la desenhar, deve dar-lhe uma lista de instruções: em cada linha de código chama uma função específica.
ru: Чтобы заставить её рисовать, вам нужно дать ей список инструкций: по одной функции в каждой строчке кода.
tr: Çizim yapması için ona bir talimatlar listesi vermeniz gerekli: her bir kod satırında, belirli bir fonksiyon çağıracaksınız.
uk: Щоб змусити її малювати, потрібно дати їй список інструкцій: по одній функції в кожному рядку коду.

source: We prepared several functions for you:
da: Vi har forberedt flere funktioner til dig:
it: Abbiamo preparato per voi diverse funzioni:
ja: ここにいくつかの関数があります。
pt: Preparamos várias funções para si:
ru: Мы подготовили несколько функций для вас:
tr: Sizin için bir sürü fonksiyon hazırladık.
uk: Ми підготували кілька функцій для вас:

source: - [code]move_forward(pixels)[/code] makes the turtle move forward over a given distance in [i]pixels[/i]. - [code]turn_right(degrees)[/code] makes the turtle turn clockwise by a precise amount of [i]degrees[/i]. - [code]turn_left(degrees)[/code] works the same as [code]turn_right(degrees)[/code], except the turtle turns counter-clockwise.
da: - [code]move_forward(pixels)[/code] får skildpadden til at bevæge sig fremad over en given afstand i [i]pixels[/i]. - [code]turn_right(degrees)[/code] får skildpadden til at dreje med uret med et præcist antal [i]grader[/i]. - [code]turn_left(degrees)[/code] fungerer på samme måde som [code]turn_right(degrees)[/code] bortset fra at skildpadden drejer mod uret.
it: - [code]move_forward(pixel)[/code] fa avanzare la tartaruga su una determinata distanza in [i]pixel[/i]. - [code]turn_right(degrees)[/code] fa girare la tartaruga in senso orario di una quantità precisa di [i]gradi[/i]. - [code]turn_left(degrees)[/code] funziona come [code]turn_right(degrees)[/code], ma la tartaruga gira in senso antiorario.
ja: - [code]move_forward(pixels)[/code] はカメを与えられた[i]ピクセル[/i]の距離を前進させます。 - [code]turn_right(degrees)[/code] はカメを正確な[i]角度(degrees)[/i]だけ右に回転させます。 - [code]turn_left(degrees)[/code] は、カメが左を向く以外は [code]turn_right(degrees)[/code] と同じように動作します。
ru: - [code]move_forward(pixels)[/code] заставляет черепашку двигаться вперёд на заданное расстояние в [i]пикселях[/i]. - [code]turn_right(degrees)[/code] заставляет черепашку повернуться вправо на заданное количество [i]градусов[/i]. - [code]turn_left(degrees)[/code] работает так же, как [code]turn_right(degrees)[/code], но поворачивает черепашку влево.
tr: - [code]move_forward(piksel_sayısı)[/code] kaplumbağayı verilen [i]piksel[/i] miktarı kadar mesafede ileri hareket ettirir. - [code]turn_right(derece)[/code] kaplumbağayı tam verilen [i]açı ölçüsü[/i] nde saat yönünde (sağa) çevirir. - [code]turn_left(derece)[/code] ise [code]turn_right(derece)[/code] gibi çalışır, ama farklı olarak kaplumbağa saat yönünün tersine (sola) döner.
uk: - [code]move_forward(pixels)[/code] змушує черепашку рухатися вперед на задану відстань у [i]пікселях[/i]. - [code]turn_right(degrees)[/code] змушує черепашку повернутись праворуч на задану кількість [i]градусів[/i]. - [code]turn_left(degrees)[/code] працює так само, як [code]turn_right(degrees)[/code], але повертає черепашку вліво.

source: You'll use these functions the same way you used [code]rotate()[/code] before.
da: Du bruger disse funktioner på samme måde, som du brugte [code]rotate()[/code] før.
it: Queste funzioni si usano nello stesso modo in cui si è usato [code]rotate()[/code].
ja: これらの関数は、以前 [code]rotate()[/code] を使ったのと同じように使うことができます。
pt: Vai usar essas funções da mesma forma que usou a função [code]rotate()[/code] antes.
ru: Вы будете использовать эти функции так же, как использовали [code]rotate()[/code] в прошлом уроке.
tr: Bu fonksiyonları, daha önce [code]rotate()[/code] ile yaptığınız gibi aynı şekilde kullanacaksınız.
uk: Ви будете використовувати ці функції так само, як використовували [code]rotate()[/code] у минулому уроці.

source: The turtle draws a white line as it moves. We'll use this line to draw shapes.
da: Skildpadden tegner en hvid linje, mens den bevæger sig. Vi bruger denne linje til at tegne former.
it: La tartaruga disegna una linea bianca mentre si muove. Questa linea verrà utilizzata per disegnare forme.
ja: カメは移動しながら白い線を描きます。この線を使って図形を描きます。
pt: A tartaruga irá desenhar uma linha branca enquanto se move. Vamos usar essa linha para desenhar formas.
ru: При движении черепашка рисует белую линию. Мы будем использовать эту линию для рисования фигур.
tr: Örneğin, kaplumbağayı 200 piksel hareket ettirmek için, [code]move_forward(200)[/code] kullanılır.
uk: Під час руху черепашка малює білу лінію. Ми використаємо цю лінію для малювання фігур.

source: For example, to move the turtle 200 pixels, you would write [code]move_forward(200)[/code].
da: For eksempel, for at flytte skildpadden 200 pixels, skal du skrive [code]move_forward(200)[/code].
it: Per esempio, per spostare la tartaruga di 200 pixel, si scrive [code]move_forward(200)[/code].
ja: 例えば、カメを200ピクセル動かすには、[code]move_forward(200)[/code] と書きます。
pt: Por exemplo, para mover a tartaruga em 200 pixels, deve escrever [code]move_forward(200)[/code].
ru: Например, чтобы переместить черепашку на 200 пикселей, нужно написать [code]move_forward(200)[/code].
tr: Kaplumbağa hareket ederken beyaz bir çizgi çiziyor. Bu çizgiyi, şekiller çizmek için kullanacağız.
uk: Наприклад, щоб перемістити черепашку на 200 пікселів, потрібно написати [code]move_forward(200)[/code].

source: Turning left and right
cs: Otáčení vlevo a vpravo
da: Drej til venstre og højre
de: Nach links und Rechts drehen
es: Girando a izquierda y derecha
ja: 左右に曲がる
ru: Повороты влево и вправо
ta: இடது மற்றும் வலது திரும்பவும்
tr: Sola ve sağa dönme
uk: Повороти ліворуч та праворуч
zh_hans: 向左向右转
zh_hant: 向左與向右轉

source: The functions [code]turn_left()[/code] and [code]turn_right()[/code] work the same.
da: Funktionerne [code]turn_left()[/code] og [code]turn_right()[/code] fungerer på samme måde.
it: Le funzioni [code]turn_left()[/code] e [code]turn_right()[/code] funzionano allo stesso modo.
ja: 関数 [code]turn_left()[/code] と [code]turn_right()[/code] は同じ働きをします。
pt: As funções [code]turn_lef()[/code] e [code]turn_right()[/code] funcionam da mesma forma.
ru: Функции [code]turn_left()[/code] и [code]turn_right()[/code] работают одинаково.
tr: [code]turn_left()[/code] (dön_sol)ve [code]turn_right()[/code] (dön_sağ) fonksiyonları aynı şekilde çalışıyor.
uk: Функції [code]turn_left()[/code] і [code]turn_right()[/code] працюють однаково.

source: To turn 45 degrees to the right, you would write [code]turn_right(45)[/code].
da: For at dreje 45 grader til højre, skal du skrive [code]turn_right(45)[/code].
it: Per ruotare di 45 gradi a destra, dovresti scrivere [code]turn_right(45)[/code].
ja: 右に45度回るには、[code]turn_right(45)[/code] と書きます。
pt: Para girar 45 graus para a direita, deve escrever [code]turn_right(45)[/code].
ru: Чтобы повернуть черепаху на 45 градусов вправо, нужно написать [code]turn_right(45)[/code].
tr: 45 derece sağa dönmek için, [code]turn_right(45)[/code] yazmalısınız.
uk: Щоб повернути черепашку на 45 градусів праворуч, потрібно написати [code]turn_right(45)[/code].

source: If we call [code]turn_right(45)[/code], the turtle turns 45 degrees to the right before moving on to the next instruction.
da: Hvis vi kalder [code]turn_right(45)[/code], drejer skildpadden 45 grader til højre, før den går videre til den næste instruktion.
it: Se chiamiamo [code]turn_right(45)[/code], la tartaruga ruoterà di 45 gradi a destra prima di passare all'istruzione successiva.
ja: [code]turn_right(45)[/code] を呼ぶと、亀は右に45度回ってから次の命令に移ります。
pt: Se chamarmos [code]turn_right(45)[/code], a tartaruga vai girar 45 graus para a direita antes do código passar para a próxima instrução.
ru: При вызове [code]turn_right(45)[/code], черепаха поворачивается на 45 градусов вправо, прежде чем перейти к следующей инструкции.
tr: Eğer [code]turn_right(45)[/code] çağrısını kullanırsak, kaplumbağa, sonraki talimata geçmeden önce, 45 derece sağa dönecektir.
uk: За виклику [code]turn_right(45)[/code], черепашка повертається на 45 градусів праворуч, перш ніж перейти до наступної інструкції.

source: Using these instructions, we can make any two-dimensional shape we like!
da: Ved hjælp af disse instruktioner kan vi lave enhver todimensionel form, vi ønsker!
it: Usando queste istruzioni possiamo creare qualsiasi forma bi-dimensionale che vogliamo!
ja: この方法を使えば、どんな平面的な形でも作ることができます。
pt: Usando essas instruções, podemos fazer qualquer forma que seja bidimensional que quisermos.
ru: Используя эти инструкции, мы можем нарисовать любую двухмерную фигуру, какую хотим!
tr: Bu talimatları kullanarak, iki boyutlu şekillerden istediğimizi oluşturabiliriz.
uk: Користуючись цими інструкціями, ми можемо намалювати будь-яку двовимірну фігуру, яку хочемо!

source: Try to understand the example below.
da: Prøv at forstå eksemplet nedenfor.
it: Cerca di capire l'esempio qui sotto.
ja: 試しに下の例題に挑戦しましょう。
pt: Tente entender o exemplo abaixo.
ru: Попробуйте понять приведённый ниже пример.
tr: Aşağıdaki örneği anlamaya çalışın.
uk: Спробуйте зрозуміти наведений нижче приклад.

source: In the next practice, you'll use the functions we saw above to first draw a corner, then a rectangle like this one.
da: I den næste øvelse skal du bruge de funktioner, vi så ovenfor, til først at tegne et hjørne og derefter et rektangel som dette.
it: Nel prossimo esercizio, userai le funzioni che abbiamo visto sopra per disegnare un angolo, poi un rettangolo, proprio come questo.
ja: 次の演習では上で見た関数を使ってまず角を描き、次のような長方形を描いてみましょう。
pt: Na próxima secção de prática, vai usar as funções que vimos acima para, primeiro, desenhar um ângulo de 90 graus e depois uma retângulo como esse.
ru: В следующем практическом упражнении вы будете использовать функции, которые мы видели выше, сначала, чтобы нарисовать угол, а затем — прямоугольник, подобный этому.
tr: Sıradaki alıştırmada, yukarıda gördüğümüz fonksiyonları kullanarak önce bir köşe çizecek, sonra buna benzer bir dikdörtgen oluşturacağız.
uk: У наступній практичній вправі ви будете використовувати функції, розглянуті вище, спочатку, щоб намалювати кут, а потім прямокутник, подібний до цього.

source: In the function call below, which part is the argument?
cs: Která část je ve volání funkce níže argumentem?
da: I funktionskaldet nedenfor, hvilken del er argumentet?
de: Welcher Teil ist in der folgenden Funktionsdefinition das Argument?
es: En la siguiente definición de función, ¿qué parte es el argumento de la función?
it: Nella funzione chiamata qui sotto, quale parte è il parametro?
ja: 以下の関数の定義において、関数の引数はどの部分でしょうか？
pt: Na chamada de função abaixo, qual parte é o argumento?
ru: Какая часть приведённой ниже функции является аргументом?
ta: கீழே உள்ள செயல்பாட்டு அழைப்பில், உரையாடல் எந்த பகுதி?
tr: Aşağıdaki fonksiyon çağrısında, hangisi bir girdi değişkenidir (argüman)?
uk: Яка частина наведеної нижче функції є аргументом?
zh_hans: 在下面的函数调用中，哪一部分是函数参数？
zh_hant: 在下面的函式呼叫中，哪一部分是引數？

source: A function's arguments are all the values inside the parentheses. In this case, there's only one, but there can be multiple separated by commas.
da: En funktions argumenter er alle værdierne inden for parenteserne. I dette tilfælde er der kun én, men der kan være flere adskilt af kommaer.
it: Gli argomenti di una funzione sono tutti i valori all'interno delle parentesi. In questo caso, ce n'è solo uno, ma ce ne possono essere molteplici separati da virgole.
ja: 関数の引数とは括弧の中にある値すべてです。この場合はひとつだけですが、コンマ区切りで複数にもできます。
pt: Os argumentos de uma função são todos os valores dentro dos parênteses. Nesse caso, há apenas um, mas pode haver vários separados por vírgulas.
ru: Аргументы функции — это значения внутри круглых скобок. В примере функция имеет только один аргумент, но она могла содержать и несколько, разделённых запятыми.
tr: Bir fonksiyonun girdi değişkenleri, parantez içindeki bütün değerlerdir. Bu durumda, elimizde sadece bir tane var, ama virgül ile ayrılmış bir çoğu olabilirdi.
uk: Аргументи функції – це значення всередині круглих дужок. У прикладі функція має лише один аргумент, але вона могла містити і кілька, розділених комами..

source: In this case, [code]move_forward[/code] is the function's name and [code]30[/code] is the argument.
da: I dette tilfælde er [code]move_forward[/code] funktionens navn, og [code]30[/code] er argumentet.
it: In questo caso, [code]move_forward[/code] è il nome della funzione e [code]30[/code] è l'argomento.
ja: この場合、[code]move_forward[/code] が関数の名前で、[code]30[/code] が引数です。
pt: Neste caso, [code]move_forward[/code] é o nome da função e [code]30[/code] é o argumento.
ru: В приведённом случае, [code]move_forward[/code] — это имя функции, а [code]30[/code] — это аргумент.
tr: Bu durum için, [code]move_forward[/code] fonksiyonun ismi, [code]30[/code] ise girdi değişkenidir.
uk: У наведеному випадку, [code]move_forward[/code] — це назва функції, а [code]30[/code] — це аргумент.

source: This function call will make the turtle move forward by [code]30[/code] pixels.
da: Dette funktionskald vil få skildpadden til at bevæge sig fremad med [code]30[/code] pixels.
it: Questa chiamata di funzione farà si che la tartaruga si muova in avanti di [code]30[/code] pixel.
ja: この関数の呼び出しで、カメを [code]30[/code] ピクセル移動させるでしょう。
pt: Esta chamada de função fará a tartaruga avançar em [code]30[/code] pixels.
ru: Вызов этой функции заставит черепаху передвинуться вперёд на [code]30[/code] пикселей.
tr: Bu fonksiyon çağrısı, kaplumbağanın [code]30[/code] piksel kadar ileri hareket etmesini sağlar.
uk: Виклик цієї функції змусить черепашку пересунутися вперед на [code]30[/code] пікселів.

source: The turtle uses code made specifically for this app!
cs: Želva používá kód vyrobený speciálně pro tuto aplikaci!
da: Skildpadden bruger kode lavet specifikt til denne app!
de: Die Schildkröte verwendet Code, der speziell für diese App erstellt wurde!
es: ¡La tortuga utiliza un código creado específicamente para esta aplicación!
ja: カメはこのアプリのために特別に作成されたコードを使用しています！
ru: Черепаха выполняет код, написанный специально для этого приложения!
ta: ஆமை இந்த பயன்பாட்டிற்காக குறிப்பாக தயாரிக்கப்பட்ட குறியீட்டைப் பயன்படுத்துகிறது!
tr: Kaplumbağa, özellikle bu uygulama için yapılmış kodu kullanıyor!
uk: Черепашка використовує код, створений спеціально для цієї програми!
zh_hans: 小海龟的这些代码是专门为这个教程制作的！
zh_hant: 這隻烏龜使用的是專為這個應用程式設計的程式碼！

source: The turtle is a little learning tool custom-made for this course, based on a proven code learning methodology. It's designed to teach you how to use and create functions.
da: Skildpadden er et lille læringsværktøj, der er specialfremstillet til dette kursus og baseret på en gennemprøvet kodeindlæringsmetode. Det er designet til at lære dig, hvordan du bruger og opretter funktioner.
ja: カメは、実証済みのコード学習方法論に基づいて、このコースのためにカスタムメイドされた小さな学習ツールです。 関数の使用方法と作成方法を教えるように設計されています。
ru: Черепаха — это небольшой, сделанный специально для этого курса образовательный инструмент, основанный на известной и проверенной методологии обучения коду. Мы его сделали, чтобы научить вас использовать и создавать функции.
tr: Kaplumbağa, kanıtlanmış bir kod öğrenme metodolojisine dayanan, bu kurs için özel olarak hazırlanmış küçük bir öğrenme aracıdır. Size fonksiyonları nasıl kullanacağınızı ve oluşturacağınızı öğretmek için tasarlanmıştır.
uk: Черепашка — це невеликий, зроблений спеціально для цього курсу навчальний засіб, заснований на відомій та перевіреній методології навчання коду. Ми його розробили, щоб навчити вас використовувати та створювати функції.

source: So please don't be surprised if writing code like [code]turn_left()[/code] inside of the Godot editor doesn't work! And don't worry, once you've learned the foundations, you'll see they make it faster and easier to learn Godot functions.
da: Så bliv ikke overrasket, hvis det ikke virker at skrive kode som [code]turn_left()[/code] inde i Godot-editoren! Og bare rolig, når du først har lært det grundlæggende, vil du se, at det gør det hurtigere og nemmere at lære Godot funktioner.
ja: したがって、Godot エディタ内で [code]turn_left()[/code] のようなコードを書いても機能しなくても驚かないでください。 心配しないでください。一度基礎を学べば、Godot 関数をより速く簡単に学ぶことができることがわかります。
ru: Так что не удивляйтесь, если такой код, как, например, [code]turn_left()[/code], не сработает в Godot! И не переживайте, как только разберётесь с основами, функции Godot станет учить быстрее и легче.
tr: Bu yüzden, yazacağınız [code]turn_left()[/code] gibi bir kodun Godot editörünün içinde çalışmadığını gördüğünüzde lütfen şaşırmayın! Endişelenmeyin, temelleri bir kere öğrendikten sonra bunların, Godot'nun kendi fonksiyonlarını öğrenmeyi daha hızlı ve kolay hale getirdiklerini göreceksiniz.
uk: Так що не дивуйтеся, якщо такий код, як, наприклад, [code]turn_left()[/code], не спрацює в Godot! І не хвилюйтесь: як тільки розберетеся з основами, функції Godot буде вивчати швидше і легше.

source: Let's move on to practice! You'll get to play with the turtle functions to draw shapes.
cs: Přejděme k praxi! Budete si moci hrát s funkcemi želvy a kreslit tvary.
da: Lad os gå videre til øvelse! Du får mulighed for at lege med skildpaddefunktionerne for at tegne figurer.
de: Lass uns mit der Übung fortfahren! Du wirst mit den Schildkrötenfunktionen spielen, um Formen zu zeichnen.
es: ¡Pasemos a la práctica! Podrás jugar con las funciones de la tortuga para dibujar formas.
ja: 演習に移りましょう！ カメ関数を使って図形を描画してみましょう。
ru: А теперь перейдем к практике! Вам предстоит поиграть с функциями черепашки, чтобы нарисовать фигуры.
ta: பயிற்சிக்கு செல்வோம்! வடிவங்களை வரைய ஆமை செயல்பாடுகளுடன் நீங்கள் விளையாடுவீர்கள்.
tr: Hadi şimdi uygulamaya geçelim! Şekiller çizmek için kaplumbağa fonksiyonları ile oynayacaksınız.
uk: А тепер перейдемо до практики! Щоб намалювати фігури, вам доведеться пограти з функціями черепашки.
zh_hans: 让我们进入练习环节！你将有机会使用这些移动函数来画各种形状。
zh_hant: 讓我們開始練習吧！你將可以使用烏龜的函式來畫出形狀。

source: Drawing a Corner
cs: Kreslení rohu
da: Tegning af et hjørne
de: Zeichnen einer Ecke
es: Dibujar una esquina
it: Disegnare uno Spigolo
ja: 角を描く
pt: Desenhando um ângulo de 90 graus
ru: Рисуем угол
ta: ஒரு மூலையில் வரைதல்
tr: Bir Köşe Çizmek
uk: Малюємо кут
zh_hans: 画一个直角
zh_hant: 畫一個直角

source: In this practice, we'll tell the turtle to draw a corner.
da: I denne øvelse vil vi fortælle skildpadden, at den skal tegne et hjørne.
it: In questa pratica, diremo alla tartaruga di disegnare un angolo.
ja: この演習ではカメに角を描くように指示します。
pt: Nessa prática, Vamos mandar a tartaruga desenhar um ângulo de 90 graus.
ru: В этом упражнении мы прикажем черепахе нарисовать угол.
tr: Bu alıştırmada, kaplumbağaya bir köşe çizmesini söyleyeceğiz.
uk: У цій вправі ми накажемо черепашці намалювати кут.
