Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-6-multiple-function-parameters.po
Languages: cs, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, zh_hans, zh_hant

source: To define a function, you need to start with the [code]func[/code] keyword followed by a space, the [code]function_name[/code], and optional parameters inside parentheses. You must end the line with a colon, which defines a new code block. We'll see moving forward that keywords other than [code]func[/code] require a colon at the end of the line.
es: Para definir una función, tienes que empezar con la palabra clave [code]func[/code] seguida de un espacio, el [code]nombre_de_función[/code] y los parámetros opcionales dentro de los paréntesis. Debes terminar la línea con dos puntos, lo que define un nuevo bloque de código. Veremos más adelante que otras palabras clave distintas de [code]func[/code] también requieren dos puntos al final de la línea.
ja: 関数を定義するには、[code]func[/code] キーワードで始め、その後にスペース、[code]関数名[/code]、および括弧内のオプションのパラメーターを続ける必要があります。 新しいコード ブロックを定義するコロンで行を終了する必要があります。 [code]func[/code] 以外のキーワードでは行末にコロンが必要であることが今後わかります。
pt_br: Para definir uma função, você precisa começar com a palavra-chave [code]func[/code] seguida por um espaço, o [code]nome_da_função[/code] e parâmetros opcionais dentro dos parênteses. Você deve terminar a linha com o sinal de dois pontos, que define um novo bloco de código. Vamos ver mais pra frente que outras palavras-chave diferentes de [code]func[/code] também vão exigir os dois pontos no final da linha.
zh_hans: 要定义一个函数，你需要以 [code]func[/code] 关键字开头，后跟一个空格、[code]function_name[/code] 和括号内的可选参数。 你必须以冒号结束该行，它定义了一个新的代码块。 之后我们还会看到 [code]func[/code] 以外的关键字也需要在行尾用冒号。
zh_hant: 要定義一個函式，你需要以 [code]func[/code] 關鍵字開始，接著是空格，然後是函式的名稱 [code]function_name[/code]，以及放在括號內可選的參數。 你必須以冒號結尾，這樣才能定義一個新的程式碼區塊。我們接下來會看到，除了 [code]func[/code] 之外，其他的關鍵字也需要在行尾加上冒號。

source: You can use multiple parameters in a function. In fact, you can use as many as you [i]need[/i]. To separate the function parameters, you need to write a comma between them.
es: Puedes usar varios parámetros en una función. De hecho, puedes utilizar tantos como [i]necesites[/i]. Para separar los parámetros de una función, debes escribir una coma entre ellos.
ja: 関数では複数のパラメーターを使用できます。 実際、[i]必要なだけ[/i]使用できます。 関数パラメータを区切るには、パラメータの間にカンマを記述する必要があります。
pt_br: Você pode usar vários parâmetros em uma função. Na verdade, você pode usar quantos parâmetros você [i]precisar[/i]. Para separar os parâmetros da função, você precisa escrever uma vírgula entre eles.
zh_hans: 你可以在一个函数中使用多个参数。 事实上，你 [i] 想要多少 [/i] 都可以。 要分隔函数参数，你需要在它们之间写一个逗号。
zh_hant: 你可以在函式中使用多個參數。事實上，你可以使用你[b]需要[/b]的任意數量。 要分隔函式參數，你需要在它們之間寫上逗號。

source: In a function definition, you must have a space between the [code]func[/code] keyword and the function name. However, because we use the comma to separate parameters, it doesn't matter if you use spaces between parameters. As long as you have the comma, either syntax is correct. We often use spaces after the comma for readability.
es: En una definición de función, debe haber un espacio entre la palabra clave [code]func[/code] y el nombre de la función. Sin embargo, como usamos la coma para separar los parámetros, no importa que uses espacios entre los parámetros. Mientras tengas la coma, cualquier sintaxis es correcta. A menudo utilizamos espacios después de la coma para facilitar la lectura.
ja: 関数定義では、[code]func[/code] キーワードと関数名の間にスペースが必要です。 ただし、パラメータの区切りにはカンマを使用するため、パラメータ間にスペースを使用しても問題はありません。 カンマがある限り、どちらの構文も正しいです。 読みやすくするために、カンマの後にスペースを使用することがよくあります。
pt_br: Em uma definição de função, você deve ter um espaço entre a palavra-chave [code]func[/code] e o nome da função. No entanto, como usamos a vírgula para separar os parâmetros, não importa se você usa espaços entre os parâmetros. Contanto que você tenha a vírgula, qualquer uma das sintaxes está correta. Nós costumamos a usar espaços após a vírgula para facilitar a leitura do código.
zh_hans: 在函数定义中，[code]func[/code] 关键字和函数名之间必须有一个空格。 但是，因为我们已经有逗号分隔参数，所以参数之间是否加空格无关紧要。 只要你有逗号，加不加额外的空格都是正确的。 为了便于阅读，我们才经常在逗号后使用空格。
zh_hant: 在函式定義中，你必須在 [code]func[/code] 關鍵字和函式名稱之間加上一個空格。 然而，因為我們使用逗號來分隔參數，所以在參數之間是否使用空格並不重要。只要有逗號，兩種語法都是正確的。 為了可讀性，我們通常會在逗號後加上一個空格。

source: The names of functions, parameters, or other things in your code are entirely up to you. They are written by us programmers for other programmers. You want to use the names that make the most sense to you and fellow programmers. You could absolutely write single-letter names like in maths classes: [code]a[/code], [code]b[/code], [code]f[/code]. You can also write abbreviated names like [code]pos[/code] for position, [code]bg[/code] for background, and so on. Many programmers do either or both of the above. At GDQuest, we favor complete and explicit names. We generally try to write code that is explicit and relatively easy to read. Right now, you have to enter every letter when you code, so long names may feel inconvenient. However, this is good for learning: it trains your fingers to [ignore]type precisely. Then, after you finish this course, you will see that the computer assists you a lot when you code real games with a feature called auto-completion. Based on a few characters you [ignore]type, it will offer you to complete long names.
es: Los nombres de las funciones, de los parámetros o de otras cosas en tu código dependen totalmente de ti. Los escribimos los programadores para otros programadores. Querrás utilizar los nombres que tengan más sentido para ti y para los demás programadores. Perfectamente, puedes escribir nombres de una sola letra, como en las clases de matemáticas: [code]a[/code], [code]b[/code], [code]f[/code]. También puedes escribir nombres abreviados como [code]pos[/code] para posición, [code]fdo[/code] para fondo, etc. Muchos programadores hacen una o ambas de las anteriores. En GDQuest, favorecemos los nombres completos y explícitos. Por lo general, tratamos de escribir un código que sea explícito y relativamente fácil de leer. En este momento, tienes que escribir cada letra cuando codificas, por lo que los nombres largos pueden parecer inconvenientes. Sin embargo, esto es bueno para el aprendizaje: ayuda a entrenar tus dedos para escribir con precisión. Luego, cuando termines este curso, verás que la computadora te ayuda mucho cuando codifiques juegos reales con una función llamada autocompletado. A partir de unos pocos caracteres que escribas, te ofrecerá completar nombres largos.
ja: コード内の関数、パラメータ、その他の名前は完全にあなた次第です。 これらは私たちプログラマによって他のプログラマのために書かれています。 自分自身や他のプログラマにとって最も意味のある名前を使用する必要があります。 数学の授業のように、[code]a[/code]、[code]b[/code]、[code]f[/code] のように 1 文字の名前を書くこともできます。 位置には [code]pos[/code]、背景には [code]bg[/code] などの省略名を記述することもできます。 多くのプログラマーは上記のいずれか、または両方を行っています。 GDQuest では、完全で明示的な名前を優先します。 私たちは通常、明示的で比較的読みやすいコードを書こうとします。 現時点では、コーディングするときにすべての文字を入力する必要があるため、長い名前は不便に感じるかもしれません。 ただし、これは学習には役立ちます。指が正確に [無視] して入力できるように訓練されます。 このコースを終了すると、実際のゲームをコーディングするときに、オートコンプリートと呼ばれる機能を使用してコンピューターが大いに支援してくれることがわかります。 [無視] して入力したいくつかの文字に基づいて、長い名前を完成させることができます。
pt_br: Os nomes de funções, parâmetros ou outras coisas em seu código dependem inteiramente de você. Eles são escritos por nós programadores para outros programadores. Você vai querer usar os nomes que fazem mais sentido para você e seus colegas programadores. Você poderia muito bem escrever nomes de uma única letra como nas aulas de matemática: [code]a[/code], [code]b[/code], [code]f[/code]. Você também pode escrever nomes abreviados como [code]pos[/code] para posição, [code]bg[/code] para background e assim por diante. Muitos programadores fazem uma ou ambas as opções acima. Na GDQuest, preferimos nomes completos e explícitos. Geralmente tentamos escrever código que seja explícito e relativamente fácil de ler. No momento, você precisa digitar todas as letras ao programar, portanto, nomes longos podem parecer inconvenientes. No entanto, isso é bom para aprender: ele treina seus dedos para [ignore]digitar com precisão. Então, depois de terminar este curso, você verá que o computador o auxilia muito na hora de programar jogos reais com um recurso chamado auto-completar. Com base em alguns caracteres que você [ignore]digita, ele oferecerá nomes longos completos.
zh_hans: 代码中的函数、参数或其他内容的名称完全取决于你。 它们是我们作为程序员为其他程序员写的。你应该使用你和你的同事都最容易看懂的名称。 你确实可以像上数学课那样只用一个字母的名称：[code]a[/code]、[code]b[/code]、[code]f[/code]。 你还可以写缩写名称，例如 [code]pos[/code] 表示位置（posiotion），[code]bg[/code] 表示背景（background），等等。 许多程序员都或多或少会用到上面这两种方式。 在 GDQuest课程里，我们倾向于完整和明确的名称。 我们应该时刻努力写出明确且相对容易阅读的代码。 现在，你必须在编码时输入每个字母，因此长名称可能会让人感到不便。 但是，这对学习有好处：它可以训练你的手指打字做到随心所欲。 然后，在你完成本课程后，你会发现当你实际编写游戏时，计算机会使用一种称为自动补全的功能协助你。 根据你键入的几个字符，它会为你补完完整的长名称。
zh_hant: 在程式碼中，函式、參數或其他元素的名稱完全由你決定。 這些名稱是程式設計師為其他程式設計師所寫的，因此你應該使用對自己和其他程式設計師來說最有意義的名稱。 你完全可以像數學課一樣使用單字母名稱：[code]a[/code]、[code]b[/code]、[code]f[/code]。 你也可以寫簡短的縮寫名稱，例如 [code]pos[/code] 代表位置、[code]bg[/code] 代表背景等等。 許多程式設計師都會使用上述其中一種或兩者。 在 GDQuest，我們偏好使用完整且明確的名稱。 我們通常會寫出較為明確、易讀的程式碼。 現在你必須手動輸入每個字母，所以長名稱可能會覺得不太方便。 然而這對學習來說是好的：它訓練你的手指進行精確的輸入。 等你完成這個課程後，你會發現當你開始製作真正的遊戲時，電腦會透過自動補全功能幫助你很多。 只需要輸入幾個字母，電腦就會幫你完成長名稱。

source: Before we create a rectangle of any size, let's first see how we can use parameters to draw simpler shapes. Here we have an incomplete function that will draw corners with lines of any length, but it's missing its [code]length[/code] parameter. The function will move the turtle forward an amount defined by the parameter [code]length[/code], turn [code]90[/code] degrees, then move forward [code]length[/code] pixels. Complete the [code]draw_corner()[/code] function so it uses the [code]length[/code] parameter to draw corners.
es: Antes de pasar a crear un rectángulo de cualquier tamaño, veamos primero cómo podemos utilizar los parámetros para dibujar formas más sencillas. Aquí tenemos una función incompleta que dibujará esquinas con líneas de cualquier longitud, pero le falta su parámetro de longitud: [code]length[/code]. La función hará avanzar a la tortuga una cantidad definida por el parámetro [code]length[/code], girará [code]90[/code] grados, y luego avanzará nuevamente por el número de pixeles definido por [code]length[/code]. Completa la función [code]draw_corner()[/code] para que use el parámetro [code]length[/code] para dibujar esquinas.
ja: 任意のサイズの長方形を作成する前に、まずパラメーターを使用してより単純な形状を描画する方法を見てみましょう。 ここには、任意の長さの線でコーナーを描画する不完全な関数がありますが、[code]length[/code] パラメーターが欠落しています。 この関数は、パラメータ [code]length[/code] で定義された量だけカメを前方に移動し、[code]90[/code] 度回転して、次に [code]length[/code] ピクセル前方に移動します。 [code]draw_corner()[/code] 関数を完成させて、[code]length[/code] パラメーターを使用してコーナーを描画します。
pt_br: Antes de criarmos um retângulo de qualquer tamanho, vamos primeiro ver como podemos usar parâmetros para desenhar formas mais simples. Aqui temos uma função incompleta que irá desenhar ângulos de 90° com linhas de qualquer comprimento, mas está faltando o parâmetro [code]length[/code]. A função vai mover a tartaruga para frente pela quantidade definida pelo parâmetro [code]length[/code], vai girar [code]90[/code] graus, então vai mover para frente pela quantidade de [code]length[/code] pixels. Complete a função [code]draw_corner()[/code] para que ela use o parâmetro [code]length[/code] para desenhar ângulos de 90°.
zh_hans: 在我们创建任意大小的矩形之前，让我们先看看如何使用参数来绘制更简单的形状。 这里我们有一个不完整的函数，它可以用任意长度的线画直角，但是它缺少它的 [code]length[/code] 参数。 该函数将使海龟向前移动一个由参数 [code]length[/code] 定义的量，转动 [code]90[/code] 度，然后向前移动 [code]length[/code] 个像素。 补全 [code]draw_corner()[/code] 函数，使其能使用 [code]length[/code] 参数绘制角。
zh_hant: 在我們創建任意大小矩形之前，先來看看如何使用參數畫一些簡單的形狀。 這裡有一個不完整的函式，它將畫出任意長度的直角線條，但缺少了 [code]length[/code] 參數。 這個函式會讓海龜前進一個由 [code]length[/code] 參數定義的距離，然後右轉 90 度，再前進 [code]length[/code] 像素。 請完成 [code]draw_corner()[/code] 函式，讓它使用 [code]length[/code] 參數來畫直角。

source: In this practice, we'll improve our [code]draw_corner()[/code] function so the angle can also vary. Add the [code]angle[/code] parameter after the [code]length[/code] parameter in the [code]draw_corner()[/code] function and use it to draw corners of varying angles.
es: En esta práctica, mejoraremos nuestra función [code]draw_corner()[/code] para que el ángulo también pueda variar. Añade el parámetro [code]angle[/code] después del parametro [code]length[/code] a la función [code]draw_corner()[/code] y utilízalo para dibujar esquinas de ángulos variables.
ja: この演習では、角度も変更できるように [code]draw_corner()[/code] 関数を改善します。 [code]draw_corner()[/code] 関数の [code]length[/code] パラメーターの後に [code]angle[/code] パラメーターを追加し、それを使用してさまざまな角度のコーナーを描画します。
pt_br: Neste exercício, vamos melhorar nossa função [code]draw_corner()[/code] para que o ângulo também possa variar. Adicione o parâmetro [code]angle[/code] após o parâmetro [code]length[/code] na função [code]draw_corner()[/code] e use ela para desenhar bordas de ângulos variados.
zh_hans: 在这个练习中，我们将改进我们的 [code]draw_corner()[/code] 函数，以便角度也可以变化。 将 [code]angle[/code] 参数添加到 [code]draw_corner()[/code] 函数中，放在[code]length[/code]参数之后，并使用它来绘制不同角度的角。
zh_hant: 在這個練習中，我們將改善我們的 [code]draw_corner()[/code] 函式，使得角度也能變化。 在 [code]draw_corner()[/code] 函式中，將 [code]angle[/code] 參數放在 [code]length[/code] 參數之後，並使用它來畫出不同角度的角。

source: We want a function to draw squares of any size. We could use these squares as outlines when selecting units in a tactical game, as a frame for items in an inventory, and more. Create a function named [code]draw_square()[/code] that takes one parameter: the [code]length[/code] of the square's sides. [b]The turtle should face towards the right when starting or completing a square.[/b] Be sure to call [b]turn_right(90)[/b] enough times in your function to do so.
es: Queremos una función para dibujar cuadrados de cualquier tamaño. Podríamos utilizar estos cuadrados como contornos al seleccionar unidades en un juego táctico, como marco para los objetos de un inventario y más. Crea una función llamada [code]draw_square()[/code] que tome un parámetro: la [code]length[/code], o la longitud, de los lados del cuadrado. [b]La tortuga debe estar posicionada mirando hacia la derecha al comenzar o completar un cuadrado.[/b] Asegúrese de llamar a [b]turn_right(90)[/b] suficientes veces para hacerlo.
ja: 任意のサイズの正方形を描画する関数が必要です。 これらの四角形は、戦術ゲームでユニットを選択するときのアウトラインとして使用したり、インベントリ内のアイテムのフレームとして使用したりできます。 [code]draw_square()[/code] という名前の関数を作成します。この関数は 1 つのパラメータ、つまり正方形の辺の [code]length[/code] を受け取ります。 [b]正方形を開始または完了するとき、カメは右を向く必要があります。[/b] そうするために、関数内で [b]turn_right(90)[/b] を十分な回数呼び出してください。
pt_br: Queremos uma função para desenhar quadrados de qualquer tamanho. Poderíamos usar esses quadrados como contornos ao selecionar unidades em um jogo tático, como moldura para itens em um inventário e muito mais. Crie uma função chamada [code]draw_square()[/code] que receba um parâmetro: o [code]length[/code] (comprimento) dos lados do quadrado. [b]A tartaruga deve ficar virada para a direita ao iniciar ou completar um quadrado.[/b] Certifique-se de chamar [b]turn_right(90)[/b] vezes suficientes em sua função para fazer isso.
zh_hans: 我们想要一个函数来绘制任意大小的正方形。 我们可以将这些正方形用作战术游戏中选择单位时出现的轮廓，背包中物品显示的边框等等。 创建一个名为 [code]draw_square()[/code] 的函数，它有一个参数：正方形边的 [code]length[/code]。 [b]开始或画完一个矩形时，乌龟应该面向右侧。[/b] 为到达上述效果，请确保在你的函数中调用足够次的 [b]turn_right(90)[/b] 函数。
zh_hant: 我們想要一個能夠繪製任意大小正方形的函式。 我們可以將這些正方形用在戰術遊戲中選擇單位的輪廓、物品欄中的框架等等。 創建一個名為 [code]draw_square()[/code] 的函式，它有一個參數：正方形邊長的 [code]length[/code]。 [b]當開始或完成正方形時，烏龜應該面向右方。[/b] 確保在函式中足夠次數地呼叫 [b]turn_right(90)[/b] 來達成這一點。

source: Let's make our square drawing function more flexible to include rectangles of varying sizes. Your job is to code a function named [code]draw_rectangle()[/code] that takes two parameters: the [code]length[/code] and the [code]height[/code] of the rectangle. [b]The turtle should face towards the right when starting or completing a rectangle.[/b] Note that we could still draw a square with [code]draw_rectangle()[/code] by having the [code]length[/code] and [code]height[/code] equal the same value.
es: Hagamos que nuestra función para dibujar cuadrados sea más flexible para incluir rectángulos de distintos tamaños. Tu trabajo es codificar una función llamada [code]draw_rectangle()[/code] que tome dos parámetros: [code]length[/code] y [code]height[/code], que designan la longitud y la altura del rectángulo respectivamente. [b]La tortuga debe estar posicionada mirando hacia la derecha al comenzar o completar un rectángulo.[/b] Ten en cuenta que aún podríamos dibujar un cuadrado con [code]draw_rectangle()[/code] haciendo que [code]length[/code] y [code]height[/code] tengan el mismo valor.
ja: 正方形の描画関数をより柔軟にして、さまざまなサイズの長方形を含めてみましょう。 あなたの仕事は、長方形の [code]length[/code] と [code]height[/code] という 2 つのパラメータを取る [code]draw_rectangle()[/code] という名前の関数をコーディングすることです。 [b]長方形を開始または完成するとき、カメは右を向く必要があります。[/b] [code]length[/code] と [code]height[/code] を同じ値にすることで、[code]draw_rectangle()[/code] を使用しても正方形を描画できることに注意してください。
pt_br: Vamos tornar nossa função de desenhar quadrados mais flexível para incluir retângulos de tamanhos variados. Seu trabalho é programar uma função chamada [code]draw_rectangle()[/code] que recebe dois parâmetros: o [code]length[/code] (comprimento) e o [code]height[/code] (altura) do retângulo. [b]A tartaruga deve ficar voltada para a direita ao iniciar ou completar um retângulo.[/b] Observe que ainda podemos desenhar um quadrado com [code]draw_rectangle()[/code] fazendo com que [code]length[/code] e [code]height[/code] sejam iguais.
zh_hans: 让我们来把矩形绘图功能做得更加灵活，能画出各种各样的矩形。 你的任务是编写一个名为 [code]draw_rectangle()[/code] 的函数，它接受两个参数：矩形的 [code]length[/code] 和 [code]height[/code]。 [b]开始或画完一个矩形时，乌龟应该面向右侧。[/b] 要留意我们还是可以用 [code]draw_rectangle()[/code]绘制正方形，给 [code]length[/code] 和 [code]height[/code] 相同的值就行了。
zh_hant: 讓我們繪製正方形的函式更加靈活，並能繪製不同大小的矩形。 你的任務是編寫一個名為 [code]draw_rectangle()[/code] 的函式，該函式需要兩個參數：長方形的 [code]length[/code]（長度）和 [code]height[/code]（高度）。 [b]當開始或完成矩形時，海龜應該朝向右邊。[/b] 請注意，我們仍然可以通過將 [code]length[/code] 和 [code]height[/code] 設置為相同的值來使用 [code]draw_rectangle()[/code] 繪製正方形。

source: Must I write spaces between function parameters?
zh_hans: 我必须在函数参数之间写空格吗？
