Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-5-your-first-function.po
Languages: cs, da, de, es, fr, it, pt, ta, uk, zh_hant

source: In computer programming, we talk about [i]identifiers[/i] rather than "names". It is because a function name is a label the computer uses to precisely [i]identify[/i] and refer to a function or other code elements. Identifiers are unique: you cannot reuse the same name in a given [i]space[/i] in your code. If you try to name two functions the same, the computer will raise an error.
de: In der Computerprogrammierung sprechen wir eher von [i]Bezeichnern[/i] als von "Namen". Dies liegt daran, dass ein Funktionsname eine Bezeichnung ist, die der Computer verwendet, um eine Funktion oder andere Codeelemente genau zu [i]identifizieren[/i] und auf eine Funktion oder andere Codeelemente zu verweisen. Bezeichner sind eindeutig: Sie können denselben Namen nicht in einem bestimmten [i]Bereich[/i] in Deinem Code wiederverwenden. Wenn Du versuchst, zwei Funktionen gleich zu benennen, löst der Computer einen Fehler aus.
fr: En programmation informatique, on parle d'[i]identifiants[/i] plutôt que de « noms ». C'est parce qu'un nom de fonction est une étiquette que l'ordinateur utilise pour précisément [i]identifier[/i] et faire référence à une fonction ou à d'autres éléments du code. Les identifiants sont uniques : vous ne pouvez pas réutiliser le même nom dans un [i]espace[/i] donné de votre code. Si vous essayez de donner le même nom à deux fonctions, l'ordinateur émettra une erreur.
ta: கணினி நிரலாக்கத்தில், "பெயர்கள்" என்பதை விட [i] அடையாளங்காட்டிகள் [/i] பற்றி பேசுகிறோம். ஒரு செயல்பாட்டு பெயர் என்பது கணினி துல்லியமாக [/i] ஐ அடையாளம் காணவும், ஒரு செயல்பாடு அல்லது பிற குறியீடு கூறுகளைக் குறிக்கவும் பயன்படுத்தும் சிட்டை ஆகும். அடையாளங்காட்டிகள் தனித்துவமானது: உங்கள் குறியீட்டில் கொடுக்கப்பட்ட [i] இடத்தில் [/i] அதே பெயரை மீண்டும் பயன்படுத்த முடியாது. இரண்டு செயல்பாடுகளை ஒரே மாதிரியாக பெயரிட முயற்சித்தால், கணினி ஒரு பிழையை எழுப்பும்.
uk: У програмуванні, ми називаємо «назви» [i]ідентифікаторами[/i]. Так заведено, оскільки за назвою комп'ютер однозначно [i]ідентифікує[/i] функції або інші елементи коду. Ідентифікатори унікальні: ви не можете використовувати одну й ту саму назву для різних елементів у одній [i]ділянці[/i] вашого коду. Якщо ви спробуєте назвати дві функції однаково, комп'ютер повідомить про помилку.
zh_hant: 在電腦程式設計中，我們使用[b]識別子(Identifier)[/b]而不是「名稱(name)」。 這是因為函式名稱是電腦用來準確[b]識別[/b]並引用函式或其他程式碼元素的標籤。 識別子是唯一的：在程式碼的特定[b]範圍(space)[/b]內，不能重複使用相同的名稱。 如果你嘗試為兩個函式取相同的名稱，電腦會回報錯誤。

source: If there is any code that you need to run multiple times, you can put it inside a function and give it a name. The instructions inside a function can be any code you want, and they will all run every time you call the function. Here's the example of a [code]move_and_rotate()[/code] function that moves the turtle forward and then turns it 90°.
de: Wenn Du einen Code mehrfach ausführen musst, kannst Du ihn in eine Funktion einfügen und ihr einen Namen geben. Die Anweisungen innerhalb einer Funktion können beliebig sein, sie werden alle bei jedem Aufruf der Funktion ausgeführt. Hier ist das Beispiel einer [code]move_and_rotate()[/code] Funktion, welcher die Schildkröte vorwärts bewegt und sie dann um 90° dreht.
fr: S'il y a du code que vous devez exécuter plusieurs fois, vous pouvez le mettre dans une fonction et lui donner un nom. Les instructions à l'intérieur d'une fonction peuvent être n'importe quel code que vous voulez, et elles seront toutes exécutées chaque fois que vous appelez la fonction. Voici l'exemple d'une fonction [code]move_and_rotate()[/code] qui fait avancer la tortue puis la fait tourner de 90°.
ta: நீங்கள் பல முறை இயக்க வேண்டிய குறியீடு ஏதேனும் இருந்தால், நீங்கள் அதை ஒரு செயல்பாட்டிற்குள் வைத்து அதற்கு ஒரு பெயரைக் கொடுக்கலாம். ஒரு செயல்பாட்டிற்குள் உள்ள வழிமுறைகள் நீங்கள் விரும்பும் எந்த குறியீடாகவும் இருக்கலாம், மேலும் நீங்கள் செயல்பாட்டை அழைக்கும் ஒவ்வொரு முறையும் அவை அனைத்தும் இயங்கும். ஆமை முன்னோக்கி நகர்த்தி பின்னர் அதை 90 by திருப்பும் [குறியீடு] MOVE_AND_ROTATE () [/குறியீடு] செயல்பாட்டின் எடுத்துக்காட்டு இங்கே.
uk: Якщо вам потрібно якийсь код виконати кілька разів, ви можете помістити його у функцію та дати їй назву. Функція може містити будь-які вказівки у вигляді коду, всі вони будуть виконані при кожному виклику функції. Наприклад, функція [code]move_and_rotate()[/code] під час виклику перемістить черепашку вперед і поверне її на 90°.
zh_hant: 如果有任何需要重複執行的程式碼，你可以將它放入函式內，並為其命名。 函式內的指令可以是任何你需要的程式碼，且每次呼叫該函式時，所有指令都會依序執行。 以下是範例，函式 [code]move_and_rotate()[/code] 會讓烏龜向前移動，然後將其旋轉 90°。

source: The [code]move_and_rotate()[/code] function consists of two instructions, each on a separate line. Both of those instructions call another familiar function. You could write another function that calls [code]move_and_rotate()[/code] four times to draw a square of length 200 pixels.
de: Die Funktion [code]move_and_rotate()[/code] besteht aus zwei Anweisungen, die sich jeweils in einer separaten Zeile befinden. Beide Anweisungen rufen eine andere vertraute Funktion auf. Du kannst eine andere Funktion schreiben, die [code]move_and_rotate()[/code] viermal aufruft, um ein Quadrat mit einer Länge von 200 Pixeln zu zeichnen.
fr: La fonction [code]move_and_rotate()[/code] se compose de deux instructions, chacune sur une ligne distincte. Ces deux instructions appellent une autre fonction que nous connaissons déjà. Vous pouvez écrire une autre fonction qui appelle [code]move_and_rotate()[/code] quatre fois pour dessiner un carré de 200 pixels de long.
ta: [குறியீடு] MOVE_AND_ROTATE () [/குறியீடு] செயல்பாடு இரண்டு வழிமுறைகளைக் கொண்டுள்ளது, ஒவ்வொன்றும் ஒரு தனி வரியில். அந்த இரண்டு அறிவுறுத்தல்களும் மற்றொரு பழக்கமான செயல்பாட்டை அழைக்கின்றன. [குறியீடு] MOVE_AND_ROTATE () [/code] ஐ நான்கு முறை அழைக்கும் மற்றொரு செயல்பாட்டை நீங்கள் எழுதலாம்.
uk: Функція [code]move_and_rotate()[/code] складається з двох інструкцій, кожна з яких розташована в окремому рядку. Обидві інструкції викликають інші знайомі вам функції. Ви можете написати іншу функцію, яка викликає [code]move_and_rotate()[/code] чотири рази, щоб намалювати квадрат з довжиною сторони 200 пікселів.
zh_hant: 函式 [code]move_and_rotate()[/code] 由兩條指令組成，每條指令各佔一行，且都呼叫了另一個你熟悉的函式。 你可以再撰寫一個函式，讓它重複呼叫 [code]move_and_rotate()[/code] 四次，以繪製一個邊長為 200 像素的正方形。

source: Every time we call [code]move_and_rotate()[/code], the two functions [code]move_forward(200)[/code] and [code]turn_right(90)[/code] are called in sequence. In this simple example, it may not feel super useful. Here's a more useful and realistic one: a function to draw any square. The following function uses [i]parameters[/i], which we will explore in the next lesson. [i]Drag the slider to change the square's size.[/i]
de: Jedes Mal, wenn wir [code]move_and_rotate()[/code] aufrufen, werden nacheinander die beiden Funktionen [code]move_forward(200)[/code] und [code]turn_right(90)[/code] aufgerufen. In diesem einfachen Beispiel mag das nicht besonders nützlich sein. Hier ist ein nützlicheres und realistischeres Beispiel: eine Funktion zum Zeichnen eines beliebigen Quadrats. Die folgende Funktion verwendet die Parameter [i][/i] , die wir in der nächsten Lektion untersuchen werden. [i]Zieh den Schieberegler, um die Größe des Quadrats zu ändern.[/i]
fr: Chaque fois que nous appelons [code]move_and_rotate()[/code], les deux fonctions [code]move_forward(200)[/code] et [code]turn_right(90)[/code] sont appelées en séquence. Dans cet exemple simple, cela peut ne pas sembler super utile. En voici un plus utile et réaliste : une fonction pour dessiner n'importe quel rectangle. La fonction suivante utilise des [i]paramètres[/i], que nous allons explorer dans la prochaine leçon. [i]Faites glisser le curseur pour modifier la taille du carré.[/i]
ta: ஒவ்வொரு முறையும் நாம் [குறியீடு] MOVE_AND_ROTATE () [/code] ஐ அழைக்கும்போது, இரண்டு செயல்பாடுகள் [குறியீடு] MOVE_FORWARD (200) [/குறியீடு] மற்றும் [குறியீடு] டர்ன்_ரைட் (90) [/குறியீடு] வரிசையில் அழைக்கப்படுகின்றன. இந்த எளிய எடுத்துக்காட்டில், இது மிகவும் பயனுள்ளதாக இருக்காது. இங்கே மிகவும் பயனுள்ள மற்றும் யதார்த்தமான ஒன்று: எந்த சதுரத்தையும் வரைய ஒரு செயல்பாடு. பின்வரும் செயல்பாடு [i] அளவுருக்களைப் பயன்படுத்துகிறது [/i], அடுத்த பாடத்தில் நாங்கள் ஆராய்வோம். [i] சதுரத்தின் அளவை மாற்ற ச்லைடரை இழுக்கவும். [/i]
uk: Кожного разу, коли ми викликаємо [code]move_and_rotate()[/code], послідовно викликаються дві функції [code]move_forward(200)[/code] і [code]turn_right(90)[/code]. З цього простого прикладу може здатися, що це не дуже корисно. Ось корисніший і реалістичніший приклад: функція, яка малює будь-який квадрат. Ця функція використовує [i]параметри[/i], які ми вивчимо в наступному уроці. [i]Використовуйте повзунок, щоб змінити розмір квадрата.[/i]
zh_hant: 每次呼叫 [code]move_and_rotate()[/code] 時，程式會依序執行 [code]move_forward(200)[/code] 和 [code]turn_right(90)[/code] 這兩個函式。 在這個簡單的範例中，這或許看起來沒那麼實用。但接下來，我們會看到一個更有用、更實際的應用：一個能夠繪製任意大小正方形的函式。 以下的函式使用了[b]參數(parameter)[/b]，我們會在下一節課進一步探討。 [b]拖曳滑桿來改變正方形的大小。[/b]

source: Let's break down how you define a function. A function definition starts with the [code]func[/code] keyword followed by a space, the function's name, parentheses, and a colon.
de: Lass uns aufschlüsseln, wie Du eine Funktion definierst. Eine Funktionsdefinition beginnt mit dem Schlüsselwort [code]func[/code], gefolgt von einem Leerzeichen, dem Namen der Funktion, Klammern und einem Doppelpunkt.
fr: Voyons comment définir une fonction. Une définition de fonction commence par le mot-clé [code]func[/code] suivi d'un espace, du nom de la fonction, de parenthèses et de deux points.
ta: ஒரு செயல்பாட்டை நீங்கள் எவ்வாறு வரையறுக்கிறீர்கள் என்பதை உடைப்போம். ஒரு செயல்பாட்டு வரையறை [குறியீடு] FUNC [/code] முக்கிய சொல்லுடன் தொடங்குகிறது, அதைத் தொடர்ந்து ஒரு இடம், செயல்பாட்டின் பெயர், அடைப்புக்குறிப்புகள் மற்றும் ஒரு பெருங்குடல்.
uk: Розберімо, як оголосити функцію. Оголошення функції починається з ключового слова [code]func[/code], пропуску після нього, назви функції, круглих дужок і двокрапки.
zh_hant: 讓我們來解析如何定義一個函式。 函式定義以 [code]func[/code] 關鍵字開頭，後面接一個空格、函式名稱、一對括號、最後以冒號結尾。

source: The instructions inside the function [b]must[/b] all start with a leading tab character. You can insert that tab character by pressing the [b]Tab[/b] key. We call those leading tabs [i]indents[/i]. They're important: the computer uses them to know which instructions are part of the same code block.
de: Die Anweisungen innerhalb der Funktion [b]müssen[/b] alle mit einem führenden Tabulatorzeichen beginnen. Du kannst dieses Tabulatorzeichen einfügen, indem Du die [b]Tab[/b]-Taste drückst. Wir nennen diese führenden Tabulatoren [i]Einrückungen[/i]. Sie sind wichtig: Der Computer verwendet sie, um zu wissen, welche Anweisungen Teil desselben Codeblocks sind.
fr: Les instructions à l'intérieur de la fonction [b]doivent[/b] toutes commencer par un caractère de tabulation. Vous pouvez insérer ce caractère de tabulation en appuyant sur la touche [b]Tab[/b]. Nous appelons ces tabulations initiales [i]indentations[/i]. Elles sont importantes : l'ordinateur les utilise pour savoir quelles instructions font partie du même bloc de code.
ta: [B] செயல்பாட்டிற்குள் உள்ள வழிமுறைகள் [/b] அனைத்தும் ஒரு முன்னணி தாவல் எழுத்துடன் தொடங்க வேண்டும். [B] தாவல் [/b] விசையை அழுத்துவதன் மூலம் அந்த தாவல் எழுத்தை நீங்கள் செருகலாம். அந்த முன்னணி தாவல்களை [i] உள்தள்ளல்கள் [/i] என்று அழைக்கிறோம். அவை முக்கியமானவை: எந்த வழிமுறைகள் ஒரே குறியீடு தொகுதியின் ஒரு பகுதி என்பதை அறிய கணினி அவற்றைப் பயன்படுத்துகிறது.
uk: Всі інструкції всередині функції [b]мусять[/b] починатися з символу табуляції. Його можна вставити за допомогою кнопки [b]Tab[/b] на клавіатурі. Символи табуляції на початку рядка ще називають [i]відступами[/i]. Відступи важливі: комп'ютер використовує їх, щоб дізнатися, які інструкції є частиною одного і того ж блоку коду.
zh_hant: 函式內的所有指令 [b]必須[/b] 以前導的 Tab 字元開始。你可以按下 [b]Tab[/b] 鍵來插入這個字元。 我們稱這些前導 Tab 為[b]縮排(indents)[/b]。它們非常重要，因為電腦會依靠縮排來判斷哪些指令屬於同一個程式區塊。

source: Functions are groups of instructions we reuse every time we call the function. Because we give functions a name, they also allow us to name a set of instructions, which is handy!
de: Funktionen sind gruppierte Anweisungen, die wir jedes Mal wiederverwenden, wenn wir die Funktion aufrufen. Da wir Funktionen einen Namen geben, erlauben sie uns auch, eine Reihe von Anweisungen zu benennen, was praktisch ist!
fr: Les fonctions sont des groupes d'instructions que nous réutilisons chaque fois que nous appelons la fonction. Parce que nous donnons un nom aux fonctions, elles nous permettent aussi de nommer un ensemble d'instructions, ce qui est pratique !
ta: செயல்பாடுகள் ஒவ்வொரு முறையும் செயல்பாட்டை அழைக்கும் ஒவ்வொரு முறையும் நாம் மீண்டும் பயன்படுத்தும் வழிமுறைகளின் குழுக்கள். நாங்கள் செயல்பாடுகளுக்கு ஒரு பெயரைக் கொடுப்பதால், அவை ஒரு அறிவுறுத்தல்களின் பெயரையும் பெயரிட அனுமதிக்கின்றன, இது எளிது!
uk: Функції – це групи інструкцій, які ми використовуємо повторно щоразу, коли викликаємо функцію. Оскільки ми даємо функціям назви, вони дають нам змогу об'єднати багато інструкцій, що дуже зручно!
zh_hant: 函式是一組指令的集合，每次呼叫函式時都可以重複使用。 由於我們會為函式命名，因此它也能讓我們為一組指令取一個方便辨識的名稱，這非常實用！

source: Function identifiers cannot contain spaces. In general, names in programming languages cannot contain spaces. The computer uses spaces to detect the separation between different keywords and identifiers. Instead of spaces, in GDScript, we use underscores ("_"). You saw this already with functions like [code]move_forward()[/code] or [code]move_local_x()[/code]. This is the convention we follow in GDScript. There's another convention programmers use in some other programming languages. Instead of using underscores, they start words with capital letters except for the first one. With that convention, you'd write function names like [code]moveForward()[/code] or [code]moveLocalX()[/code] Identifiers also [i]have[/i] to start with a letter or an underscore; You [i]can't[/i] begin with a number, but you can use numbers after the first character.
de: Funktionsbezeichner dürfen keine Leerzeichen enthalten. Im Allgemeinen dürfen Namen in Programmiersprachen keine Leerzeichen enthalten. Der Computer verwendet Leerzeichen, um die Trennung zwischen verschiedenen Schlüsselwörtern und Bezeichnern zu erkennen. Anstelle von Leerzeichen verwenden wir in GDScript Unterstriche ("_"). Du hast dies bereits bei Funktionen wie [code]move_forward()[/code] oder [code]move_local_x()[/code] gesehen. Dies ist die Konvention, der wir in GDScript folgen. Es gibt eine andere Konvention, die Programmierer in einigen anderen Programmiersprachen verwenden. Anstatt Unterstriche zu verwenden, beginnen sie Wörter mit Großbuchstaben mit Ausnahme des ersten. Mit dieser Konvention würdest Du Funktionsnamen wie [code]moveForward()[/code] oder [code]moveLocalX()[/code] schreiben. Bezeichner [i]müssen[/i] mit einem Buchstaben oder einem Unterstrich beginnen; Du [i]kannst nicht[/i] mit einer Zahl beginnen, aber Du kannst Zahlen nach dem ersten Zeichen verwenden.
fr: Les identifiants de fonction ne peuvent pas contenir d'espaces. En général, les noms dans les langages de programmation ne peuvent pas contenir d'espaces. L'ordinateur utilise les espaces pour détecter la séparation entre les différents mots-clés et identifiants. Au lieu d'espaces, dans GDScript, nous utilisons des tirets bas ("_"). Vous l'avez déjà vu avec des fonctions comme [code]move_forward()[/code] ou [code]move_local_x()[/code]. C'est la convention que nous suivons dans GDScript. Il existe une autre convention que les programmeurs utilisent dans d'autres langages de programmation. Au lieu d'utiliser des tirets bas, on commence les mots par des lettres majuscules, sauf pour le premier. Avec cette convention, vous écririez des noms de fonctions comme [code]moveForward()[/code] ou [code]moveLocalX()[/code] Les identifiants [i]doivent[/i] également commencer par une lettre ou un tiret bas ; vous [i]ne pouvez pas[/i] commencer par un nombre, mais vous pouvez utiliser des nombres après le premier caractère.
ta: செயல்பாட்டு அடையாளங்காட்டிகள் இடைவெளிகளைக் கொண்டிருக்க முடியாது. பொதுவாக, நிரலாக்க மொழிகளில் உள்ள பெயர்கள் இடைவெளிகளைக் கொண்டிருக்க முடியாது. வெவ்வேறு சொற்களுக்கும் அடையாளங்காட்டிகளுக்கும் இடையில் பிரிப்பதைக் கண்டறிய கணினி இடைவெளிகளைப் பயன்படுத்துகிறது. இடைவெளிகளுக்கு பதிலாக, GDSCRIPT இல், நாங்கள் அடிக்கோடிட்டு ("_") பயன்படுத்துகிறோம். [குறியீடு] MOVE_FORWARD () [/code] அல்லது [குறியீடு] MOVE_LOCAL_X () [/code] போன்ற செயல்பாடுகளுடன் இதை நீங்கள் ஏற்கனவே பார்த்தீர்கள். GDSCRIPT இல் நாம் பின்பற்றும் மாநாடு இதுதான். வேறு சில நிரலாக்க மொழிகளில் புரோகிராமர்கள் பயன்படுத்தும் மற்றொரு மாநாடு உள்ளது. அடிக்கோடிட்டுக் காட்டுவதற்குப் பதிலாக, அவை முதல் ஒன்றைத் தவிர பெரிய எழுத்துக்களுடன் சொற்களைத் தொடங்குகின்றன. அந்த மாநாட்டின் மூலம், நீங்கள் [குறியீடு] நகர்வு () [/குறியீடு] அல்லது [குறியீடு] மூவெலோகல்க்ச் () [/குறியீடு] போன்ற செயல்பாட்டு பெயர்களை எழுதுவீர்கள் அடையாளங்காட்டிகளும் [i] ஒரு கடிதம் அல்லது அடிக்கோடிட்டுக் கொண்டு தொடங்க [/i]; நீங்கள் [என்னால்] முடியாது [/i] ஒரு எண்ணுடன் தொடங்க முடியாது, ஆனால் முதல் எழுத்துக்குப் பிறகு நீங்கள் எண்களைப் பயன்படுத்தலாம்.
uk: Ідентифікатори функцій не можуть містити пропусків. Загалом, назви в мовах програмування не можуть містити пропусків. Комп'ютер використовує пропуски для розпізнавання проміжків між різними ключовими словами та ідентифікаторами. Замість пропусків у GDScript ми використовуємо нижнє підкреслення («_»). Ви вже бачили його в назвах функцій [code]move_forward()[/code] і [code]move_local_x()[/code]. Цієї угоди ми дотримуємося в GDScript. Існують й інші угоди, яких дотримуються програмісти в інших мовах програмування. Замість використання нижнього підкреслення в них усі слова в ідентифікаторах, крім першого, починаються з великих букв. Якби ми дотримувалися цієї угоди, то назви функцій виглядали б так: [code]moveForward()[/code] або [code]moveLocalX()[/code] Ідентифікатори також [i]мають[/i] починатися з букви або нижнього підкреслення; [i]не можна[/i] починати ідентифікатор цифрою, але цифри можна використовувати після першого символу.
zh_hant: 函式識別符不能包含空格。在程式語言中，名稱通常不能包含空格。 電腦使用空格來檢測不同關鍵字和識別符之間的分隔。 在 GDScript 中，我們使用底線（"_"）來代替空格。你已經看過像是 [code]move_forward()[/code] 或 [code]move_local_x()[/code] 這樣的函式名稱，這是 GDScript 中的命名慣例。 在其他一些程式語言中，程式設計師也有另一種命名慣例。 這種慣例會使用大寫字母來開頭每個單詞，除了第一個字。這樣的命名方式會寫成 [code]moveForward()[/code] 或 [code]moveLocalX()[/code]。 此外，識別符[b]必須[/b]以字母或底線開始；你[b]不能[/b]用數字開頭，但可以在第一個字符後使用數字。

source: You can't name a function [code]move forward[/code] because it contains a space. Names in code cannot contain spaces. They can't start with numbers either, which is why [code]45_degree_turn[/code] is also invalid. However, having numbers elsewhere in a function name is fine. That's why [code]make3NewCharacters[/code] works.
de: Du kannst eine Funktion nicht [code]move forward[/code] nennen, da sie ein Leerzeichen enthält. Namen im Code dürfen keine Leerzeichen enthalten. Du kannst auch nicht mit Zahlen beginnen, weshalb [code]45_degree_turn[/code] auch ungültig ist. Es ist jedoch in Ordnung, Zahlen an anderer Stelle in einem Funktionsnamen zu haben. Deshalb funktioniert [code]make3NewCharacters[/code].
fr: Vous ne pouvez pas nommer une fonction [code]move forward[/code] parce que ce nom contient un espace. Les noms dans le code ne peuvent pas contenir d'espaces. Ils ne peuvent pas non plus commencer par des nombres, c'est pourquoi [code]45_degree_turn[/code] n'est pas non plus valide Cependant, il est possible d'avoir des nombres ailleurs dans le nom d'une fonction. C'est pourquoi [code]make3NewCharacters[/code] fonctionne.
ta: ஒரு செயல்பாட்டை நீங்கள் பெயரிட முடியாது [குறியீடு] முன்னேறவும் [/குறியீடு] ஏனெனில் அதில் ஒரு இடம் உள்ளது. குறியீட்டில் உள்ள பெயர்களில் இடைவெளிகளைக் கொண்டிருக்க முடியாது. அவர்களால் எண்களுடன் தொடங்க முடியாது, அதனால்தான் [குறியீடு] 45_degree_turn [/code] கூட தவறானது. இருப்பினும், ஒரு செயல்பாட்டு பெயரில் வேறு எங்கும் எண்களைக் கொண்டிருப்பது நல்லது. அதனால்தான் [குறியீடு] Make3Newcharacters [/code] வேலை செய்கிறது.
uk: Ви не можете назвати функцію [code]move forward[/code], тому що в цій назві є пропуск. Назви в коді не можуть містити пропусків. Також вони не можуть починатися цифрою, тому назва [code]45_degree_turn[/code] – неправильна. Однак, в іншому місці назви функції цифри використати можна. Тому [code]make3NewCharacters[/code] – це допустима назва.
zh_hant: 你不能將函式命名為 [code]move forward[/code]，因為它包含了空格。程式碼中的名稱不能包含空格。 它們也不能以數字開頭，這就是為什麼 [code]45_degree_turn[/code] 也是無效的。 然而，函式名稱中的其他地方可以包含數字。所以 [code]make3NewCharacters[/code] 是有效的。

source: move forward
ta: முன்னேறவும்

source: jump
ta: தாவு

source: make3NewCharacters
de: make3NeuCharaktäre
ta: make3newharacters

source: In order to draw multiple squares in different positions, we introduce a new function for our turtle to use. The [code]jump()[/code] function picks up the turtle and places it relative to where it is. So calling [code]jump(-100, 50)[/code] moves the turtle by 100 pixels to the [b]left[/b] and 50 pixels [b]down[/b] without drawing any lines.
de: Um mehrere Quadrate in verschiedenen Positionen zu zeichnen, führen wir eine neue Funktion für unsere Schildkröte ein. Die Funktion [code]jump()[/code] nimmt die Schildkröte auf und platziert sie relativ zu dem Ort, an dem sie sich befindet. Der Aufruf von [code]jump(-100, 50)[/code] bewegt die Schildkröte also um 100 Pixel nach [b]links[/b] und 50 Pixel nach [b]unten[/b], ohne Linien zu zeichnen.
fr: Afin de dessiner plusieurs carrés dans des positions différentes, nous introduisons une nouvelle fonction à utiliser par notre tortue. La fonction [code]jump()[/code] prend la tortue et la place dans une position relative à l'endroit où elle se trouve. Ainsi, en appelant [code]jump(-100, 50)[/code], la tortue se déplace de 100 pixels vers [b]la gauche[/b] et de 50 pixels vers [b]le bas[/b] sans dessiner de lignes.
ta: வெவ்வேறு நிலைகளில் பல சதுரங்களை வரைய, எங்கள் ஆமை பயன்படுத்த ஒரு புதிய செயல்பாட்டை அறிமுகப்படுத்துகிறோம். [குறியீடு] சம்ப் () [/குறியீடு] செயல்பாடு ஆமை எடுத்து, அது இருக்கும் இடத்துடன் ஒப்பிடுகிறது. எனவே [குறியீடு] சம்ப் (-100, 50) [/குறியீடு] ஆமை 100 படப்புள்ளிகள் [/b] மற்றும் 50 படப்புள்ளிகள் [b] கீழே [/b] க்கு நகர்த்துகிறது.
uk: Для того, щоб намалювати кілька квадратів у різних місцях, створимо нову функцію для керування нашою черепашкою. Функція [code]jump()[/code] піднімає черепашку і ставить її кудись відносно місця, де вона перебуває зараз. Виклик [code]jump(-100, 50)[/code] переміщує черепашку на 100 пікселів [b]ліворуч[/b] і 50 пікселів [b]униз[/b] без малювання нових ліній.
zh_hant: 為了在不同位置繪製多個正方形，我們引入了一個新的函式供我們的海龜使用。 [code]jump()[/code] 函式會把海龜彈起來，並將它移動到相對於當前位置的指定位置。 因此呼叫 [code]jump(-100, 50)[/code] 會將海龜移動 100 像素到 [b]左邊[/b] 並且 50 像素 [b]向下[/b]，而且不會畫出任何線條。
