Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-5-your-first-function.po
Languages: cs, da, de, es, fr, it, pt, ta, uk, zh_hant

source: So far, we have called existing functions that other developers wrote.
cs: Dosud jsme volali existující funkce, které napsali jiní vývojáři.
da: Indtil videre har vi kaldt eksisterende funktioner, som andre udviklere har skrevet.
es: Hasta ahora, hemos llamado a funciones existentes que escribieron otros desarrolladores.
it: Fino ad ora, ci siamo limitati a chiamare funzioni già esistenti scritte da altri programmatori.
pt: Até agora, só chamamos funções existentes que outros programadores escreveram.

source: In this lesson, we'll talk more about what functions are and see some examples. Then, you will learn how to define your own functions.
cs: V této lekci si povíme více o tom, co jsou funkce, a podíváme se na několik příkladů. Poté se naučíte, jak definovat své vlastní funkce.
da: I denne lektion vil vi snakke mere om, hvad funktioner er og se nogle eksempler. Og så vil du lære at definere dine egne funktioner.
es: En esta lección, hablaremos más sobre qué son las funciones y veremos algunos ejemplos. Luego, aprenderás a definir tus propias funciones.
it: In questa lezione, parleremo meglio di cosa sono le funzioni e vedremo alcuni esempi. In seguito, imparerai a definire delle funzioni tutte tue.
pt: Nessa lição, vamos falar mais sobre o que são funções e ver mais exemplos. Logo depois vai aprender como definir as suas próprias funções.

source: Functions are named sequences of instructions
cs: Funkce jsou pojmenované sekvence instrukcí
da: Funktioner er navngivet sekvenser af instruktioner
de: Funktionen sind benannte Sequenzen von Anweisungen
es: Las funciones son secuencias de instrucciones con nombre
fr: Les fonctions sont des séquences d'instructions avec un nom
it: Le funzioni sono una sequenza di istruzioni con un nome
pt: Funções são sequencias de instruções que possuem um nome
ta: செயல்பாடுகள் அறிவுறுத்தல்களின் வரிசைகளுக்கு பெயரிடப்பட்டுள்ளன
uk: Функції — це іменовані послідовності інструкцій
zh_hant: 函式是指令序列

source: Functions are [i]sequences of instructions[/i] we give a name. We call that name an [i]identifier[/i].
cs: Funkce jsou [i]posloupnosti instrukcí[/i], které pojmenujeme. Tomuto jménu říkáme [i]identifikátor[/i].
da: Funktioner er [i]sekvenser af instruktioner[/i] vi giver et navn. Vi kalder dette navn [i]identifikator[/i].
es: Las funciones son [i]secuencias de instrucciones[/i] a las que damos un nombre. Llamamos a ese nombre un [i]identificador[/i].
it: Le funzioni sono [i]sequenze di istruzioni[/i] a cui diamo un nome. Questo nome è un [i]identificatore[/i].
pt: Funções são [i]sequencia de instruções[/i] que damos um nome. Chamamos esse nome de [i]identificador[/i].

source: Using the identifier, we can get the computer to execute all the instructions inside the function as many times as we need. This is what a [i]function call[/i] does.
cs: Pomocí identifikátoru můžeme přimět počítač, aby provedl všechny instrukce uvnitř funkce tolikrát, kolikrát potřebujeme. K tomu slouží [i]volání funkce[/i].
da: Ved hjælp af identifikatoren kan vi få computeren til at udføre alle instruktionerne inde i funktionen så mange gange som vi har brug for. Dette er, hvad et [i]funktions kald[/i] gør.
es: Usando el identificador, podemos hacer que la computadora ejecute todas las instrucciones dentro de la función tantas veces como necesitemos. Esto es lo que hace una [i]llamada a una función[/i].
it: Usando un identificatore, possiamo far eseguire al computer tutte le istruzioni all'interno di una funzione, tutte le volte che vogliamo. Questo è ciò che fa una [i]chiamata di funzione[/i].
pt: Usando o identificador, fazemos com que o computador execute todas as instruções naquela função, quantas vezes a gente quiser. É isso que uma [i]chamada de função[/i] faz.

source: Learn more about identifiers
cs: Více informací o identifikátorech
da: Lær mere om identifikatorer
de: Erfahre mehr über Bezeichner
es: Más sobre identificadores
fr: En savoir plus sur les identifiants
it: Per saperne di più sugli identificatori
ta: அடையாளங்காட்டிகளைப் பற்றி மேலும் அறிக
uk: Докладніше про ідентифікатори
zh_hant: 深入了解識別子(Identifiers)

source: In computer programming, we talk about [i]identifiers[/i] rather than "names".
cs: V počítačovém programování se spíše než o "jménech" hovoří o [i]identifikátorech[/i].
da: I computerprogrammering taler vi om [i]identifikatorer[/i] snarere end "navne".
es: En programación informática, hablamos de [i]identificadores[/i] en lugar de "nombres".
it: Nella programmazione, non parliamo di "nomi", ma di [i]identificatori[/i].
pt: Na área de programação de computadores, chamamos como [i]identificadores[/i] ao invés de "nomes".

source: It is because a function name is a label the computer uses to precisely [i]identify[/i] and refer to a function or other code elements.
cs: Je to proto, že jméno funkce je označení, které počítač používá k přesné [i]identifikaci[/i] a odkazu na funkci nebo jiný prvek kódu.
da: Det skyldes, at et funktionsnavn er en etiket, som computeren bruger til præcist at [i]identificere[/i] og henvise til en funktion eller andre kodeelementer.
es: Esto se debe a que el nombre de una función es una etiqueta que la computadora utiliza para [i]identificar[/i] con precisión y referirse a una función o a otros elementos del código.
it: Questo perché il nome di una funzione è l'etichetta usata dal computer per [i]identificare[/i] e avere un riferimento relativo a una funzione o ad altre parti di codice.
pt: É porque um nome da função é um rótulo que o computador usa para [i]identificar[/i] precisamente e se referir a uma função ou outros elementos do código.

source: Identifiers are unique: you cannot reuse the same name in a given [i]space[/i] in your code.
cs: Identifikátory jsou jedinečné: v daném [i]místě[/i] kódu nelze opakovaně použít stejný název.
da: Identifikatorer er unikke: du kan ikke genbruge det samme navn i et givet [i]område[/i] i din kode.
es: Los identificadores son únicos: no puedes reutilizar el mismo nombre en un [i]espacio[/i] determinado de tu código.
it: Gli identificatori sono unici: non puoi riutilizzare lo stesso nome in una determinata [i]area[/i] del tuo codice.
pt: Identificadores são únicos: não pode reusar o mesmo nome num determinado [i]lugar[/i] do seu código.

source: If you try to name two functions the same, the computer will raise an error.
cs: Pokud se pokusíte pojmenovat dvě funkce stejně, počítač vyhodí chybu.
da: Hvis du forsøger at navngive to funktioner ens, vil computeren give en fejl.
es: Si intentas darle el mismo nombre a dos funciones, la computadora emitirá un error.
it: Se provi a dare a due funzioni lo stesso nome, il computer ti restituirà un errore.
pt: Se tentar usar o mesmo nome em duas funções diferentes, o computador vai gerar um erro.

source: If there is any code that you need to run multiple times, you can put it inside a function and give it a name.
cs: Pokud existuje kód, který potřebujete spustit vícekrát, můžete jej vložit do funkce a pojmenovat ji.
da: Hvis der er kode, du skal køre flere gange, kan du placere den i en funktion og give den et navn.
es: Si hay algún código que necesites ejecutar varias veces, puedes ponerlo dentro de una función y darle un nombre.
it: Se c'è del codice che hai bisogno di eseguire più volte, puoi metterlo in una funzione e dargli un nome.
pt: Se tiver qualquer código que precisa executar várias vezes, pode pôr esse código dentro de uma função e lhe dar um nome.

source: The instructions inside a function can be any code you want, and they will all run every time you call the function.
cs: Instrukce uvnitř funkce mohou obsahovat libovolný kódem a všechny se spustí při každém volání funkce.
da: Instruktionerne i en funktion kan være enhver kode, du ønsker, og de vil alle køre hver gang du kalder funktionen.
es: Las instrucciones dentro de una función pueden ser cualquier código que quieras, y todas se ejecutarán cada vez que llames a la función.
it: Le istruzioni in una funzione possono essere qualsiasi cosa tu voglia, e verranno eseguite ogni volta che chiami la funzione.
pt: As instruções dentro da função podem ser qualquer código que quiser e elas (as instruções) vão ser executadas toda vez que chamar aquela função.

source: Here's the example of a [code]move_and_rotate()[/code] function that moves the turtle forward and then turns it 90°.
cs: Zde je příklad funkce [code]move_and_rotate()[/code], která posune želvu dopředu a pak ji otočí o 90°.
da: Her er et eksempel på en [code]move_and_rotate()[/code]-funktion, der bevæger skildpadden fremad og derefter drejer den 90°.
es: Este es el ejemplo de una función [code]move_and_rotate()[/code] que mueve la tortuga hacia delante y luego la gira 90º.
it: Ecco l'esempio di una funzione [code]move_and_rotate()[/code] che sposta la tartaruga in avanti e la ruota di 90°.
pt: Aqui tem um exemplo de uma função chamada [code]move_and_rotate()[/code] que move a tartaruga para frente e depois rotaciona ela em 90°.

source: The [code]move_and_rotate()[/code] function consists of two instructions, each on a separate line. Both of those instructions call another familiar function.
cs: Funkce [code]move_and_rotate()[/code] se skládá ze dvou instrukcí, z nichž každá je na samostatném řádku. Obě tyto instrukce volají jinou známou funkci.
da: Funktionen [code]move_and_rotate()[/code] består af to instruktioner, der hver er på en separat linje. Begge disse instruktioner kalder en anden velkendt funktion.
es: La función [code]move_and_rotate()[/code] consta de dos instrucciones, cada una en una línea distinta. Cada una de estas instrucciones llama a otra función que ya conocemos.
it: La funzione [code]move_and_rotate()[/code] consiste in due istruzioni, ognuna su una riga diversa. Entrambe le istruzioni chiamano altre funzioni piuttosto familiari.
pt: A função [code]move_and_rotate()[/code] consiste em duas instruções, cada uma numa linha separada. Ambas as instruções chama outra função bem familiar.

source: You could write another function that calls [code]move_and_rotate()[/code] four times to draw a square of length 200 pixels.
cs: Můžete napsat jinou funkci, která volá [code]move_and_rotate()[/code] čtyřikrát a nakreslí čtverec o délce 200 pixelů.
da: Du kan skrive en anden funktion, der kalder [code]move_and_rotate()[/code] fire gange for at tegne et kvadrat med en længde på 200 pixels.
es: Podrías escribir otra función que llame a [code]move_and_rotate()[/code] cuatro veces para dibujar un cuadrado de 200 pixeles de largo.
it: Potresti scrivere un'altra funzione che chiama [code]move_and_rotate()[/code] quattro volte per disegnare un quadrato dai lati di 200 pixel.
pt: Pode escrever outra função que faz a chamada da função [code]move_and_rotate()[/code] mais quatro vezes para desenhar um quadrado com o tamanho de 200 pixels.

source: Every time we call [code]move_and_rotate()[/code], the two functions [code]move_forward(200)[/code] and [code]turn_right(90)[/code] are called in sequence.
da: Hver gang vi kalder [code]move_and_rotate()[/code], kaldes de to funktioner [code]move_forward(200)[/code] og [code]turn_right(90)[/code] i rækkefølge.
es: Cada vez que llamamos a [code]move_and_rotate()[/code], las dos funciones [code]move_forward(200)[/code] y [code]turn_right(90)[/code] se llaman en secuencia.
it: Ogni volta che si chiama [code]move_and_rotate()[/code], vengono richiamate in sequenza le due funzioni [code]move_forward(200)[/code] e [code]turn_right(90)[/code].
pt: Todas as vezes que chamamos [code]move_and_rotate()[/code], as duas funções [code]move_forward(200)[/code] e [code]turn_right(90)[/code] são chamadas logo em sequencia.

source: In this simple example, it may not feel super useful. Here's a more useful and realistic one: a function to draw any square.
cs: V tomto jednoduchém příkladu se to nemusí zdát super užitečné. Zde je užitečnější a reálnější příklad: funkce pro vykreslení libovolného obdélníku.
da: I dette simple eksempel føles det måske ikke super nyttigt. Her er et mere nyttigt og realistisk eksempel: en funktion til at tegne et hvilket som helst kvadrat.
es: En este ejemplo tan simple, puede que no parezca súper útil. Aquí tienes un ejemplo más útil y realista: una función para dibujar cualquier rectángulo.
it: In questo semplice esempio, potrebbe non essere molto utile. Eccone uno più utile e realistico: una funzione per disegnare un quadrato qualsiasi.

source: The following function uses [i]parameters[/i], which we will explore in the next lesson.
cs: Následující funkce používá [i]parametry[/i], které prozkoumáme v příští lekci.
da: Følgende funktion bruger [i]parametre[/i], som vi vil udforske i den næste lektion.
es: La siguiente función utiliza [i]parámetros[/i], que exploraremos en la próxima lección.
it: La funzione seguente utilizza [i]parametri[/i], che esploreremo nella prossima lezione.
pt: Essa próxima função usa [i]parâmetros[/i], que vamos explorar na próxima lição.

source: [i]Drag the slider to change the square's size.[/i]
cs: [i]Potažením posuvníku změníte velikost čtverce'[/i].
da: [i]Træk skyderen for at ændre kvadratets størrelse.[/i]
es: [i]Arrastra el deslizador para cambiar el tamaño del cuadrado[/i]
it: [i]Trascinare il cursore per modificare le dimensioni del quadrato[/i].
pt: [i]Arraste o slider para alterar o tamanho do quadrado.[/i]

source: How to define your own functions
cs: Jak definovat vlastní funkce
da: Sådan definerer du dine egne funktioner
de: So definierest Du eigene Funktionen
es: Cómo definir tus propias funciones
fr: Comment définir vos propres fonctions
it: Come definire le tue funzioni
pt: Como definir as suas próprias funções
ta: உங்கள் சொந்த செயல்பாடுகளை எவ்வாறு வரையறுப்பது
uk: Як оголошувати власні функції
zh_hant: 如何定義自己的函式

source: Let's break down how you define a function.
cs: Rozebereme si, jak funkci definovat.
da: Lad os gennemgå, hvordan du definerer en funktion.
es: Vamos a desglosar cómo se define una función.
it: Vediamo, passo passo, come definire una funzione.
pt: Vamos ver em detalhes como definir uma função.

source: A function definition starts with the [code]func[/code] keyword followed by a space, the function's name, parentheses, and a colon.
cs: Definice funkce začíná klíčovým slovem [code]func[/code], za kterým následuje mezera, název funkce a závorky a dvojtečka.
da: En funktionsdefinition starter med nøgleordet [code]func[/code] efterfulgt af et mellemrum, funktionens navn, parenteser og et kolon.
es: La definición de una función comienza con la palabra clave [code]func[/code] seguida de un espacio, el nombre de la función, paréntesis y dos puntos.
it: La definizione di una funzione comincia con la parola chiave [code]func[/code] seguita da uno spazio, il nome della funzione, un paio di parentesi, e i due punti.
pt: Uma definição de função começa com a palavra-chave [code]func[/code] seguida de um espaço em branco, depois o nome da função, um parênteses e o sinal de dois pontos.

source: The instructions inside the function [b]must[/b] all start with a leading tab character. You can insert that tab character by pressing the [b]Tab[/b] key.
cs: Všechny instrukce uvnitř funkce [b]musí[/b] začínat úvodním znakem tabulátoru. Tento znak tabulátoru můžete vložit stisknutím klávesy [b]Tab[/b].
da: Instruktionerne i funktionen [b]skal[/b] alle starte med et indledende tabulatortegn. Du kan indsætte dette tabulatortegn ved at trykke på [b]Tabulator[/b]-tasten.
es: Todas las instrucciones dentro de la función [b]deben[/b] empezar con un carácter de tabulación inicial. Puedes insertar ese carácter de tabulación presionando la tecla [b]Tab[/b].
it: Le istruzioni di una funzione [b]devono[/b] cominciare tutte con un carattere di tabulazione. Puoi inserire questo carattere premendo il tasto [b]Tab[/b].
pt: Todas as instruções dentro da função [b]devem[/b] começar com um caractere de tabulação. Pode inserir esse caractere de tabulação pressionando a tecla [b]Tab[/b] no seu teclado.

source: We call those leading tabs [i]indents[/i]. They're important: the computer uses them to know which instructions are part of the same code block.
cs: Těmto úvodním znakům tabulátoru říkáme [i]odstavce[/i]. Jsou důležité: počítač podle nich pozná, které instrukce jsou součástí stejného bloku kódu.
da: Vi kalder disse indledende tabulatorer for [i]indryk[/i]. De er vigtige: computeren bruger dem til at vide, hvilke instruktioner der er en del af den samme kodeblok.
es: A esos tabuladores iniciales los llamamos [i]sangrías[/i]. Las sangrías (también conocidas como "indentaciones") son importantes: la computadora las utiliza para saber qué instrucciones forman parte del mismo bloque de código.
it: Chiamiamo queste tabulazioni [i]indentazione[/i]. È molto importante: il computer la sfrutta per capire quali istruzioni fanno parte dello stesso blocco di codice.
pt: Chamamos esses caracteres de tabulação como [i]recuos[/i]. Eles são importantes: o computador usa-os para saber quais instruções fazem parte do mesmo bloco de código.

source: Why do we use functions?
cs: Proč používáme funkce?
da: Hvorfor bruger vi funktioner?
de: Warum nutzen wir Funktionen?
es: ¿Por qué utilizamos funciones?
fr: Pourquoi utilisons-nous des fonctions ?
it: Perché usiamo le funzioni?
pt: Por que usamos funções?
ta: நாம் ஏன் செயல்பாடுகளைப் பயன்படுத்துகிறோம்?
uk: Чому ми використовуємо функції?
zh_hant: 我們為什麼要使用函式？

source: Functions are groups of instructions we reuse every time we call the function.
cs: Funkce jsou skupiny instrukcí, které opakovaně používáme při každém volání funkce.
da: Funktioner er grupper af instruktioner, som vi genbruger hver gang vi kalder funktionen.
es: Las funciones son grupos de instrucciones que reutilizamos cada vez que llamamos a la función.
it: Le funzioni sono gruppi di istruzioni che riutilizziamo ogni volta che chiamiamo una funzione.
pt: Funções são grupos de instruções que reutilizamos toda vez que chamamos uma função.

source: Because we give functions a name, they also allow us to name a set of instructions, which is handy!
cs: Protože funkcím dáváme jméno, umožňují nám také pojmenovat sadu instrukcí, což je užitečné!
da: Fordi vi giver funktioner et navn, giver de os også mulighed for at navngive et sæt instruktioner, hvilket er praktisk!
es: Debido a que le damos un nombre a las funciones, también nos permiten nombrar un conjunto de instrucciones, ¡lo cual es muy útil!
it: Dare un nome alle funzioni ci permette di dare un nome a una serie di istruzioni, il che è davvero comodo!
pt: Como damos um nome às funções, elas também nos permitem nomear um conjunto de instruções, o que é bem prático!

source: To reuse code multiple times.
cs: Chcete-li kód použít vícekrát.
da: At genbruge kode flere gange.
de: Um Code mehrmals wiederzuverwenden.
es: Para reutilizar el código varias veces.
fr: Pour réutiliser le code plusieurs fois.
it: Per riutilizzare del codice più volte.
pt: Para reutilizar o código várias vezes.
ta: குறியீட்டை பல முறை மீண்டும் பயன்படுத்த.
uk: Щоб повторно використати код багато разів.
zh_hant: 為了能夠多次重複使用程式碼。

source: To run multiple instructions in one go.
cs: Chcete-li spustit více instrukcí najednou.
da: At køre flere instruktioner på én gang.
de: Um mehrere Anweisungen auf einmal auszuführen.
es: Para ejecutar varias instrucciones a la vez.
fr: Pour exécuter plusieurs instructions en une seule fois.
it: Per eseguire più istruzioni alla volta.
pt: Executar várias instruções de um vez só.
ta: ஒரே நேரத்தில் பல வழிமுறைகளை இயக்க.
uk: Щоб виконати кілька інструкцій за один раз.
zh_hant: 一次執行多個指令。

source: To put a name on multiple lines of code.
cs: Chcete-li pojmenovat více řádků kódu.
da: For at sætte et navn, på flere linjer kode.
de: Um mehreren Codezeilen einen Namen zu geben.
es: Para poner un nombre a varias líneas de código.
fr: Pour donner un nom à plusieurs lignes de code.
it: Per dare un nome a più righe di codice.
pt: Para pôr um nome em várias linhas de código.
ta: குறியீட்டின் பல வரிகளில் ஒரு பெயரை வைக்க.
uk: Щоб дати назву кільком рядкам коду.
zh_hant: 給多行程式碼命名。

source: Names in code have rules
cs: Názvy v kódu mají pravidla
da: Navne i kode har regler
de: Namen im Code haben Regeln
es: Los nombres en el código tienen reglas
fr: Les noms dans le code ont des règles
it: L'assegnazione dei nomi ha delle regole
pt: Nomes dentro dos códigos possuem regras
ta: குறியீட்டில் உள்ள பெயர்களுக்கு விதிகள் உள்ளன
uk: Щодо назв у коді є правила
zh_hant: 程式碼中的名稱有規則

source: Function identifiers cannot contain spaces. In general, names in programming languages cannot contain spaces.
cs: Identifikátory funkcí nesmí obsahovat mezery. Obecně platí, že názvy v programovacích jazycích nemohou obsahovat mezery.
da: Funktionsidentifikatorer må ikke indeholde mellemrum. Generelt må navne i programmeringssprog ikke indeholde mellemrum.
es: Los identificadores de funciones no pueden contener espacios. En general, los nombres en los lenguajes de programación no pueden contener espacios.
it: Gli identificatori delle funzioni non possono contenere spazi. In generale, i nomi nei linguaggi di programmazione non possono contenere spazi.
pt: Identificadores de função não podem conter espaços entre eles. No geral, nomes em linguagens de programação não podem conter espaços entre eles.

source: The computer uses spaces to detect the separation between different keywords and identifiers.
cs: Počítač používá mezery k rozpoznání oddělení různých klíčových slov a identifikátorů.
da: Computeren bruger mellemrum til at registrere adskillelsen mellem forskellige nøgleord og identifikatorer.
es: La computadora utiliza los espacios para detectar la separación entre diferentes palabras clave e identificadores.
it: Il computer usa gli spazi per identificare la separazione tra parole chiavi e nomi.
pt: O computar usa esses espaços para detetar separações entre diferentes palavras-chave e identificadores.

source: Instead of spaces, in GDScript, we use underscores ("_"). You saw this already with functions like [code]move_forward()[/code] or [code]move_local_x()[/code]. This is the convention we follow in GDScript.
cs: Místo mezer používáme v jazyce GDScript podtržítka ("_"). Viděli jste to již u funkcí jako [code]move_forward()[/code] nebo [code]move_local_x()[/code]. Tuto konvenci dodržujeme v jazyce GDScript.
da: I stedet for mellemrum bruger vi understregninger ("_") i GDScript. Du har allerede set dette med funktioner som [code]move_forward()[/code] eller [code]move_local_x()[/code]. Dette er den konvention, vi følger i GDScript.
es: En lugar de espacios, en GDScript usamos guiones bajos ("_"). Ya viste esto con funciones como [code]move_forward()[/code] o [code]move_local_x()[/code]. Esta es la convención que seguimos en GDScript.
it: Al posto degli spazi, in GDScript, usiamo i trattini bassi ("_"). L'hai già potuto vedere con funzioni come [code]move_forward()[/code] o [code]move_local_x()[/code]. Questa è la convenzione, chiamata snake_case che viene usata in GDScript.
pt: Ao invés de espaços, no GDScript, usamos o símbolo de underscores ("_"); Já viu isso em funções como [code]move_forward()[/code] ou [code]move_local_x()[/code]. Isso é uma convenção que seguimos no GDScript.

source: There's another convention programmers use in some other programming languages.
cs: V některých jiných programovacích jazycích používají programátoři jinou konvenci.
da: Der er en anden konvention, som programmører bruger i nogle andre programmeringssprog.
es: Hay otra convención que los programadores utilizan en algunos otros lenguajes de programación.
it: Ci sono altre convenzioni che vengono usate dai programmatori in altri linguaggi.
pt: Existe outra convenção que programadores usam em algumas outras linguagens de programação.
