Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-19-creating-arrays.po
Languages: cs, da, de, es, fr, it, nl, pt_br, ru, ta, tr, uk, zh_hant

source: The [code]range()[/code] function we saw in the previous lesson outputs a list of numbers. For example, calling [code]range(3)[/code] produces the list of numbers [code][0, 1, 2][/code].
cs: Funkce [code]range()[/code], kterou jsme viděli v předchozí lekci, vypisuje seznam čísel. Například zavoláním funkce [code]range(3)[/code] vznikne seznam čísel [code][0, 1, 2][/code].
da: [code]range()[/code] funktionen, vi så i den forrige lektion, udskriver en liste af tal. For eksempel, kaldet [code]range(3)[/code] producerer listen med tal [code][0, 1, 2][/code].
de: Die Funktion [code]range()[/code], die wir in der vorherigen Lektion gesehen haben, gibt eine Liste von Zahlen aus. Wenn Du beispielsweise [code]range(3)[/code] aufrufst, wird eine Liste der Zahlen [code][0, 1, 2][/code] erzeugt.
es: La función [code]range()[/code] que vimos en la lección anterior genera una lista de números. Por ejemplo, llamar a [code]range(3)[/code] produce la lista de números [code][0, 1, 2][/code].
fr: La fonction [code]range()[/code] que nous avons vue dans la leçon précédente produit une liste de nombres. Par exemple, l'appel de [code]range(3)[/code] produit la liste de nombres [code][0, 1, 2][/code].
it: Abbiamo visto nelle lezioni precedenti che la funzione [code]range()[/code] da come risultato una lista di numeri. Per esempio, chiamare la funzione [code]range(3)[/code] produce la lista [code][0, 1, 2][/code].
nl: De functie [code]range()[/code] die we in de vorige les hebben gezien, geeft een lijst met getallen. Als je bijvoorbeeld [code]range(3)[/code] aanroept, krijg je de lijst met getallen [code][0, 1, 2][/code].
pt_br: A função [code]range()[/code] que vimos na lição anterior gera uma lista de números. Por exemplo, chamar [code]range(3)[/code] produz a lista de números [code][0, 1, 2][/code].
ru: Функция [code]range()[/code], которую мы рассматривали в предыдущем уроке, создаёт список чисел. Например, вызов [code]range(3)[/code] производит список [code][0, 1, 2][/code].
ta: முந்தைய பாடத்தில் நாம் பார்த்த [குறியீடு] வரம்பு () [/குறியீடு] செயல்பாடு எண்களின் பட்டியலை வெளியிடுகிறது. எடுத்துக்காட்டாக, [குறியீடு] வரம்பு (3) [/குறியீடு] ஐ அழைப்பது எண்களின் பட்டியலை [குறியீடு] [0, 1, 2] [/குறியீடு] உருவாக்குகிறது.
tr: Önceki derste gördüğümüz [code]range()[/code] fonksiyonu, bir sayı listesi çıktısı verir. Örneğin, [code]range(3)[/code] çağrısı, [code][0, 1, 2][/code] sayı listesini üretir.
uk: Функція [code]range()[/code], яку ми бачили в попередньому уроці, виводить список чисел. Наприклад, виклик [code]range(3)[/code] створює список чисел [code][0, 1, 2][/code].
zh_hant: [code]range()[/code] 函式在前面課程中介紹過，它會輸出一個數字列表。例如呼叫 [code]range(3)[/code] 會產生數字列表 [code][0, 1, 2][/code]。

source: A list of values, numbers or otherwise, has a precise name in code: we call it an [i]array[/i]. So we can say calling the [code]range()[/code] function produces an [i]array[/i] of numbers.
da: En liste over værdier, tal eller andet, har et præcist navn i kode: vi kalder det et [i]array[/i]. Så vi kan sige at kalde [code]range()[/code] funktionen producerer et [i]array[/i] af tal.
fr: Une liste de valeurs, de nombres ou non, a un nom précis dans le code : on les appelle [i]tableaux[/i] (ou [code]array[/code]). Nous pouvons donc dire que l'appel de la fonction [code]range()[/code] produit un [i]tableau[/i] de nombres.
it: Un elenco di valori, numeri o altro, ha un nome preciso nel codice: lo chiamiamo [i]array[/i]. Quindi possiamo dire che chiamando la funzione [code]range()[/code] si ottiene un [i]array[/i] di numeri.
nl: Een lijst met waarden, getallen of iets anders, heeft een precieze naam in code: we noemen het een [i]array[/i]. We kunnen dus zeggen dat het aanroepen van de [code]range()[/code] functie een [i]array[/i] van getallen produceert.
pt_br: Uma lista de valores, seja ela de números ou não, tem um nome preciso em código: nós as chamamos de [i]arrays[/i]. Então podemos dizer que chamar a função [code]range()[/code] produz um [i]array[/i] de números.
ru: Списки значений, чисел и т.п., имеют точное название в коде: мы называем их [i]массивами[/i]. Соответственно, мы можем сказать, что вызов функции [code]range()[/code] создаёт [i]массив[/i] чисел.
tr: Sayı ya da başka tipte değerlerden oluşan bir listenin kodlamada özel bir ismi var: buna [i]dizi[/i] diyoruz. Yani, [code]range()[/code] fonksiyonunu çağırmanın sayılardan oluşan bir [i]dizi[/i] ürettiğini söyleyebiliriz.
uk: Список значень, чисел чи інших, має точну назву в коді: ми називаємо його [i]масивом[/i]. Отже, можна сказати, що виклик функції [code]range()[/code] створює [i]масив[/i] чисел.

source: We could directly write and use that array inside our [code]for[/code] loop instead of the [code]range()[/code] function. You can run the next function step-by-step to see how it works.
da: Vi kunne direkte skrive og bruge det array inde i vores [code]for[/code] loop i stedet for [code]range()[/code] funktionen. Du kan køre næste funktion trin-for-trin for at se, hvordan det virker.
fr: Nous pouvons directement écrire et utiliser ce tableau dans notre boucle [code]for[/code] au lieu de la fonction [code]range()[/code]. Vous pouvez exécuter la fonction suivante étape par étape pour voir comment elle fonctionne.
it: Potremmo scrivere e utilizzare direttamente questo array all'interno del nostro ciclo [code]for[/code] invece della funzione [code]range()[/code]. È possibile eseguire la funzione successiva passo per passo per vedere come funziona.
nl: We zouden die array letterlijk in onze [code]for[/code] lus kunnen schrijven en gebruiken in plaats van de functie [code]range()[/code]. Je kunt de volgende functie stap voor stap uitvoeren om te zien hoe het werkt.
pt_br: Poderíamos escrever e usar diretamente esse array dentro do nosso loop [code]for[/code] ao invés da função [code]range()[/code]. Você pode executar a próxima função passo por passo pra ver como funciona.
ru: Мы можем создать массив напрямую и использовать его в нашем цикле [code]for[/code] вместо функции [code]range()[/code]. Вы можете запустить следующую функцию шаг за шагом, чтобы увидеть, как она работает.
tr: Böyle diziyi, [code]range()[/code] fonksiyonu yerine, doğrudan [code]for[/code] döngümüzün içine yazabilir ve kullanabiliriz. Nasıl çalıştığını görmek için bir sonraki fonksiyonu adım adım çalıştırabilirsiniz.
uk: Ми могли б безпосередньо записати та використати цей масив у нашому циклі [code]for[/code] замість функції [code]range()[/code]. Ви можете виконати наступну функцію крок за кроком, щоб побачити, як вона працює.

source: As you can see, the code still works the same. Notice that when we create a [code]for[/code] loop, we also create a local variable to which the loop assigns one value per iteration. Above, we named it [code]number[/code] because the array we loop over contains three numbers (0, 1, and 2).
da: Som du kan se, fungerer koden stadig på samme måde. Bemærk, at når vi opretter en [code]for[/code] løkke, opretter vi også en lokal variabel, som løkken tildeler én værdi pr. iteration. Ovenstående kaldte vi den [code]number[/code], fordi det array, vi sløjfer over indeholder tre tal (0, 1 og 2).
fr: Comme vous pouvez le constater, le code fonctionne toujours de la même manière. Remarquez que lorsque nous créons une boucle [code]for[/code], nous créons également une variable locale à laquelle la boucle attribue une valeur par itération. Ci-dessus, nous l'avons nommée [code]number[/code] parce que le tableau sur lequel nous bouclons contient trois nombres (0, 1 et 2).
it: Come si può vedere, il codice funziona ancora allo stesso modo. Notate che quando creiamo un ciclo [code]for[/code], creiamo anche una variabile locale alla quale il ciclo assegna un valore per ogni iterazione. Qui sopra l'abbiamo chiamata [code]numero[/code], perché l'array su cui eseguiamo il ciclo contiene tre numeri (0, 1 e 2).
nl: Zoals je kunt zien, werkt de code nog steeds hetzelfde. Merk op dat wanneer we een [code]for[/code]-lus maken, we ook een lokale variabele maken waaraan de lus één waarde per iteratie toewijst. Hierboven hebben we het [code]number[/code] genoemd omdat de array waar we overheen lussen drie getallen bevat (0, 1 en 2).
pt_br: Como você pode ver, o código funciona da mesma forma. Perceba que quando criamos um loop [code]for[/code], nós também criamos uma variável local a qual o loop atribui um valor por iteração. Acima, nós a nomeamos como [code]number[/code] porque a array que estamos acessando contém três números (0, 1 e 2).
ru: Как видите, код по-прежнему работает так же. Обратите внимание: когда мы создаем цикл [code]for[/code], мы также создаем локальную переменную, которой цикл присваивает одно значение за итерацию. Выше мы назвали её [code]number[/code], потому что массив, по которому мы проходим цикл, содержит три числа (0, 1 и 2).
tr: Gördüğünüz gibi, kod hala aynı şekilde çalışıyor. Bir [code]for[/code] döngüsü oluşturduğumuzda, döngünün her yineleme için yeni bir değer atadığı bir yerel değişken de oluşturduğumuza dikkat edin. Yukarıda, üzerinde döngü yaptığımız dizi üç sayı (0, 1 ve 2) içerdiği için bu değişkene [code]number[/code] adını verdik.
uk: Як бачите, код все ще працює так само. Зауважте, що коли ми створюємо цикл [code]for[/code], ми також створюємо локальну змінну, якій цикл призначає одне значення за кожну ітерацію. Вище ми назвали його [code]число[/code], оскільки масив, який ми перебираємо, містить три числа (0, 1 і 2).

source: But we could name it anything we'd like!
da: Men vi kunne navngive den hvad som helst!
fr: Mais nous pourrions lui donner n'importe quel nom !
it: Ma possiamo chiamarla come vogliamo!
nl: Maar we kunnen het elke naam geven die we maar willen!
pt_br: Mas poderíamos dar o nome que quiséssemos!
ru: Но мы можем назвать её как угодно!
tr: Ama ona istediğimiz ismi verebilirdik!
uk: Але ми можемо назвати його як завгодно!

source: If we "unwrap" the [code]for[/code] loop above, we'd get the following code with the exact same behaviour:
cs: Pokud bychom výše uvedenou smyčku [code]for[/code] "rozbalili", dostali bychom následující kód s naprosto stejným chováním:
da: Hvis vi "udpakker" [code]for[/code]-løkken ovenfor, får vi følgende kode med præcis samme opførsel:
de: Wenn wir die [code]for[/code] Schleife oben "auspacken", würden wir den folgenden Code mit dem exakt gleichen Verhalten bekommen:
es: Si "desenvolvemos" el bucle [code]for[/code] anterior, obtendríamos el siguiente código con exactamente el mismo comportamiento:
fr: Si nous "déballons" la boucle [code]for[/code] ci-dessus, nous obtiendrons le code suivant, qui a exactement le même comportement :
it: Se "scartiamo" il ciclo [code]for[/code] di cui sopra, otterremo il seguente codice con lo stesso identico comportamento:
nl: Als we de bovenstaande [code]for[/code]-lus "ontrollen", krijgen we de volgende code met exact hetzelfde gedrag:
pt_br: Se nós "desdobrássemos" o loop [code]for[/code] acima, nós teríamos o seguinte código com o mesmo comportamento:
ru: Если мы «развернем» приведённый выше цикл [code]for[/code], мы получим следующий код с точно таким же поведением:
ta: மேலே உள்ள [/குறியீடு] வளையத்திற்கான [குறியீட்டை] நாம் "அவிழ்த்து" செய்தால், அதே நடத்தையுடன் பின்வரும் குறியீட்டைப் பெறுவோம்:
tr: Eğer yukarıdaki [code]for[/code] döngüsünü "açarsak", tamamen aynı davranışa sahip aşağıdaki kodu elde ederiz:
uk: Якщо ми «розгорнемо» цикл [code]for[/code] вище, ми отримаємо наступний код із точно такою самою поведінкою:
zh_hant: 如果我們將上方的 [code]for[/code] 迴圈「展開」，就會得到以下具有相同行為的程式碼：

source: The syntax of arrays
cs: Syntaxe polí
da: Syntaksen for arrays
de: Die Syntax von Arrays
es: La sintaxis de las matrices
fr: La syntaxe des tableaux
it: La sintassi degli array
nl: De vorm van arrays
pt_br: A sintaxe dos arrays
ru: Синтаксис массивов
ta: வரிசைகளின் தொடரியல்
tr: Dizilerin sözdizimi
uk: Синтаксис масивів
zh_hant: 陣列的語法

source: We write arrays this way in GDScript.
cs: Tímto způsobem zapisujeme pole v GDScriptu.
da: Vi skriver arrays på denne måde i GDScript.
de: Wir schreiben Arrays auf diese Weise in GDScript.
es: En GDScript, escribimos las matrices de esta manera.
fr: Nous écrivons des tableaux de cette façon dans GDScript.
it: Scriviamo gli array in questo modo in GDScript.
nl: Zo schrijven we arrays in GDScript.
pt_br: Nós escrevemos arrays dessa forma no GDScript.
ru: В GDScript мы создаём массивы таким образом.
ta: GDSCRIPT இல் வரிசைகளை இந்த வழியில் எழுதுகிறோம்.
tr: GDScript'te, dizileri bu şekilde yazıyoruz.
uk: Таким чином ми записуємо масиви в GDScript.
zh_hant: 我們在 GDScript 中用這種方式編寫陣列。

source: You start with an opening square bracket. Then, you write comma-separated values that compose the array. Finally, you need a closing square bracket to complete the array.
da: Du starter med en indledende firkantet parentes. Derefter skriver du kommaseparerede værdier, der udgør arrayet. Til sidst skal du bruge en afsluttende firkantet parentes for at fuldføre arrayet.
fr: Vous commencez par un crochet ouvrant. Ensuite, vous écrivez les valeurs qui composent le tableau séparées par des virgules. Enfin, vous avez besoin d'un crochet fermant pour compléter le tableau.
it: Inizi aprendo una parentesi quadra. Poi, scrivi i valori che compongono l'array separati da una virgola. In fine, inserisci la parentesi quadra di chiusura per completare 'array.
nl: Je begint met een vierkant haakje. Vervolgens schrijf je door komma's gescheiden waarden waaruit de array is opgebouwd. Tot slot heb je een afsluitende vierkante haak nodig om de array af te sluiten.
pt_br: Você começa com um colchete de abertura. Em seguida, você escreve valores separados por vírgulas que compõem o array. Finalmente, você precisa de um colchete de fechamento para completar o array.
ru: Вы начинаете с открывающей квадратной скобки. После неё пишете значения, составляющие массив, через запятую. В конце необходимо поставить закрывающую квадратную скобку для завершения массива.
tr: Açılan köşeli parantez ile başlarsınız. Ardından, diziyi oluşturan değerleri, virgülle ayırıp yazarsınız. Son olarak, diziyi tamamlamak için bir kapanan köşeli paranteze ihtiyacınız var.
uk: Ви починаєте з відкриття квадратної дужки. Потім ви записуєте значення, розділені комами, які утворюють масив. Нарешті, для завершення масиву потрібна квадратна дужка, що закривається.

source: Here are a couple of valid arrays. Notice how you can mix values, and how they don't need to follow one another.
da: Her er et par gyldige arrays. Bemærk, hvordan du kan blande værdier, og hvordan de ikke behøver at følge hinanden.
fr: Voici quelques tableaux valides. Remarquez que vous pouvez mélanger des valeurs et qu'elles ne doivent pas nécessairement être séquentielles.
it: Ecco una serie di array validi. Nota bene che puoi usare diversi tipi di valori e questi non devono conformarsi l'uno agli altri.
nl: Hier zijn een paar geldige arrays. Merk op hoe je waarden kunt mengen en dat ze elkaar niet hoeven op te volgen.
pt_br: Aqui estão alguns arrays válidos. Observe como você pode misturar valores e como eles não precisam seguir um ao outro.
ru: Вот несколько правильных примеров объявления массивов. Обратите внимание, что вы можете смешивать значения, и что им необязательно следовать друг за другом.
tr: İşte birkaç tane geçerli dizi örneği. Değerleri karışık verebileceğinize ve sıralı olmaları gerekmediğine dikkat edin.
uk: Ось кілька дійсних масивів. Зверніть увагу, як ви можете змішувати значення, і як вони не повинні слідувати одне за одним.

source: Because arrays themselves are a value type, just like numbers or [code]Vector2[/code], we can assign arrays to variables to reaccess them later.
da: Fordi arrays i sig selv er en værditype, ligesom tal eller [code]Vector2[/code], kan vi tildele arrays til variabler for at få adgang til dem senere.
fr: Comme les tableaux sont eux-mêmes un type de valeur, tout comme les nombres ou les [code]Vector2[/code], nous pouvons assigner des tableaux à des variables pour y accéder à nouveau plus tard.
it: Perché gli array sono lo ro stessi un tipo di valore, così come i numeri o i [code]Vector2[/code], possiamo assegnare array a variabili per ri-accedervi in seguito.
nl: Omdat arrays zelf een waardentype zijn, net als getallen of [code]Vector2[/code], kunnen we arrays toewijzen aan variabelen om ze later opnieuw te gebruiken.
pt_br: Como os próprios arrays são um tipo de valor, assim como números ou [code]Vector2[/code], podemos colocar arrays dentro de variáveis para reacessá-los depois.
ru: Поскольку массивы сами по себе являются типом значений, как числа или [code]Vector2[/code], мы можем присваивать массивы переменным чтобы иметь доступ к ним в будущем.
tr: Dizilerin kendileri de, tıpkı sayılar ve [code]Vector2[/code] gibi bir değer tipi olduğundan, bunlara daha sonra yeniden erişmek için değişkenlere atayabiliriz.
uk: Оскільки самі масиви є типом значень, як і числа чи [code]Вектор2[/code], ми можемо призначити масиви змінним, щоб отримати до них повторний доступ пізніше.

source: That'll come in handy in the next lesson, where we'll use those variables in loops.
da: Det vil være nyttigt i den næste lektion, hvor vi vil bruge disse variabler i løkker.
fr: Cela nous sera très utile dans la prochaine leçon, où nous utiliserons ces variables dans des boucles.
it: Questo tornerà utile nella prossima lezione, in cui useremo queste variabili all'interno di cicli.
nl: Dat zal van pas komen in de volgende les, waar we die variabelen in lussen zullen gebruiken.
pt_br: Isso será útil na próxima lição, onde vamos usar essas variáveis em loops.
ru: Это пригодится в следующем уроке, где мы будем использовать такие переменные в циклах.
tr: Bu değişkenler, onları döngülerin içinde kullanacağımız sonraki dersimizde çok işimize yarayacak.
uk: Це стане в нагоді в наступному уроці, де ми будемо використовувати ці змінні в циклах.

source: But first, let's see [i]when[/i] you'd use an array.
cs: Nejprve se však podívejme [i]kdy[/i] byste použili pole.
da: Men først, lad os se på [i]hvornår[/i] du ville bruge et array.
de: Aber lass uns zuerst sehen, [i]wann[/i] ein Array zu verwenden ist.
es: Pero primero, veamos [i]cuándo[/i] utilizarías una matriz.
fr: Mais d'abord, voyons [i]quand[/i] vous utiliseriez un tableau.
it: Ma prima, vediamo [i]quando[/i] dovresti usare un array.
nl: Maar laten we eerst eens kijken [i]wanneer[/i] je een array zou gebruiken.
pt_br: Mas primeiro, vamos ver [i]quando[/i] você usaria um array.
ru: Но сначала давайте посмотрим [i]где[/i] вы будете использовать массивы.
ta: ஆனால் முதலில், [/i] நீங்கள் ஒரு வரிசையைப் பயன்படுத்தும்போது [i] பார்ப்போம்.
tr: Ama önce bir diziyi [i]ne zaman[/i] kullanacağınızı görelim.
uk: Але спочатку давайте подивимося, [i]коли[/i] ви будете використовувати масив.
zh_hant: 在此之前，讓我們先看看你[b]何時[/b]要使用陣列。

source: When you use arrays
cs: Kdy použít pole
da: Hvornår bruges arrays
de: Wann Du Arrays verwendest
es: Cuándo se utilizan las matrices
fr: Quand utilise-t-on les tableaux ?
it: Quando usi gli array
nl: Wanneer je arrays gebruikt
pt_br: Quando usar arrays
ru: Где использовать массивы
ta: நீங்கள் வரிசைகளைப் பயன்படுத்தும்போது
tr: Dizileri ne zaman kullanırsınız
uk: Коли ви використовуєте масиви
zh_hant: 使用陣列的場合

source: In computer programming, we use arrays [i]all the time[/i].
da: I computerprogrammering bruger vi arrays [i]hele tiden[/i].
fr: En programmation informatique, nous utilisons des tableaux [i]tout le temps[/i].
it: In programmazione informatica, usiamo gli array [i]tutte le volte[/i].
nl: Bij het programmeren gebruiken we [i]heel vaak[/i] arrays.
pt_br: Em programação, usamos arrays [i]o tempo todo[/i].
ru: В программировании мы используем массивы [i]постоянно[/i].
tr: Bilgisayar programlamada, [i]dizilerini her zaman[/i] kullanırız.
uk: У комп’ютерному програмуванні ми [i]постійно[/i] використовуємо масиви.

source: Precisely, you'll use them whenever you need to store a [i]list of things[/i].
da: Normalt set bruger du dem, når du har brug for at gemme en [i]liste over ting[/i].
fr: Précisément, vous les utiliserez chaque fois que vous aurez besoin de stocker une [i]liste de choses[/i].
it: Precisamente, li userai ogniqualvolta che devi conservare una [i]lista di cose[/i].
nl: Om precies te zijn, je gebruikt ze wanneer je een [i]lijst van dingen[/i] moet opslaan.
pt_br: Precisamente, você os vai usar eles sempre que precisar armazenar uma [i]lista de coisas[/i].
ru: Точнее, вы будете использовать их всякий раз, когда вам понадобится хранить [i]список вещей[/i].
tr: Kesin olmak gerekirse, [i]bir şeylerin listesi[/i]'ni saklamanız gerektiğinde bunları kullanacaksınız.
uk: Точніше, ви будете використовувати їх щоразу, коли вам потрібно буде зберегти [i]список речей[/i].

source: You always need lists of things in games:
da: Du har altid brug for lister over ting i spil:
fr: Vous avez toujours besoin de listes de choses dans les jeux :
it: Hai sempre bisogno di liste nei videogiochi:
nl: In spellen heb je vaak lijsten met dingen nodig:
pt_br: Você sempre precisa de listas de coisas em jogos:
ru: В играх всегда нужны списки вещей:
tr: Oyunlarda her zaman listelere ihtiyaç duyarsınız:
uk: В іграх завжди потрібні списки речей:

source: - The player's party in an RPG. - The items in the player's inventory. - The high scores in an arcade game. - The objects in the game world.
da: - Spillerens gruppe i et RPG. - Genstandene i spillerens lager. - Highscores i et arkadespil. - Objekterne i spilverdenen.
fr: - Les membres du groupe du joueur dans un RPG. - Les objets dans l'inventaire du joueur. - Les meilleurs scores dans un jeu d'arcade. - Les objets du monde du jeu.
it: - Il party del giocatore in un RPG. - Gli oggetti nell'inventario del giocatore. - I record all'interno di un gioco arcade. - Gli oggetti nel mondo di gioco.
nl: - De spelersgroep in een RPG. - De voorwerpen in de inventaris van de speler. - De topscores in een arcadespel. - De objecten in de spelwereld.
pt_br: - O grupo de personagens em um RPG. - Os itens no inventário do jogador. - As pontuações mais altas em um jogo de arcade. - Os objetos no mundo do jogo.
ru: - Партия игрока в RPG. - Предметы в инвентаре игрока. - Список рекордов в аркадной игре. - Объекты в игровом мире.
tr: - Bir RPG'de (rol yapma oyunu) oyuncunun takımı. - Oyuncunun deposundaki eşyalar. - Bir arcade (salon tarzı) oyunundaki yüksek skorlar. - Oyun dünyası içindeki nesneler.
uk: - Партія гравця в RPG. - Предмети в інвентарі гравця. - Високі результати в аркадній грі. - Об'єкти в ігровому світі.

source: All of those and many more rely on arrays.
da: Alle disse og mange flere er afhængige af arrays.
fr: Toutes ces choses et bien d'autres encore reposent sur des tableaux.
it: Tutti questi e molti altri fanno affidamento su degli array.
nl: Al deze en nog veel meer dingen zijn afhankelijk van arrays.
pt_br: Todos esses e muitos mais dependem de arrays.
ru: Всё это и многое другое реализуется при помощи массивов.
tr: Bunların hepsi ve daha fazlası dizilere bel bağlar.
uk: Усі вони та багато інших покладаються на масиви.

source: Using arrays to follow a path
cs: Použití pole ke sledování trasy
da: Brug af arrays til at følge en sti
de: Verwenden von Arrays zum Folgen eines Pfads
es: Utilizar matrices para seguir un camino
fr: Utiliser des tableaux pour suivre un chemin
it: Usando gli array per seguire un percorso
nl: Arrays gebruiken om een pad te volgen
pt_br: Usando arrays para seguir um caminho
ru: Использование массивов для перемещения по пути
ta: ஒரு பாதையைப் பின்பற்ற வரிசைகளைப் பயன்படுத்துதல்
tr: Bir yolu takip etmek için dizileri kullanmak
uk: Використання масивів для проходження шляху
zh_hant: 使用陣列跟隨路徑
