Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-22-functions-return-values.po
Languages: cs, da, de, es, it, ja, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: Until now, you learned that functions are sequences of instructions you give a name and you can call any time.
da: Indtil nu har du lært, at funktioner er sekvenser af instruktioner, du giver et navn, og du kan kalde til enhver tid.
de: Bis jetzt hast du gelernt, dass Funktionen Sequenzen von Anweisungen sind, die du einen Namen geben und jederzeit aufrufen kannst.
es: Hasta ahora, has aprendido que las funciones son secuencias de instrucciones a las que les das un nombre y que puedes llamar en cualquier momento.
it: Fino ad ora, hai imparato che le funzioni sono sequenze di istruzioni a cui attribuisci un nome, che puoi chiamare ogni volta che ne hai la necessità.
ja: ここまでは、関数は名前を付けていつでも呼び出すことができる一連の命令であることを学びました。
pt_br: Até agora, você aprendeu que funções são sequências de instruções que você dá um nome e pode chamar a qualquer momento.
ru: До этого момента вы выучили, что функции — это именованные последовательности инструкций, которые можно вызвать в любое время.
tr: Şimdiye kadar fonksiyonların, bir isim verdiğiniz ve istediğiniz zaman çağırabileceğiniz sıralı talimatlar olduğunu öğrendiniz.
zh_hans: ·学到现在，你已经知道了到函数是一个由你命名的指令序列，可以被随时调用。

source: On top of that, functions can make calculations and [i]return[/i] new values.
da: Desuden kan funktioner lave beregninger og [i]retunere[/i] nye værdier.
de: Darüber hinaus können Funktionen Berechnungen durchführen und [i]return[/i] neue Werte zurückgeben.
es: Además de eso, las funciones pueden hacer cálculos y [i]devolver[/i] nuevos valores.
it: Oltre a questo, le funzioni possono aiutarci a fare calcoli e [i]farci ritornare[/i] nuovi valori.
ja: その上、関数は計算を行い、新しい値を[i]返す[/i]ことができます。
pt_br: Além disso, as funções podem fazer cálculos e [i]retornar[/i] novos valores.
ru: Помимо этого, функции могут производить вычисления и [i]возвращать[/i] новые значения.
tr: Buna ek olarak, fonksiyonlar, hesaplamalar yapabilir ve geriye yeni değerler [i]döndürebilirler[/i].
zh_hans: 在此基础上，函数还可以进行计算并[i]返回[/i]（return）新的值。

source: Let's look at some examples to see why it's useful.
da: Lad os se på nogle eksempler for at se, hvorfor det er nyttigt.
de: Schauen wir uns einige Beispiele an, um zu sehen, warum das nützlich ist.
es: Veamos algunos ejemplos para ver por qué es útil.
it: Guardiamo qualche esempio per vedere perchè è utile.
ja: なぜそれが役立つのか、いくつかの例を見てみましょう。
pt_br: Vamos ver alguns exemplos para ver por que isso é útil.
ru: Давайте взглянем на несколько примеров, чтобы увидеть, чем это полезно.
tr: Bunun ne yararı olduğunu görmek için bazı örneklere bakalım.
zh_hans: 让我们来看些例子，看看它为什么很有用。

source: Built-in functions that return a value
cs: Vestavěné funkce, které vracejí hodnotu
da: Indbygget funktioner, der returnerer en værdi
de: Integrierte Funktionen, die einen Wert zurückgeben
es: Funciones incorporadas que devuelven un valor
it: Funzioni predefinite che ritornano un valore
ja: 値を返す組み込み関数
pt: Funções embutidas prontas que retornam um valor
pt_br: Funções internas prontas que retornam um valor
ru: Встроенные функции, возвращающие значение
ta: ஒரு மதிப்பைத் தரும் உள்ளமைக்கப்பட்ட செயல்பாடுகள்
tr: Bir değer döndüren yerleşik fonksiyonlar
uk: Вбудовані функції, які повертають значення
zh_hans: 返回一个值的内置函数
zh_hant: 回傳值的內建函式

source: Many functions built into GDScript make calculations and return a new value.
da: Mange funktioner indbygget i GDScript laver beregninger og returnerer en ny værdi.
de: Viele Funktionen, die in GDScript integriert sind, führen Berechnungen durch und geben einen neuen Wert zurück.
es: Muchas funciones integradas en GDScript realizan cálculos y devuelven un nuevo valor.
it: Molte funzioni predefinite in GDScript svolgono calcoli e ritornano nuovi valori.
ja: GDScriptに組み込まれている多くの関数は、計算を行い、新しい値を返します。
pt_br: Muitas funções já incorporadas no GDScript fazem cálculos e retornam um novo valor.
ru: Многие функции, встроенные в GDScript, производят вычисления и возвращают новые значения.
tr: GDScript'in içinde yerleşik olarak gelen birçok fonksiyon, hesaplamalar yapar ve geriye yeni bir değer döndürür.
zh_hans: GDScript 会自带内置的函数，有些能进行计算并返回一个新值。

source: For example, the [code]round()[/code] function takes a decimal number as an argument and gives you back a new number rounded to the nearest digit.
da: For eksempel, funktionen [code]round()[/code] tager et decimaltal som et argument og giver dig tilbage et nyt nummer afrundet til det nærmeste heltal.
de: Beispielsweise verwendet die Funktion [code]round()[/code] eine Dezimalzahl als Argument und gibt eine neue Zahl zurück, die auf die nächste Ziffer gerundet ist.
es: Por ejemplo, la función [code]round()[/code] toma un número decimal como argumento y te devuelve un nuevo número redondeado al dígito más cercano.
it: Per esempio, la funzione [code]round()[/code] accetta un valore decimale come argomento e restituisce un nuovo numero intero arrotondato alla cifra più vicina.
ja: たとえば、[code]round()[/code] 関数は 10 進数を引数として受け取り、最も近い桁に丸められた新しい数値を返します。
pt_br: Por exemplo, a função [code]round()[/code] recebe um número decimal como argumento e retorna um novo número arredondado para o dígito mais próximo.
ru: Напрмер, функция [code]round()[/code] принимает десятичную дробь в качестве аргумента и возвращает вам новое число — результат округления аргумента до ближайшего целого числа.
tr: Örneğin, [code]round()[/code] (yuvarla) fonksiyonu, girdi değişken olarak ondalık bir sayı alır ve geriye, bunun en yakın basamağına yuvarlanmış yeni bir sayı verir.
zh_hans: 例如，[code]round()[/code] 函数以一个小数为参数，返回一个四舍五入的整数。

source: Imagine you have a game where you track the player's health as a percentage, a decimal number going from [code]0.0[/code] to [code]100.0[/code].
da: Forestil dig et spil, hvor du sporer spillerens liv i procent, et decimaltal der går fra [code]0.0[/code] til [code]100.0[/code].
de: Stell dir vor, du hast ein Spiel, in dem du das Leben des Spielers als Prozentsatz verfolgst, eine Dezimalzahl, die von [code]0.0[/code] bis [code]100.0[/code] reicht.
es: Imagina que tienes un juego en el que llevas la cuenta de la salud del jugador como un porcentaje, un número decimal que va de [code]0.0[/code] a [code]100.0[/code].
it: Immaginate di avere un gioco in cui la salute del giocatore è indicata in percentuale, un numero decimale che va da [code]0,0[/code] a [code]100,0[/code].
ja: プレイヤーの体力を [code]0.0[/code] から [code]100.0[/code] までの 10 進数でパーセンテージで追跡するゲームがあるとします。
pt_br: Imagine que você tem um jogo onde você acompanha a vida do jogador como uma porcentagem, um número decimal que vai de [code]0.0[/code] até [code]100.0[/code].
ru: Представьте, что у вас есть игра, в которой вы отслеживаете здоровье игрока в процентах — десятичной дроби от [code]0.0[/code] до [code]100.0[/code].
tr: Oyuncunun sağlığını yüzde olarak takip ettiğiniz bir oyununuz olduğunu düşünün; [code]0.0[/code] ile [code]100.0[/code] arasında değişen ondalık bir sayı.
zh_hans: 想象一下，你在做一个游戏，要用百分比的形式跟踪玩家的血量，这是一个从 [code]0.0[/code] 到 [code]100.0[/code] 的小数字。

source: When displaying the health on the interface, you don't want to show the decimal part. In that case, you may use the [code]round()[/code] function, like so.
da: Når livet vises på brugerfladen, ønsker du ikke at vise decimaldelen. I så fald kan du bruge funktionen [code]round()[/code] på denne måde.
de: Wenn du das Leben auf der Benutzeroberfläche anzeigst, möchtest du den Dezimalteil nicht anzeigen. In diesem Fall kannst du die Funktion [code]round()[/code] wie folgt verwenden.
es: Al mostrar la salud en la interfaz, no quieres mostrar la parte decimal. En ese caso, puedes utilizar la función [code]round()[/code], así.
it: Quando si visualizza la salute sull'interfaccia, non si vuole mostrare la parte decimale. In questo caso, si può usare la funzione [code]round()[/code], in questo modo.
ja: インターフェイスに正常性を表示する場合、小数部分は表示しません。その場合は、次のように [code]round()[/code] 関数を使用できます。
pt_br: Ao exibir a vida na tela, você não quer mostrar a parte decimal do número. Nesse caso, você pode usar a função [code]round()[/code], assim.
ru: При отображении здоровья в интерфейсе вы не хотите показывать дробную часть. В этом случае, вы можете использовать функцию [code]round()[/code], например, так.
tr: Sağlığı arayüzde görüntülerken, ondalık kısmı göstermek istemezsiniz. Bu durumda, [code]round()[/code] fonksiyonunu aşağıdaki gibi kullanabilirsiniz.
zh_hans: 在游戏界面上显示血量时，你不想显示出小数部分。在这种情况下，可以像这样使用 [code]round()[/code] 函数。

source: Notice how we assign the result of the function call to a variable. Because the [code]round()[/code] function returns a [i]new[/i] value, we need to either store the result or use the value immediately.
da: Bemærk, hvordan vi tildeler resultatet af funktionskaldet til en variabel. Fordi funktionen [code]round()[/code] returnerer en [i]ny[/i] værdi, skal vi enten gemme resultatet eller bruge værdien med det samme.
de: Beachte, wie wir das Ergebnis des Funktionsaufrufs einer Variablen zuweisen. Da die Funktion [code]round()[/code] einen [i]neuen[/i] Wert zurückgibt, müssen wir das Ergebnis speichern.
es: Observa cómo asignamos el resultado de la llamada de función a una variable. Como la función [code]round()[/code] devuelve un [i]nuevo[/i] valor, necesitamos almacenar el resultado o usar el valor inmediatamente.
it: Nota bene come assegniamo il risultato della funzione ad una variabile. Questo poiché la funzione [code]round()[/code] riporta un [i]nuovo[/i] valore di cui dobbiamo o conservare il risultato o usare immediatamente.
ja: 関数呼び出しの結果を変数に代入する方法に注目してください。[code]round()[/code]関数は[i]新しい[/i]値を返すため、結果を保存するか、値をすぐに使用する必要があります。
pt_br: Observe como atribuímos o resultado da chamada de função a uma variável. Como a função [code]round()[/code] retorna um [i]novo[/i] valor, precisamos armazenar o resultado ou usar o valor imediatamente.
ru: Обратите внимание, как мы присваиваем результат выполнения функции переменной. Поскольку функция [code]round()[/code] возвращает [i]новое[/i] значение, нам нужно либо сохранить результат, либо сразу использовать его.
tr: Fonksiyon çağrısının sonucunu bir değişkene atama şeklimize dikkat edin. [code]round()[/code] fonksiyonu [i]yeni[/i] bir değeri dönderdiği için, sonucu saklamamız ya da değeri hemen kullanmamız gerekir.
zh_hans: 请注意是如何将函数调用的结果赋值给变量的。因为 [code]round()[/code] 函数返回了一个 [i]新[/i] 的值，我们要么得存储它，或者立即使用这个值。

source: Above, we assigned it to a variable, but you could also do the following.
da: Ovenfor tildelte vi det til en variabel, men du kan også gøre følgende.
de: Also weisen wir das Ergebnis einer Variablen zu.
es: Arriba, lo asignamos a una variable, pero también podrías hacer lo siguiente.
it: Sopra, lo abbiamo assegnato ad una variabile, ma potresti anche fare così.
ja: 上記では変数に代入しましたが、次のこともできます。
pt_br: Acima, nós o atribuímos a uma variável, mas você também pode fazer o seguinte.
ru: Выше мы присвоили его переменной, но можно поступить и следующим образом.
tr: Yukarıda bunu bir değişkene atadık, ancak aşağıdakileri de yapabilirsiniz.
zh_hans: 在上面的例子里，我们将结果赋值给了一个变量，但你也可以像下面这样做。

source: You can assign the return value of a function call if you plan on using it more than once.
cs: Pokud plánujete volání funkce použít více než jednou, můžete jí přiřadit návratovou hodnotu.
da: Du kan tildele returværdien for et funktionskald, hvis du planlægger at bruge det mere end én gang.
de: Du kannst den Rückgabewert eines Funktionsaufrufs zuweisen, wenn du ihn mehr als einmal verwenden möchten.
es: Puedes asignar el valor de retorno de una llamada de función si planeas usarla más de una vez.
it: Puoi assegnare il risultato della funzione ad una variabile se intendi riutilizzarlo successivamente.
ja: 関数呼び出しの戻り値は、複数回使用する予定がある場合は割り当てることができます。
pt: Pode atribuir o valor de retorno de uma chamada de função se planeja usá-lo mais que uma vez.
pt_br: Você pode atribuir o valor de retorno de uma chamada de função se planeja usá-lo mais de uma vez.
ru: Вы можете присвоить значение, возвращённое функцией, в переменную, если хотите использовать его более одного раза.
ta: ஒரு செயல்பாட்டு அழைப்பின் வருவாய் மதிப்பை நீங்கள் ஒன்றுக்கு மேற்பட்ட முறை பயன்படுத்த திட்டமிட்டால் அதை ஒதுக்கலாம்.
tr: Eğer birden fazla kez kullanmayı planlıyorsanız, bir fonksiyon çağrısının dönüş değerini bir değişkene atayabilirsiniz.
uk: Ви можете призначити значення, що повертається виклику функції, якщо ви плануєте використовувати його більше одного разу.
zh_hans: 如果你计划多次使用一个函数的返回值的话，你可以将它赋值给一个变量。
zh_hant: 如果你打算多次使用函式呼叫的回傳值，可以將其指定給變數。

source: A cooler example: lerp()
cs: Lepší příklad: lerp()
da: Et smartere eksempel: lerp()
de: Ein cooleres Beispiel: lerp()
es: Un ejemplo más interesante: lerp()
it: Un esempio più interessante: lerp()
ja: よりクールな例: lerp()
pt: Um exemplo mais fixe: lerp()
pt_br: Um exemplo mais legal: lerp()
ru: Пример покруче: lerp()
ta: ஒரு குளிரான எடுத்துக்காட்டு: லெர்ப் ()
tr: Daha havalı bir örnek: lerp()
uk: Більш крутий приклад: lerp()
zh_hans: 更酷的例子：lerp()函数
zh_hant: 更酷的例子：lerp()

source: The [code]lerp()[/code] function, short for [i]linear interpolate[/i], calculates and returns a weighted average between two values.
da: Funktionen [code]lerp()[/code] er en forkortelse for [i]lineær interpolering[/i], og beregner og returnerer et vægtet gennemsnit mellem to værdier.
de: Die Funktion [code]lerp()[/code], kurz für [i]linear interpolate[/i](lineare Interpolation), berechnet und gibt einen gewichteten Durchschnitt zwischen zwei Werten zurück.
es: La función [code]lerp()[/code] (abreviatura del inglés [i]linear interpolate[/i] que significa "interpolación lineal") calcula y devuelve un promedio ponderado entre dos valores.
it: La funzione [code]lerp()[/code], diminutivo di [i]interpolazione lineare[/i], calcola e riporta la media ponderata tra due valori.
ja: [i]線形補間 (linear interpolate)[/i]の略である [code]lerp()[/code] 関数は、2 つの値の間の加重平均を計算して返します。
pt_br: A função [code]lerp()[/code], abreviação de [i]interpolação linear[/i], calcula e retorna uma média entre dois valores.
ru: Функция [code]lerp()[/code] (сокращение от [i]линейная интерполяция[/i]) вычисляет и возвращает средневзвешенное значение между двумя величинами.
tr: [i]linear interpolate[/i] (doğrusal ara değer hesaplama) ifadesinin kısaltması olan [code]lerp()[/code] fonksiyonu, iki değer arasında ağırlıklı bir ortalama hesaplayıp döndürür.
zh_hans: [code]lerp()[/code] 函数是 [i]linear interpolate[/i] （线性插值）的缩写，计算并返回两个值之间的加权平均值。

source: It takes three arguments: the two values to average and a value between [code]0.0[/code] and [code]1.0[/code] to skew the result.
da: Den kræver tre argumenter: de to værdier, der skal beregnes gennemsnittet af, og en værdi mellem [code]0.0[/code] og [code]1.0[/code] for at skævvride resultatet.
de: Es werden drei Argumente benötigt: die beiden Werte zum Mittelwert und ein Wert zwischen [code]0.0[/code] und [code]1.0[/code], um das Ergebnis zu verzerren.
es: Esta toma tres argumentos: los dos valores que hay que promediar y un valor entre [code]0.0[/code] y [code]1.0[/code] para sesgar el resultado.
it: Questa necessita di tre argomenti: i primi due sono i valori da interpolare e l'ultimo è un valore compreso tra [code]0.0[/code] e [code]1.0[/code] che determina quanto velocemente avviene l'interpolazione.
ja: 平均する 2 つの値と、結果を歪める [code]0.0[/code] と [code]1.0[/code] の間の値の 3 つの引数を取ります。
pt_br: São necessários três argumentos: os dois valores para a média e um valor entre [code]0.0[/code] e [code]1.0[/code] para distorcer o resultado.
ru: Она принимает три аргумента: два значения для усреднения и значение между [code]0.0[/code] и [code]1.0[/code] в качестве смещения результата.
tr: Üç girdi değişkeni alır: arası bulunacak iki değer ve sonuca eğim vermek için [code]0.0[/code] ile [code]1.0[/code] arasında bir değer.
zh_hans: 它需要三个参数：要平均的两个值，和一个 [code]0.0[/code] 和 [code]1.0[/code] 之间的值来偏移结果（和小的值更近还是和大的更近）。

source: In game programming, it's used to animate things moving towards a target with a single line of code.
da: I spilprogrammering bruges den til at animere ting, der bevæger sig mod et mål, med en enkelt linje kode.
de: Es ist eine beliebe Funktion in Spielen, um Dinge mit einer Codezeile zu animieren, die sich auf ein Ziel zubewegen.
es: Es popular en los juegos para animar cosas que se mueven hacia un objetivo con una sola línea de código.
it: Nella programmazione di videogiochi, viene spesso utilizzato per animare cose che si muovono verso un obiettivo con una singola linea di codice.
ja: ゲームプログラミングでは、1行のコードでターゲットに向かって移動するものをアニメーション化するために使用されます。
pt_br: Em programação para jogos, isso é usado para animar coisas que se movem em direção a um alvo com uma única linha de código.
ru: В программировании игр эта функция используется чтобы анимировать движущиеся к цели объекты в одну строчку кода.
tr: Oyun programlamada, bir hedefe doğru hareket eden şeyleri, tek bir kod satırıyla canlandırmak için kullanılır.
zh_hans: 在游戏编程中，用它只需一行代码，就能使物体向一个目标运动起来。

source: Every frame, the code calculates a position somewhere between the turtle and the mouse cursor. The [code]lerp()[/code] function takes care of everything.
da: For hver frame beregner koden en position et sted mellem skildpadden og musemarkøren. Funktionen [code]lerp()[/code] tager sig af alt.
de: In jedem Frame berechnet der Code eine Position irgendwo zwischen der Schildkröte und dem Mauszeiger. Die Funktion [code]lerp()[/code] kümmert sich um alles.
es: En cada fotograma, el código calcula una posición en algún lugar entre la tortuga y el cursor del mouse. La función [code]lerp()[/code] se encarga de todo.
it: Ogni frame, il codice calcola la posizione circa la tartaruga e il cursore del mouse. La funzione [code]lerp()[/code] fa tutto il necessario.
ja: フレームごとに、カメとマウスカーソルの間の位置が計算されます。[code]lerp()[/code]関数がすべてを処理します。
pt_br: A cada frame, o código calcula uma posição em algum lugar entre a tartaruga e o cursor do mouse. A função [code]lerp()[/code] faz isso tudo por ela mesma.
ru: Каждый кадр код вычисляет позицию между черепахой и курсором мыши. Функция [code]lerp()[/code] здесь берёт всю работу на себя.
tr: Kod, her oyun karesinde, kaplumbağa ile fare imleci arasında bir yerde bir konum hesaplar. [code] lerp()[/code] fonksiyonu her şeyi halleder.
zh_hans: 每一帧，代码都会计算出某个小海龟和鼠标光标之间的位置。 [code]lerp()[/code] 函数负责处理所有的过程。

source: It's not the most robust approach for smooth movement, as you'll learn in the future, but it's a helpful function nonetheless.
da: Det er ikke den mest robuste metode til jævn bevægelse, som du vil lære i fremtiden, men det er ikke desto mindre en nyttig funktion.
de: Es ist nicht der robusteste Ansatz für eine reibungslose Bewegung, wie du in Zukunft lernen wirst, aber es ist dennoch eine hilfreiche Funktion.
es: No es el enfoque más robusto para un movimiento suave, como aprenderás en el futuro, pero aún así es una función muy útil.
it: Non è l'approccio perfetto per un movimento fluido, come imparerai in futuro esistono modi migliori, ma è comunque una funzione molto utile.
ja: これは、後で学ぶように、スムーズな動きのための最も堅牢なアプローチではありませんが、それでも便利な機能です。
pt_br: Não é a abordagem mais robusta para movimentos suaves, como você vai aprender no futuro, mas ainda assim é uma função útil.
ru: Это не самый надёжный способ реализации плавного перемещения, как вы убедитесь в будущем, тем не менее, это не делает функцию менее полезной.
tr: İleride öğreneceğiniz gibi, pürüzsüz bir hareket için en sağlam yaklaşım bu değildir, ancak yine de yararlı bir fonksiyondur.
zh_hans: 如果你继续深入学习下去，会发现这并不是实现平滑运动的最强大的方法，但它仍然是一个很有用的函数。

source: Writing a function that returns a value
cs: Vytvoření funkce, která vrací hodnotu
da: At skrive en funktion, der returnerer en værdi
de: Schreiben einer Funktion die einen Wert zurückgibt
es: Escribir una función que devuelva un valor
it: Scrivendo una funzione che ritorna un valore
ja: 値を返す関数の記述
pt: Escrevendo uma função que retorna um valor
pt_br: Escrevendo uma função que retorna um valor
ru: Написание функции, возвращающей значение
ta: ஒரு மதிப்பைத் தரும் ஒரு செயல்பாட்டை எழுதுதல்
tr: Değer döndüren bir fonksiyon yazmak
uk: Написання функції, яка повертає значення
zh_hans: 编写一个有返回值的函数
zh_hant: 編寫一個會回傳值的函式

source: You can make [i]your[/i] functions return values.
da: Du kan få [i]dine[/i] funktioner til at returnere værdier.
de: Du kannst festlegen, dass [i]deine[/i]-Funktionen Werte zurückgeben.
es: Puedes hacer que [i]tus[/i] funciones devuelvan valores.
it: È possibile far sì che le [i]proprie[/i] funzioni restituiscano dei valori.
ja: 関数[i]が[/i]値を返すようにすることができます。
pt_br: Você pode fazer com que [i]suas[/i] funções retornem valores.
ru: Вы можете создать [i]свои[/i] функции, возвращающие значения.
tr: Siz de [i]kendi[/i] fonksiyonlarınızdan değerler döndürebilirsiniz.
zh_hans: 你可以让 [i]你的[/i] 函数也能返回值。

source: To make a function return a value, you use the [code]return[/code] keyword followed by the value in question.
da: For at få en funktion til at returnere en værdi, bruger du nøgleordet [code]return[/code] efterfulgt af den pågældende værdi.
de: Damit eine Funktion einen Wert zurückgibt, verwendest du das Schlüsselwort [code]return[/code] gefolgt von dem betreffenden Wert.
es: Para hacer que una función devuelva un valor, debes utilizar la palabra clave [code]return[/code] seguida del valor en cuestión.
it: Per far sì che una funzione restituisca un valore, si usa la parola chiave [code]return[/code] seguita dal valore in questione.
ja: 関数に値を返させるようにするには、[code]return[/code] キーワードを使用し、その後に対象の値を指定します。
pt_br: Para fazer uma função retornar um valor, você usa a palavra-chave [code]return[/code] seguida do valor em questão.
ru: Чтобы заставить функцию вернуть значение, используйте ключевое слово [code]return[/code], а затем укажите желаемое значение.
tr: Bir fonksiyonun bir değer döndürmesini sağlamak için, [code]return[/code] anahtar kelimesini ve ardından söz konusu değeri kullanırsınız.
zh_hans: 要让函数返回值，请使用 [code]return[/code]（返回） 关键字，后跟要返回的值。

source: In previous lessons, we had characters walking on grids.
da: I tidligere lektioner havde vi karaktere, der gik på gitre.
de: In früheren Lektionen hatten wir Charaktere, die auf einem Koordinatensystem liefen.
es: En las lecciones anteriores, teníamos personajes que caminaban sobre cuadrículas.
it: Nelle lezioni precedenti, i personaggi camminavano su griglie.
ja: 以前のレッスンでは、グリッドの上を歩くキャラクターがいました。
pt_br: Nas lições anteriores, tínhamos personagens andando em grades (ou tabuleiros).
ru: В предыдущих уроках мы работали с персонажами, перемещающимися по сеткам.
tr: Önceki derslerde, ızgaralar üzerinde yürüyen karakterlerimiz vardı.
zh_hans: 在之前的课程中，我们成功让角色能在棋盘网格上行走。

source: And for those practices, you were working directly with cell coordinates.
da: Og i disse øvelser arbejdede du direkte med cellekoordinater.
de: Und für diese Praktiken arbeitetest du direkt mit Zellkoordinaten.
es: Y para esas prácticas, estuviste trabajando directamente con coordenadas de celdas.
it: Per queste pratiche, si lavorava direttamente con le coordinate delle celle.
ja: これらの演習では、セル座標を直接操作していました。
pt_br: E naquelas práticas, você estava trabalhando diretamente com as coordenadas das células.
ru: В тех упражнениях вы работали напрямую с координатами ячеек.
tr: Ve onların alıştırmalarında, doğrudan hücre koordinatlarıyla çalışıyordunuz.
zh_hans: 在那些练习中，你直接使用的是网格本身的单元坐标。
