Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-20-looping-over-arrays.po
Languages: cs, da, de, es, it, ja, pt_br, ru, ta, tr, uk, zh_hant

source: We used the [code]range()[/code] function in combination with [code]for[/code] loops.
cs: Použili jsme funkci [code]range()[/code] v kombinaci s cykly [code]for[/code].
da: Vi brugte funktionen [code]range()[/code] i kombination med [code]for[/code] løkker.
de: Wir haben die Funktion [code]range()[/code] in Kombination mit [code]for[/code]-Schleifen verwendet.
es: Utilizamos la función [code]range()[/code] en combinación con bucles [code]for[/code].
it: Abbiamo usato la funzione [code]range()[/code] in combinazione con i cicli [code]for[/code].
ja: [code]range()[/code] 関数を [code]for[/code] ループと組み合わせて使用しました。
pt_br: Usamos a função [code]range()[/code] em combinação com loops [code]for[/code].
ru: Мы использовали функцию [code]range()[/code] в сочетании с циклами [code]for[/code].
ta: [/குறியீடு] சுழல்களுக்கான [குறியீடு] உடன் [குறியீடு] வரம்பு () [/குறியீடு] செயல்பாட்டைப் பயன்படுத்தினோம்.
tr: [code]range()[/code] fonksiyonunu, [code]for[/code] döngüleri ile birlikte kullanmıştık.
uk: Ми використовували функцію [code]range()[/code] у поєднанні з циклами [code]for[/code].
zh_hant: 我們將 [code]range()[/code] 函式與 [code]for[/code] 迴圈結合使用。

source: The [code]range()[/code] function produced an array that the [code]for[/code] keyword could loop over.
da: [code]range()[/code] funktionen lavede et array, som [code]for[/code] nøgleordet kunne loope hen over.
de: Die Funktion [code]range()[/code] erzeugte ein Array, das mit dem Schlüsselwort [code]for[/code] durchlaufen werden konnte.
es: La función [code]range()[/code] producía una matriz sobre la que la palabra clave [code]for[/code] podía hacer un bucle.
it: La funzione [code]range()[/code] ha prodotto un array che il ciclo [code]for[/code] può utilizzare.
ja: [code]range()[/code] 関数は、[code]for[/code] キーワードがループできる配列を生成しました。
pt_br: A função [code]range()[/code] produziu um array no qual a palavra-chave [code]for[/code] poderia fazer um loop.
ru: Функция [code]range()[/code] создавала массив, элементы которого мы могли перебрать по очереди при помощи ключевого слова [code]for[/code].
ta: [குறியீடு] வரம்பு () [/குறியீடு] செயல்பாடு [/குறியீடு] முக்கிய சொல்லுக்கான [குறியீடு] ஒரு வரிசையை உருவாக்கியது.
tr: [code]range()[/code] fonksiyonu, [code]for[/code] anahtar kelimesinin üzerinde döngü kurabileceği bir dizi üretiyor.
uk: Функція [code]range()[/code] створила масив, який можна було б пройти за ключовим словом [code]for[/code].

source: We can give [code]for[/code] loops [i]any[/i] array, and they will loop over them just the same.
da: Vi kan give [code]for[/code] loops [i]hvilket som helst[/i] array, og de vil loope over dem på samme måde.
de: Wir können [code]for[/code]-Schleifen [i]beliebige[/i] Arrays übergeben, die immer genau so durchlaufen werden.
es: Podemos darles a los bucles [code]for[/code] [i]cualquier[/i] matriz, y estos harán un bucle sobre ella de la misma manera.
it: Possiamo dare ai cicli [code]for[/code] [i]ogni[/i] array ed eseguirà il ciclo come al solito.
ja: [code]for[/code]ループに[i]任意[/i]の配列を与えることができ、それらはそれらを同じようにループします。
pt_br: Podemos fornecer para os loops [code]for[/code] [i]qualquer[/i] array, e eles farão um loop sobre eles da mesma forma.
ru: Мы можем дать циклам [code]for[/code] [i]любой[/i] массив, и они точно так же будут его перебирать.
ta: [/குறியீடு] சுழல்களுக்கு [i] எந்தவொரு [/i] வரிசைக்கும் [குறியீடு] கொடுக்கலாம், மேலும் அவை அவைமீது ஒரே மாதிரியாக இருக்கும்.
tr: [code]for[/code] döngülerine, [i]herhangi bir[/i] dizi verirsek, bunlar üzerinde de aynı şekilde döngü kurulacaktır.
uk: Ми можемо надати циклам [code]for[/code] [i]будь-який[/i] масив, і вони так само циклять їх.

source: Instead of using the [code]range()[/code] function, we could manually write the numbers and get the same result.
da: I stedet for at bruge funktionen [code]range()[/code] kunne vi manuelt skrive tallene og få det samme resultat.
de: Anstatt die Funktion [code]range()[/code] zu verwenden, könnten wir die Zahlen auch manuell vorgeben und damit das gleiche Ergebnis erzielen.
es: En lugar de utilizar la función [code]range()[/code], podríamos escribir manualmente los números y obtener el mismo resultado.
it: Invece di utilizzare la funzione [code]range()[/code], potremmo manualmente scrivere i numeri e ricevere lo stesso risultato.
ja: [code]range()[/code]関数を使用する代わりに、手動で数値を書き込んで同じ結果を得ることができます。
pt_br: Ao invés de usar a função [code]range()[/code], poderíamos escrever manualmente os números e obter o mesmo resultado.
ru: Вместо того чтобы использовать функцию [code]range()[/code], мы можем вручную создать массив чисел и получить тот же результат.
ta: [குறியீடு] வரம்பு () [/குறியீடு] செயல்பாட்டைப் பயன்படுத்துவதற்குப் பதிலாக, எண்களைக் கைமுறையாக எழுதி அதே முடிவைப் பெறலாம்.
tr: [code]range()[/code] fonksiyonunu kullanmak yerine, sayıları elle yazabilir ve aynı sonucu elde edebilirdik.
uk: Замість використання функції [code]range()[/code] ми могли б вручну записати числа й отримати той самий результат.

source: For each element inside the array, the [code]for[/code] loop extracts it, stores it in the temporary variable named [code]number[/code], and executes the loop's code once.
da: For hvert element inde i arrayet, udtrækker [code]for[/code]-løkken det og gemmer det i den midlertidige variabel, der hedder [code]number[/code], og udfører løkkens kode én gang.
de: Für jedes Element innerhalb des Arrays extrahiert die [code]for[/code]-Schleife dieses, speichert es in der temporären Variablen mit dem Namen [code]number[/code] und führt den Code der Schleife einmal aus.
es: Para cada elemento dentro de la matriz, el bucle [code]for[/code] lo extrae, lo almacena en la variable temporal llamada [code]number[/code], y ejecuta el código del bucle una vez.
it: Per ogni elemento dell'array, il ciclo [code]for[/code] li estrae, li conserva in una variabile temporanea chiamata [code]number[/code] ed esegue il codice nel ciclo una volta.
ja: 配列内の各要素について、[code]for[/code]ループはそれを抽出し、[code]number[/code]という名前の一時変数に格納し、ループのコードを一度実行します。
pt_br: Para cada elemento dentro do array, o loop [code]for[/code] o extrai, armazena ele na variável temporária chamada [code]number[/code] e executa o código do loop uma vez.
ru: Для каждого элемента в массиве, цикл [code]for[/code] извлечёт его, сохранит во временной переменной [code]number[/code] и выполнит код цикла один раз.
ta: வரிசையின் ஒவ்வொரு உறுப்புக்கும், [/குறியீடு] லூப்பிற்கான [குறியீடு] அதை பிரித்தெடுத்து, [குறியீடு] எண் [/குறியீடு] என்ற பெயரிடப்பட்ட தற்காலிக மாறியில் சேமித்து, ஒரு முறை லூப்பின் குறியீட்டை இயக்குகிறது.
tr: Bir dizinin içindeki her bir öğe için, [code]for[/code] döngüsü bu öğeyi alır, [code]number[/code] isimli geçici değişkende saklar, ve döngü kodunu bir kez çalıştırır.
uk: Для кожного елемента всередині масиву цикл [code]for[/code] витягує його, зберігає в тимчасовій змінній під назвою [code]number[/code] і виконує код циклу один раз.

source: Inside the loop, you can access the [code]number[/code] variable, which changes on each [i]iteration[/i].
da: Inde i løkken kan du få adgang til [code]number[/code] variablen, som ændrer sig på hver [i]iteration[/i].
de: Innerhalb der Schleife kannst du auf die Variable [code]number[/code] zugreifen, die sich bei jeder [i]Iteration (Wiederholung)[/i] ändert.
es: Dentro del bucle, puedes acceder a la variable [code]number[/code], que cambia en cada [i]iteración[/i].
it: Dentro il ciclo, puoi avere accesso alla variabile [code]number[/code], che cambia ad ogni [i]iterazione[/i].
ja: ループ内では、[i]反復[/i]ごとに変化する [code]number[/code] 変数にアクセスできます。
pt_br: Dentro do loop, você pode acessar a variável [code]number[/code], que muda a cada [i]iteração[/i] (a cada vez que o loop recomeçar).
ru: Внутри цикла вы имеете доступ к переменной [code]number[/code], значение которой меняется каждую [i]итерацию[/i].
ta: வளையத்தின் உள்ளே, நீங்கள் [குறியீடு] எண் [/குறியீடு] மாறியை அணுகலாம், இது ஒவ்வொரு [i] மறு செய்கையிலும் [/i] மாறுகிறது.
tr: Döngünün içinde, her [i]yinelemede[/i] değişen bu [code]number[/code] değişkenine erişebilirsiniz.
uk: Усередині циклу ви можете отримати доступ до змінної [code]number[/code], яка змінюється на кожній [i]ітерації[/i].

source: The code works regardless of the array or where you store it. Often, you will store arrays in variables for easy access.
da: Koden fungerer uanset arrayet eller hvor du gemmer det. Ofte vil du gemme arrays i variabler for nem adgang.
de: Der Code funktioniert unabhängig vom Array oder wo Du ihn speicherst. Häufig werden Arrays in Variablen für einen einfachen Zugriff gespeichert.
es: El código funciona independientemente de la matriz o de dónde la almacenes. A menudo, almacenarás las matrices en variables para tener un fácil acceso a ellas.
it: Il codice opera indipendentemente dall'array o dove lo conservi. Spesso, conserverai gli array in variabili per un più facile accesso.
ja: コードは、配列や格納場所に関係なく機能します。多くの場合、簡単にアクセスできるように配列を変数に格納します。
pt_br: O código funciona independentemente do array ou de onde você o armazena. Frequentemente, você vai armazenar arrays em variáveis para facilitar o acesso a eles.
ru: Код работает независимо от состава массива или места его хранения. Часто вы будете хранить массивы в переменных для упрощения их использования.
ta: வரிசை அல்லது நீங்கள் அதை எங்கு சேமித்து வைத்தாலும் பொருட்படுத்தாமல் குறியீடு செயல்படுகிறது. பெரும்பாலும், நீங்கள் எளிதாக அணுகுவதற்கான மாறிகளில் வரிசைகளை சேமிப்பீர்கள்.
tr: Kod, diziden veya onu nerede sakladığına bakmadan çalışır. Genellikle, kolay erişim için dizileri değişkenlerde saklarsınız.
uk: Код працює незалежно від масиву або місця його зберігання. Часто ви будете зберігати масиви в змінних для легкого доступу.

source: What will this code print?
cs: Co tento kód zobrazí?
da: Hvad vil denne kode udskrive?
de: Was wird dieser Code ausgeben?
es: ¿Qué imprimirá este código?
it: Cosa stamperà questo codice?
ja: このコードは何を表示しますか?
pt_br: O que esse código vai imprimir na tela?
ru: Что выведет этот код?
ta: இந்த குறியீடு என்ன அச்சிடும்?
tr: Bu kod ne yazdıracak?
uk: Що надрукує цей код?
zh_hant: 這段程式碼會印出什麼？

source: [code]var numbers = [0, 1, 2] for number in numbers: print(number) [/code]
ta: [குறியீடு] var எண்கள் = [0, 1, 2] எண்களில் உள்ள எண்ணுக்கு: அச்சிடு (எண்) [/குறியீடு]

source: Compared to previous examples, we store the array in the [code]numbers[/code] variable. Using the [code]numbers[/code] variable in our [code]for[/code] loop allows the computer to access the array of numbers like before.
da: Sammenlignet med tidligere eksempler gemmer vi arrayet i variablen [code]numbers[/code]. Brug af variablen [code]numbers[/code] i vores [code]for[/code]-løkke giver computeren adgang til arrayet af tal som før.
de: Im Vergleich zu früheren Beispielen speichern wir das Array in der Variablen [code]numbers[/code]. Die Verwendung der Variablen [code]numbers[/code] in unserer [code]for[/code]-Schleife ermöglicht es dem Computer, wie zuvor, auf das Zahlenarray zuzugreifen.
es: En comparación con los ejemplos anteriores, almacenamos la matriz en la variable [code]numbers[/code]. Utilizar la variable [code]numbers[/code] en nuestro bucle [code]for[/code] le permite a la computadora acceder a la matriz de números como antes.
it: A confronto con gli esempi precedenti, conserviamo l'array nella variabile [code]numbers[/code]. Usare la variabile [code]numbers[/code] nel nostro ciclo [code]for[/code] consente al computer di accedere all'array di numeri come prima.
ja: 前の例と比較すると、配列を [code]numbers[/code] 変数に格納します。[code]for[/code]ループで[code]numbers[/code]変数を使用すると、コンピューターは以前と同じように数値の配列にアクセスできます。
pt_br: Comparado aos exemplos anteriores, armazenamos o array na variável [code]numbers[/code]. Usar a variável [code]numbers[/code] em nosso loop [code]for[/code] permite que o computador acesse o array de números como antes.
ru: По сравнению с предыдущими примерами, мы храним массив в переменной [code]numbers[/code]. Использование переменной [code]numbers[/code] в цикле [code]for[/code] позволяет компьютеру обращаться к массиву чисел, как и раньше.
ta: முந்தைய எடுத்துக்காட்டுகளுடன் ஒப்பிடும்போது, வரிசையை [குறியீடு] எண்கள் [/குறியீடு] மாறியில் சேமிக்கிறோம். [/குறியீடு] வளையத்திற்கான எங்கள் [குறியீடு] இல் [குறியீடு] எண்கள் [/குறியீடு] மாறியைப் பயன்படுத்துவது கணினியை முன்பு போன்ற எண்களின் வரிசையை அணுக அனுமதிக்கிறது.
tr: Önceki örneklerle karşılaştırırsak, diziyi [code]numbers[/code] değişkeninde saklıyoruz. [code]for[/code] döngümüzde [code]numbers[/code] değişkenini kullanmak, bilgisayarın sayı dizisine daha önce olduğu gibi erişmesini sağlar.
uk: Порівняно з попередніми прикладами, ми зберігаємо масив у змінній [code]numbers[/code]. Використання змінної [code]numbers[/code] у нашому циклі [code]for[/code] дозволяє комп’ютеру отримувати доступ до масиву чисел, як і раніше.

source: We have three numbers in the array: [code]0[/code], [code]1[/code], and [code]2[/code].
da: Vi har tre tal i arrayet: [code]0[/code], [code]1[/code] og [code]2[/code].
de: Wir haben drei Zahlen im Array: [code]0[/code], [code]1[/code] und [code]2[/code].
es: Tenemos tres números en la matriz: [code]0[/code], [code]1[/code] y [code]2[/code].
it: Abbiamo tre numeri in questo array: [code]0[/code], [code]1[/code] e [code]2[/code].
ja: 配列には、[code]0[/code]、[code]1[/code]、および [code]2[/code] の 3 つの数値があります。
pt_br: Temos três números no array: [code]0[/code], [code]1[/code] e [code]2[/code].
ru: В нашем массиве есть три числа: [code]0[/code], [code]1[/code], и [code]2[/code].
ta: வரிசையில் எங்களிடம் மூன்று எண்கள் உள்ளன: [குறியீடு] 0 [/குறியீடு], [குறியீடு] 1 [/குறியீடு] மற்றும் [குறியீடு] 2 [/குறியீடு].
tr: Dizide üç tane sayımız var: [code]0[/code], [code]1[/code], ve [code]2[/code].
uk: У масиві є три числа: [code]0[/code], [code]1[/code] і [code]2[/code].

source: The loop extracts each of them sequentially and assigns it to the [code]number[/code] temporary variable. As the loop processes each number, the output will print [code]0[/code], then [code]1[/code], then [code]2[/code], each on a separate line.
da: Løkken udtrækker hvert af dem sekventielt og tildeler det til den midlertidige variabel [code]number[/code]. Når løkken behandler hvert tal, vil outputtet udskrive [code]0[/code], derefter [code]1[/code] og derefter [code]2[/code], hver på en separat linje.
de: Die Schleife extrahiert jedes Element nacheinander und weist es der temporären Variablen [code]number[/code] zu. Da wir innerhalb der Schleife die Nummer ausgeben, wird die Ausgabe zuerst [code]0[/code], dann [code]1[/code], dann [code]2[/code], jeweils in einer separaten Zeile ausgeben.
es: El bucle extrae cada uno de ellos secuencialmente y lo asigna a la variable temporal [code]number[/code]. A medida que el bucle procesa cada número, la salida imprimirá [code]0[/code], luego [code]1[/code], luego [code]2[/code], cada uno en una línea distinta.
it: Il ciclo estrae ognuno di questi in modo sequenziale e lo assegna alla variabile temporanea [code]number[/code]. Il ciclo procedendo ad ogni numero, risulterà nella stampa di [code]0[/code], poi [code]1[/code], poi [code]2[/code], ognuno in una linea separata.
ja: ループは、それぞれを順番に抽出し、[code]number[/code]一時変数に代入します。ループが各数値を処理すると、出力は [code]0[/code]、次に [code]1[/code]、次に [code]2[/code] をそれぞれ別々の行に出力します。
pt_br: O loop extrai cada um deles sequencialmente e o coloca na variável temporária [code]number[/code]. Como, dentro do loop, imprimimos o número, a saída vai imprimir na tela [code]0[/code], depois [code]1[/code], depois [code]2[/code], cada um em uma linha separada.
ru: Цикл последовательно извлекает каждое из них и присваивает его временной переменной [code]number[/code]. По мере обработки каждого числа, в окне вывода появляются [code]0[/code], затем [code]1[/code], затем [code]2[/code], каждое на отдельной линии.
ta: லூப் அவை ஒவ்வொன்றையும் தொடர்ச்சியாக பிரித்தெடுக்கிறது மற்றும் அதை [குறியீடு] எண் [/குறியீடு] தற்காலிக மாறிக்கு ஒதுக்குகிறது. லூப் ஒவ்வொரு எண்ணையும் செயலாக்கும்போது, வெளியீடு [குறியீடு] 0 [/குறியீடு], பின்னர் [குறியீடு] 1 [/குறியீடு], பின்னர் [குறியீடு] 2 [/குறியீடு], ஒவ்வொன்றும் ஒரு தனி வரியில் அச்சிடும்.
tr: Döngü bunların her birini sırayla çıkarır ve [code]number[/code] geçici değişkenine atar. Döngü her bir sayıyı işledikçe, çıktıya, her biri ayrı bir satırda olacak şekilde, ilk başta [code]0[/code], sonra [code]1[/code], ve en son [code]2[/code] yazdırılır.
uk: Цикл послідовно витягує кожне з них і призначає його тимчасовій змінній [code]number[/code]. Коли цикл обробляє кожне число, на виході виводиться [code]0[/code], потім [code]1[/code], потім [code]2[/code], кожен в окремому рядку.

source: 0, 1, and 2
cs: 0, 1 a 2
da: 0, 1, og 2
de: 0, 1 und 2
es: 0, 1 y 2
it: 0, 1 e 2
ja: 0、1、および 2
pt_br: 0, 1, e 2
ru: 0, 1, и 2
ta: 0, 1, மற்றும் 2
tr: 0, 1 ve 2
uk: 0, 1, і 2
zh_hant: 0, 1, 和 2

source: 1, 2, and 3
cs: 1, 2 a 3
da: 1, 2, og 3
de: 1, 2 und 3
es: 1, 2 y 3
it: 1, 2 e 3
ja: 0、1、および 2
pt_br: 1, 2, e 3
ru: 1, 2, и 3
ta: 1, 2, மற்றும் 3
tr: 1, 2 ve 3
uk: 1, 2, і 3
zh_hant: 1, 2, 和 3

source: 0, 0, and 0
cs: 0, 0 a 0
da: 0, 0, og 0
de: 0, 0 und 0
es: 0, 0 y 0
it: 0, 0 e 0
ja: 0、0、および 0
pt_br: 0, 0, e 0
ru: 0, 0, и 0
ta: 0, 0, மற்றும் 0
tr: 0, 0 ve 0
uk: 0, 0, і 0
zh_hant: 0, 0, 和 0

source: Making the turtle walk, with a loop
cs: Chůze želvy se smyčkou
da: Få skildpadden til at gå, med en løkke
de: Die Schildkröte mit einer Schleife laufen lassen
es: Hacer caminar a la tortuga, con un bucle
it: Facendo camminare la tartaruga, con un ciclo
ja: カメを歩かせる、ループで
pt_br: Fazendo a tartaruga se mover, com um loop
ru: Заставляем черепаху ходить, при помощи цикла
ta: ஆமை நடைப்பயணத்தை, ஒரு வளையத்துடன்
tr: Kaplumbağayı, bir döngü kullanarak yürütmek
uk: Змусити черепаху ходити, петлею
zh_hant: 使用迴圈讓烏龜移動

source: In the previous lesson, you made a turtle walk along a path by writing [code]Vector2[/code] coordinates in an array.
cs: V předchozí lekci jste vytvořili želvu, která se prochází po cestě tak, že jste do pole zapsali souřadnice [code]Vector2[/code].
da: I den forrige lektion fik du en skildpadde til at gå langs en sti ved at skrive [code]Vector2[/code] koordinater i et array.
de: In der vorherigen Lektion hast Du eine Schildkröte auf einem Pfad spazieren lassen, indem Du [code]Vector2[/code]-Koordinaten in ein Array geschrieben hast.
es: En la lección anterior, hiciste que una tortuga recorriera un camino escribiendo coordenadas [code]Vector2[/code] en una matriz.
it: Nella lezione precedente, hai fatto camminare la tartaruga lungo un percorso scrivendo delle coordinate [code]Vector2[/code] in un array.
ja: 前のレッスンでは、配列に [code]Vector2[/code] 座標を記述して、カメがパスに沿って歩くようにしました。
pt_br: Na lição anterior, você fez uma tartaruga andar por um caminho escrevendo as coordenadas [code]Vector2[/code] em um array.
ru: В предыдущем уроке вы заставили черепаху двигаться по пути, при помощи написания массива координат типа [code]Vector2[/code].
ta: முந்தைய பாடத்தில், ஒரு வரிசையில் [குறியீடு] வெக்டர் 2 [/குறியீடு] ஆயங்களை எழுதுவதன் மூலம் ஒரு பாதையில் ஆமை நடப்பதை நீங்கள் செய்தீர்கள்.
tr: Bir önceki derste, [code]Vector2[/code] konumlarını bir diziye yazarak, bir kaplumbağanın bir yol boyunca yürümesini sağladınız.
uk: У попередньому уроці ви змусили черепаху пройти по доріжці, записавши координати [code]Vector2[/code] у масиві.
zh_hant: 在前面的課程中，你透過在陣列中寫入 [code]Vector2[/code] 座標，使烏龜沿著路徑移動。

source: It's a [code]for[/code] loop that makes the turtle walk along the path.
da: Det er en [code]for[/code]-løkke, der får skildpadden til at gå langs stien.
de: Hier ist eine [code]for[/code]-Schleife, welche die Schildkröte den Weg entlang gehen lässt.
es: Es un bucle [code]for[/code] que hace que la tortuga camine por la trayectoria.
it: Quello che fa camminare la tartaruga lungo il percorso è il ciclo [code]for[/code].
ja: これは、カメをパスに沿って歩かせる [code]for[/code] ループです。
pt_br: É um loop [code]for[/code] que faz a tartaruga andar pelo caminho.
ru: Именно цикл [code]for[/code] позволяет черепахе двигаться по пути.
ta: இது [/குறியீடு] வளையத்திற்கான [குறியீடு], இது ஆமை பாதையில் நடக்க வைக்கிறது.
tr: Kaplumbağanın yol boyunca yürümesini sağlayan, bir [code]for[/code] döngüsüdür.
uk: Це цикл [code]for[/code], який змушує черепаху йти стежкою.

source: The loop works like this: for each coordinate in the array, it moves the turtle once to that cell.
da: Løkken fungerer sådan her: for hver koordinat i arrayet flytter den skildpadden én gang til den celle.
de: Die Schleife funktioniert folgendermaßen: Für jede Koordinate im Array bewegt sich die Schildkröte einmal zu dieser Zelle.
es: El bucle funciona así: por cada coordenada de la matriz, este mueve la tortuga una vez hacia esa celda.
it: Il ciclo funziona così: per ogni coordinata nell'array, muove la tartaruga una volta verso quella cella.
ja: ループは次のように機能します。配列内の座標ごとに、カメをそのセルに一度移動します。
pt_br: O loop funciona assim: para cada coordenada no array, ele move a tartaruga uma vez para aquela célula.
ru: Цикл работает так: для каждой координаты в массиве он передвигает черепаху в ячейку, соответствующую этой координате.
ta: லூப் இப்படி செயல்படுகிறது: வரிசையில் உள்ள ஒவ்வொரு ஒருங்கிணைப்புக்கும், அது ஆமை ஒரு முறை அந்த கலத்திற்கு நகர்த்துகிறது.
tr: Döngü şu şekilde çalışır: dizideki her konum için, kaplumbağayı o hücreye taşır.
uk: Цикл працює так: для кожної координати в масиві він переміщує черепаху один раз до цієї комірки.

source: It's the same principle with unit selection.
cs: Stejný princip platí i pro výběr jednotek.
da: Det er det samme princip med enhedsvalg.
de: Es ist das gleiche Prinzip bei der Einheitenauswahl.
es: Es el mismo principio con la selección de unidades.
it: Lo stesso principio si applica per la selezione di unità.
ja: ユニット選択も同じ原理です。
pt_br: É o mesmo princípio com a seleção de unidades.
ru: Тот же принцип использовался при выборе юнитов.
ta: யூனிட் தேர்வுடன் அதே கொள்கை இது.
tr: Birimlerin seçiminde de aynı ilke geçerli.
uk: Той же принцип і з вибором одиниць.
zh_hant: 這與選取單位的原理相同。

source: For each coordinate in an array named [code]selected_units[/code], we check if there is a unit in that cell. If so, we select it.
da: For hver koordinat i array'et med navnet [code]selected_units[/code] kontrollerer vi, om der er en enhed i den celle. Hvis det er tilfældet, vælger vi den.
de: Für jede Koordinate in einem Array mit dem Namen [code]selected_units[/code] überprüfen wir, ob sich in dieser Zelle eine Einheit befindet. Wenn ja, wählen wir sie aus.
es: Para cada coordenada en una matriz llamada [code]selected_units[/code], comprobamos si hay una unidad en esa celda. Si es así, la seleccionamos.
it: Per ogni coordinata nell'array chiamato [code]selected_units[/code], controlliamo se c'è un'unità in quella cella. Se è così, la selezioniamo.
ja: [code]selected_units[/code] という名前の配列の各座標について、そのセルにユニットがあるかどうかを確認します。もしそうなら、それを選択します。
pt_br: Para cada coordenada em um array chamado [code]selected_units[/code], verificamos se existe uma unidade naquela célula. Se sim, selecionamos ela.
ru: Для каждой координаты в массиве [code]cells[/code], мы проверяем, есть ли в этой ячейке юнит, если да — мы выбираем его.
ta: [குறியீடு] தேர்ந்தெடுக்கப்பட்ட_யூனிட்ச் [/குறியீடு] என்ற வரிசையில் உள்ள ஒவ்வொரு ஒருங்கிணைப்புக்கும், அந்த கலத்தில் ஒரு அலகு இருக்கிறதா என்று சரிபார்க்கிறோம். அப்படியானால், நாங்கள் அதைத் தேர்ந்தெடுப்போம்.
tr: [code]selected_units[/code] (seçili_birimler) adlı dizideki her konum için, o hücrede bir birimin olup olmadığını kontrol ederiz. Eğer varsa, onu seçeriz.
uk: Для кожної координати в масиві з назвою [code]selected_units[/code] ми перевіряємо, чи є одиниця в цій клітинці. Якщо так, ми вибираємо його.
