Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-16-2d-vectors.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: The [code]x[/code] and [code]y[/code] sub-variables of the robot's [code]scale[/code] need to be [code]1.0[/code].
cs: Podproměné [code]x[/code] a [code]y[/code] měřítka [code]scale[/code] robota musí být [code]1.0[/code].
da: Undervariablerne [code]x[/code] og [code]y[/code] for robottens [code]scale[/code] skal være [code]1.0[/code].
de: Die Untervariablen [code]x[/code] und [code]y[/code] der [code]Skalierung[/code] des Roboters müssen [code]1.0[/code] sein.
es: Las subvariables [code]x[/code] y [code]y[/code] de la [code]scale[/code] del robot deben ser [code]1.0[/code].
fr: Les sous-variables [code]x[/code] et [code]y[/code] de la [code]scale[/code] du robot doivent être [code]1.0[/code].
ja: ロボットの [code]scale[/code] の [code]x[/code] と [code]y[/code] サブ変数は [code]1.0[/code] である必要があります。
pt: As sub-variáveis [code]x[/code] e [code]y[/code] da [code]scale[/code] do robô precisam ser [code]1.0[/code].
tr: Robotun [code]scale[/code] değişkeninin [code] x[/code] ve [code]y[/code] alt-değişkenlerinin [code]1.0[/code] olması gerekir.
uk: Підзмінні [code]x[/code] і [code]y[/code] [code]шкали[/code] робота мають бути [code]1.0[/code].

source: The robot's [code]position[/code] needs to be [code]Vector2(0, 0)[/code].
cs: Poloha robota [code]position[/code] musí být [code]Vector2(0, 0)[/code].
da: Robottens [code]position[/code] skal være [code]Vector2(0, 0)[/code].
de: Die [code]Position[/code] des Roboters muss [code]Vector2(0, 0)[/code] sein.
es: La [code]position[/code] del robot debe ser [code]Vector2(0, 0)[/code].
fr: La [code]position[/code] du robot doit être [code]Vector2(0, 0)[/code].
ja: ロボットの [code]position[/code] は [code]Vector2(0, 0)[/code] である必要があります。
pt: A [code]position[/code] do robô precisa ser [code]Vector2(0, 0)[/code].
tr: Robotun [code]position[/code] değerinin, [code] Vector2(0, 0)[/code] olması gerekir.
uk: [code]Позиція[/code] робота має бути [code]Вектор2(0, 0)[/code].

source: As in the previous practice, make sure to use vectors when dealing with scale and position.
cs: Stejně jako v předchozím cvičení se ujistěte, že používáte vektory při práci s měřítkem a polohou.
da: Som i den foregående øvelse skal du sørge for at bruge vektorer, når du beskæftiger dig med skala og position.
de: Achte wie in der vorherigen Übung darauf, Vektoren zu verwenden, wenn Du dich mit Skalierung und Position befasst.
es: Al igual que en la práctica anterior, asegúrate de utilizar vectores cuando trates con la escala y la posición.
fr: Comme dans l'exercice précédent, assurez-vous d'utiliser des vecteurs lorsque vous travaillez avec l'échelle et la position.
ja: 前の演習と同様に、スケールと位置を扱うときは必ずベクトルを使用してください。
pt: Assim como na prática anterior, certifique-se de usar vetores ao lidar com escala e posição.
tr: Önceki uygulamada olduğu gibi, ölçek ve konum ile uğraşırken vektörleri kullandığınızdan emin olun.
uk: Як і в попередній практиці, обов’язково використовуйте вектори, коли маєте справу з масштабом і положенням.

source: Perhaps increasing the scale every level was a bad idea! Let's restore the robot to the correct size.
cs: Možná, že zvyšování měřítka na každé úrovni byl špatný nápad! Vraťme robotovi správnou velikost.
da: Måske var det en dårlig idé at øge skalaen for hvert niveau! Lad os gendanne robotten til den korrekte størrelse.
de: Vielleicht war es eine schlechte Idee, die Skalierung auf jeder Ebene zu erhöhen! Lass uns den Roboter auf die richtige Größe zurücksetzen.
es: ¡Quizás aumentar la escala en cada nivel fue una mala idea! Restituyamos el robot al tamaño correcto.
fr: Augmenter l'échelle à chaque niveau était peut-être une mauvaise idée ! Remettons le robot à la bonne taille.
it: Forse aumentare la grandezza ad ogni livello è stata una pessima idea! Ridiamo al robot la corretta grandezza.
ja: おそらく、レベルごとにスケールを上げるのは悪い考えでした!ロボットを正しいサイズに戻しましょう。
nl: Misschien was het een slecht idee om de schaal met elk niveau te vergroten! Laten we de robot terugbrengen naar de juiste grootte.
pt: Talvez aumentar a escala a cada nível tenha sido uma ideia ruim! Vamos fazer o robô voltar ao tamanho correto.
pt_br: Talvez aumentar a escala a cada nível tenha sido uma ideia ruim! Vamos fazer o robô voltar para o tamanho correto.
ru: Кажется, увеличение размера при каждом повышении уровня было плохой идеей! Давайте вернём роботу правильный размер.
ta: ஒவ்வொரு மட்டத்திலும் அளவை அதிகரிப்பது ஒரு மோசமான யோசனையாக இருக்கலாம்! ரோபோவை சரியான அளவிற்கு மீட்டெடுப்போம்.
tr: Belki de ölçeği her seviye atlamada artırmak kötü bir fikirdi! Robotu doğru boyutuna geri getirelim.
uk: Можливо, збільшувати масштаб кожного рівня було поганою ідеєю! Давайте відновимо робота до потрібного розміру.
zh_hans: 也许每次升级都变大是个坏主意！让我们将机器人恢复到正确的大小。
zh_hant: 也許每次升級都增加縮放比例並不是個好主意！讓我們把機器人恢復到正確的大小。

source: 2D Vectors
cs: 2D vektory
da: 2D Vektore
de: 2D-Vektoren
es: Vectores 2D
fr: Vecteurs 2D
it: Vettori 2D
ja: 2D ベクトル
nl: 2D Vectoren
pt: Vetores 2D
pt_br: Vetores 2D
ru: 2D векторы
ta: 2 டி திசையன்கள்
tr: 2B Vektörler
uk: 2D вектори
zh_hans: 二维向量
zh_hant: 二維向量(2D Vectors)

source: position -= Vector2(50, 0)
da: position -= Vektor2(50, 0)
ta: நிலை -= திசையன் 2 (50, 0)

source: Suppose we want to increase the size of the robot when it levels up. As you may recall, we do this by using the following code.
it: Ipotizziamo di voler aumentare la grandezza del nostro robot quando sale di livello. Come puoi ricordare, possiamo fare questo attraverso questo codice.
nl: Stel dat we de robot groter willen maken wanneer hij een niveau stijgt. Zoals je misschien nog weet, doen we dat met de volgende code.
pt_br: Vamos supor que queremos aumentar o tamanho do robô quando ele subir de nível. Podemos fazer isso usando o código a seguir.
ru: Допустим, мы хотим, чтобы при получении нового уровня робот увеличивался в размерах. Как вы помните, мы можем достичь этого следующим кодом.
ta: ரோபோவின் அளவை அதிகரிக்க விரும்புகிறோம் என்று வைத்துக்கொள்வோம். நீங்கள் நினைவு கூர்ந்தபடி, பின்வரும் குறியீட்டைப் பயன்படுத்தி இதைச் செய்கிறோம்.
zh_hans: 假设我们想在机器人升级的时候让它变大。 可能你还记得前面，我们用过以下代码来实现这个。
zh_hant: 假設我們希望在機器人升級時增加其大小。 如你所記得的，我們可以使用以下程式碼來實現。

source: As we talked about in lesson 7, the [code]scale[/code] variable has two sub-variables to it: [code]x[/code] and [code]y[/code]. This is because [code]scale[/code] is a [code]Vector2[/code], which stands for two-dimensional vector. A [code]Vector2[/code] represents 2D coordinates.
it: Come abbiamo già detto nella lezione 7, la variabile [code]scale[/code] ha due sotto-variabili: [code]x[/code] e [code]y[/code]. Questo è perché [code]scale[/code] è un [code]Vector2[/code], che sta per vettore bidimensionale. Un [code]Vector2[/code] rappresenta delle coordinate 2D.
nl: Zoals we in les 7 hebben besproken, heeft de variabele [code]scale[/code] twee deelvariabelen: [code]x[/code] en [code]y[/code]. Dit komt doordat [code]scale[/code] een [code]Vector2[/code] is, wat staat voor tweedimensionale vector. Een [code]Vector2[/code] vertegenwoordigt 2D-coördinaten.
pt_br: Como falamos na lição 7, a variável [code]scale[/code] tem duas sub-variáveis: [code]x[/code] e [code]y[/code]. Isso ocorre porque [code]scale[/code] é um [code]Vector2[/code], que significa vetor bidimensional. Um [code]Vector2[/code] representa coordenadas 2D.
ru: Как мы сказали в уроке 7, переменная [code]scale[/code] имеет две вложенные переменные: [code]x[/code] и [code]y[/code]. Всё потому что [code]scale[/code] — это двумерный вектор ([code]Vector2[/code]). [code]Vector2[/code] представляет двумерные координаты.
ta: பாடம் 7 இல் நாங்கள் பேசியபடி, [குறியீடு] அளவு [/குறியீடு] மாறியில் இரண்டு துணை மாறிகள் உள்ளன: [குறியீடு] ஃச் [/குறியீடு] மற்றும் [குறியீடு] ஒய் [/குறியீடு]. ஏனென்றால், [குறியீடு] அளவுகோல் [/குறியீடு] என்பது ஒரு [குறியீடு] திசையன் 2 [/குறியீடு] ஆகும், இது இரு பரிமாண திசையனைக் குறிக்கிறது. ஒரு [குறியீடு] வெக்டர் 2 [/குறியீடு] 2 டி ஆயத்தொகுப்புகளைக் குறிக்கிறது.
zh_hans: 正如第 7 课中谈到的，变量[code]scale[/code] 有两个子变量：[code]x[/code] 和 [code]y[/code]。 因为[code]scale[/code]是一个[code]Vector2[/code]，代表二维向量（2D Vector）。 [code]Vector2[/code] 表示一个二维坐标。
zh_hant: 正如我們在第 7 課中討論的，[code]scale[/code] 變數包含兩個子變數：[code]x[/code] 和 [code]y[/code]。 這是因為 [code]scale[/code] 是一個 [code]Vector2[/code]，代表二維向量。[code]Vector2[/code] 用於表示 2D 座標。

source: A vector, in physics, is a quantity with a magnitude and a direction. For example, a force applied to some object, the velocity (speed and direction) of a character, and so on. We often represent this quantity with an arrow. In Godot, 2D vectors are a common value type named [code]Vector2[/code], Unlike plain numbers, they store [i]two[/i] decimal numbers: one for the X coordinate and one for the Y coordinate.
it: Un vettore, in fisica, è una quantità con un'intensità e una direzione. Per esempio, una forza applicata ad un oggetto, la velocità (velocità e direzione) di un personaggio e così via. Spesso rappresentiamo questa quantità con una freccia. In Godot, i vettori 2D sono una tipologia di valore molto comune e vengono chiamati [code]Vector2[/code], Al contrario dei numeri interi, questi conservano [i]due[/i] valori decimali: uno per la coordinata X e l'altro per la coordinata Y.
nl: In de natuurkunde is een vector een grootheid met een grootte en een richting. Bijvoorbeeld een kracht uitgeoefend op een voorwerp, de snelheid (inclusief richting) van een personage, enzovoort. We geven deze grootheid vaak weer met een pijl. In Godot zijn 2D vectoren een veelvoorkomend type met de naam [code]Vector2[/code], In tegenstelling tot gewone getallen, bevatten ze [i]twee[/i] kommagetallen: één voor de X-coördinaat en één voor de Y-coördinaat.
pt_br: Um vetor, em física, é uma quantidade com uma magnitude (tamanho) e uma direção. Por exemplo, um vetor pode representar uma força aplicada a algum objeto, a velocidade (quantidade de deslocamento do objeto e a direção) de um personagem e assim por diante. Muitas vezes representamos essa quantidade com uma seta. Na Godot, vetores 2D são um tipo de valor comum chamado [code]Vector2[/code], Ao contrário de números simples, os vetores armazenam [i]dois[/i] números decimais: um para a coordenada X e outro para a coordenada Y.
ru: Вектор, в физике, — это величина, имеющая размер и направление. Например, сила, приложенная к какому-либо объекту, скорость и направление персонажа и так далее. Мы часто изображаем эту величину стрелкой. В Godot 2D векторы представлены базовым типом [code]Vector2[/code]. В отличие от обычных чисел, они хранят [i]две[/i] десятичных дроби: одну для координаты X, другую для координаты Y.
ta: ஒரு திசையன், இயற்பியலில், ஒரு அளவு மற்றும் திசையைக் கொண்ட ஒரு அளவு. எடுத்துக்காட்டாக, ஒரு பாத்திரத்தின் விரைவு (வேகம் மற்றும் திசை) மற்றும் பலவற்றிற்கு பயன்படுத்தப்படும் ஒரு சக்தி. இந்த அளவை ஒரு அம்புடன் நாங்கள் அடிக்கடி பிரதிநிதித்துவப்படுத்துகிறோம். கோடோட்டில், 2 டி திசையன்கள் [குறியீடு] வெக்டர் 2 [/குறியீடு] என்ற பொதுவான மதிப்பு வகை, எளிய எண்களைப் போலன்றி, அவை [i] இரண்டு [/i] தசம எண்களை சேமிக்கின்றன: ஃச் ஒருங்கிணைப்புக்கு ஒன்று மற்றும் ஒய் ஒருங்கிணைப்புக்கு ஒன்று.
zh_hans: 在物理学中，向量是具有大小和方向的量。例如，施加到某个对象上的力、角色的速度（速度大小和速度方向）等等。 我们常用一个箭头表示向量。 在 Godot 中，二维向量是一种常见的值类型，名为 [code]Vector2[/code]， 与普通数字不同，它存储 [i] 两个 [/i] 小数：一个用于 X 坐标，一个用于 Y 坐标。
zh_hant: 在物理學中，向量是一種具有大小和方向的量。例如，施加在物體上的力、角色的速度（速率與方向）等。 我們通常用箭頭來表示這種量。 在 Godot 中，2D 向量是一種常見的數值類型，稱為 [code]Vector2[/code]。 與單純的數字不同，[code]Vector2[/code] 儲存[b]兩個[/b]小數：一個代表 X 座標，另一個代表 Y 座標。

source: Vectors are [i]essential[/i] in video games. They allow you to represent a character's movement speed and direction, calculate the distance to a target, and more, with little code. Take this turtle AI below. You've probably seen games where enemies move like this. This is done with just seven lines of pure vector calculation code. The code is a bit too difficult for now, so we'll spare you the details, but this turtle gives you a glimpse of what 2D vectors can do for you and your game projects.
it: I vettori sono [i]essenziali[/i] nei videogiochi. Ci permettono di rappresentare la velocità e la direzione di un personaggio in movimento, calcolare la distanza da un bersaglio e molto altro, con poco codice. Prendi come esempio la IA della tartaruga qua sotto. Hai probabilmente visto giochi in cui i nemici si muovono così. Questo è fatto con solo sei righe di codice di puri calcoli di vettori. Il codice è un po' troppo difficile per ora, quindi ti risparmieremo i dettagli, ma questa tartaruga ci dà uno squarcio di cosa i vettori 2D possono fare nel tuo progetto videoludico.
nl: Vectoren zijn [i]essentieel[/i] in videogames. Ze stellen je in staat om de bewegingssnelheid en -richting van een personage weer te geven, de afstand tot een doelwit te berekenen en nog veel meer, met weinig code. Neem de AI van deze schildpad hieronder. Je hebt vast wel eens spellen gezien waarin vijanden op deze manier bewegen. Dit is gedaan met slechts zeven regels pure vectorrekeningscode. De code is een beetje te moeilijk voor nu, dus we zullen je de details besparen, maar deze schildpad geeft je een indruk van wat 2D vectoren kunnen betekenen voor jou en je spelprojecten.
pt_br: Vetores são [i]essenciais[/i] em jogos. Eles permitem que você represente a velocidade e direção do movimento de um personagem, calcule a distância até um alvo e muito mais, com pouca programação. Veja essa I.A da tartaruga abaixo. Você provavelmente já viu jogos em que os inimigos se movem assim. Isso é feito com apenas sete linhas de código de cálculo vetorial puro. O código é um pouco difícil por enquanto, então vamos poupar os detalhes, mas essa tartaruga já consegue te dar uma ideia do que os vetores 2D podem fazer por você e seus projetos de jogo.
ru: Векторы [i]необходимы[/i] в видеоиграх. Они позволяют отображать скорость и направление движения персонажа, вычислять расстояние до цели и многое другое с помощью небольшого количества кода. Возьмем, к примеру, ИИ черепахи. Вы наверняка видели игры, в которых враги двигаются подобным образом. Это сделано с помощью всего семи строк кода чистых векторных вычислений. Этот код немного сложен для вас сейчас, поэтому мы не будем описывать его подробно, но при помощи этого примера мы хотим дать вам представление о том, что 2D-векторы могут дать вам и вашим игровым проектам.
ta: வீடியோ கேம்களில் திசையன்கள் [i] அத்தியாவசியமானவை [/i]. ஒரு கதாபாத்திரத்தின் இயக்க விரைவு மற்றும் திசையை குறிக்க, இலக்குக்கான தூரத்தை கணக்கிடவும், மேலும் பல குறியீட்டைக் கொண்டிருக்கவும் அவை உங்களை அனுமதிக்கின்றன. இந்த ஆமை AI ஐ கீழே எடுத்துக் கொள்ளுங்கள். எதிரிகள் இப்படி நகரும் விளையாட்டுகளை நீங்கள் பார்த்திருக்கலாம். தூய திசையன் கணக்கீட்டு குறியீட்டின் ஏழு வரிகளுடன் இது செய்யப்படுகிறது. குறியீடு இப்போது சற்று கடினம், எனவே நாங்கள் உங்களுக்கு விவரங்களை விட்டுவிடுவோம், ஆனால் இந்த ஆமை உங்களுக்கும் உங்கள் விளையாட்டு திட்டங்களுக்கும் 2 டி திசையன்கள் என்ன செய்ய முடியும் என்பதைப் பற்றிய ஒரு காட்சியை உங்களுக்கு வழங்குகிறது.
zh_hans: 向量在电子游戏中是[i]必不可少的[/i]。 它可以用少量代码表示出角色的移动速度、方向，计算到目标的距离等等。 以下面这个海龟的 AI 为例。可能你在一些游戏中看到过像这样移动的敌人。 只需 7 行纯矢量计算代码即可实现此操作。 对现在来说这个代码有点太难了，所以我们不会详细说明，但是这个海龟示例能让你大概明白，对你和你的项目来说，二维向量有多大的作用。
zh_hant: 向量在電子遊戲中是[b]不可或缺[/b]的。 它們讓你能夠用簡單的程式碼表示角色的移動速度與方向、計算與目標的距離等等。 看看下面這隻烏龜的 AI。你可能在遊戲中見過敵人以類似方式移動。 這種移動方式只需要七行純向量運算的程式碼即可實現。 這段程式碼現在可能還有點難，所以我們先不細講，不過這隻烏龜可以讓你初步了解 2D 向量在遊戲開發中的應用。

source: Notice how we use parentheses and two arguments inside parentheses, just like other function calls. We call this a [i]constructor function call[/i]. You can think of it as a special kind of function that creates a particular type of value. The code [code]Vector2(0.2, 0.2)[/code] constructs a new [code]Vector2[/code] value with its [code]x[/code] set to [code]0.2[/code] and its [code]y[/code] set to [code]0.2[/code], respectively.
it: Nota che usiamo le parentesi e due argomenti all'interno di esse, così come le altre chiamate di funzioni. Chiamiamo questo una [i]chiamata della funzione costruttore[/i]. Puoi pensarla come un particolare tipo di funzione che crea un particolare tipo di valore. Il codice [code]Vector2(0.2, 0.2)[/code] costruisce un nuovo valore [code]Vector2[/code] con la sua [code]x[/code] impostata a [code]0.2[/code] e la sua [code]y[/code] impostata a [code]0.2[/code], rispettivamente.
nl: Merk op dat we haakjes en twee argumenten tussen de haakjes gebruiken, net als bij andere functieaanroepen. We noemen dit een [i]constructorfunctieaanroep[/i]. Je kunt het zien als een speciaal soort functie die een bepaald type waarde creëert. De code [code]Vector2(0.2, 0.2)[/code] bouwt een nieuwe [code]Vector2[/code]-waarde met haar [code]x[/code] ingesteld op [code]0.2[/code] en haar [code]y[/code] ingesteld op [code]0.2[/code].
pt_br: Observe como usamos parênteses e dois argumentos dentro dos parênteses, assim como outras chamadas de função. Chamamos isso de [i]chamada de função de construtor[/i]. Você pode pensar nisso como um tipo especial de função que cria um tipo específico de valor. O código [code]Vector2(0.2, 0.2)[/code] constrói um novo valor de [code]Vector2[/code] com seu [code]x[/code] definido como [code]0.2[/code] e seu [code]y[/code] definido como [code]0.2[/code], respectivamente.
ru: Обратите внимание, что мы используем два аргумента внутри круглых скобок, точно так же, как при вызове других функций. Мы называем это [i]вызовом функции-конструктора[/i]. Вы можете думать о ней, как о специальной разновидности функции, создающей значение определённого типа. Инструкция [code]Vector2(0.2, 0.2)[/code] создаёт новый [code]Vector2[/code], имеющий [code]x[/code], установленный в [code]0.2[/code] и [code]y[/code], установленный в [code]0.2[/code], соответственно.
ta: மற்ற செயல்பாட்டு அழைப்புகளைப் போலவே, அடைப்புக்குறிக்குள் அடைப்புக்குறிகளையும் இரண்டு வாதங்களையும் எவ்வாறு பயன்படுத்துகிறோம் என்பதைக் கவனியுங்கள். இதை நாங்கள் ஒரு [i] கட்டமைப்பாளர் செயல்பாட்டு அழைப்பு [/i] என்று அழைக்கிறோம். ஒரு குறிப்பிட்ட வகை மதிப்பை உருவாக்கும் ஒரு சிறப்பு வகையான செயல்பாடாக இதை நீங்கள் நினைக்கலாம். குறியீடு [குறியீடு] வெக்டர் 2 (0.2, 0.2) [/குறியீடு] அதன் [குறியீடு] ஃச் [/குறியீடு] உடன் [குறியீடு] 0.2 [/குறியீடு] மற்றும் அதன் [[குறியீடு] உடன் புதிய [குறியீடு] திசையன் 2 [/குறியீடு] மதிப்பை உருவாக்குகிறது [ குறியீடு] ஒய் [/குறியீடு] முறையே [குறியீடு] 0.2 [/குறியீடு] என அமைக்கவும்.
zh_hans: 注意是如何使用括号和括号内的两个参数的，就像调用其他的函数一样。 我们称之为[i]调用构造函数[/i]。你可以将其视为创建特定类型值的一种特殊函数。 代码 [code]Vector2(0.2, 0.2)[/code] 构造了一个新的 [code]Vector2[/code] 值，其 [code]x[/code] 设为 [code]0.2[/code] ， [code]y[/code] 设为 [code]0.2[/code]。
zh_hant: 請注意，我們使用括號，並在括號內提供兩個參數，就像其他函式呼叫一樣。 我們稱這種方式為[b]建構(constructor)函式呼叫[/b]。你可以把它想像成一種特殊的函式，用來建立特定類型的數值。 程式碼 [code]Vector2(0.2, 0.2)[/code] 會建立一個新的 [code]Vector2[/code] 值，並將其 [code]x[/code] 設為 [code]0.2[/code]，[code]y[/code] 也設為 [code]0.2[/code]。

source: [code]position -= Vector2(50, 0)[/code] subtracts [code]50[/code] to the sub-variable [code]x[/code], and [code]0[/code] to [code]y[/code]. [code]position.x -= Vector2(50, 0)[/code] tries to subtract a 2D vector to the sub-variable [code]x[/code], which is a decimal number. The value types are incompatible. If you try to do this, you will get an error.
it: [code]position -= Vector2(50, 0)[/code] sottrae [code]50[/code] alla sottovariabile [code]x[/code] e [code]0[/code] a [code]y[/code]. [code]position.x -= Vector2(50, 0)[/code] cerca di sottrarre un vettore 2D alla sottovariabile [code]x[/code], che è un numero decimale. I tipi di valore sono incompatibili. Se si tenta di eseguire questa operazione, si otterrà un errore.
nl: [code]position -= Vector2(50, 0)[/code] trekt [code]50[/code] af van de deelvariabele [code]x[/code], en [code]0[/code] van [code]y[/code]. [code]position.x -= Vector2(50, 0)[/code] probeert een 2D-vector af te trekken van de deelvariabele [code]x[/code], wat een kommagetal is. De waardentypes zijn incompatibel. Als je dit probeert, krijg je een foutmelding.
pt_br: [code]position -= Vector2(50, 0)[/code] subtrai [code]50[/code] da sub-variável [code]x[/code] e [code]0[/code] de [code]y[/code]. [code]position.x -= Vector2(50, 0)[/code] tenta subtrair um vetor 2D da sub-variável [code]x[/code], que é um número decimal. Os tipos de valores nesse caso são incompatíveis. Se você tentar fazer isso, vai receber um erro.
ru: [code]position -= Vector2(50, 0)[/code] вычитает [code]50[/code] из внутренней переменной [code]x[/code] и [code]0[/code] из [code]y[/code]. [code]position.x -= Vector2(50, 0)[/code] пытается вычесть 2D вектор из внутренней переменной [code]x[/code], являющейся целым числом. Типы значений несовместимы. Если вы попытаетесь сделать так, то получите сообщение об ошибке.
ta: . குறியீடு] ஒய் [/குறியீடு]. . மதிப்பு வகைகள் பொருந்தாது. இதைச் செய்ய முயற்சித்தால், உங்களுக்கு பிழை கிடைக்கும்.
zh_hans: [code]position -= Vector2(50, 0)[/code] 子变量 [code]x[/code] 减去 [code]50[/code]，[code]y[/code] 减去 [code]0[/code] 。 [code]position.x -= Vector2(50, 0)[/code] 是尝试在 子变量 [code]x[/code] 中减去一个二维向量，子变量是一个小数。值类型不兼容。如果你尝试这样做，会得到一个错误。
zh_hant: [code]position -= Vector2(50, 0)[/code] 會讓子變數 [code]x[/code] 減去 [code]50[/code]，而 [code]y[/code] 則減去 [code]0[/code]。 [code]position.x -= Vector2(50, 0)[/code] 會嘗試將子變數 [code]x[/code] 減掉一個二維向量，而 [code]x[/code] 是一個小數數值。由於數值類型不相容，如果這樣寫，會導致錯誤。

source: position.x -= Vector2(50, 0)
ta: pasition.x -= vecter2 (50, 0)
