Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-17-while-loops.po
Languages: cs, da, de, es, fr, it, ta, tr, uk, zh_hant

source: You've seen that you can use functions to [i]reuse[/i] code. In this lesson, you'll learn about [b]loops[/b]. Loops help you [i]repeat[/i] code. To illustrate how loops work, let's take a game board split into a grid. Our robot can move to neighboring cells by changing a [code]Vector2[/code] variable named [code]cell[/code]. It represents the current cell the robot is in. When we increase [code]cell.x[/code], the robot moves to the right. Note that we delay the robot's movement in the app to help you visualize how it moves. The following code would normally move the robot instantly.
es: Ya has visto que puedes utilizar funciones para [i]reutilizar[/i] código. En esta lección, aprenderás sobre los [b]bucles[/b]. Los bucles te ayudan a [i]repetir[/i] código. Para ilustrar cómo funcionan los bucles, tomemos un tablero de juego dividido en una cuadrícula. Nuestro robot puede moverse a las celdas vecinas cambiando una variable [code]Vector2[/code] llamada variable celda, o [code]cell[/code]. Representa la celda donde está el roboto. Cuando aumentamos [code]cell.x[/code], el robot se mueve hacia la derecha. Ten en cuenta que retrasamos el movimiento del robot en la aplicación para ayudarte a visualizar cómo se mueve. El siguiente código normalmente movería el robot de forma instantánea.
zh_hant: 你已經學會如何使用函式來[b]重複利用[/b]程式碼。在本課中，你將學習[b]迴圈[/b]。迴圈可以幫助你[b]重複執行[/b]程式碼。 為了說明迴圈的運作方式，讓我們來看一個被劃分網格的遊戲棋盤。 我們的機器人可以透過改變名為 [code]cell[/code] 的 [code]Vector2[/code] 變數來移動到相鄰的格子。這個變數代表機器人目前所在的格子。 當我們增加 [code]cell.x[/code] 的值時，機器人會向右移動。 請注意，在應用程式中，我們會延遲機器人的移動，以幫助你更清楚地觀察它的動作。然而，以下程式碼在正常情況下會讓機器人立即移動。

source: The above code works for a pre-defined board with a size of [code]Vector2(3, 3)[/code], but the [code]move_to_end()[/code] function wouldn't work if the size of the board was different. The robot would either stop before the end or go too far. To implement a general solution for all board sizes, we can repeat the robot's movement until it gets to the end. For code that repeats, we can use [i]loops[/i].
cs: Výše uvedený kód funguje pro předem definovanou desku o velikosti [code]Vector2(3, 3)[/code], ale funkce [code]move_to_end()[/code] by nefungovala, kdyby byla velikost desky jiná. Robot by se buď zastavil před koncem, nebo by dojel příliš daleko. Abychom implementovali obecné řešení pro všechny velikosti desek, můžeme pohyb robota opakovat, dokud se nedostane na konec. Pro kód, který se opakuje, můžeme použít [i]smyčky[/i].
es: El código anterior funciona para un tablero predefinido con un tamaño de [code]Vector2(3, 3)[/code], pero la función [code]move_to_end()[/code] no funcionaría si el tamaño del tablero fuera diferente. El robot se detendría antes del final o iría demasiado lejos. Para implementar una solución general para todos los tamaños de tablero, podemos repetir el movimiento del robot hasta que llegue al final. Para código que se repite, podemos utilizar [i]bucles[/i].
zh_hant: 上述程式碼適用於大小為 [code]Vector2(3, 3)[/code] 的預定義棋盤，但如果棋盤大小不同，則 [code]move_to_end()[/code] 函式將無法正常運作。 機器人可能會在到達終點前停下，或是移動得太遠。 為了實現適用於所有棋盤大小的一般解決方案，我們可以重複機器人的移動，直到它到達終點。 對於需要重複的程式碼，我們可以使用[b]迴圈[/b]。

source: You can use a [code]while[/code] loop to make the computer repeat a block of code until you meet a specific condition or decide to break from the loop. Here's how we use a [code]while[/code] loop.
cs: Smyčku [code]while[/code] můžete použít k tomu, aby počítač opakoval blok kódu, dokud nesplníte konkrétní podmínku nebo se nerozhodnete smyčku přerušit. Zde je návod, jak používáme smyčku [code]while[/code].
es: Los bucles [code]while[/code] hacen que la computadora repita un bloque de código hasta que se cumpla una condición específica o se decida salir del bucle. Así es como utilizamos un bucle [code]while[/code].
zh_hant: 你可以使用 [code]while[/code] 迴圈讓電腦重複執行一段程式碼，直到符合特定條件或決定中斷迴圈為止。 以下是我們如何使用 [code]while[/code] 迴圈的範例。

source: We use the variable [code]number[/code] to keep track of how many loops the [code]while[/code] loop completes. Each time we go through the [code]while[/code] loop, we add [code]1[/code] to [code]number[/code]. The [code]while[/code] loop keeps running for as long as the condition is true. In this case, it keeps running while [code]number[/code] is less than [code]4[/code]. You can see that the following code is executed four times in the console.
cs: Proměnnou [code]number[/code] používáme ke sledování počtu smyček, které smyčka [code]while[/code] dokončí. Pokaždé, když procházíme smyčkou [code]while[/code], přidáme [code]1[/code] k [code]number[/code]. Smyčka [code]while[/code] běží tak dlouho, dokud je podmínka pravdivá. V tomto případě stále běží, zatímco [code]number[/code] je menší než [code]4[/code]. V konzole můžete vidět, že následující kód je spuštěn čtyřikrát.
es: Utilizamos la variable [code]number[/code] para llevar la cuenta de cuántos ciclos completa el bucle [code]while[/code]. Cada vez que pasamos por un ciclo del bucle [code]while[/code], le sumamos [code]1[/code] a [code]number[/code]. El bucle [code]while[/code] sigue ejecutándose mientras la condición sea verdadera. En este caso, sigue ejecutándose mientras [code]number[/code] sea menor que [code]4[/code]. Puedes ver que el siguiente código se ejecuta cuatro veces en la consola.
zh_hant: 我們使用變數 [code]number[/code] 來追蹤 [code]while[/code] 迴圈執行的次數。 每次經過 [code]while[/code] 迴圈時，我們將 [code]1[/code] 加到 [code]number[/code] 上。 只要條件為真，[code]while[/code] 迴圈就會繼續執行。在這個例子中，當 [code]number[/code] 小於 [code]4[/code] 時，迴圈會持續執行。 你可以看到以下程式碼在控制台中執行了四次。

source: Let's apply this to our [code]move_to_end()[/code] function. This time, we compare the number of loops to the board's width. We go through the loop until we reach the width of the board. Note that we move the robot until its position is one less than the board's width because we are counting tiles from [code]0[/code]. A board of [code]3[/code] by [code]3[/code] cells would have cell coordinates going from [code]0[/code] to [code]2[/code] on both the X and Y axes.
es: Apliquemos esto a nuestra función [code]move_to_end()[/code]. Esta vez, comparamos el número de bucles con el ancho del tablero. Seguimos haciendo bucles hasta alcanzar el ancho del tablero. Ten en cuenta que nos movemos uno menos que el ancho del tablero porque el robot ya está en la primera celda. Un tablero de [code]3[/code] por [code]3[/code] celdas tendría unas coordenadas de celda que irían de [code]0[/code] a [code]2[/code] en los ejes X e Y.
zh_hant: 讓我們將這個應用到 [code]move_to_end()[/code] 函式中。 這次，我們將迴圈的次數與棋盤的寬度進行比較，並執行迴圈直到棋盤的寬度。 請注意，我們會將機器人移動直到它的位置比棋盤寬度少一個單位，因為我們是從 [code]0[/code] 開始計算格子。 一個大小為 [code]3[/code] x [code]3[/code] 的棋盤，X 軸和 Y 軸的格子座標會從 [code]0[/code] 到 [code]2[/code]。

source: If you're not careful, your [code]while[/code] loop can run infinitely. In that case, the application will freeze. Take a look at this code example.
cs: Pokud si nedáte pozor, může smyčka [code]while[/code] běžet donekonečna. V takovém případě aplikace zamrzne. Podívejte se na tento příklad kódu.
es: Si no tienes cuidado, tu bucle [code]while[/code] puede ejecutarse infinitamente. En ese caso, la aplicación se congelará. Echa un vistazo a este ejemplo de código.
zh_hant: 如果不小心，你的 [code]while[/code] 迴圈可能會無限執行下去。在這種情況下，應用程式將會當掉。 看看這個程式碼範例。

source: Because we don't increment [code]number[/code] within the [code]while[/code] loop, it always stays at [code]0[/code]. As a result, the number is always lower than [code]10[/code], so we never break out of the loop. Since there's no way to exit the [code]while[/code] loop, the computer will attempt to draw squares infinitely, which will freeze the program. When programs stop responding on your computer, it's often due to an infinite loop!
cs: Protože v rámci cyklu [code]while[/code] neinkrementujeme [code]number[/code], zůstává vždy na hodnotě [code]0[/code]. Výsledkem je, že číslo je vždy menší než [code]10[/code], takže se ze smyčky nikdy nedostaneme. Protože neexistuje žádný způsob, jak ukončit smyčku [code]while[/code], bude se počítač pokoušet kreslit čtverce donekonečna, což program zmrazí. Když programy na počítači přestanou reagovat, je to často způsobeno nekonečnou smyčkou!
es: Como no incrementamos [code]número[/code] dentro del bucle [code]while[/code], siempre se queda en [code]0[/code]. Como resultado, el número es siempre menor que [code]10[/code], por lo que nunca salimos del bucle. Como no hay forma de salir del bucle [code]while[/code], el ordenador intentará dibujar cuadrados infinitamente, lo que congelará el programa. Cuando los programas dejan de responder en tu ordenador, ¡a menudo se debe a un bucle infinito!
zh_hant: 因為我們在 [code]while[/code] 迴圈內沒有遞增 [code]number[/code]，它會一直保持在 [code]0[/code]。 結果 [code]number[/code] 永遠小於 [code]10[/code]，所以我們永遠無法跳出迴圈。 由於沒有退出 [code]while[/code] 迴圈的方法，電腦會無限次嘗試繪製正方形，程式會卡死。 當程式在你的電腦上停止回應時，通常是因為出現了無限迴圈！

source: At first, you will not need [code]while[/code] loops often. Even the code we show here has more efficient alternatives. Also, there's a safer kind of loop, [code]for[/code] loops, which we'll look at in the next lesson. Yet, [code]while[/code] loops have important intermediate to advanced-level uses, so you at least need to know they exist and how to use them. We use [code]while[/code] loops every time we need to loop an unknown number of times. For example, games run in a loop that typically generates sixty images per second until the user closes the game. This is possible thanks to [code]while[/code] loops. There are other good uses for [code]while[/code] loops: - Reading and processing a file, like a text document, line by line. - Processing a constant stream of data, like someone recording audio with a microphone. - Reading code and converting it into instructions the computer understands. - Various intermediate to advanced-level algorithms, like finding paths around a map for AI.
cs: Zpočátku nebudete cykly [code]while[/code] často potřebovat. I kód, který zde ukazujeme, má efektivnější alternativy. Existuje také bezpečnější druh smyček, [code]for[/code] smyčky, kterým se budeme věnovat v příští lekci. Přesto mají [code]while[/code] smyčky důležité využití na střední až pokročilé úrovni, takže je třeba alespoň vědět, že existují a jak je používat. Smyčky [code]while[/code] používáme vždy, když potřebujeme provést neznámý počet cyklů. Například hry běží ve smyčce, která obvykle generuje šedesát obrázků za sekundu, dokud uživatel hru nezavře. To je možné díky smyčkám [code]while[/code]. Existují i další dobrá využití smyček [code]while[/code]: - Čtení a zpracování souboru, například textového dokumentu, řádek po řádku. - Zpracování konstantního proudu dat, jako když někdo nahrává zvuk pomocí mikrofonu. - Čtení kódu a jeho převod na instrukce, kterým počítač rozumí. - Různé algoritmy na střední až pokročilé úrovni, například hledání cest po mapě pro umělou inteligenci.
es: Al principio, no necesitarás los bucles [code]while[/code] con frecuencia. Incluso el código que mostramos aquí tiene alternativas más eficientes. Además, hay un tipo de bucle más seguro, los bucles [code]for[/code], los cuales veremos en la próxima lección. Sin embargo, los bucles [code]while[/code] tienen importantes usos de nivel intermedio a avanzado, por lo que al menos debes saber que existen y cómo utilizarlos. Utilizamos los bucles [code]while[/code] cada vez que necesitamos hacer un bucle un número desconocido de veces. Por ejemplo, los juegos se ejecutan en un bucle que suele generar sesenta imágenes por segundo hasta que el usuario cierra el juego. Esto es posible gracias a los bucles [code]while[/code]. Hay otros buenos usos para los bucles [code]while[/code]: - Leer y procesar un archivo, como un archivo de texto, línea por línea. - Procesar un flujo constante de datos, como alguien que graba audio con un micrófono. - Leer código y convertirlo en instrucciones que la computadora entienda. - Varios algoritmos de nivel intermedio a avanzado, como encontrar caminos en un mapa para la IA.
zh_hant: 一開始，你可能不會經常需要使用 [code]while[/code] 迴圈。即使是我們在這裡展示的程式碼，也有更有效率的替代方案。 此外，還有一種更安全的迴圈就是 [code]for[/code] 迴圈，我們會在下堂課中介紹。 然而 [code]while[/code] 迴圈在中級到高級的應用中扮演著重要角色，因此你至少需要知道它的存在以及如何使用它。 我們會在需要執行未知次數的迴圈時使用 [code]while[/code] 迴圈。 例如，遊戲通常會在一個迴圈中運行，每秒生成六十幀畫面，直到使用者關閉遊戲。這正是利用 [code]while[/code] 迴圈來實現的。 [code]while[/code] 迴圈還有其他良好的應用場景： - 逐行讀取和處理檔案，例如讀取文字文件。 - 處理不間斷的資料流，例如使用麥克風錄音。 - 讀取程式碼並將其轉換為電腦可理解的指令。 - 各種中級到高級的演算法，例如 AI 在地圖上尋找路徑。

source: Let's practice some [code]while[/code] loops, as they're useful to know. It's also an excellent opportunity to practice 2D vectors. Then, we'll move on to the safer [code]for[/code] loops in the following lesson.
cs: Procvičme si několik [code]while[/code] cyklů, protože je užitečné je znát. Je to také výborná příležitost k procvičení 2D vektorů. V následující lekci pak přejdeme k bezpečnějším [code]for[/code] cyklům.
es: Vamos a practicar rápidamente los bucles [code]while[/code], ya que es útil conocerlos. También es una excelente oportunidad para practicar los vectores 2D. Luego, pasaremos a los bucles [code]for[/code], los cuales son más seguros, en la siguiente lección.
zh_hant: 讓我們來練習一些 [code]while[/code] 迴圈，因為這是一個值得學習的技能。同時這也是練習 2D 向量的絕佳機會。 接著在下堂課我們會學習更安全的 [code]for[/code] 迴圈。

source: Our robot has decided to stand at the top of the board. Complete the [code]move_to_bottom()[/code] function so the robot moves to the bottom of the board. The board size is determined by the [code]Vector2[/code] [code]board_size[/code]. The robot's current cell is [code]Vector2(2, 0)[/code]. Make sure to use a [code]while[/code] loop so the function works for any board size.
cs: Náš robot se rozhodl si stoupnout na vrcholu tabule. Dokončete funkci [code]move_to_bottom()[/code] tak, aby se robot přesunul na spodní část desky. Velikost desky je určena funkcí [code]Vector2[/code] [code]board_size[/code]. Aktuální buňka robota je [code]Vector2(2, 0)[/code]. Nezapomeňte použít smyčku [code]while[/code], aby funkce fungovala pro libovolnou velikost desky.
es: Nuestro robot ha decidido situarse en la parte superior del tablero. Completa la función [code]move_to_bottom()[/code] para que el robot se desplace a la parte inferior del tablero. El tamaño del tablero está determinado por el [code]Vector2[/code] llamado [code]board_size[/code]. La celda actual del robot es [code]Vector2(2, 0)[/code] Asegúrate de utilizar un bucle [code]while[/code] para que la función funcione para cualquier tamaño de tablero.
zh_hant: 我們的機器人決定站在棋盤最上方。 請完成 [code]move_to_bottom()[/code] 函式，使機器人移動到棋盤的最下方。 棋盤的大小由 [code]Vector2[/code] [code]board_size[/code] 決定。 機器人目前位於 [code]Vector2(2, 0)[/code]。 請確保使用 [code]while[/code] 迴圈，使該函式適用於任何棋盤大小。
