Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-3-standing-on-shoulders-of-giants.po
Languages: cs, da, de, es, fr, it, ja, nl, pt_br, ru, ta, uk, zh_hant

source: If the function requires one or more [i]arguments[/i], you add them inside the parentheses. Whether you need to do that or not depends on the function.
cs: Pokud funkce vyžaduje jeden nebo více [i]argumentů[/i], přidáte je dovnitř závorek. Zda to musíte udělat, nebo ne, záleží na dané funkci.
da: Hvis funktionen kræver et eller flere [i]argumenter[/i], skal du tilføje dem i parenteserne. Om du skal gøre det eller ej, afhænger af funktionen.
fr: Si la fonction nécessite un ou plusieurs [i]arguments[/i], vous les ajoutez à l'intérieur des parenthèses. Que vous ayez besoin de le faire ou non dépend de la fonction.
ja: 関数が1つ以上の[i]引数[/i]を必要とする場合は、括弧内に引数を追加します。 それが必要かどうかは関数によって異なります。
nl: Als de functie één of meer [i]argumenten[/i] nodig heeft, voeg je die toe tussen de haakjes. Of je dat moet doen of niet hangt af van de functie.
pt_br: Se a função requer um ou mais [i]argumentos[/i], você adiciona eles dentro do parêntese. Se você precisa ou não colocar argumentos vai depender da função.
ru: Если функция принимает один или несколько [i]аргументов[/i], можно добавить их в круглые скобки. Нужно добавлять аргументы или нет, зависит от конкретной функции.
ta: செயல்பாட்டிற்கு ஒன்று அல்லது அதற்கு மேற்பட்ட [i] வாதங்கள் தேவைப்பட்டால் [/i], நீங்கள் அவற்றை அடைப்புக்குறிக்குள் சேர்க்கிறீர்கள். நீங்கள் அதைச் செய்ய வேண்டுமா இல்லையா என்பது செயல்பாட்டைப் பொறுத்தது.
uk: Якщо функція приймає один чи кілька [i]аргументів[/i], можна додати їх у круглі дужки. Потрібно додавати аргументи чи ні, залежить від конкретної функції.
zh_hant: 如果該函式需要一個或多個[b]引數[/b]，則將它們放在括號內。是否需要這樣做取決於函式的要求。

source: You write its name followed by an opening and a closing parenthesis.
cs: Napíšete její název, za kterým následuje úvodní a závěrečná závorka.
da: Du skriver dens navn efterfulgt af en indledende og en afsluttende parentes.
de: Du schreibst ihren Namen, gefolgt von einer öffnenden und einer schließenden Klammer.
es: Escribes su nombre seguido de un paréntesis de apertura y otro de cierre.
fr: Vous écrivez son nom suivi d'une parenthèse ouvrante et d'une parenthèse fermante.
it: Scrivi il suo nome seguito da parentesi tonde aperte e chiuse.
ja: 関数名の後に開き括弧と閉じ括弧を書きます。
nl: Je schrijft de naam gevolgd door een openend en een sluitend haakje.
pt_br: Você escreve o nome da função seguido por uma abertura e fechamento de parêntesis.
ru: Написать имя функции, затем поставить открывающую и закрывающую круглые скобки.
ta: நீங்கள் அதன் பெயரை ஒரு திறப்பு மற்றும் ஒரு இறுதி அடைப்புக்குறிக்குள் எழுதுகிறீர்கள்.
uk: Написати назву функції, потім поставити відкриту і закриту круглі дужки.
zh_hant: 你寫下它的名稱，後面跟著一個左括號和一個右括號。

source: You write its name followed by a colon.
cs: Napíšete její název, za kterým následuje dvojtečka.
da: Du skriver dens navn efterfulgt af et kolon.
de: Du schreibst ihren Namen gefolgt von einem Doppelpunkt.
es: Escribes su nombre seguido de dos puntos.
fr: Vous écrivez son nom suivi de deux-points.
it: Scrivi il suo nome seguito dai due punti.
ja: 関数名の後にコロンを付けます。
nl: Je schrijft de naam gevolgd door een dubbele punt.
pt_br: Você escreve o seu nome seguido por um sinal de dois pontos.
ru: Написать имя функции, затем двоеточие.
ta: நீங்கள் அதன் பெயரை ஒரு பெருங்குடலைத் தொடர்ந்து எழுதுகிறீர்கள்.
uk: Написати назву функції, потім двокрапку.
zh_hant: 你寫下它的名稱，後面加上一個冒號。

source: You write a value, like a number, followed by an opening and a closing parenthesis.
cs: Zapíšete hodnotu, například číslo, za kterou následuje úvodní a závěrečná závorka.
da: Du skriver en værdi, som et tal, efterfulgt af en indledende og en afsluttende parentes.
de: Du schreibst einen Wert, wie eine Zahl, gefolgt von einer öffnenden und einer schließenden Klammer.
es: Escribes un valor, como un número, seguido de un paréntesis de apertura y otro de cierre.
fr: Vous écrivez une valeur, comme un nombre, suivie d'une parenthèse ouvrante et d'une parenthèse fermante.
it: Scrivi un valore, come ad esempio un numero, seguito da parentesi tonde aperte e chiuse.
ja: 数値などの値を記述し、その後に開き括弧と閉じ括弧を書きます。
nl: Je schrijft een waarde, zoals een getal, gevolgd door een openend en een sluitend haakje.
pt_br: Você escreve um valor, como um número, seguido por uma abertura e fechamento de parêntesis.
ru: Написать значение, например число, затем поставить открывающую и закрывающую круглые скобки.
ta: நீங்கள் ஒரு எண்ணைப் போல ஒரு மதிப்பை எழுதுகிறீர்கள், அதைத் தொடர்ந்து ஒரு திறப்பு மற்றும் ஒரு இறுதி அடைப்புக்குறிப்பு.
uk: Написати значення, наприклад число, потім поставити відкриту і закриту круглі дужки.
zh_hant: 你寫下一個數值，例如數字，後面跟著一對括號。

source: Make The Character Visible
cs: Zviditelnit postavu
da: Gør Karakteren Synlig
de: Den Charakter sichtbar machen
es: Haz que el personaje sea visible
fr: Rendre le personnage visible
it: Rendi Il Personaggio Visibile
ja: キャラクターを見えるようにする
nl: Maak het personage zichtbaar
pt_br: Fazendo o personagem ficar visível
ru: Сделайте персонажа видимым
ta: கதாபாத்திரத்தை காணச் செய்யுங்கள்
uk: Зробіть персонажа видимим
zh_hant: 讓角色可見

source: Our robot character's invisible! Call the [code]show()[/code] function to make it appear.
cs: Naše robotická postava je neviditelná! Vyvolejte funkci [code]show()[/code], aby se objevila.
da: Vores robotfigur er usynlig! Kald funktionen [code]show()[/code] for at få den til at vises.
fr: Notre personnage robot est invisible ! Appelez la fonction [code]show()[/code] pour le faire apparaître.
ja: このロボットのキャラクターは見えません！ [code]show()[/code]関数を呼び出して表示させましょう。
nl: Ons robotpersonage is onzichtbaar! Roep de functie [code]show()[/code] aan om hem te laten verschijnen.
pt_br: Nosso personagem robô está invisível! Chame a função [code]show()[/code] para fazer ele aparecer.
ru: Наш персонаж-робот невидим! Вызовите функцию [code]show()[/code], чтобы заставить его появиться.
ta: எங்கள் ரோபோ கதாபாத்திரத்தின் கண்ணுக்கு தெரியாதது! [குறியீடு] காட்சி () [/குறியீடு] செயல்பாட்டை அழைக்கவும்.
uk: Наш персонаж-робот невидимий! Викличте функцію [code]show()[/code], щоб змусити його з'явитися.
zh_hant: 我們的機器人角色是隱形的！呼叫 [code]show()[/code] 函式讓它顯示出來。

source: Please call [code]show()[/code] inside the [code]run()[/code] function, on line [code]2[/code], and keep the [code]Tab[/code] character at the start of the line. The computer needs that to understand your code.
cs: Zavolejte [code]show()[/code] uvnitř funkce [code]run()[/code], na řádku [code]2[/code], a ponechte znak [code]Tab[/code] na začátku řádku. Počítač ho potřebuje, aby porozuměl vašemu kódu.
da: Kald venligst [code]show()[/code] inde i funktionen [code]run()[/code] på linje [code]2[/code], og behold tegnet [code]Tab[/code] i starten af linjen. Computeren skal bruge det for at forstå din kode.
fr: Veuillez appeler [code]show()[/code] à l'intérieur de la fonction [code]run()[/code], sur la ligne [code]2[/code], et conserver le caractère [code]Tab[/code] en début de ligne. L'ordinateur en a besoin pour comprendre votre code.
ja: [code]run()[/code]関数内の[code]2[/code]行で[code]show()[/code]を呼び出します。[code]Tab[/code]文字で行の開始しますが、これはコンピュータがあなたのコードを理解するために必要なものです。
nl: Roep [code]show()[/code] aan binnen de [code]run()[/code] functie, op regel [code]2[/code], en laat het [code]Tab[/code]-teken aan het begin van de regel staan. De computer heeft dat nodig om je code te begrijpen.
pt_br: Por favor, chame a função [code]show()[/code] dentro da função [code]run()[/code] na linha número [code]2[/code] e mantenha o [code]caractere de tabulação[/code] no começo da linha. O computar precisa disso para entender seu código.
ru: Пожалуйста, вызовите [code]show()[/code] внутри функции [code]run()[/code] в строке [code]2[/code], обязательно сохранив символ [code]Tab[/code] (табуляцию) в начале строки. Компьютеру это нужно, чтобы понять ваш код.
ta: [குறியீடு] ரன் () [/குறியீடு] செயல்பாட்டிற்குள், [குறியீடு] 2 [/குறியீடு] இல் [குறியீடு] காண்பி [/குறியீடு] ஐ அழைக்கவும், மேலும் [குறியீடு] தாவல் [/குறியீடு] எழுத்தை வைத்திருங்கள் வரியின் தொடக்க. உங்கள் குறியீட்டைப் புரிந்துகொள்ள கணினி தேவை.
uk: Будь ласка, викличте [code]show()[/code] всередині функції [code]run()[/code] в рядку [code]2[/code], обов'язково зберігши символ [code]Tab[/code] (табуляцію) на початку рядка. Комп'ютеру це потрібно, щоб зрозуміти ваш код.
zh_hant: 請在 [code]run()[/code] 函式內部的第 [code]2[/code] 行呼叫 [code]show()[/code]，並保持該行開頭的 [code]Tab[/code] 字符。電腦需要這樣才能理解你的程式碼。

source: The robot's invisible! Call a function to bring it back.
cs: Robot'je neviditelný! Vyvolejte funkci, která ho přivede zpět.
da: Robotten er usynlig! Kald en funktion for at få den tilbage.
de: Der Roboter ist unsichtbar! Rufe eine Funktion auf, um ihn sichtbar zu machen.
es: ¡El robot es invisible! Llama a una función para traerlo de vuelta.
fr: Le robot est invisible ! Appelez une fonction pour le faire revenir.
it: Il robot è invisibile! Chiama una funzione per renderlo visibile.
ja: ロボットが見えない！ 関数を呼び出して元に戻します。
nl: De robot is onzichtbaar! Roep een functie aan om hem terug te brengen.
pt_br: O robô está invisível! Chame uma função para trazer ele de volta.
ru: Робот невидим! Вызовите функцию, чтобы вернуть его обратно.
ta: ரோபோவின் கண்ணுக்கு தெரியாதது! அதை மீண்டும் கொண்டு வர ஒரு செயல்பாட்டை அழைக்கவும்.
uk: Робот невидимий! Викличте функцію, щоб показати його.
zh_hant: 機器人消失了！呼叫一個函式讓它重新出現。

source: Make the Robot Upright
cs: Postavte robota rovně
da: Gør robotten oprejst
de: Sorge dafür, dass der Roboter aufrecht steht
es: Endereza el robot
fr: Rendre le robot droit
it: Metti il Robot in Posizione Verticale
ja: ロボットを直立させる
nl: Zet de robot rechtop
pt_br: Fazendo o robô ficar reto
ru: Поставьте робота в вертикальное положение
ta: ரோபோவை நிமிர்ந்து செய்யுங்கள்
uk: Поставте робота у вертикальне положення
zh_hant: 讓機器人直立

source: The robot was turned by [code]-0.5[/code] radians. You need to make it upright by calling the [code]rotate()[/code] function.
cs: Robot byl otočen o [code]-0,5[/code] radiánů. Je třeba ho postavit do svislé polohy zavoláním funkce [code]rotate()[/code].
da: Robotten blev drejet med [code]-0,5[/code] radianer. Du skal rette den op ved at kalde funktionen [code]rotate()[/code].
fr: Le robot a été tourné de [code]-0.5[/code] radians. Vous devez le redresser en appelant la fonction [code]rotate()[/code].
ja: ロボットは[code]-0.5[/code]ラジアンで回転しました。 [code]rotate()[/code]関数を呼び出して直立させましょう。
nl: De robot is [code]-0,5[/code] radialen gedraaid. Je moet hem rechtop zetten door de functie [code]rotate()[/code] aan te roepen.
pt_br: O robô foi rotacionado por [code]-0.5[/code] radiano. Você precisa deixar ele reto chamando a função [code]rotate()[/code].
ru: Робот повёрнут на [code]-0.5[/code] радиан. Вам нужно поставить его в вертикальное положение, вызвав функцию [code]rotate()[/code].
ta: ரோபோ [குறியீடு] -0.5 [/குறியீடு] ரேடியன்களால் திருப்பப்பட்டது. [குறியீடு] சுழற்சி () [/குறியீடு] செயல்பாட்டை அழைப்பதன் மூலம் நீங்கள் அதை நிமிர்ந்து செய்ய வேண்டும்.
uk: Робот повернутий на [code]-0.5[/code] радіан. Вам потрібно поставити його у вертикальне положення, викликавши функцію [code]rotate()[/code].
zh_hant: 機器人被旋轉了 [code]-0.5[/code] 弧度。你需要通過呼叫 [code]rotate()[/code] 函式將它轉回直立。

source: Please call [code]rotate()[/code] inside the [code]run()[/code] function, on line [code]2[/code], and keep the [code]Tab[/code] character at the start of the line. The computer needs that to understand your code.
cs: Zavolejte [code]rotate()[/code] uvnitř funkce [code]run()[/code], na řádku [code]2[/code], a na začátku řádku ponechte znak [code]Tab[/code]. Počítač ho potřebuje, aby porozuměl vašemu kódu.
da: Kald venligst [code]rotate()[/code] inde i funktionen [code]run()[/code] på linje [code]2[/code], og behold [code]Tab[/code]-tegnet i starten af linjen. Computeren skal bruge det for at forstå din kode.
fr: Veuillez appeler [code]rotate()[/code] à l'intérieur de la fonction [code]run()[/code], sur la ligne [code]2[/code], et conserver le caractère [code]Tab[/code] en début de ligne. L'ordinateur en a besoin pour comprendre votre code.
ja: [code]run()[/code]関数内の[code]2[/code]行で[code]rotate()[/code]を呼び出します。[code]Tab[/code]文字で行の開始しますが、これはコンピュータがあなたのコードを理解するために必要なものです。
nl: Roep [code]rotate()[/code] aan binnen de [code]run()[/code] functie, op regel [code]2[/code], en laat het [code]Tab[/code]-teken aan het begin van de regel staan. De computer heeft dat nodig om je code te begrijpen.
pt_br: Por favor, chame a função [code]rotate()[/code] dentro da função [code]run()[/code] na linha número [code]2[/code] e mantenha o [code]caractere de tabulação[/code] no começo da linha. O computar precisa disso para entender seu código.
ru: Пожалуйста, вызовите [code]rotate()[/code] внутри функции [code]run()[/code] в строке [code]2[/code], обязательно сохранив символ [code]Tab[/code] (табуляцию) в начале строки. Компьютеру это нужно, чтобы понять ваш код.
ta: [குறியீடு] ரன் () [/குறியீடு] செயல்பாட்டின் உள்ளே, [குறியீடு] 2 [/குறியீடு] க்குள் [குறியீடு] சுழற்றுங்கள் () [/குறியீடு] மற்றும் [குறியீடு] தாவல் [/குறியீடு] எழுத்தை வைத்திருங்கள் வரியின் தொடக்க. உங்கள் குறியீட்டைப் புரிந்துகொள்ள கணினி தேவை.
uk: Будь ласка, викличте [code]rotate()[/code] всередині функції [code]run()[/code] в рядку [code]2[/code], обов'язково зберігши символ [code]Tab[/code] (табуляцію) на початку рядка. Комп'ютеру це потрібно, щоб зрозуміти ваш код.
zh_hant: 請在 [code]run()[/code] 函式內的第 [code]2[/code] 行呼叫 [code]rotate()[/code]，並保持行首的 [code]Tab[/code] 字元。電腦需要這個來理解你的程式碼。

source: The robot is turned sideways. Help it straighten up with a function call.
cs: Robot je otočen na stranu. Pomozte mu narovnat se pomocí volání funkce.
da: Robotten er drejet sidelæns. Hjælp den med at rette sig op med et funktionskald.
de: Der Roboter ist seitlich gedreht.Hilf ihm, sich mit einem Funktionsaufruf zu begradigen.
es: El robot está inclinado. Ayúdalo a enderezarse con una llamada de función.
fr: Le robot est incliné. Aidez-le à se redresser avec un appel de fonction.
it: Il robot è ruotato sul suo fianco. Aiutalo a mettersi dritto chiamando una funzione.
ja: ロボットが横向きになっています。 関数呼び出しでそれをまっすぐにしましょう。
nl: De robot is zijwaarts gedraaid. Help hem rechtop met een functieaanroep.
pt_br: O robô está virado de lado. Ajude ele a se endireitar com uma chamada de função.
ru: Робот повернут боком. Помогите ему выпрямиться с помощью вызова функции.
ta: ரோபோ பக்கவாட்டாக மாறியுள்ளது. ஒரு செயல்பாட்டு அழைப்போடு நேராக்க உதவுங்கள்.
uk: Робот повернутий боком. Допоможіть йому вирівнятися за допомогою виклику функції.
zh_hant: 機器人現在是橫著的。請幫它使用函式呼叫將它直立起來。

source: We Stand on the Shoulders of Giants
cs: Stojíme na ramenou obrů
da: Vi står på giganternes skuldre
de: Auf den Erkenntnissen Anderer aufbauen
es: Estamos parados sobre los hombros de gigantes
fr: Comme des nains sur des épaules de géants
it: Sulle Spalle Dei Giganti
ja: 巨人の肩に乗っかる
nl: We staan op de schouders van reuzen
pt_br: Sobre os Ombros de Gigantes
ru: Мы стоим на плечах гигантов
ta: நாங்கள் ராட்சதர்களின் தோள்களில் நிற்கிறோம்
uk: Ми стоїмо на плечах гігантів
zh_hant: 我們站在巨人的肩膀上

source: As programmers, we rely on a lot of code created by others before us. Every programming language comes with a wealth of features created by other programmers to save you time. We call a bundle of code created by fellow developers a [i]library[/i]. It's a bunch of code sitting there, waiting for you to use it. Game engines like Godot bundle many libraries together. They provide a massive toolset to save you time when making games.
de: Als Programmierer verlassen wir uns auf eine Menge Code, der von anderen vor uns erstellt wurde. Jede Programmiersprache verfügt über eine Fülle von Funktionen, die von anderen Programmierern erstellt wurden, um Zeit zu sparen. Wir nennen eine Sammlung von Code auch [i]library[/i] (Bibliothek oder Code-Bibliothek). Eine Sammlung, die nur darauf wartet um von dir verwendet zu werden. Game Engines wie Godot bündeln sehr viele von solchen Bibliotheken. Sie bieten einen umfangreichen Werkzeugkasten, um beim Spiele entwickeln Zeit zu sparen.
es: Como programadores, dependemos de una gran cantidad de código creado por otros antes que nosotros. Cada lenguaje de programación viene con una gran cantidad de funciones creadas por otros programadores para ahorrarte tiempo. Llamamos [i]biblioteca[/i] a un conjunto de código creado por otros desarrolladores. Es un montón de código que está ahí, esperando a que lo utilices. Los motores de juego como Godot reúnen muchas bibliotecas. Proporcionan un conjunto de herramientas enorme para ahorrarte tiempo al crear juegos.
it: Noi programmatori spesso usiamo del codice che è già stato creato da altri prima di noi. Ogni linguaggio di programmazione dispone di funzionalità create da altri programmatori, questo ci permette di risparmiare tempo. Chiamiamo un insieme di codici creati per questo scopo da altri programmatori [i]librerie[/i]. È del codice che aspetta solo di essere usato. I motori di gioco come Godot mettono a disposizioni molte librerie. Forniscono un immenso set di strumenti mirati per la risoluzioni di problemi che uno sviluppatore di videogiochi potrebbe incontrare.

source: When coding, you always use a lot of code from developers who came before you. In a moment, you'll write your first code. You'll use [i]functions[/i] created by the Godot developers. A function is a list of instructions with an exact name. We can tell the computer to execute all the instructions in sequence with that name.
de: Beim Programmieren baut man meist immer auf Code auf, der bereits von anderen Entwicklern vorher erstellt wurde. Der erste Code, den Du schreibst, wird ebenfalls [i]Funktionen[/i] aufrufen, die bereits von anderen Godot-Programmierern erstellt wurden. Eine Funktion ist eine Liste von Anweisungen für den Computer mit einem genauen Namen. Durch die Verwendung dieses Namens weisen wir den Computer an, alle enthaltenen Anweisungen nacheinander auszuführen.
es: Al codificar, siempre utilizas mucho código de los desarrolladores que vinieron antes de ti. En un momento, escribirás tu primer código. Utilizarás [i]funciones[/i] creadas por los desarrolladores de Godot. Una función es una lista de instrucciones con un nombre exacto. Podemos decirle a la computadora que ejecute todas las instrucciones en secuencia con ese nombre.
it: Quando programmi, non sei mai solo. I linguaggi di programmazione stessi sono creati su programmi creati da altri sviluppatori. Fra poco, scriverai il tuo primo codice. Userai [i]funzioni[/i] create dagli sviluppatori di Godot. Una funzione è una serie di istruzioni per il computer. Le funzioni hanno un nome che usiamo per dire al computer di eseguire tutte le istruzioni all'interno in sequenza.

source: When you tell the computer to execute a function, we say you [i]call[/i] the function. To call a function, you write its [i]exact[/i] name followed by an open and closed parenthesis. To call the function named "show", you would write [code]show()[/code].
de: Wenn Du den Computer anweist, eine Funktion auszuführen, sagen wir, Du [i]rufst[/i] die Funktion auf. Um eine Funktion aufzurufen, schreibst Du ihren [i]genauen[/i] Namen, gefolgt von einer offenen und einer geschlossenen Klammer. Um die Funktion "show" aufzurufen, würdest Du [code]show()[/code] schreiben.
es: Cuando le dices a la computadora que ejecute una función, decimos que [i]llamas[/i] a la función. Para llamar a una función, escribes su nombre [i]exacto[/i] seguido de un paréntesis abierto y otro cerrado. Para llamar a la función llamada "show", escribirías [code]show()[/code].
it: Quando dici al computer di eseguire una funzione, diciamo che la stiamo [i]chiamando[/i]. Per chiamare una funzione, scrivi il suo [i]esatto[/i] nome seguito da una parentesi aperta e una chiusa. Per chiamare la funzione chiamata "show"(mostra), dovresti scrivere [code]show()[/code].

source: In Godot, calling [code]show()[/code] makes something visible, like a character or item. The complementary [code]hide()[/code] function hides the entity. Once an entity is visible, calling [code]show()[/code] again doesn't have any effect. Similarly, once you hide something, calling [code]hide()[/code] again doesn't change anything. [i]Click the Run button on any example below to execute the code listing.[/i]
de: In Godot macht das Aufrufen von [code]show()[/code] etwas sichtbar, z. B. ein Zeichen oder ein Element. Die ergänzende Funktion [code]hide()[/code] blendet die Entität aus. Sobald eine Entität sichtbar ist, hat der erneute Aufruf von [code]show()[/code] keine Auswirkungen. Sobald Du etwas ausblendest, ändert das erneute Aufrufen von [code]hide()[/code] nichts. [i]Klicke in einem beliebigen Beispiel unten auf die Schaltfläche , um die Codeliste auszuführen. [/i]
es: En Godot, llamar a [code]show()[/code] hace que algo sea visible, como un personaje o un objeto. La función complementaria [code]hide()[/code] oculta la entidad. Una vez que una entidad es visible, volver a llamar a [code]show()[/code] no tiene ningún efecto. Del mismo modo, una vez que ocultas algo, volver a llamar a [code]hide()[/code] no cambia nada. [i]Haz clic en el botón Ejecutar en cualquiera de los ejemplos a continuación para ejecutar el listado de código.[/i]
it: In Godot, chiamare [code]show()[/code] rende qualcosa visibile, come un personaggio o un oggetto. Al contrario [code]hide()[/code] li nasconde. Quando qualcosa è visibile, chiamare [code]show()[/code] nuovamente non avrà alcun effetto. Allo stesso modo, quando qualcosa è già nascosta, chiamare nuovamente [code]hide()[code] non cambierà nulla. [i]Clicca il tasto Esegui nell'esempio sottostante per eseguire il codice.[/i]
