Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-23-append-to-arrays.po
Languages: cs, de, es, it, ja, ru, ta, uk, zh_hant

source: Here we pop the last value of the array and print what's left of the array to demonstrate how the array gets smaller.
de: Wir entfernen den hier den letzten Wert aus dem Array und drucken was noch davon übrig ist, so demonstrieren wir wie der Array kleiner wird.
es: Aquí extraemos el último valor de la matriz e imprimimos lo que queda de la matriz para demostrar cómo esta se vuelve más pequeña.
it: Qui rimuoviamo l'ultimo valore dell'array e stampiamo quello che rimane nell'array per dimostrare in che modo l'array si rimpicciolisce.
ja: ここでは、配列の最後の値をポップし、配列の残りを出力して、配列がどのように小さくなるかを示します。
ru: Здесь мы удаляем последнее значение из массива и выводим количество оставшихся элементов для демонстрации того, как он уменьшается.
ta: இங்கே நாம் வரிசையின் கடைசி மதிப்பை பாப் செய்து, வரிசை எவ்வாறு சிறியதாகிறது என்பதை நிரூபிக்க வரிசையின் மீதமுள்ளவற்றை அச்சிடுகிறோம்.

source: Like [code]pop_front()[/code], the function returns the value removed from the array. You will often store that value in a variable.
de: Wie [code]pop_front()[/code] gibt die Funktion den aus dem Array entfernten Wert zurück. Du wirst diesen Wert häufig in einer Variablen speichern.
es: Al igual que [code]pop_front()[/code], la función devuelve el valor eliminado de la matriz. A menudo almacenarás ese valor en una variable.
it: Come [code]pop_front()[/code], la funzione ritorna il valore rimosso dall'array. Spesso conserverai questo valore in una variabile.
ja: [code]pop_front()[/code] と同様に、この関数は配列から削除された値を返します。 多くの場合、その値は変数に保存されます。
ru: Подобно [code]pop_front()[/code], функция возвращает значение, удалённое из массива. Вы часто будете сохранять это значение в переменную.
ta: [குறியீடு] POP_FRONT () [/code] ஐப் போன்ற, செயல்பாடு வரிசையிலிருந்து அகற்றப்பட்ட மதிப்பை வழங்குகிறது. நீங்கள் அடிக்கடி அந்த மதிப்பை ஒரு மாறியில் சேமிப்பீர்கள்.

source: The value in question could be the crate's content, which you can then use to give resources to the player.
de: Der fragliche Wert könnte der Inhalt der Kiste sein, den Du dann verwenden kannst, um dem Spieler Ressourcen zur Verfügung zu stellen.
es: El valor en cuestión podría ser el contenido de la caja, que luego puedes usar para darle recursos al jugador.
it: Il valore in questione potrebbe essere il contenuto della cassa, che poi puoi usare per dare le risorse al giocatore.
ja: 問題の値はクレートの内容である可能性があり、これを使用してプレーヤーにリソースを与えることができます。
ru: Такое значение может быть содержимым ящика, которое затем вы сможете передать игроку.
ta: கேள்விக்குரிய மதிப்பு க்ரேட்டின் உள்ளடக்கமாக இருக்கலாம், பின்னர் நீங்கள் பிளேயருக்கு ஆதாரங்களை வழங்க பயன்படுத்தலாம்.

source: In the following practices, you will use the [code]append()[/code], [code]pop_front()[/code], and [code]pop_back()[/code] array functions.
de: In den folgenden Verfahren verwendest Du die Arrayfunktionen [code]append()[/code], [code]pop_front()[/code] und [code]pop_back()[/code].
es: En las siguientes prácticas, utilizarás las funciones de matriz [code]append()[/code], [code]pop_front()[/code] y [code]pop_back()[/code].
it: Nelle seguenti pratiche, userai le funzioni array [code]append()[/code], [code]pop_front()[/code] e [code]pop_back()[/code].
ja: 次の演習では、[code]append()[/code]、[code]pop_front()[/code]、および [code]pop_back()[/code] 配列関数を使用します。
ru: В следующих упражнениях вы будете использовать функции массива: [code]append()[/code], [code]pop_front()[/code] и [code]pop_back()[/code].
ta: பின்வரும் நடைமுறைகளில், நீங்கள் [குறியீடு] பிற்சேர் () [/குறியீடு], [குறியீடு] POP_FRONT () [/குறியீடு] மற்றும் [குறியீடு] POP_BACK () [/குறியீடு] வரிசை செயல்பாடுகளைப் பயன்படுத்துவீர்கள்.

source: Completing orders
cs: Dokončování objednávek
de: Abschließen von Bestellungen
es: Completar pedidos
it: Completare gli ordini
ja: 注文の完了
ru: Выполнение заказов
ta: ஆர்டர்களை நிறைவு செய்தல்
uk: Виконання замовлень
zh_hant: 完成訂單

source: The [code]waiting_orders[/code] array will be filled over time.
de: Das Array [code]waiting_orders[/code] wird im Laufe der Zeit gefüllt.
es: La matriz [code]waiting_orders[/code] se llenará con el tiempo.
it: L'array [code]waiting_orders[/code] si riempirà con il tempo.
ja: [code]waiting_orders[/code] 配列は時間の経過とともにいっぱいになります。
ru: Массив [code]waiting_orders[/code] будет заполняться постепенно.
ta: [குறியீடு] காத்திருப்பு_ ஆர்டர்ச் [/குறியீடு] வரிசை காலப்போக்கில் நிரப்பப்படும்.

source: Your job is to move orders from the waiting list to the [code]completed_orders[/code] list using the array's [code]append()[/code] and [code]pop_front()[/code] functions.
de: Deine Aufgabe ist es, Bestellungen mit den Funktionen [code]append()[/code] und [code]pop_front()[/code] des Arrays von der Warteliste in die Liste [code]completed_orders[/code] zu verschieben.
es: Tu trabajo consiste en mover los pedidos de la lista de espera a la lista de [code]completed_orders[/code] utilizando las funciones [code]append()[/code] y [code]pop_front()[/code] de la matriz.
it: Il tuo obiettivo è quello di muovere gli ordini dalla lista d'attesa alla lista degli [code]completed_orders[/code] usando le funzioni array [code]append()[/code] e [code]pop_front()[/code].
ja: あなたの仕事は、配列の [code]append()[/code] 関数と [code]pop_front()[/code] 関数を使用して、待機リストから注文を [code]completed_orders[/code] リストに移動することです。
ru: Ваша задача — перемещать заказы из списка ожидания в список [code]completed_orders[/code] при помощи функций массива [code]append()[/code] и [code]pop_front()[/code].
ta: வரிசையின் [குறியீடு] பிற்சேர் () [/code] மற்றும் [குறியீடு] POP_FRONT () [/குறியீடு] செயல்பாடுகளைப் பயன்படுத்தி காத்திருப்பு பட்டியலிலிருந்து ஆர்டர்களை [குறியீடு] நிறைவு செய்யப்பட்ட_ ஆர்டர்ச் [/குறியீடு] பட்டியலுக்கு நகர்த்துவதே உங்கள் வேலை.

source: Remember that the array's [code]pop_front()[/code] function returns the popped value, which allows you to store it in a variable and then pass it to another function.
de: Denk daran, dass die Funktion [code]pop_front()[/code] des Arrays den entfernten Wert zurückgibt, mit dem Du ihn in einer Variablen speichern und dann an eine andere Funktion übergeben kannst.
es: Recuerda que la función [code]pop_front()[/code] de la matriz devuelve el valor extraído, lo que te permite almacenarlo en una variable y luego pasarlo a otra función.
it: Ricorda che la funzione di array [code]pop_front()[/code] ritorna il valore rimosso, questo ci consente di conservarlo in una variabile per poi passarlo ad un'altra funzione.
ja: 配列の [code]pop_front()[/code] 関数はポップされた値を返すので、それを変数に格納して別の関数に渡すことができることに注意してください。
ru: Помните, что функция [code]pop_front()[/code] возвращает удалённое из массива значение, что позволяет вам сохранить его в переменную и передать в другую функцию.
ta: வரிசையின் [குறியீடு] POP_FRONT () [/code] செயல்பாடு பாப் செய்யப்பட்ட மதிப்பை வழங்குகிறது என்பதை நினைவில் கொள்ளுங்கள், இது ஒரு மாறியில் சேமித்து அதை மற்றொரு செயல்பாட்டிற்கு அனுப்ப அனுமதிக்கிறது.

source: Orders are piling up in the kitchen, and we need to clear them fast using the array's [code]pop_front()[/code] function.
cs: V kuchyni se hromadí objednávky a my je potřebujeme rychle odstranit pomocí funkce [code]pop_front()[/code].
de: Bestellungen häufen sich in der Küche, und wir müssen sie schnell mit der [code]pop_front()[/code]-Funktion des Arrays löschen.
es: Los pedidos se acumulan en la cocina, y tenemos que sacarlos rápidamente utilizando la función [code]pop_front()[/code] de la matriz.
it: Gli ordini si stanno accumulando in cucina e dobbiamo completarli velocemente usando la funzione per array [code]pop_front()[/code].
ja: キッチンには注文が山積みになっているため、配列の [code]pop_front()[/code] 関数を使用して注文をすばやく片付ける必要があります。
ru: Заказы накапливаются на кухне и нам нужно быстро выполнять их с помощью функции массива [code]pop_front()[/code].
ta: சமையலறையில் ஆர்டர்கள் குவிந்து வருகின்றன, மேலும் வரிசையின் [குறியீடு] பாப்_பிரண்ட் () [/குறியீடு] செயல்பாட்டைப் பயன்படுத்தி அவற்றை வேகமாக அழிக்க வேண்டும்.
uk: Замовлення накопичуються на кухні, і нам потрібно швидко їх очистити за допомогою функції [code]pop_front()[/code] масиву.
zh_hant: 訂單在廚房堆積如山，我們需要使用陣列的 [code]pop_front()[/code] 函式快速清除它們。

source: Clearing up the crates
cs: Vyklízení beden
de: Kisten aufräumen
es: Deshacerse de las cajas
it: Svuotare le casse
ja: 木箱を片付ける
ru: Очистка ящиков
ta: கிரேட்சுகளை அழித்தல்
uk: Розчищення ящиків
zh_hant: 清理箱子

source: Crates are piling up on the platform. Move them out of the way by popping them from the [code]crates[/code] array.
de: Kisten stapeln sich auf der Plattform. Verschiebe sie aus dem Weg, indem Du sie aus dem Array [code]crates[/code] entfernst.
es: Las cajas se acumulan en la plataforma. Quítalas del camino extrayéndolas de la matriz denominada [code]crates[/code].
it: Le casse si stanno accumulando sulla piattaforma. Spostale via rimuovendole dall'array [code]crates[/code].
ja: プラットフォームには木箱が山積みになっています。 [code]crates[/code] 配列からそれらをポップして、邪魔にならない場所に移動します。
ru: На платформе скопились ящики. Уберите ящики с дороги, удалив их из массива [code]crates[/code].
ta: கிரேட்சுகள் மேடையில் குவிந்து கொண்டிருக்கின்றன. [குறியீடு] கிரேட்சுகள் [/குறியீடு] வரிசையிலிருந்து அவற்றைத் தூண்டுவதன் மூலம் அவற்றை வெளியே நகர்த்தவும்.

source: You need to remove them from top to bottom using the array's [code]pop_back()[/code] function.
de: Du musst sie mit der Funktion [code]pop_back()[/code] des Arrays von oben nach unten entfernen.
es: Debes quitarlas de arriba a abajo usando la función [code]pop_back()[/code] de la matriz.
it: Devi rimuoverle dall'alto verso il basso usando la funzione per array [code]pop_back()[/code].
ja: 配列の [code]pop_back()[/code] 関数を使用して、上から下にそれらを削除する必要があります。
ru: Убирать ящики нужно сверху вниз, при помощи функции [code]pop_back()[/code].
ta: வரிசையின் [குறியீடு] பாப்_பேக் () [/குறியீடு] செயல்பாட்டைப் பயன்படுத்தி அவற்றை மேலிருந்து கீழாக அகற்ற வேண்டும்.

source: Your code should remove all the crates in the array using a while loop.
de: Dein Code sollte alle Kisten im Array mithilfe einer while-Schleife entfernen.
es: Tu código debe eliminar todas las cajas de la matriz utilizando un bucle while.
it: Il tuo codice dovrebbe rimuovere tutte le casse nell'array usando un ciclo while.
ja: コードでは、while ループを使用して配列内のすべてのクレートを削除する必要があります。
ru: Для удаления ящиков обязательно используйте цикл while.
ta: உங்கள் குறியீடு சிறிது நேரம் வளையத்தைப் பயன்படுத்தி வரிசையில் உள்ள அனைத்து கிரேட்டுகளையும் அகற்ற வேண்டும்.

source: [b]Careful![/b] if you run a while loop carelessly, you can lock the software.
de: [b] Vorsicht! [/b] Wenn Du eine While-Schleife unvorsichtig ausführst, kann du die Software sperren.
es: [b]¡Cuidado![/b], si ejecutas un bucle while sin cuidado, puedes bloquear el software.
it: [b]Fa attenzione![/b] se esegui un ciclo while incautamente, potresti bloccare il programma.
ja: [b]注意してください！[/b] while ループを不用意に実行すると、ソフトウェアがロックされる可能性があります。
ru: [b]Осторожно![/b] Если вы запустите цикл бездумно, программа может зависнуть.
ta: [b] கவனமாக! [/b] நீங்கள் சிறிது நேரம் சுழற்சியை கவனக்குறைவாக இயக்கினால், நீங்கள் மென்பொருளை பூட்டலாம்.

source: You can check if the [code]crates[/code] array still contains values by writing [code]while crates:[/code]
de: Du kannst das [code]crates[/code] Array auf Werte überprüfen indem du [code]while crates:[/code] nutzt
es: Puedes verificar si la matriz [code]crates[/code] aún contiene valores escribiendo [code]while crates:[/code]
it: Puoi controllare se l'array [code]crates[/code] contiene ancora dei valori scrivendo [code]while crates:[/code].
ja: [code]while crates:[/code] と記述することで、[code]crates[/code] 配列にまだ値が含まれているかどうかを確認できます
ru: Проверить, содержит ли массив [code]crates[/code] значения, можно вот так: [code]while crates:[/code]
ta: [குறியீடு] கிரேட்சுகள் [/குறியீடு] வரிசையில் [குறியீட்டை] எழுதுவதன் மூலம் மதிப்புகள் உள்ளதா என்பதை நீங்கள் சரிபார்க்கலாம்: [/குறியீடு]

source: Crates are piling up on the platform. Move them out of the way by popping them from their array.
cs: Na plošině se hromadí bedny. Odstraňte je z cesty tak, že je vystrčíte(pop) z jejich pole.
de: Kisten stapeln sich auf der Plattform. Schiebe sie aus dem Weg, indem Du sie aus ihrem Array entfernen.
es: Las cajas se acumulan en la plataforma. Quítalas del camino extrayéndolas de su matriz.
it: Le casse si stanno accumulando sulla piattaforma. Spostale via rimuovendole dal loro array.
ja: プラットフォームには木箱が山積みになっています。 配列からそれらをポップして、邪魔にならない場所に移動します。
ru: На платформе скапливаются ящики. Уберите их с дороги, удалив из массива.
ta: கிரேட்சுகள் மேடையில் குவிந்து கொண்டிருக்கின்றன. அவற்றின் வரிசையிலிருந்து அவர்களை வெளியேற்றுவதன் மூலம் அவர்களை வழியிலிருந்து நகர்த்தவும்.
uk: На платформі накопичуються ящики. Перемістіть їх убік, викинувши їх із масиву.
zh_hant: 箱子正在平台上堆積。請透過從陣列中移除它們來清理空間。

source: Appending and popping values from arrays
cs: Připojování a získávání hodnot z polí
de: Anhängen und Freigeben von Werten aus Arrays
es: Agregar y extraer valores de las matrices
it: Accodare ed eliminare valori negli array
ja: 配列への値の追加とポップ
ru: Добавление и удаление значений из массивов
ta: வரிசைகளிலிருந்து மதிப்புகளைச் சேர்ப்பது மற்றும் பாப் செய்தல்
uk: Додавання та вилучення значень із масивів
zh_hant: 從陣列追加或是取出值

source: In previous lessons, you learned how to create arrays to store lists of values and how to loop over them. It's nice, but you won't go far with only that. The real strength of arrays is that you can add and remove values from them at any time. It allows you to [i]queue[/i] or [i]stack[/i] data.
cs: V předchozích lekcích jste se naučili vytvářet pole pro ukládání seznamů hodnot a procházet jimi ve smyčce. Skutečná síla polí však spočívá v tom, že do nich můžete kdykoli přidávat a odebírat hodnoty. Umožňuje vám to [i] řadit[/i] nebo [i] skládat[/i] data.
uk: У попередніх уроках ви дізналися, як створювати масиви для зберігання списків значень і як циклювати їх. Це добре, але тільки цим далеко не заїдеш. Справжня сила масивів полягає в тому, що ви можете додавати та видаляти значення з них у будь-який час. Це дозволяє [i]ставити в чергу[/i] або [i]стосувати[/i] дані.
zh_hant: 在先前的課程中，你學習了如何建立陣列來儲存值列表，並且使用迴圈來遍歷它們。這很不錯，但僅靠這些還不夠。 陣列的真正強大之處在於你可以隨時新增或移除其中的值。這使你能夠建立資料的[b]佇列(queue)[/b]或[b]堆疊(stack)[/b]。

source: You're making a restaurant management game where customers place orders, and you need to handle them as they come. In this game, customers order meals that end up in a queue. You need to prepare them in the kitchen. In this example, we simulate orders arriving and getting completed over time.
cs: Vytváříte hru na řízení restaurace, kde zákazníci zadávají objednávky a vy je musíte vyřizovat tak, jak přicházejí. V této hře si zákazníci objednávají jídla, která končí ve frontě. Musíte je připravit v kuchyni. V tomto příkladu simulujeme příchod objednávek a jejich dokončení v průběhu času.
uk: Ви створюєте гру про управління рестораном, де клієнти розміщують замовлення, і вам потрібно обробляти їх, коли вони надходять. У цій грі клієнти замовляють страви, які в кінцевому підсумку стоять у черзі. Готувати їх потрібно на кухні. У цьому прикладі ми моделюємо надходження та виконання замовлень з часом.
zh_hant: 你正在製作一款餐廳經營遊戲，顧客會下訂單，而你需要按順序處理它們。 在這款遊戲中，顧客的訂單會進入一個隊列，你需要在廚房內準備這些餐點。 在這個範例中，我們將模擬訂單隨時間到達並被完成的過程。

source: How do you keep track of pending and completed orders? With an array! When a customer purchases a meal, you want to [i]append[/i] it to the array. Then, as you complete a meal in the kitchen and serve it, you want to remove it from the array. You can do that with the [code]append()[/code] and the [code]pop_front()[/code] functions of the array, respectively. Try to read the code below before moving on. Don't worry if not everything makes sense, as we'll break it all down.
cs: Jak sledujete nevyřízené a dokončené objednávky? Pomocí pole! Když si zákazník koupí jídlo, chcete ho [i]přidat[/i] do pole. Když pak jídlo v kuchyni dokončíte a naservírujete, chcete ho z pole odebrat. To můžete provést pomocí funkcí [code]append()[/code], respektive [code]pop_front()[/code] pole. Než budete pokračovat, zkuste si přečíst níže uvedený kód. Nebojte se, pokud vám nebude všechno dávat smysl, protože vše rozebereme.
uk: Як ви відстежуєте незавершені та виконані замовлення? З масивом! Коли клієнт купує страву, ви хочете [i]додати[/i] її до масиву. Потім, коли ви завершуєте страву на кухні та подаєте її, ви хочете видалити її з масиву. Ви можете зробити це за допомогою функцій [code]append()[/code] і [code]pop_front()[/code] масиву відповідно. Спробуйте прочитати код нижче, перш ніж рухатися далі. Не хвилюйтеся, якщо не все має сенс, оскільки ми все розберемо.
zh_hant: 你要如何追蹤未完成與已完成的訂單？答案就是使用陣列！ 當顧客點餐時，你需要將餐點[b]新增[/b]到陣列中。然後，當你在廚房完成餐點並上菜時，你需要將它從陣列中移除。 你可以分別使用陣列的 [code]append()[/code] 和 [code]pop_front()[/code] 函式來完成這些操作。 在繼續之前，試著閱讀下面的程式碼。如果有些地方不太理解也沒關係，接下來我們會逐步解析。

source: Notice how we call some functions by writing a dot after a variable name. Like a given value type can have sub-variables, it can also have its own functions. Functions like [code]append()[/code] and [code]pop_front()[/code] only exist on arrays. That's why to call them, we need to access it from the array using the dot: [code]array.append()[/code].
cs: Všimněte si, jak voláme některé funkce napsáním tečky za názvem proměnné. Stejně jako daný typ hodnoty může mít podproměnné, může mít také své vlastní funkce. Funkce jako [code]append()[/code] a [code]pop_front()[/code] existují pouze v polích. Proto, abychom je mohli volat, musíme k nim přistupovat z pole pomocí tečky: [code]array.append()[/code].
uk: Зверніть увагу, як ми викликаємо деякі функції, ставлячи крапку після імені змінної. Подібно до того, як заданий тип значення може мати підзмінні, він також може мати власні функції. Такі функції, як [code]append()[/code] і [code]pop_front()[/code] існують лише для масивів. Ось чому, щоб викликати їх, нам потрібно отримати до нього доступ із масиву за допомогою точки: [code]array.append()[/code].
zh_hant: 請注意，我們在某些變數名稱後面加上點來呼叫函式。就像特定的數值類型可以有子變數一樣，它們也可以擁有自己的函式。 像 [code]append()[/code] 和 [code]pop_front()[/code] 這類的函式只存在於陣列中。因此，當我們要呼叫它們時，必須透過陣列本身來存取，也就是使用點號：[code]array.append()[/code]。

source: Let's break down the code. We queue orders in the [code]waiting_orders[/code] array by appending them to the array.
cs: Rozebereme si kód. Objednávky zařadíme do fronty v poli [code]waiting_orders[/code] tak, že je do pole připojíme.
uk: Давайте розберемо код. Ми ставимо замовлення в чергу в масиві [code]waiting_orders[/code], додаючи їх до масиву.
zh_hant: 讓我們來解析這段程式碼。 我們透過將訂單加入 [code]waiting_orders[/code] 陣列的方式，將它們排入隊列。

source: We write [code]#...[/code] to represent ellipses in the code. It means "we're completing the function's code." We use that to break down code examples and make them easier to learn from. The hash sign itself marks the start of a code comment. It's a line the computer will ignore, which is why it typically appears in grey.
cs: Píšeme [code]#...[/code], abychom v kódu reprezentovali elipsy. Znamená to "dokončujeme kód funkce." Používáme to k rozebrání příkladů kódu a usnadnění jejich učení. Samotný znak hash označuje začátek komentáře ke kódu. Je to řádek, který bude počítač ignorovat, a proto se obvykle zobrazuje šedě.
uk: Ми пишемо [code]#...[/code], щоб представити еліпси в коді. Це означає «ми завершуємо код функції». Ми використовуємо це, щоб розбити приклади коду та полегшити їх вивчення. Сам знак решітки позначає початок коментаря коду. Це рядок, який комп’ютер ігноруватиме, тому він зазвичай відображається сірим кольором.
zh_hant: 我們寫 [code]#...[/code] 來表示程式碼中的省略號。它的意思是「我們正在完成該函式的程式碼。」我們使用這個方式來分解程式碼範例，使學習過程變得更容易理解。 井字符號本身標示了一行程式註解的開始。這是電腦會忽略的內容，因此它通常會以灰色顯示。

source: Another common use of arrays is [i]stacks[/i] of data. Take a factory management game where you need to retrieve materials from stacks of crates. They arrive at the factory piled up vertically, and you need to take them from top to bottom.
cs: Dalším běžným použitím polí jsou [i]zásobníky[/i] dat. Vezměte si hru na správu továrny, kde potřebujete získat materiály ze stohů beden. Ty se do továrny dostanou vertikálně naskládané a vy je musíte vzít shora dolů.
uk: Іншим поширеним використанням масивів є [i]стеки[/i] даних. Візьміть гру управління фабрикою, де вам потрібно отримати матеріали зі стосів ящиків. На фабрику вони надходять вертикально складеними, а брати їх потрібно зверху вниз.
zh_hant: 另一個常見的陣列用途是作為[b]堆疊(stack)[/b]資料。 想像一個工廠管理遊戲，你需要從堆疊的貨箱取出材料。這些貨箱垂直堆疊在工廠中，你需要從最上層開始一個一個取出。

source: To take a crate from the back of the array, this time, we use the [code]pop_back()[/code] array function. This function removes (pops) the last value from the array and returns it to you. Here we pop the last value of the array and print what's left of the array to demonstrate how the array gets smaller.
cs: Abychom vzali bednu ze zadní části pole, tentokrát použijeme funkci pole [code]pop_back()[/code]. Tato funkce odstraní (pop) poslední hodnotu z pole a vrátí vám ji. Zde odstraníme poslední hodnotu pole a vytiskneme to, co z pole zbylo, abychom ukázali, jak se pole zmenšuje.
uk: Цього разу, щоб взяти ящик із задньої частини масиву, ми використовуємо функцію масиву [code]pop_back()[/code]. Ця функція видаляє (вискакує) останнє значення з масиву та повертає його вам. Тут ми витягуємо останнє значення масиву та друкуємо те, що залишилося від масиву, щоб продемонструвати, як масив стає меншим.
zh_hant: 要從陣列的後端取出貨箱，這次我們使用 [code]pop_back()[/code] 陣列函式。 這個函式會移除(彈出)陣列中的最後一個值，並將其回傳給你。 這裡我們彈出陣列中的最後一個值，並打印出剩餘的陣列來展示陣列是如何變小的。

source: Like [code]pop_front()[/code], the function returns the value removed from the array. You will often store that value in a variable. The value in question could be the crate's content, which you can then use to give resources to the player. In the following practices, you will use the [code]append()[/code], [code]pop_front()[/code], and [code]pop_back()[/code] array functions.
cs: Podobně jako [code]pop_front()[/code] vrátí funkce hodnotu odebranou z pole. Tuto hodnotu často uložíte do proměnné. Dotyčnou hodnotou by mohl být obsah bedny, který pak můžete použít k poskytnutí zdrojů hráči. V následujících postupech budete používat maticové funkce [code]append()[/code], [code]pop_front()[/code] a [code]pop_back()[/code].
uk: Подібно до [code]pop_front()[/code], функція повертає значення, видалене з масиву. Ви часто зберігаєте це значення у змінній. Цінністю, про яку йде мова, може бути вміст ящика, який потім можна використовувати для надання ресурсів гравцеві. У наведених нижче практиках ви будете використовувати функції масиву [code]append()[/code], [code]pop_front()[/code] і [code]pop_back()[/code].
zh_hant: 像是[code]pop_front()[/code]一樣，這個函式會回傳從陣列中移除的值。你通常會將該值儲存到一個變數中。 這個值可能是貨箱的內容，然後你可以使用它來給玩家提供資源。 以下的練習，你將使用 [code]append()[/code]、[code]pop_front()[/code]、和 [code]pop_back()[/code] 陣列函式。
