Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-7-member-variables.po
Languages: cs, da, de, es, fr, nl, pt_br, ru, ta, uk, zh_hans, zh_hant

source: You write a slash ("/") between the variable and the sub-variable name.
cs: Mezi název proměnné a název dílčí proměnné napíšete lomítko ("/").
da: Du skriver et skråstreg ("/") mellem variablen og undervariablens navn.
de: Schreibe einen Schrägstrich ("/") zwischen der Variablen und dem Namen der Untervariablen.
es: Escribes una barra inclinada ("/") entre el nombre de la variable y el nombre de la subvariable.
fr: Vous écrivez une barre oblique (« / ») entre le nom de la variable et le nom de la sous-variable.
nl: Je schrijft een punt ("/") tussen de variabele en de naam van de deelvariabele.
pt_br: Você escreve uma barra ("/") entre a variável e o nome da sub-variável.
ru: Написать косую черту ("/") между переменной и именем вложенной переменной.
ta: மாறி மற்றும் துணை மாறி பெயருக்கு இடையில் ஒரு குறைப்பு ("/") எழுதுகிறீர்கள்.
uk: Поставити косу риску ("/") між змінною та назвою вкладеної змінної.
zh_hans: 在变量和子变量名称之间写一个斜杠（“/”）。
zh_hant: 你需要在變數名稱和子變數名稱之間寫上一個斜線（"/"）。

source: In a future lesson, we'll explain why and how those variables have sub-variables.
da: I en fremtidig lektion vil vi forklare, hvorfor og hvordan disse variabler har undervariabler.
es: En una próxima lección, explicaremos por qué y cómo esas variables tienen subvariables.
fr: Dans une prochaine leçon, nous expliquerons pourquoi et comment ces variables ont des sous-variables.
pt_br: Em uma lição futura, nós vamos explicar o por que e como essas variáveis têm sub-variáveis.
ru: В следующем уроке мы объясним, почему и зачем в этих переменных есть вложенные переменные.
ta: எதிர்கால பாடத்தில், அந்த மாறிகள் ஏன், எப்படி துணை மாறிகள் உள்ளன என்பதை விளக்குவோம்.
uk: У наступному уроці ми пояснимо, чому і навіщо в цих змінних є вкладені змінні.

source: For now, just know you can use the dot to access them.
da: For nu skal du bare vide, at du kan bruge punktum til at få adgang til dem.
es: Por ahora, sólo tienes que saber que puedes utilizar el punto para acceder a ellas.
fr: Pour l'instant, sachez simplement que vous pouvez utiliser le point pour y accéder.
pt_br: Por enquanto, apenas saiba que você pode usar o ponto final para acessá-las.
ru: Пока что просто знайте, что вы можете использовать точку для доступа к ним.
ta: இப்போதைக்கு, அவற்றை அணுக நீங்கள் புள்ளியைப் பயன்படுத்தலாம் என்பதை அறிந்து கொள்ளுங்கள்.
uk: Поки що просто знайте, що для доступу до них використовують крапку.

source: We'll tell you which variables have sub-components and what their names are.
da: Vi fortæller dig, hvilke variabler der har underkomponenter, og hvad deres navne er.
es: Te diremos qué variables tienen subcomponentes y cuáles son sus nombres.
fr: Nous vous dirons quelles variables ont des sous-composants et quels sont leurs noms.
pt_br: Nós vamos te dizer quais variáveis têm subcomponentes e quais são seus nomes.
ru: Мы расскажем вам, какие переменные имеют вложенные компоненты и как они называются.
ta: எந்த மாறிகள் துணைக் கூறுகள் உள்ளன, அவற்றின் பெயர்கள் என்ன என்பதை நாங்கள் உங்களுக்குச் சொல்வோம்.
uk: Ми розповімо вам, які змінні мають вкладені компоненти та як вони називаються.

source: In the next lessons, you'll create your own variables and do operations on them to add or remove [code]score[/code], [code]health[/code], you name it.
da: I de næste lektioner vil du oprette dine egne variabler og udføre operationer på dem for at tilføje eller fjerne [code]score[/code], [code]health[/code], you name it.
es: En las próximas lecciones, crearás tus propias variables y harás operaciones con ellas para añadir o quitar [code]puntuación[/code], [code]salud[/code] o lo que quieras.
fr: Dans les prochaines leçons, vous créerez vos propres variables et effectuerez des opérations sur elles pour ajouter ou supprimer du [code]score[/code], de la [code]health[/code] (santé), ou ce que vous voulez.
pt_br: Nas próximas lições, você vai criar suas próprias variáveis e vai fazer operações nelas para adicionar ou remover coisas como: [code]score[/code] (pontos), [code]health[/code] (vida) ou qualquer outra coisa.
ru: В следующих уроках вы создадите свои собственные переменные и будете использовать их в операциях по добавлению или вычитанию [code]score[/code] (очков) и [code]health[/code] (здоровья).
ta: அடுத்த பாடங்களில், நீங்கள் உங்கள் சொந்த மாறிகளை உருவாக்கி, [குறியீடு] மதிப்பெண் [/குறியீடு], [குறியீடு] உடல்நலம் [/குறியீடு] சேர்க்க அல்லது அகற்ற அவற்றில் செயல்பாடுகளைச் செய்வீர்கள், அதற்கு நீங்கள் பெயரிடுங்கள்.
uk: У наступних уроках ви створите власні змінні і використовуватимете їх в операціях додавання або віднімання [code]score[/code] (очків) і [code]health[/code] (здоров'я).

source: For now, let's practice accessing variables.
da: Lad os nu øve os i at få adgang til variabler.
es: Por ahora, vamos a practicar el acceso a las variables.
fr: Pour l'instant, mettons en pratique nos connaissances sur l'accès aux variables.
pt_br: Por enquanto, vamos praticar o acesso a variáveis.
ru: А пока давайте потренируемся получать доступ к переменным.
ta: இப்போதைக்கு, மாறிகளை அணுகுவதைப் பயிற்சி செய்வோம்.
uk: А поки що потренуймося отримувати доступ до змінних.

source: Draw a rectangle at a precise position
cs: Nakreslete obdélník v přesné poloze
da: Tegn et rektangel på en præcis position
es: Dibujar un rectángulo en una posición precisa
fr: Dessiner un rectangle à une position précise
nl: Teken een rechthoek op een specifieke plek
pt_br: Desenhe um retângulo em uma posição precisa
ru: Нарисуйте прямоугольник в точной позиции
ta: ஒரு துல்லியமான நிலையில் ஒரு செவ்வகத்தை வரையவும்
uk: Намалюйте прямокутник у точному положенні
zh_hans: 在精确位置绘制一个矩形
zh_hant: 在精確位置繪製矩形

source: Draw a rectangle of 200 by 120 pixels at the X position of 120 pixels and Y position of 100 pixels.
da: Tegn et rektangel på 200 gange 120 pixels ved X-positionen på 120 pixels og Y-positionen på 100 pixels.
es: Dibuja un rectángulo de 200 por 120 pixeles en la posición X de 120 pixeles y en la posición Y de 100 pixeles.
fr: Dessinez un rectangle de 200 par 120 pixels à la position X de 120 pixels et à la position Y de 100 pixels.
pt_br: Desenhe um retângulo de 200 pixels de comprimento por 120 pixels de altura na posição X de 120 pixels e na posição Y de 100 pixels.
ru: Нарисуйте прямоугольник размером 200 на 120 пикселей в позиции X — 120 и Y — 100 пикселей.
ta: 120 படப்புள்ளிகள் மற்றும் 100 படப்புள்ளிகள் ஒய் நிலை நிலையில் 200 ஆல் 120 படப்புள்ளிகள் செவ்வகத்தை வரையவும்.
uk: Намалюйте прямокутник розміром 200 на 120 пікселів у позиції X – 120 та Y – 100 пікселів.

source: You need to replace the numbers in the code editor to draw the correct rectangle.
da: Du skal erstatte tallene i kodeeditoren for at tegne det korrekte rektangel.
es: Debes reemplazar los números en el editor de código para dibujar el rectángulo correcto.
fr: Vous devez remplacer les nombres dans l'éditeur de code pour dessiner le bon rectangle.
pt_br: Você precisa substituir os números no editor de código para desenhar o retângulo correto.
ru: Вам нужно заменить числа в редакторе кода, чтобы нарисовать правильный прямоугольник.
ta: சரியான செவ்வகத்தை வரைய குறியீடு எடிட்டரில் உள்ள எண்களை மாற்ற வேண்டும்.
uk: Вам потрібно замінити числа в редакторі коду, щоб намалювати прямокутник правильно.

source: Use the position member variable and its sub-variables to change the rectangle's position.
cs: Ke změně polohy obdélníku použijte členskou proměnnou position a její dílčí proměnné.
da: Brug «position» medlemsvariablen og dens undervariabler til at ændre rektanglets position.
de: Verwende die Positionsvariable und ihre Untervariablen, um die Position des Rechtecks zu ändern.
es: Utiliza la variable miembro "position" y sus subvariables para cambiar la posición del rectángulo.
fr: Utilisez la variable membre « position » et ses sous-variables pour modifier la position du rectangle.
nl: Gebruik de lidvariabele position en diens deelvariabelen om de positie van de rechthoek te veranderen.
pt_br: Use a variável membro "position" e suas sub-variáveis para alterar a posição do retângulo.
ru: Используйте свойство position и его внутренние переменные для изменения положения прямоугольника.
ta: செவ்வகத்தின் நிலையை மாற்ற நிலை உறுப்பினர் மாறி மற்றும் அதன் துணை மாறிகள் பயன்படுத்தவும்.
uk: Щоб зміни положення прямокутника, скористайтеся властивістю position та її внутрішніми змінними.
zh_hans: 使用成员变量 position 及其子变量来改变矩形的位置。
zh_hant: 使用 position 成員變數及其子變數來改變矩形的位置。

source: Draw squares at different positions
cs: Nakreslete čtverce na různých místech
da: Tegn firkanter på forskellige positioner
es: Dibujar rectángulos en diferentes posiciones
fr: Dessiner des carrés à différentes positions
nl: Teken vierkanten op verschillende plekken
pt_br: Desenhe quadrados em diferentes posições
ru: Нарисуйте квадраты в разных позициях
ta: வெவ்வேறு நிலைகளில் சதுரங்களை வரையவும்
uk: Намалюйте квадрати в різних місцях
zh_hans: 在不同位置绘制多个矩形
zh_hant: 在不同位置繪製多個矩型

source: Draw three squares of size 100 by 100 that are 100 pixels apart on the horizontal axis. In other words, there should be a 100-pixel gap between two squares.
da: Tegn tre firkanter på størrelse 100 gange 100, der er 100 pixels fra hinanden på den vandrette akse. Med andre ord skal der være et mellemrum på 100 pixels mellem to firkanter.
es: Dibuja tres cuadrados de tamaño 100 por 100 que estén separados por 100 pixeles en el eje horizontal. En otras palabras, debe haber un espacio de 100 pixeles entre dos cuadrados.
fr: Dessinez trois carrés de taille 100 par 100 qui soient séparés de 100 pixels sur l'axe horizontal. En d'autres termes, il doit y avoir un écart de 100 pixels entre deux carrés.
pt_br: Desenhe três quadrados de tamanho 100 por 100, separados por 100 pixels no eixo horizontal. Em outras palavras, deve haver um espaço de 100 pixels entre os dois quadrados.
ru: Нарисуйте три квадрата размером 100 на 100, расположив их на расстоянии 100 пикселей друг от друга по горизонтальной оси. Другими словами, между двумя квадратами должен быть промежуток в 100 пикселей.
ta: கிடைமட்ட அச்சில் 100 படப்புள்ளிகள் இடைவெளியில் 100 ஆல் 100 அளவு மூன்று சதுரங்களை வரையவும். வேறு வார்த்தைகளில் கூறுவதானால், இரண்டு சதுரங்களுக்கு இடையில் 100 படப்புள்ளி இடைவெளி இருக்க வேண்டும்.
uk: Намалюйте три квадрати розміром 100 на 100, розташувавши їх на відстані 100 пікселів один від одного вздовж горизонтальної осі. Іншими словами, між двома квадратами має бути проміжок на 100 пікселів.

source: You should draw the squares starting at the position (100, 100). This means you should position the first square at 100 on the X axis and 100 on the Y axis.
da: Du skal tegne firkanterne startende ved positionen (100, 100). Det betyder, at du skal placere den første firkant ved 100 på X-aksen og 100 på Y-aksen.
es: Debes dibujar los cuadrados empezando en la posición (100, 100). Esto significa que debes situar el primer cuadrado en 100 en el eje X y en 100 en el eje Y.
fr: Vous devez dessiner les carrés en commençant à la position (100, 100). Cela signifie que vous devez positionner le premier carré à 100 sur l'axe X et à 100 sur l'axe Y.
pt_br: Você deve desenhar os quadrados começando na posição (100, 100). Isso significa que você deve posicionar o primeiro quadrado em 100 no eixo X e 100 no eixo Y.
ru: Вы должны нарисовать квадраты, начиная с позиции (100, 100). Это означает, что первый квадрат должен располагаться в координатах 100 по оси X и 100 по оси Y.
ta: நீங்கள் நிலையில் (100, 100) தொடங்கும் சதுரங்களை வரைய வேண்டும். இதன் பொருள் நீங்கள் முதல் சதுரத்தை ஃச் அச்சில் 100 ஆகவும், ஒய் அச்சில் 100 ஆகவும் வைக்க வேண்டும்.
uk: Ви повинні намалювати квадрати, починаючи з позиції (100, 100). Це означає, що перший квадрат має розташовуватися. в координатах 100 за віссю X і 100 за віссю Y.

source: Remember you need to use the equal sign ([code]=[/code]) to change the value of a variable, like the turtle's position.
da: Husk, at du skal bruge lighedstegnet ([code]=[/code]) for at ændre værdien af en variabel, f.eks. skildpaddens position.
es: Recuerda que debes utilizar el signo de igual ([code]=[/code]) para cambiar el valor de una variable, como la posición de la tortuga.
fr: N'oubliez pas que vous devez utiliser le signe égal ([code]=[/code]) pour changer la valeur d'une variable, comme la position de la tortue.
pt_br: Lembre-se que você precisa usar o sinal de igual ([code]=[/code]) para alterar o valor de uma variável, como a posição da tartaruga.
ru: Помните, что для изменения значения переменной, например положения черепахи, нужно использовать знак равенства ([code]=[/code]).
ta: ஆமை நிலை போன்ற ஒரு மாறியின் மதிப்பை மாற்ற நீங்கள் சம அடையாளத்தை ([குறியீடு] = [/குறியீடு]) பயன்படுத்த வேண்டும் என்பதை நினைவில் கொள்ளுங்கள்.
uk: Пам'ятайте, що для змінення значення змінної, наприклад, положення черепашки, використовують знак рівності ([code]=[/code]).

source: Write your code inside the [code]run()[/code] function so the computer can recognize it.
da: Skriv din kode i funktionen [code]run()[/code], så computeren kan genkende den.
es: Escribe tu código dentro de la función [code]run()[/code] para que la computadora pueda reconocerlo.
fr: Écrivez votre code à l'intérieur de la fonction [code]run()[/code] pour que l'ordinateur puisse le reconnaître.
pt_br: Escreva seu código dentro da função [code]run()[/code] para que o computador possa reconhecer o código.
ru: Напишите свой код внутри функции [code]run()[/code], чтобы компьютер мог его распознать.
ta: [குறியீடு] ரன் () [/குறியீடு] செயல்பாட்டிற்குள் உங்கள் குறியீட்டை எழுதுங்கள், எனவே கணினி அதை அடையாளம் காண முடியும்.
uk: Напишіть свій код всередині функції [code]run()[/code], щоб комп'ютер міг його розпізнати.

source: Use the provided [code]draw_rectangle()[/code] function to draw each square.
da: Brug den medfølgende funktion [code]draw_rectangle()[/code] til at tegne hver firkant.
es: Utilice la función [code]draw_rectangle()[/code] para dibujar cada cuadrado.
fr: Utilisez la fonction [code]draw_rectangle()[/code] fournie pour dessiner chaque carré.
pt_br: Use a função [code]draw_rectangle()[/code] para desenhar cada quadrado.
ru: Используйте предоставленную функцию [code]draw_rectangle()[/code] для рисования каждого квадрата.
ta: ஒவ்வொரு சதுரத்தையும் வரைய வழங்கப்பட்ட [குறியீடு] draw_rectangle () [/குறியீடு] செயல்பாட்டைப் பயன்படுத்தவும்.
uk: Використайте цю функцію [code]draw_rectangle()[/code] для малювання кожного з квадратів.

source: Now you can place and draw one shape, but how about drawing several? In this practice, you'll place three squares side by side to really get the hang of properties.
cs: Nyní můžete umístit a nakreslit jeden tvar, ale co takhle nakreslit jich několik? V tomto cvičení umístíte tři čtverce vedle sebe, abyste si vlastnosti opravdu osvojili.
da: Nu kan du placere og tegne én figur, men hvad med at tegne flere? I denne øvelse placerer du tre firkanter side om side for virkelig at få styr på egenskaberne.
es: Ahora que puedes colocar y dibujar un rectángulo, ¿qué tal si colocas varios? En esta práctica, colocará tres cuadrados uno al lado del otro para dominar realmente las propiedades.
fr: Vous pouvez maintenant placer et dessiner une forme, mais que diriez-vous d'en dessiner plusieurs ? Dans cet exercice, vous placerez trois carrés côte à côte pour vous familiariser avec les propriétés.
nl: Nu kun je één vorm plaatsen en tekenen, maar hoe zit het met het tekenen van meerdere vormen? In deze oefening plaats je drie vierkanten naast elkaar om eigenschappen echt onder de knie te krijgen.
pt_br: Agora você pode colocar e desenhar uma forma, mas que tal desenhar várias? Neste exercício, você colocará três quadrados lado a lado para realmente pegar o jeito das propriedades.
ru: Теперь вы можете разместить и нарисовать одну фигуру, но как насчет рисования нескольких? В этом упражнении вы разместите три квадрата рядом друг с другом, чтобы действительно научиться пользоваться свойствами.
ta: இப்போது நீங்கள் ஒரு வடிவத்தை வைக்கலாம் மற்றும் வரையலாம், ஆனால் பலவற்றை வரைவது எப்படி? இந்த நடைமுறையில், பண்புகளைத் தொங்கவிட மூன்று சதுரங்களை அருகருகே வைப்பீர்கள்.
uk: Тепер ви можете розмістити та намалювати одну фігуру, але як щодо малювання кількох? У цій вправі ви розмістите три квадрати поруч один з одним, щоб дійсно навчитися користуватися властивостями.
zh_hans: 现在你能放置和绘制一个矩形，但放好几个呢？在这一练习中，你得做到并排放置三个矩形才算真正掌握了这些功能的使用。
zh_hant: 現在你可以放置並繪製一個圖形了，但如果要繪製多個圖形該怎麼辦？在這個練習中，你將並排放置三個正方形，這樣可以讓你更熟練地掌握屬性。

source: Introduction to Member Variables
cs: Úvod do členských proměnných
da: Introduktion til medlemsvariabler
es: Introducción a las variables miembro
fr: Introduction aux variables membres
nl: Inleiding tot lidvariabelen
pt_br: Introdução às variáveis membro
ru: Введение в свойства
ta: உறுப்பினர் மாறிகள் அறிமுகம்
uk: Вступ до властивостей
zh_hans: 引入成员变量
zh_hant: 介紹成員變數

source: In this lesson, we take a first look at variables. In games, you need to keep track of many values that change over time: - The player's score. - Every character or enemy's health. - The last checkpoint. And so much more. You need to store, retrieve, and update those values. We call those values [i]variables[/i]. Variables are labels you use to keep track of values that vary over time. Here's an example of a variable tracking a character or monster's health.
cs: V této lekci se podíváme na proměnné. Ve hrách je třeba sledovat mnoho hodnot, které se v průběhu času mění: - Skóre hráče. - Zdraví každé postavy nebo nepřítele. - Poslední kontrolní bod. A mnoho dalšího. Tyto hodnoty je třeba ukládat, načítat a aktualizovat. Tyto hodnoty nazýváme [i]proměnné[/i]. Proměnné jsou štítky/značky, které používáte ke sledování hodnot, které se v čase mění. Zde je příklad proměnné, která sleduje zdraví postavy nebo příšery.
de: In dieser Lektion werfen wir einen ersten Blick auf Variablen. In Spielen musst Du viele Werte im Auge behalten, die sich im Laufe der Zeit ändern: - Die Punktzahl des Spielers. - Die Gesundheit jedes Charakters oder Feindes. - Der letzte Checkpoint. Und vieles mehr. Du musst diese Werte speichern, abrufen und aktualisieren. Wir nennen diese Werte [i]Variablen[/i]. Variablen sind Beschriftungen, die Du verwendest, um Werte zu verfolgen, die sich im Laufe der Zeit ändern. Hier ist ein Beispiel für eine Variable, die die Gesundheit eines Charakters oder Monsters verfolgt.
nl: In deze les kijken we voor het eerst naar variabelen. In spellen moet je veel waarden bijhouden die in de loop van de tijd veranderen: - De score van de speler. - De gezondheid van elk personage of elke vijand. - Het laatste checkpoint. En nog veel meer. Je moet die waarden opslaan, ophalen en bijwerken. We noemen deze waarden [i]variabelen[/i]. Variabelen zijn labels die je gebruikt om waarden bij te houden die variëren in de tijd. Hier is een voorbeeld van een variabele die de gezondheid van een personage of monster bijhoudt.
zh_hans: 在本课中，我们会第一次接触到变量。 在游戏中，你需要跟踪许多随时间变化的值： - 玩家的分数。 - 每个角色或敌人的生命值。 - 上一个检查点的位置。 还有更多其他的。你需要存储、检索和更新这些值。 我们将这些值称为 [i] 变量 [/i]。变量是用于跟踪随时间变化的值的标签。这是一个跟踪角色或怪物生命值的变量示例。
zh_hant: 在這一課中，我們將首次介紹變數。 在遊戲中，你需要追蹤許多隨時間變動的值： - 玩家分數。 - 每個角色或敵人的生命值。 - 最後一個檢查點。 還有更多。你需要儲存、檢索並更新這些值。 我們稱這些值為[b]變數[/b]。變數是用來追蹤隨時間變動的值的標籤。這裡有一個變數追蹤角色或怪物生命值的範例。

source: The line above defines a new variable named [code]health[/code] and assigns it a starting value of [code]100[/code] (that's what the equal sign does, more on that below). Function parameters, which you saw in the previous lesson, are another example of variables.
cs: Řádek výše definuje novou proměnnou s názvem [code]health[/code] a přiřazuje jí počáteční hodnotu [code]100[/code] (k tomu slouží rovnítko, více níže). Dalším příkladem proměnných jsou parametry funkcí, které jste viděli v předchozí lekci.
de: Die obige Zeile definiert eine neue Variable mit dem Namen [code]health[/code] und weist ihr einen Startwert von [code]100[/code] zu (das ist es, was das Gleichheitszeichen tut, mehr dazu weiter unten). Funktionsparameter, die Du in der vorherigen Lektion gesehen hast, sind ein weiteres Beispiel für Variablen.
nl: De regel hierboven definieert een nieuwe variabele met de naam [code]health[/code] en wijst er een beginwaarde aan toe van [code]100[/code] (dat is wat het gelijkheidsteken doet, meer daarover hieronder). Functieparameters, die je in de vorige les hebt gezien, zijn een ander voorbeeld van variabelen.
zh_hans: 上面的行定义了一个名为 [code]health[/code] 的新变量，并为它分配了一个起始值 [code]100[/code]（这就是等号的作用，下面会详细介绍）。 你在上一课中看到的函数参数也是一种变量的例子。
zh_hant: 上面的這行程式碼定義了一個新的變數，名為 [code]health[/code]，並將其初始值設定為 [code]100[/code]（等號的作用就是將值指定給變數，稍後會詳細說明）。 你在上堂課中所看到的函式參數也是變數的另一個範例。

source: In this lesson, we start using variables built into Godot. They're a particular kind called [i]member variables[/i]. Member variables are values attached to a game entity. They're useful properties like the [code]position[/code], [code]rotation[/code], and [code]scale[/code] of a character. In a previous lesson, we saw how we could use the [code]rotate()[/code] function to rotate our character.
cs: V této lekci začneme používat proměnné zabudované do Godotu. Jedná se o určitý druh proměnné nazývaný [i]členské proměnné[/i] (member variables). Členské proměnné jsou hodnoty připojené k entitě hry. Jsou to užitečné vlastnosti, jako je [code]position[/code] (pozice), [code]rotation[/code] (rotace) a [code]scale[/code] (měřítko) postavy. V předchozí lekci jsme viděli, jak bychom mohli použít funkci [code]rotate()[/code] k otočení naší postavy.
de: In dieser Lektion beginnen wir mit der Verwendung von Variablen, die in Godot integriert sind. Sie sind eine bestimmte Art, die [i]Membervariable[/i] genannt wird. Membervariablen sind Werte, die einer Spiels Entität zugeordnet sind. Sie sind nützliche Eigenschaften wie die Position([code]position[/code]), Rotation([code]rotation[/code]) und Skalierung([code]scale[/code]) eines Charakters. In einer früheren Lektion haben wir gesehen, wie wir die Funktion [code]rotate()[/code] verwenden können, um unseren Charakter zu drehen.
nl: In deze les beginnen we met in Godot ingebouwde variabelen gebruiken. Deze zijn van een speciale soort die [i]lidvariabelen[/i] worden genoemd. Lidvariabelen zijn waarden die aan een spelobject zijn gekoppeld. Het zijn nuttige eigenschappen zoals de [code]position[/code], [code]rotation[/code] en [code]scale[/code] van een personage. In een vorige les zagen we hoe we de functie [code]rotate()[/code] konden gebruiken om ons personage te draaien.
zh_hans: 在本课中，我们从使用 Godot 内置好的变量开始。它们是一种特殊的类型，称为 [i] 成员变量 [/i]。 成员变量是附加到游戏实体上的值。 它们是很有用的属性，例如角色的 [code]position[/code]、[code]rotation[/code] 和 [code]scale[/code]（位置，旋转，缩放比例）。 在上一课中，我们看过了如何使用 [code]rotate()[/code] 函数来旋转我们的角色。
zh_hant: 在這一課中，我們開始使用 Godot 內建的變數。這些變數是一種特定類型，稱為[b]成員變數[/b]。 成員變數是附加在遊戲實體上的值。它們是有用的屬性，例如角色的 [code]position[/code](位置)、[code]rotation[/code](旋轉) 和 [code]scale[/code](縮放)。 在上堂課中，我們看到如何使用 [code]rotate()[/code] 函式來旋轉我們的角色。
