Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-4-drawing-a-rectangle.po
Languages: cs, da, de, es, it, ja, pt, ru, ta, tr, uk, zh_hans, zh_hant

source: Using these instructions, we can make any two-dimensional shape we like! Try to understand the example below. In the next practice, you'll use the functions we saw above to first draw a corner, then a rectangle like this one.
cs: Pomocí těchto návodů můžeme vytvořit libovolný dvourozměrný tvar! Pokuste se pochopit následující příklad. V příštím cvičení použijete funkce, které jsme viděli výše, nejprve k nakreslení rohu, a poté obdélníku jako je tento.
de: Mit diesen Anweisungen können wir jede zweidimensionale Form herstellen, die wir möchten! Versuche das folgende Beispiel zu verstehen. In der nächsten Übung verwendest Du die Funktionen, die wir oben gesehen haben, um zuerst eine Ecke und dann ein Rechteck wie dieses zu zeichnen.
es: Utilizando estas instrucciones, ¡podemos hacer cualquier forma bidimensional que queramos! Trata de entender el siguiente ejemplo. En la siguiente práctica, utilizarás las funciones que vimos anteriormente para dibujar primero una esquina y luego un rectángulo como este.
ta: இந்த வழிமுறைகளைப் பயன்படுத்தி, நாம் விரும்பும் இரு பரிமாண வடிவத்தை உருவாக்கலாம்! கீழே உள்ள உதாரணத்தைப் புரிந்து கொள்ள முயற்சிக்கவும். அடுத்த நடைமுறையில், மேலே நாங்கள் பார்த்த செயல்பாடுகளை முதலில் ஒரு மூலையை வரையவும், பின்னர் இது போன்ற ஒரு செவ்வகம் பயன்படுத்தவும்.
zh_hans: 使用这些指令，我们可以制作任何喜欢的二维形状！ 试着理解下面的例子。 在接下来的练习中，你将用到上面的函数，首先绘制一个角，然后绘制一个像这样的矩形。
zh_hant: 使用這些指令，我們可以畫出任何我們想要的二維形狀！ 試著理解下面的範例。 在下一個練習中，你將使用我們剛剛學到的函式，首先畫出一個直角，接著畫出像這樣的矩形。

source: [code]move_forward(30)[/code]
ta: [குறியீடு] MOVE_FORWARD (30) [/குறியீடு]

source: A function's arguments are all the values inside the parentheses. In this case, there's only one, but there can be multiple separated by commas. In this case, [code]move_forward[/code] is the function's name and [code]30[/code] is the argument. This function call will make the turtle move forward by [code]30[/code] pixels.
cs: Argumenty funkce jsou všechny hodnoty v závorkách. V tomto případě je pouze jeden, ale může jich být více oddělených čárkami. V tomto případě je [code]move_forward[/code] název funkce a [code]30[/code] je argument. Toto volání funkce způsobí, že se želva posune vpřed o [code]30[/code] pixelů.
de: Die Argumente einer Funktion sind die Werte innerhalb der runden Klammern. In diesem Fall gibt es nur ein Argument, aber es kann auch mehrere geben - getrennt durch ein Komma. In diesem Beispiel, ist [code]move_forward[/code] der Funktionsname und [code]30[/code] das Argument. Dieser Funktionsaufruf bewegt die Schildkröte um [code]30[/code] Pixel vorwärts.
es: Los argumentos de una función son todos los valores dentro de los paréntesis. En este caso solo hay uno, pero pueden ser varios separados por comas. En este caso, [code]mover_adelante[/code] es el nombre de la función y [code]30[/code] es el argumento. Esta llamada de función hará que la tortuga avance [code]30[/code] píxeles.
ta: ஒரு செயல்பாட்டின் வாதங்கள் அடைப்புக்குறிக்குள் உள்ள அனைத்து மதிப்புகளும் ஆகும். இந்த விசயத்தில், ஒன்று மட்டுமே உள்ளது, ஆனால் காற்புள்ளிகளால் பலவற்றை பிரிக்கலாம். இந்த வழக்கில், [குறியீடு] MOVE_FORWARD [/code] என்பது செயல்பாட்டின் பெயர் மற்றும் [குறியீடு] 30 [/குறியீடு] என்பது வாதமாகும். இந்த செயல்பாட்டு அழைப்பு ஆமை [குறியீடு] 30 [/குறியீடு] படப்புள்ளிகள் மூலம் முன்னேறும்.
zh_hans: 括号内是函数参数。当前例子中参数虽然只有一个，但是可以有多个得情况，使用逗号隔开。 例子中[code]move_forward[/code]是函数名[code]30[/code]是函数参数。 函数调用后海龟会向前移动[code]30[/code]个像素。
zh_hant: 一個函式的引數是括號內的所有值。在這個例子中，只有一個，但也可以有多個，用逗號分隔。 在這個例子中，[code]move_forward[/code] 是函式的名稱，而 [code]30[/code] 是引數。 這個函式呼叫會讓烏龜向前移動 [code]30[/code] 像素。

source: The turtle is a little learning tool custom-made for this course, based on a proven code learning methodology. It's designed to teach you how to use and create functions. So please don't be surprised if writing code like [code]turn_left()[/code] inside of the Godot editor doesn't work! And don't worry, once you've learned the foundations, you'll see they make it faster and easier to learn Godot functions.
cs: Želva je učební nástroj založený na osvědčené metodě učení kódu. Je navržen tak, aby vás naučil jak používat a vytvářet funkce. Takže se nedivte, že [code]turn_left()[/code] uvnitř editoru Godot nefunguje! A nedělejte si starosti, jakmile jste se naučili základy, uvidíte, že je rychlejší a jednodušší se naučit funkce Godot.
de: Die Schildkröte ist ein kleines, speziell für diesen Kurs entwickeltes Lernwerkzeug, das auf einer bewährten Methodik zum Erlernen von Code basiert. Es wurde entwickelt, um dir beizubringen, wie man Funktionen verwendet und erstellt. Sei also bitte nicht überrascht, wenn das Schreiben von Code wie [code]turn_left()[/code] im Godot-Editor nicht funktioniert! Und keine Sorge, sobald du die Grundlagen gelernt hast, wirst du sehen, dass sie es einfacher und schneller machen, die Funktionen von Godot zu erlernen.
es: La tortuga es una pequeña herramienta de aprendizaje hecha a medida para este curso, basada en una metodología probada de aprendizaje de código. Está diseñada para enseñarte a usar y crear funciones. Así que, por favor, ¡no te sorprendas si escribir código como [code]turn_left()[/code] dentro del editor Godot no funciona! Y no te preocupes, una vez que hayas aprendido los fundamentos, verás que hacen más rápido y fácil aprender las funciones de Godot.
ta: ஆமை ஒரு சிறிய கற்றல் கருவியாகும், இது இந்த பாடத்திட்டத்திற்கு தனிப்பயனாக்கப்பட்டதாகும், இது நிரூபிக்கப்பட்ட குறியீடு கற்றல் முறையை அடிப்படையாகக் கொண்டது. செயல்பாடுகளை எவ்வாறு பயன்படுத்துவது மற்றும் உருவாக்குவது என்பதை உங்களுக்குக் கற்பிப்பதற்காக இது வடிவமைக்கப்பட்டுள்ளது. எனவே கோடோட் எடிட்டரின் உள்ளே [குறியீடு] டர்ன்_லெஃப்ட் () [/குறியீடு] போன்ற குறியீட்டை எழுதினால் தயவுசெய்து ஆச்சரியப்பட வேண்டாம்! கவலைப்பட வேண்டாம், நீங்கள் அச்திவாரங்களைக் கற்றுக்கொண்டவுடன், அவர்கள் அதை விரைவாகவும், கோடோட் செயல்பாடுகளைக் கற்றுக்கொள்வதை எளிதாகவும் காண்பீர்கள்.
zh_hans: 小海龟是我们专为这个课程制作的教具，它来自一套经过考验的编程学习方法。它旨在教你如何使用和创建函数。 因此，如果在 Godot 编辑器中直接写像 [code]turn_left()[/code] 这样的代码时不起作用，不要感到惊讶！也别担心，只要你学会了这些基础内容，你会发现它们让学习使用真正的Godot 函数变得更快更容易。
zh_hant: 這隻烏龜是專為這門課程所設計的學習工具，基於已證實的程式學習方法。它的目的是教你如何使用和創建函式。 所以請不要感到驚訝，如果在 Godot 編輯器裡寫 [code]turn_left()[/code] 這樣的程式碼無法運作！別擔心，一旦你掌握了基礎，這些會讓你學習 Godot 函式變得更快速且更簡單。

source: In this practice, we'll tell the turtle to draw a corner. The corner is made up of two lines that are [code]200[/code] pixels long. The lines are connected at each end by [code]90[/code] degrees, or right-angle. The [code]move_forward()[/code] and [code]turn_right()[/code] functions to the right draw a corner, but they're missing some arguments. Add the missing arguments so the turtle moves forward [code]200[/code] pixels, turns right [code]90[/code] degrees, then moves forward again [code]200[/code] pixels. We added the first argument for you so the turtle moves forward [code]200[/code] pixels. In the following practices, we'll draw multiple corners to create rectangles.
de: In dieser Übung werden wir der Schildkröte beibringen, eine Ecke zu zeichnen. Die Ecke besteht aus zwei Linien, die [code]200[/code] Pixel lang sind. Die Linien sind an jedem Ende um [code]90[/code] Grad verbunden, also ein rechter Winkel. Die Funktionen [code]move_forward()[/code] und [code]turn_right()[/code] zeichnen eine Ecke, aber sie fehlen noch einige Argumente. Füge die fehlenden Argumente hinzu, damit die Schildkröte [code]200[/code] Pixel vorwärts geht, sich dann um [code]90[/code] Grad nach rechts dreht und erneut [code]200[/code] Pixel vorwärts geht. Wir haben das erste Argument für dich hinzugefügt, damit die Schildkröte [code]200[/code] Pixel vorwärts geht. In den nächsten Übungen werden wir mehrere Ecken zeichnen, um Rechtecke zu erstellen.
es: En esta práctica, le diremos a la tortuga que dibuje una esquina. La esquina está formada por dos líneas de [code]200[/code] pixeles de largo. Las líneas están unidas en cada extremo por un ángulo de [code]90[/code] grados, o sea, un ángulo recto. Las funciones [code]move_forward()[/code] y [code]turn_right()[/code] a la derecha dibujan una esquina, pero les faltan algunos parámetros. Agrega los parámetros que faltan para que la tortuga avance [code]200[/code] pixeles, gire a la derecha [code]90[/code] grados, y luego avance de nuevo [code]200[/code] pixeles. Hemos añadido el primer parámetro por ti para que la tortuga avance [code]200[/code] pixeles. En las siguientes prácticas, dibujaremos varias esquinas para crear rectángulos.
ta: இந்த நடைமுறையில், ஆமை ஒரு மூலையை வரையுமாறு கூறுவோம். மூலையில் [குறியீடு] 200 [/குறியீடு] படப்புள்ளிகள் நீளமுள்ள இரண்டு வரிகளால் ஆனது. கோடுகள் ஒவ்வொரு முனையிலும் [குறியீடு] 90 [/குறியீடு] டிகிரி அல்லது வலது கோணத்தால் இணைக்கப்பட்டுள்ளன. . காணாமல் போன வாதங்களைச் சேர்க்கவும், இதன் மூலம் ஆமை முன்னோக்கி நகரும் [குறியீடு] 200 [/குறியீடு] படப்புள்ளிகள், வலது [குறியீடு] 90 [/குறியீடு] டிகிரிகளை மாற்றி, பின்னர் மீண்டும் முன்னோக்கி நகரும் [குறியீடு] 200 [/குறியீடு] பிக்சல்கள். உங்களுக்காக முதல் வாதத்தை நாங்கள் சேர்த்துள்ளோம், எனவே ஆமை முன்னோக்கி நகரும் [குறியீடு] 200 [/குறியீடு] பிக்சல்கள். பின்வரும் நடைமுறைகளில், செவ்வகங்களை உருவாக்க பல மூலைகளை வரைவோம்.
zh_hans: 在这个练习中，我们将让海龟画一个角。 角由两条 [code]200[/code] 像素长的线组成。 这些线在端点上以 [code]90[/code] 度也就是直角相连。 右边的 [code]move_forward()[/code] 和 [code]turn_right()[/code] 函数画了一个角，但它们缺少一些参数。 添加缺少的参数，使海龟向前移动 [code]200[/code] 像素，向右转 [code]90[/code] 度，然后再次向前移动 [code]200[/code] 像素。 我们为你添加了第一个参数，以便海龟向前移动 [code]200[/code] 像素。 在后续的练习中，我们将绘制多个角来创建矩形。
zh_hant: 這個練習中我們會指示小海龜畫出一個直角。 這個直角由兩條長度為 [code]200[/code] 像素的直線組成，兩條直線的連接處成為 [code]90[/code] 度的直角。 [code]move_forward()[/code] 和 [code]turn_right()[/code] 函式會讓小海龜畫出這個直角，但它們缺少些引數。 請添加缺少的引數，讓小海龜先前進 [code]200[/code] 像素，然後右轉 [code]90[/code] 度，再前進一次 [code]200[/code] 像素。 我們已經幫你加上了第一個引數，讓小海龜先前進 [code]200[/code] 像素。 在接下來的練習中，我們將會畫出多個直角，來創建長方形。

source: Add the correct arguments to the functions [code]move_forward()[/code] and [code]turn_right()[/code] to draw a rectangle with a width of [code]200[/code] pixels, and a height of [code]120[/code] pixels. We wrote the first argument for you. In the next practice, you'll use the same functions to draw a bigger rectangle.
de: Füge die richtigen Parameter zu den Funktionen [code]move_forward()[/code] und [code]turn_right()[/code] hinzu, um ein Rechteck mit einer Breite von [code]200[/code] Pixeln und einer Höhe von [code]120[/code] Pixeln zu zeichnen. Wir haben den ersten Parameter für dich geschrieben. In der nächsten Übung verwendest Du die gleichen Funktionen, um ein größeres Rechteck zu zeichnen.
es: Añade los parámetros correctos a las funciones [code]move_forward()[/code] y [code]turn_right()[/code] para dibujar un rectángulo con un ancho de [code]200[/code] pixeles y una altura de [code]120[/code] pixeles. Hemos escrito el primer parámetro por ti. En la siguiente práctica, utilizarás las mismas funciones para dibujar un rectángulo más grande.
ta: [குறியீடு] 200 [/குறியீடு] பிக்சல்களின் அகலமும், உயரமும் கொண்ட ஒரு செவ்வகத்தை வரைய செயல்பாடுகளில் [குறியீடு] MOVE_FORWARD () [/குறியீடு] மற்றும் [குறியீடு] டர்ன்_ரைட் () [/குறியீடு] செயல்பாடுகளுக்கு சரியான வாதங்களைச் சேர்க்கவும் [குறியீடு] 120 [/குறியீடு] பிக்சல்கள். உங்களுக்காக முதல் வாதத்தை நாங்கள் எழுதினோம். அடுத்த நடைமுறையில், ஒரு பெரிய செவ்வகத்தை வரைய அதே செயல்பாடுகளைப் பயன்படுத்துவீர்கள்.
zh_hans: 在函数[code]move_forward()[/code]和[code]turn_right()[/code]中添加正确的参数，绘制一个宽度为[code]200[/code]像素、高度为 [code]120[/code] 像素的长方形。 我们为你填好了第一个参数。 在下一个练习中，你将使用相同的函数来绘制一个更大的矩形。
zh_hant: 請將正確的引數加到 [code]move_forward()[/code] 和 [code]turn_right()[/code] 函式中，以畫出一個寬度為 [code]200[/code] 像素，高度為 [code]120[/code] 像素的矩形。 我們已經為你寫好了第一個引數。 在下一個練習中，你將使用相同的函式來畫出一個更大的矩形。

source: Write out calls to the functions [code]move_forward()[/code] and [code]turn_right()[/code] to draw a rectangle with a width of 220 pixels, and a height of 260 pixels. We wrote the first two lines for you. Be sure to write each instruction on a separate line. Every line should start with one [code]Tab[/code] character so the computer understands it's part of the [code]draw_rectangle()[/code] function.
cs: Vypište volání funkcí [code]move_forward()[/code] a [code]turn_right()[/code] pro vykreslení obdélníku o šířce 220 pixelů a výšce 260 pixelů. První dva řádky jsme napsali za vás. Nezapomeňte každou instrukci napsat na samostatný řádek. Každý řádek by měl začínat jedním znakem [code]Tab[/code], aby počítač pochopil, že je součástí funkce [code]draw_rectangle()[/code].
de: Schreibe Aufrufe der Funktionen [code]move_forward()[/code] und [code]turn_right()[/code], um ein Rechteck mit einer Breite von 220 Pixeln und einer Höhe von 260 Pixeln zu zeichnen. Wir haben die ersten beiden Zeilen für Dich geschrieben. Stelle sicher, dass jede Anweisung in eine separate Zeile geschrieben ist. Jede Zeile sollte mit einem [code]Tab[/code]-Zeichen beginnen, damit der Computer versteht, dass es Teil der [code]draw_rectangle()[/code]-Funktion ist.
es: Escribe las llamadas a las funciones [code]move_forward()[/code] y [code]turn_right()[/code] para dibujar un rectángulo de 220 pixeles de ancho y 260 pixeles de alto. Hemos escrito las dos primeras líneas por ti. Asegúrate de escribir cada instrucción en una línea distinta. Cada línea debe empezar con un carácter [code]Tab[/code] para que la computadora entienda que forma parte de la función [code]draw_rectangle()[/code].
ta: 220 படப்புள்ளிகள் அகலம் மற்றும் 260 படப்புள்ளிகள் உயரத்துடன் ஒரு செவ்வகத்தை வரைய செயல்பாடுகளை [குறியீடு] MOVE_FORWARD () [/குறியீடு] மற்றும் [குறியீடு] டர்ன்_ரைட் () [/குறியீடு] ஆகியவற்றிற்கான அழைப்புகளை எழுதுங்கள். உங்களுக்காக முதல் இரண்டு வரிகளை எழுதினோம். ஒவ்வொரு வழிமுறையையும் ஒரு தனி வரியில் எழுத மறக்காதீர்கள். ஒவ்வொரு வரியும் ஒரு [குறியீடு] தாவல் [/குறியீடு] எழுத்துடன் தொடங்கப்பட வேண்டும், எனவே கணினி இது [குறியீடு] டிரா_ரெக்டாங்கல் () [/குறியீடு] செயல்பாட்டின் ஒரு பகுதியாகும் என்பதை புரிந்துகொள்கிறது.
zh_hans: 写出对函数 [code]move_forward()[/code] 和 [code]turn_right()[/code] 的调用，以绘制一个宽度为 220 像素、高度为 260 像素的矩形。 我们为你编写了前两行。 确保每条指令写在了单独的一行上。 每一行都应该以一个 [code]Tab[/code] 字符开头，以便计算机理解它是 [code]draw_rectangle()[/code] 函数的一部分。
zh_hant: 寫出呼叫 [code]move_forward()[/code] 和 [code]turn_right()[/code] 函式的程式碼來畫一個寬度為 220 像素，高度為 260 像素的矩形。 我們已經為你寫好了前兩行。 請確保每條指令都寫在單獨的一行。 每一行都應該以一個 [code]Tab[/code] 字元開頭，這樣電腦才能理解它是 [code]draw_rectangle()[/code] 函式的一部分。
