Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-18-for-loops.po
Languages: da, de, es, it, ja, nl, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: There's a safer and often easier kind of loop: the [code]for[/code] loop. We'll look at it in this lesson. Unlike [code]while[/code] loops, [code]for[/code] loops don't run infinitely, so it's much less likely that you'll get bugs in your game. [b]We recommend favoring for loops over while loops because of this[/b]. Let's change the code above to use a [code]for[/code] loop instead. The loop below will change the [code]cell[/code] three times.
de: Es gibt eine sicherere und oft einfachere Art von Schleife: die [code]for[/code]-Schleife. Diese werden wir uns in dieser Lektion ansehen. Im Gegensatz zu [code]while[/code]-Schleifen laufen [code]for[/code]-Schleifen nicht unendlich, so dass es viel unwahrscheinlicher ist, dass Du Fehler in deinem Spiel erhälst. [b]Aus diesem Grund empfehlen wir, for-Schleifen gegenüber while-Schleifen zu bevorzugen[/b]. Lass uns den obigen Code ändern, um stattdessen eine [code]for[/code]-Schleife zu verwenden. Die Schleife unten ändert die Variable [code]cell[/code] dreimal.
es: Hay un tipo de bucle que es más seguro y a menudo más fácil de utilizar: el bucle [code]for[/code]. Lo veremos en esta lección. A diferencia de los bucles [code]while[/code], los bucles [code]for[/code] no se ejecutan infinitamente, por lo que es mucho menos probable que obtengas errores en tu juego. [b]Debido a esto, recomendamos favorecer los bucles for sobre los bucles while[/b]. Cambiemos el código anterior para utilizar un bucle [code]for[/code] en su lugar. El bucle a continuación cambiará la [code]cell[/code] tres veces.
it: C'è una tipologia di ciclo più sicura e spesso più facile da usare: il ciclo [code]for[/code]. Lo esploreremo in questa lezione. Al contrario dei cicli [code]while[/code], i cicli [code]for[/code] non vengono eseguiti all'infinito, quindi ha molte meno probabilità di causare bug nel tuo gioco. [b]Ti consigliamo di preferire i cicli for al posto di quelli while per questo motivo[/b]. Cambiamo il codice qua sopra cosicché usi un ciclo [code]for[/code]. Il ciclo qui sotto cambierà la [code]cell[/code] tre volte.
ru: Существует более безопасный и, в большинстве случаев, более простой вид цикла: цикл [code]for[/code]. Мы рассмотрим его в этом уроке. В отличие от циклов [code]while[/code], циклы [code]for[/code] не могут выполняться бесконечно, поэтому, вероятность того, что их использование приведёт к ошибкам в вашей игре, гораздо меньше. [b]По этой причине мы рекомендуем использовать циклы for вместо циклов while везде, где это возможно[/b]. Давайте изменим приведённый выше код с использованием цикла [code]for[/code]. Цикл в примере ниже изменит [code]cell[/code] три раза.
zh_hans: 有一种更安全且通常更简便的循环：[code]for[/code] 循环。 我们将在本课中研究它。 与 [code]while[/code] 循环不同，[code]for[/code] 循环不会无限运行，因此在游戏中出现错误（bugs）的可能性要小得多。 [b]正因如此，我们建议优先使用 for 循环而不是 while 循环[/b]。 让我们将上面的代码改为使用 [code]for[/code] 循环。 下面的循环将更改 [code]cell[/code] 三次。
zh_hant: 有一種更安全且通常更簡單的迴圈：[code]for[/code] 迴圈。 我們會在本課中學習它。 與 [code]while[/code] 迴圈不同，[code]for[/code] 迴圈不會無限執行，因此更不容易讓你的遊戲出現錯誤。[b]因此我們建議優先使用 for 迴圈，而不是 [code]while[/code] 迴圈。[/b] 現在讓我們將上面的程式碼改為 [code]for[/code] 迴圈。 以下的迴圈將改變 [code]cell[/code] 三次。

source: Godot has the helper function [code]range()[/code]. Calling [code]range(n)[/code] creates a list of numbers from [code]0[/code] to [code]n - 1[/code]. So calling [code]range(3)[/code] outputs the list of numbers [code][0, 1, 2][/code], and [code]range(5)[/code] outputs [code][0, 1, 2, 3, 4][/code].
de: Godot hat die Hilfsfunktion [code]range()[/code]. Wenn du [code]range(n)[/code] aufrufst, wird eine Liste von Zahlen von [code]0[/code] bis [code]n - 1[/code] erstellt. Wenn du also [code]range(3)[/code] aufrufst, wird die Liste der Zahlen [code][0, 1, 2][/code] ausgegeben, und [code]range(5)[/code] gibt [code][0, 1, 2, 3, 4][/code] aus.
es: Godot tiene la función auxiliar [code]range()[/code]. Al llamar a [code]range(n)[/code], se crea una lista de números desde [code]0[/code] hasta [code]n - 1[/code] Así, llamar a [code]range(3)[/code] genera la lista de números [code][0, 1, 2][/code], y [code]range(5)[/code] genera [code][0, 1, 2, 3, 4][/code].
it: Godot dispone della funzione di aiuto [code]range()[/code]. Chiamando [code]range(n)[/code] si crea un elenco di numeri da [code]0[/code] a [code]n - 1[/code]. Quindi, chiamando [code]range(3)[/code] si ottiene l'elenco di numeri [code][0, 1, 2][/code], mentre [code]range(5)[/code] produce [code][0, 1, 2, 3, 4][/code].
ru: В Godot есть вспомогательная функция [code]range()[/code]. Вызов [code]range(n)[/code] создаёт список чисел от [code]0[/code] до [code]n - 1[/code]. Таким образом, вызов [code]range(3)[/code] создаст список чисел [code][0, 1, 2][/code], а [code]range(5)[/code] создаст список [code][0, 1, 2, 3, 4][/code].
zh_hans: Godot 有这个叫 [code]range()[/code] 的辅助函数 。 调用 [code]range(n)[/code] 会创建一个从 [code]0[/code] 到 [code]n - 1[/code] 的数字列表。 所以调用[code]range(3)[/code]会输出数字列表[code][0,1,2][/code]，[code]range(5)[/code]输出[code][ 0、1、2、3、4][/code]。
zh_hant: Godot 有一個輔助函式 [code]range()[/code]。呼叫 [code]range(n)[/code] 會創建一個從 [code]0[/code] 到 [code]n - 1[/code] 的數字列表。 因此呼叫 [code]range(3)[/code] 會輸出數字列表 [code][0, 1, 2][/code]，而 [code]range(5)[/code] 會輸出 [code][0, 1, 2, 3, 4][/code]。

source: The function [code]range(n)[/code] creates a list of numbers from [code]0[/code] to [code]n - 1[/code]. The output list will start with [code]0[/code] and end with [code]5[/code]. So calling [code]range(6)[/code] will output a list of six numbers which are [code][0, 1, 2, 3, 4, 5][/code].
de: Die Funktion [code]range(n)[/code] erstellt eine Liste von Zahlen von [code]0[/code] bis [code]n - 1[/code]. Die Ausgabeliste beginnt mit [code]0[/code] und endet mit [code]5[/code]. Wenn Du also [code]range(6)[/code] aufrufst, wird eine Liste von sechs Zahlen ausgegeben, die [code][0, 1, 2, 3, 4, 5][/code] sind.
es: La función [code]range(n)[/code] crea una lista de números desde [code]0[/code] hasta [code]n - 1[/code]. La lista de salida comenzará con [code]0[/code] y terminará con [code]5[/code]. Así, al llamar a [code]range(6)[/code], se generará una lista de seis números que son [code][0, 1, 2, 3, 4, 5][/code].
it: La funzione [code]range(n)[/code] crea una lista di numeri da [code]0[/code] a [code]n - 1[/code]. La lista risultante inizierà da [code]0[/code] e finirà con [code]5[/code]. Quindi chiamare [code]range(6)[/code] darà come risultato una lista di sei numeri che sono [code][0 ,1 ,2 ,3 ,4 , 5][/code].
ru: Функция [code]range(n)[/code] создаёт список чисел от [code]0[/code] до [code]n - 1[/code]. Выходной список будет начинаться с [code]0[/code] и заканчиваться на [code]5[/code]. Поэтому вызов [code]range(6)[/code] выведет список из шести чисел: [code][0, 1, 2, 3, 4, 5][/code].
zh_hans: 函数 [code]range(n)[/code] 创建一个从 [code]0[/code] 到 [code]n - 1[/code] 的数字列表。 输出列表会从 [code]0[/code] 开始，到 [code]5[/code] 结束。 所以调用 [code]range(6)[/code] 将输出一个包含六个数字的列表，它们是 [code][0, 1, 2, 3, 4, 5][/code]。
zh_hant: [code]range(n)[/code] 函式會創建一個從 [code]0[/code] 到 [code]n - 1[/code] 的數字列表。輸出的列表將以 [code]0[/code] 開始，並以 [code]5[/code] 結束。 因此呼叫 [code]range(6)[/code] 會輸出六個數字的列表：[code][0, 1, 2, 3, 4, 5][/code]。

source: In the above example, for each item in the list [code][0, 1, 2][/code], Godot sets [code]number[/code] to the item, then executes the code in the [code]for[/code] loop. We'll explain arrays more thoroughly in the next lesson, but notice that [code]number[/code] is just a temporary variable. You create it when defining the loop, and the loop takes care of changing its value. Also, you can name this variable anything you want. This code behaves the same as the previous example:
de: Im obigen Beispiel legt Godot für jedes Element in der Liste [code][0, 1, 2][/code] die Variable [code]number[/code] auf das aktuelle Element fest und führt dann den Code in der [code]for[/code]-Schleife aus. Wir werden in der nächsten Lektion die Arrays ausführlicher behandeln. Für den Moment beachte, dass [code]number[/code] eine temporäre Variable ist. Du erstellst sie, sobald du eine Schleife definierst. Die Schleife kümmert sich dann selbständig um die Änderung des Wertes der Variablen. Diese Programm verhält sich genauso wie das vorige Beispiel:
es: En el ejemplo anterior, para cada elemento de la lista [code][0, 1, 2][/code], Godot asigna el elemento a la variable [code]number[/code], y luego ejecuta el código en el bucle [code]for[/code]. Explicaremos los arrays con más detalle en la próxima lección, pero fíjate en que [code]number[/code] es sólo una variable temporal. La creas cuando defines el bucle, y el bucle se encarga de cambiar su valor. Además, puedes nombrar esta variable como quieras. Este código se comporta igual que el ejemplo anterior:
it: Nell'esempio precedente, per ogni elemento dell'elenco [code][0, 1, 2][/code], Godot imposta [code]numero[/code] all'elemento, quindi esegue il codice nel ciclo [code]for[/code]. Spiegheremo meglio gli array nella prossima lezione, ma notate che [code]number[/code] è solo una variabile temporanea. La si crea quando si definisce il ciclo e il ciclo si occupa di modificarne il valore. Inoltre, è possibile dare a questa variabile il nome che si desidera. Questo codice si comporta come l'esempio precedente:
ru: В примере ниже, для каждого элемента в списке [code][0, 1, 2][/code] Godot присваивает [code]number[/code] значение числа, а затем выполняет код тела цикла [code]for[/code]. В этом примере мы выводим значение [code]number[/code] в процессе продвижения Godot через цикл. Вы создаете его при определении цикла, и цикл сам заботится об изменении своего значения. Кроме того, вы можете назвать эту переменную как угодно. Этот код ведёт себя похожим образом с кодом из предыдущего примера:
zh_hans: 在上面的例子中，对于列表 [code][0, 1, 2][/code] 中的每一项，Godot 将 [code]number[/code]（数字，临时变量）设置为该项，然后执行 [code]for[/code] 循环中的代码。 我们会在下节课中更加仔细地解释数组（一系列的数值），需要注意的是 [code]number[/code] 只是一个临时变量。它是在创建循环的时候被定义的，然后它的值的变化被循环本身接管。当然，你可以给这个临时变量起任何你想要的名字。 下列的代码和上面的代码是完全等效的：
zh_hant: 在上述範例中，對於列表 [code][0, 1, 2][/code] 中的每個項目，Godot 會將 [code]number[/code] 設為該項目，然後執行 [code]for[/code] 迴圈中的程式碼。 我們會在下堂課更詳細地解釋陣列(Array)，但要注意的是 [code]number[/code] 只是個暫時變數。你在定義迴圈時創建它，並且迴圈會負責改變它的值。此外你可以隨意命名這個變數。 這段程式碼的行為和之前的範例相同：

source: In both examples, we print the value of the temporary variable we created: [code]number[/code] in the first example and [code]element[/code] in the second. As Godot moves through the loop, it assigns each value of the array to that variable. First, it sets the variable to [code]0[/code], then to [code]1[/code], and finally, to [code]2[/code]. We can break down the instructions the loop runs. You can see how a loop is a shortcut to code that otherwise gets very long.
de: In beiden Beispielen lassen wir den Wert, der von uns erstellten temporären Variablen ausgeben: [code]number[/code] im ersten und [code]element[/code] im zweiten Beispiel. Das Feld wird von Godot Wert für Wert durchlaufen und der gerade aktuelle Wert wird der temporären Variablen zugewiesen. Zuerst wird die Variable auf [code]0[/code] gesetzt, dann auf [code]1[/code] und letztlich auf [code]2[/code]. Wir können die Schleife in einzelne Anweisungen zerlegen. Das zeigt, dass eine Schleife abkürzt, was sonst ziemlich viel wird.
es: En ambos ejemplos, imprimimos el valor de la variable temporal que hemos creado: [code]número[/code] en el primer ejemplo y [code]elemento[/code] en el segundo. A medida que Godot avanza por el bucle, asigna cada valor de la matriz a esa variable. Primero, asigna a la variable el valor [code]0[/code], luego el valor [code]1[/code] y, por último, el valor [code]2[/code]. Podemos desglosar las instrucciones que ejecuta el bucle. Puedes ver cómo un bucle es un atajo para un código que, de otro modo, sería muy largo.
it: In entrambi gli esempi, stampiamo il valore della variabile temporanea creata: [code]number[/code] nel primo esempio e [code]element[/code] nel secondo. Man mano che Godot procede nel ciclo, assegna ogni valore dell'array a quella variabile. Prima imposta la variabile a [code]0[/code], poi a [code]1[/code] e infine a [code]2[/code]. Possiamo suddividere le istruzioni che il ciclo esegue. Si può notare come un ciclo sia una scorciatoia per un codice che altrimenti diventerebbe molto lungo.
ru: В обоих примерах мы печатаем значение созданной нами временной переменной: [code]number[/code] в первом примере и [code]element[/code] во втором. По мере прохождения цикла Godot присваивает каждое значение массива этой переменной. Сначала он присваивает переменной значение [code]0[/code], затем значение [code]1[/code] и, наконец, значение [code]2[/code]. Мы можем остановить инструкции, которые выполняет цикл. Вы можете видеть, что цикл — это специальный приём упрощения кода, который другим способом становится очень длинным.
zh_hans: 在这两个示例中，都打印出了创建的临时变量的值： 第一个示例中的 [code]number[/code]，第二个示例中的 [code]element[/code]。 Godot 在循环中移动时，会将数组的每个值依次赋值给该变量。首先，它将变量设置为 [code]0[/code]，然后设置为 [code]1[/code]，最后设置为 [code]2[/code]。 我们可以对循环运行的指令进行细分。可以看到，循环是写代码的捷径，直接写代码会变得很长。
zh_hant: 在兩個範例中，我們列印了創建的暫時變數的值：第一個範例是 [code]number[/code]，第二個範例是 [code]element[/code]。 當 Godot 執行迴圈時，它將陣列中的每個值指定給該變數。首先，它將變數設為 [code]0[/code]，接著是 [code]1[/code]，最後是 [code]2[/code]。 我們可以分解迴圈執行的指令。你可以看到迴圈是一種捷徑，能夠簡化原本會變得非常長的程式碼。

source: Rather than constantly checking if the robot reached the end of the board, with the [code]for[/code] loop, we take the board's width beforehand, then move the robot a set amount of times. The function still works the same. You can execute it below.
de: Anstatt ständig zu überprüfen, ob der Roboter das Ende des Bretts erreicht hat, nehmen wir mit der [code]for[/code]-Schleife die Breite des Bretts und bewegen den Roboter eine bestimmten Anzahl von Malen. Die Funktion funktioniert immer noch gleich. Du kannst es unten ausführen.
es: En lugar de comprobar constantemente si el robot ha llegado al final del tablero, con el bucle [code]for[/code], tomamos el ancho del tablero de antemano y luego movemos el robot una cantidad determinada de veces. La función sigue funcionando igual. Puedes ejecutarla a continuación.
it: Invece di controllare costantemente se il robot ha raggiungo la fine della tavola, con il ciclo [code]for[/code], prima prendiamo la larghezza della tavola, poi muoviamo il robot un determinato numero di volte. La funzione funziona sempre allo stesso modo. Puoi eseguirlo qui sotto.
ru: Вместо того, чтобы каждый раз проверять, достиг ли робот конца доски, в цикле [code]for[/code] мы можем взять ширину доски перед выполнением итераций, а после — передвинуть робота требуемое количество раз. Функция всё ещё работает точно так же. Вы можете выполнить её ниже.
zh_hans: 与其不断检查机器人是否到达棋盘末端，我们用 [code]for[/code] 循环，预先获取棋盘的宽度，然后让机器人移动一定的次数就好了。 这个函数的功能还是一样的。 你可以在下面执行它。
zh_hant: 不需要一直檢查機器人是否達到棋盤的終點，使用 [code]for[/code] 迴圈後，我們可以事先取得棋盤的寬度，然後讓機器人移動固定次數。 這個函式的運作方式仍然相同。你可以在下面執行它。

source: Once again, the robot has decided to stand at the top of the board. This time, use a [code]for[/code] loop in the [code]move_to_bottom()[/code] function to have it move to the bottom of the board. The board size is determined by the [code]Vector2[/code] variable [code]board_size[/code]. The robot's starting cell is [code]Vector2(2, 0)[/code].
de: Wieder einmal hat sich der Roboter entschieden, an der Spitze des Spielbretts zu stehen. Verwende dieses Mal eine [code]for[/code]-Schleife in der Funktion [code]move_to_bottom()[/code], damit er sich an die Unterseite des Spielbretts bewegt. Die Spielbrettgröße wird durch die [code]Vector2[/code]-Variable [code]board_size[/code] bestimmt. Die Startzelle des Roboters ist [code]Vector2(2, 0)[/code].
es: Una vez más, el robot ha decidido situarse en la parte superior del tablero. Esta vez, utiliza un bucle [code]for[/code] en la función [code]move_to_bottom()[/code] para que se desplace a la parte inferior del tablero. El tamaño del tablero está determinado por la variable [code]Vector2[/code] llamada [code]board_size[/code]. La celda inicial del robot es [code]Vector2(2, 0)[/code].
it: Un'altra volta, il robot ha deciso di stare in cima alla tavola. Questa volta, usa un ciclo [code]for[/code] nella funzione [code]move_to_bottom()[/code] per far sì che il robot arrivi alla fine della tavola. La grandezza della tavola è determinata dalla variabile [code]Vector2[/code] [code]board_size[/code]. La cella iniziale del robot è [code]Vector2(2, 0)[/code].
ru: Робот снова решил остановиться в верхней части доски. В этот раз используйте цикл [code]for[/code] в функции [code]move_to_bottom()[/code], чтобы переместить робота в нижнюю часть доски. Размер доски определяется переменной типа [code]Vector2[/code] — [code]board_size[/code]. Стартовая ячейка робота — [code]Vector2(2, 0)[/code].
zh_hans: 和上次一样，机器人站在棋盘的顶部。 这一次，在 [code]move_to_bottom()[/code] 函数中使用 [code]for[/code] 循环让它移动到棋盘的底部。 棋盘大小由 [code]Vector2[/code] 变量 [code]board_size[/code] 决定。 机器人的起始单元是 [code]Vector2(2, 0)[/code]。
zh_hant: 再一次，機器人決定站在棋盤上方。 這次請在 [code]move_to_bottom()[/code] 函式中使用 [code]for[/code] 迴圈，讓它移動到棋盤的底部。 棋盤的大小由 [code]Vector2[/code] 變數 [code]board_size[/code] 決定。 機器人初始的位置是 [code]Vector2(2, 0)[/code]。

source: Use a [code]for[/code] loop to remove the duplicate code in the [code]run()[/code] function. In this practice, we revisit the turtle and drawing rectangles. With our new knowledge of [code]for[/code] loops, we can condense this code to take up less space and make it easier to modify. The turtle should draw three squares in a horizontal line. The squares should be 100 pixels apart.
de: Verwende eine [code]for[/code]-Schleife, um den doppelten Code in der Funktion [code]run()[/code] zu entfernen. In dieser Übung kommen wir zu der Schildkröte zurück und zeichnen Rechtecke. Mit unserem neuen Wissen über [code]for[/code]-Schleifen können wir diesen Code verkürzen, um weniger Platz zu beanspruchen und spätere Änderungen zu erleichtern. Die Schildkröte soll drei Quadrate in einer horizontalen Linie zeichnen. Die Quadrate sollen 100 Pixel voneinander entfernt sein.
es: Utiliza un bucle [code]for[/code] para eliminar el código duplicado en la función [code]run()[/code]. En esta práctica, volvemos a hablar de la tortuga y de dibujar rectángulos. Con nuestros nuevos conocimientos sobre los bucles [code]for[/code], podemos condensar este código para que ocupe menos espacio y sea más fácil de modificar. La tortuga debe dibujar tres cuadrados en una línea horizontal. Los cuadrados deben estar separados por 100 pixeles.
it: Usa un ciclo [code]for[/code] per rimuovere il codice duplicato nella funzione [code]run()[/code]. In questa pratica, rivisitiamo la tartaruga e l'illustrazione di rettangoli. Con la nostra nuova conoscenza sui cicli [code]for[/code], possiamo condensare questo codice per far sì che occupi meno spazio e che sia più facile da modificare. La tartaruga dovrebbe disegnare tre quadrati in una linea orizzontale. I quadrati dovrebbero essere a 100 pixel di distanza l'uno dall'altro.
ru: Используйте цикл [code]for[/code] для удаления дубликатов кода в функции [code]run()[/code]. В этом упражнении мы вернёмся к черепахе и рисованию прямоугольников. Наши новые знания циклов [code]for[/code] позволяют нам сократить этот код, чтобы он занимал меньше места и его было проще модифицировать. Черепаха должна нарисовать три квадрата горизонтально, друг за другом. Сторона квадрата должна быть равна 100 пикселям.
zh_hans: 使用 [code]for[/code] 循环简化 [code]run()[/code] 函数中的重复代码。 在这个练习中，我们又重新请到了小海龟来绘制矩形。 借助新知识 [code]for[/code] 循环，我们可以压缩此代码，占用更少的空间并更易于修改。 小海龟应该在水平方向上画三个正方形。 正方形应相距 100 像素。
zh_hant: 使用 [code]for[/code] 迴圈來移除 [code]run()[/code] 函式中的重複程式碼。 在這個練習中，我們將重新使用烏龜並繪製矩形。 運用我們剛學到的 [code]for[/code] 迴圈，我們可以讓程式碼更精簡，使其更容易修改。 烏龜應該在水平方向上繪製三個正方形，且每個正方形之間應間隔 100 像素。
