Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-28-specifying-types.po
Languages: cs, da, de, ru, ta, uk, zh_hant

source: By default, GDScript is what we call a dynamically-typed language. That means that you can just write variables, assign them a value with a number, and assign them another value with a different type.
da: Som standard er GDScript, hvad vi kalder et dynamisk type sprog. Det betyder, at du bare kan skrive variabler, tildele dem en værdi med et nummer og tildele dem en anden værdi med en anden type.
de: Standardmäßig ist GDScript eine so genannte dynamisch typisierte Sprache. Das bedeutet, dass du einfach Variablen erstellen, ihnen einen Wert mit einer Zahl zuweisen und ihnen dann einen anderen Wert mit einem anderen Typ zuweisen kannst.
ru: По умолчанию, GDScript — динамически типизированный язык. Это значит, что вы можете просто создать переменную, присвоить ей числовое значение, а затем присвоить ей же значение другого типа.
ta: இயல்பாக, GDSCRIPT என்பது மாறும் தட்டச்சு செய்யப்பட்ட மொழி என்று நாம் அழைக்கிறோம். அதாவது நீங்கள் மாறிகள் எழுதலாம், அவர்களுக்கு ஒரு எண்ணுடன் ஒரு மதிப்பை ஒதுக்கலாம், வேறு வகையுடன் மற்றொரு மதிப்பை ஒதுக்கலாம்.
uk: За замовчуванням GDScript — це те, що ми називаємо динамічно типізованою мовою. Це означає, що ви можете просто написати змінні, призначити їм значення за допомогою числа та призначити їм інше значення іншого типу.

source: Unlike in some other languages, in GDScript, the following code is valid.
da: I modsætning til nogle andre sprog, i GDScript, er følgende kode gyldig.
de: Im Gegensatz zu einigen anderen Sprachen funktioniert in GDScript der folgende Code problemlos.
ru: В отличии от некоторых других языков, в GDScript следующий код является допустимым.
ta: வேறு சில மொழிகளைப் போலல்லாமல், GDSCRIPT இல், பின்வரும் குறியீடு செல்லுபடியாகும்.
uk: На відміну від деяких інших мов, у GDScript наступний код дійсний.

source: But this feature often causes problems down the line. Let's take one example.
cs: Tato funkce však často způsobuje problémy. Podívejme se na jeden příklad.
da: Men denne funktion forårsager ofte problemer senere hen. Lad os tage et eksempel.
de: Aber diese Funktionalität kann oft zu Problemen führen. Schauen wir uns ein Beispiel an.
ru: Но эта особенность часто приводит к проблемам в дальнейшем. Давайте рассмотрим другой пример.
ta: ஆனால் இந்த நற்பொருத்தம் பெரும்பாலும் சிக்கல்களை ஏற்படுத்துகிறது. ஒரு உதாரணத்தை எடுத்துக்கொள்வோம்.
uk: Але ця функція часто викликає проблеми. Візьмемо один приклад.
zh_hant: 但這個特性經常會在後續開發中引發問題。讓我們來看一個例子。

source: Cell size: decimal number, or 2D vector?
cs: Velikost buňky: desetinné číslo, nebo 2D vektor?
da: Cellestørrelse: decimaltal eller 2D vektor?
de: Zellengröße: Dezimalzahl oder 2D-Vektor?
ru: Размер ячейки — это десятичная дробь или 2D вектор?
ta: செல் அளவு: தசம எண், அல்லது 2 டி திசையன்?
uk: Розмір комірки: десяткове число чи двовимірний вектор?
zh_hant: 格子的大小：小數或是二維向量？

source: Games use grids all the time, be it for grid-based gameplay or to make algorithms faster.
da: Spil bruger gitre hele tiden, hvad enten det er til gitterbaseret gameplay eller for at gøre algoritmer hurtigere.
de: Spiele verwenden ständig Raster, sei es für Raster-basiertes Gameplay oder um Algorithmen schneller zu machen.
ru: В играх постоянно используются сетки, например, для геймплея с привязкой к сетке или для увеличения скорости выполнения алгоритмов.
ta: விளையாட்டுகள் எல்லா நேரத்திலும் கட்டங்களைப் பயன்படுத்துகின்றன, இது கட்டம் அடிப்படையிலான விளையாட்டுக்காகவோ அல்லது வழிமுறைகளை விரைவாகச் செய்யவோ இருக்கலாம்.
uk: В іграх постійно використовуються сітки, чи то для гри на основі сітки, чи для пришвидшення алгоритмів.

source: When working with grids, you need to convert grid coordinates into positions in the game world all the time. To do so, you give each cell a size in pixels.
da: Når du arbejder med gitre, skal du hele tiden konvertere gitterkoordinater til positioner i spilverdenen. For at gøre det giver du hver celle en størrelse i pixels.
de: Wenn du mit Rastern arbeitest, musst du ständig Rasterkoordinaten in Positionen in der Spielwelt umwandeln. Dazu gibt man den Zellen eine fixe Größe in Pixeln.
ru: При работе с сетками вам постоянно приходится конвертировать координаты сетки в позиции игрового мира. Для этого вы передаёте каждой ячейке размер в пикселях.
ta: கட்டங்களுடன் பணிபுரியும் போது, நீங்கள் எல்லா நேரத்திலும் கட்டம் ஆயங்களை விளையாட்டு உலகில் நிலைகளாக மாற்ற வேண்டும். அவ்வாறு செய்ய, நீங்கள் ஒவ்வொரு கலத்திற்கும் பிக்சல்களில் ஒரு அளவைக் கொடுக்கிறீர்கள்.
uk: Працюючи з сітками, вам потрібно постійно перетворювати координати сітки в позиції в ігровому світі. Для цього ви задаєте кожній клітинці розмір у пікселях.

source: You'll likely pick one of two types for that: [code]float[/code] or [code]Vector2[/code], because pixel positions on the screen use [code]Vector2[/code] coordinates.
da: Du vil sandsynligvis vælge en af to typer til det: [code]float[/code] eller [code]Vector2[/code], fordi pixelpositioner på skærmen bruger [code]Vector2[/code]-koordinater.
de: Du wirst wahrscheinlich einen von zwei Typen dafür auswählen: [code]float[/code] oder [code]Vector2[/code], da Pixelpositionen auf dem Bildschirm [code]Vector2[/code] Koordinaten verwenden.
ru: Вероятнее всего, для этого вы будете использовать один из двух типов: [code]float[/code] или [code]Vector2[/code], потому что позиции пикселей на экране используют координаты [code]Vector2[/code].
ta: அதற்கான இரண்டு வகைகளில் ஒன்றைத் தேர்ந்தெடுப்பீர்கள்: [குறியீடு] மிதவை [/குறியீடு] அல்லது [குறியீடு] திசையன் 2 [/குறியீடு], ஏனெனில் திரையில் படப்புள்ளி நிலைகள் [குறியீடு] திசையன் 2 [/குறியீடு] ஆயத்தொகுதிகளைப் பயன்படுத்துகின்றன.
uk: Ймовірно, для цього ви виберете один із двох типів: [code]float[/code] або [code]Vector2[/code], оскільки позиції пікселів на екрані використовують координати [code]Vector2[/code].

source: Either of those two values would be fine:
da: En af disse to værdier ville være fint:
de: Jeder dieser beiden Werte wäre gut geeignet:
ru: Любое из этих двух значений подойдёт:
ta: அந்த இரண்டு மதிப்புகளில் ஒன்று நன்றாக இருக்கும்:
uk: Будь-яке з цих двох значень підійде:

source: Using a [code]Vector2[/code] could simplify some calculations. For example, when converting grid coordinates to game world coordinates.
cs: Použití [code]Vector2[/code] by mohlo zjednodušit některé výpočty. Například při převodu souřadnic mřížky na souřadnice herního světa.
da: Brug af en [code]Vector2[/code] kan forenkle nogle beregninger. For eksempel når man konverterer gitterkoordinater til spilverdenens koordinater.
de: Die Verwendung eines [code]Vector2[/code] könnte einige Berechnungen vereinfachen. Zum Beispiel beim Konvertieren von Raster-Koordinaten zu Spielwelt-Koordinaten.
ru: Использование [code]Vector2[/code] может упростить некоторые вычисления. Например, при конвертации координат сетки в координаты игрового мира.
ta: [குறியீடு] வெக்டர் 2 [/குறியீடு] ஐப் பயன்படுத்துவது சில கணக்கீடுகளை எளிதாக்கும். எடுத்துக்காட்டாக, கட்டம் ஆயங்களை விளையாட்டு உலக ஆயத்தொகுதிகளுக்கு மாற்றும்போது.
uk: Використання [code]Vector2[/code] може спростити деякі обчислення. Наприклад, при перетворенні координат сітки в координати ігрового світу.
zh_hant: 使用 [code]Vector2[/code] 可以簡化某些計算，例如在將網格座標轉換為遊戲世界座標時。

source: In this example, because both [code]cell[/code] and [code]cell_size[/code] are [code]Vector2[/code] values, we can add them.
da: I dette eksempel, fordi både [code]cell[/code] og [code]cell_size[/code] er [code]Vector2[/code]-værdier, kan vi lægge dem sammen.
de: Da in diesem Beispiel sowohl [code]cell[/code] als auch [code]cell_size[/code] Werte vom Typ [code]Vector2[/code] sind, können wir sie addieren.
ru: В этом примере и [code]cell[/code] и [code]cell_size[/code] являются значениями типа [code]Vector2[/code], поэтому мы можем их сложить.
ta: இந்த எடுத்துக்காட்டில், [குறியீடு] செல் [/குறியீடு] மற்றும் [குறியீடு] செல்_சைச் [/குறியீடு] இரண்டும் [குறியீடு] திசையன் 2 [/குறியீடு] மதிப்புகள் என்பதால், அவற்றை நாங்கள் சேர்க்கலாம்.
uk: Оскільки в цьому прикладі [code]cell[/code] і [code]cell_size[/code] є значеннями [code]Vector2[/code], ми можемо додати їх.

source: However, if [code]cell_size[/code] is a [code]float[/code], we will get a type error.
da: Men hvis [code]cell_size[/code] er en [code]float[/code], får vi en typefejl.
de: Wenn jedoch [code]cell_size[/code] ein [code]float[/code] ist, erhalten wir einen Typfehler.
ru: Однако, если бы [code]cell_size[/code] имел тип [code]float[/code], мы получили бы ошибку.
ta: இருப்பினும், [குறியீடு] செல்_சிச் [/குறியீடு] ஒரு [குறியீடு] மிதவை [/குறியீடு] என்றால், எங்களுக்கு ஒரு வகை பிழையைப் பெறுவோம்.
uk: Однак, якщо [code]cell_size[/code] є [code]float[/code], ми отримаємо помилку типу.

source: Worse: due to dynamic typing, we won't get an error [i]right away[/i]. We will only get the error when calling [code]grid_to_world(Vector2(1, 1))[/code].
da: Værre endnu: på grund af dynamisk typning får vi ikke en fejl [i]med det samme[/i]. Vi får kun fejlen, når vi kalder [code]grid_to_world(Vector2(1, 1))[/code].
de: Schlimmer noch: Aufgrund der dynamischen Typisierung erhalten wir nicht sofort einen Fehler [i][/i] . Der Fehler wird erst zur Laufzeit beim Aufruf von [code]grid_to_world(Vector2(1, 1))[/code] auftreten.
ru: А хуже всего то, что из-за динамической типизации эту ошибку мы получили бы [i]не при написании кода[/i], а в момент вызова [code]grid_to_world(Vector2(1, 1))[/code].
ta: மோசமானது: மாறும் தட்டச்சு காரணமாக, எங்களுக்கு இப்போதே பிழை கிடைக்காது [/i]. [குறியீட்டை] கட்டம்_டோ_வர்ட் (வெக்டர் 2 (1, 1)) [/குறியீடு] என்று அழைக்கும்போது மட்டுமே பிழையைப் பெறுவோம்.
uk: Гірше того: завдяки динамічному набору ми не отримаємо помилку [i]відразу[/i]. Ми отримаємо помилку лише під час виклику [code]grid_to_world(Vector2(1, 1))[/code].

source: And that's a big problem.
da: Og det er et stort problem.
de: Und das ist ein großes Problem.
ru: Это большая проблема.
ta: அது ஒரு பெரிய சிக்கல்.
uk: І це велика проблема.

source: Because we're learning, we only have small code examples in this course. But your games' code will get long and split into many files. When coding, you often forget about the code you wrote several weeks ago.
da: Fordi vi er i gang med at lære, har vi kun små kodeeksempler i dette kursus. Men koden i dine spil bliver lang og opdelt i mange filer. Når man koder, glemmer man ofte den kode, man skrev for flere uger siden.
de: Da wir lernen, haben wir in diesem Kurs nur kleine Code-Beispiele. Aber der Code deiner Spiele wird lang und in viele Dateien aufgeteilt sein. Beim Programmieren vergisst man oft den Code, den man vor einigen Wochen geschrieben hat.
ru: Весь код этого курса представлен небольшими примерами, чтобы вам было легче учиться. В ваших играх кода будет намного больше и он будет разбит на множество файлов. Часто, при программировании, код, написанный несколько недель назад, забывается.
ta: நாங்கள் கற்றுக்கொள்வதால், இந்த பாடத்திட்டத்தில் சிறிய குறியீடு எடுத்துக்காட்டுகள் மட்டுமே உள்ளன. ஆனால் உங்கள் விளையாட்டுகளின் குறியீடு நீண்ட காலமாகி பல கோப்புகளாகப் பிரிக்கும். குறியீட்டு முறை, பல வாரங்களுக்கு முன்பு நீங்கள் எழுதிய குறியீட்டை நீங்கள் அடிக்கடி மறந்துவிடுவீர்கள்.
uk: Оскільки ми вчимося, у нас є лише невеликі приклади коду в цьому курсі. Але код вашої гри буде довгим і розбиватиметься на багато файлів. Під час кодування ви часто забуваєте про код, який написали кілька тижнів тому.

source: And with a lot of code, it could take [i]hours[/i] of play before players trigger a type error in your code.
da: Og med meget kode kan det tage [i]timer[/i] spilletid, før spillerne udløser en typefejl i din kode.
de: Und bei einer Menge Code kann es [i]Stunden[/i] dauern, bis die Spieler einen Typen-Fehler in deinem Code auslösen.
ru: А при большой кодовой базе, ошибка может возникать спустя несколько [i]часов[/i] игры.
ta: நிறைய குறியீடுகளுடன், உங்கள் குறியீட்டில் வீரர்கள் ஒரு வகை பிழையைத் தூண்டுவதற்கு முன்பு இது [i] மணிநேரம் [/i] விளையாடலாம்.
uk: І з великою кількістю коду можуть знадобитися [i]години[/i] гри, перш ніж гравці виведуть помилку типу у вашому коді.

source: Using type hints
cs: Použití nápovědy(vymezení) typu
da: Brug af type hints
de: Verwenden von Typhinweisen
ru: Использование строгой типизации
ta: வகை குறிப்புகளைப் பயன்படுத்துதல்
uk: Використання підказок типу
zh_hant: 使用類型提示(type hints)

source: Fortunately, GDScript has optional [i]type hints[/i].
da: Heldigvis har GDScript valgfrie [i]typehints[/i].
de: Glücklicherweise verfügt GDScript über optionale [i]type hints[/i] (Typ-Hinweise).
ru: К счастью, GDScript имеет опциональные средства [i]строгого обозначения типов[/i] (строгой типизации).
ta: அதிர்ச்டவசமாக, GDSCRIPT விருப்பமான [i] வகை குறிப்புகளைக் கொண்டுள்ளது [/i].
uk: На щастя, GDScript має додаткові [i]підказки типу[/i].

source: Type hints let the computer know the value type you want for variables and report errors before running the code.
da: Typehints fortæller computeren, hvilken værditype du ønsker for variabler, og rapporterer fejl, før koden køres.
de: Typ-Hinweise teilen dem Computer mit, welchen Werttyp Du für Variablen wünschst und melden Fehler, bevor der Code ausgeführt wird.
ru: Обозначение типа позволяет компьютеру понять, какого типа значения вы хотите хранить в переменных, и оповестить вас об ошибках до выполнения кода.
ta: குறிப்புகளைத் தட்டச்சு செய்க நீங்கள் மாறிகளுக்கு நீங்கள் விரும்பும் மதிப்பு வகையை கணினிக்கு தெரியப்படுத்துங்கள் மற்றும் குறியீட்டை இயக்குவதற்கு முன் பிழைகள் புகாரளிக்கவும்.
uk: Підказки щодо типів дозволяють комп’ютеру знати тип значення, який ви хочете використовувати для змінних, і повідомляти про помилки перед виконанням коду.

source: To specify the type a variable can accept, you can write a colon and a type after the name when defining a new variable.
da: For at angive den type, en variabel kan acceptere, kan du skrive et kolon og en type efter navnet, når du definerer en ny variabel.
de: Den Typ einer Variablen können wir beim definieren der variablen festlegen. Dies geschieht mit einem Doppelpunkt gefolgt vom Typ nach dem Variable-Namen.
ru: Для обозначения типа переменной вы можете написать двоеточие и тип после имени, при определении новой переменной.
ta: ஒரு மாறி ஏற்றுக்கொள்ளக்கூடிய வகையை குறிப்பிட, புதிய மாறியை வரையறுக்கும் போது நீங்கள் ஒரு பெருங்குடல் மற்றும் பெயருக்குப் பிறகு ஒரு வகையை எழுதலாம்.
uk: Щоб указати тип, який може прийняти змінна, ви можете написати двокрапку та тип після імені під час визначення нової змінної.

source: You could tell the computer you want [code]cell_size[/code] only to accept [code]Vector2[/code] values like so.
cs: Počítači můžete říci, že chcete, aby [code]cell_size[/code] přijímal pouze hodnoty [code]Vector2[/code] takto.
da: Du kan fortælle computeren, at du kun vil have [code]cell_size[/code] til at acceptere [code]Vector2[/code] værdier, sådan her.
de: Das folgende Beispiel zeigt, wie du dem Computer mitteilen kannst, dass [code]cell_size[/code] nur [code]Vector2[/code]-Werte akzeptieren soll.
ru: Вы можете сказать компьютеру, что хотите хранить в переменной [code]cell_size[/code] только значения типа [code]Vector2[/code].
ta: நீங்கள் விரும்பும் கணினியை நீங்கள் சொல்ல முடியும் [குறியீடு] செல்_சைச் [/குறியீடு][குறியீடு] திசையன் 2 [/குறியீடு] மதிப்புகளை ஏற்றுக்கொள்ள மட்டுமே.
uk: Ви можете сказати комп’ютеру, що ви хочете, щоб [code]cell_size[/code] приймав лише такі значення [code]Vector2[/code].
zh_hant: 你可以這樣告訴電腦，[code]cell_size[/code] 只能接受 [code]Vector2[/code] 值，像下面這樣。

source: If you try to replace the [code]cell_size[/code] with a value of another type later, the computer will not let you.
cs: Pokud se pokusíte později nahradit [code]cell_size[/code] hodnotou jiného typu, počítač vám to nedovolí.
da: Hvis du senere forsøger at erstatte [code]cell_size[/code] med en værdi af en anden type, vil computeren ikke tillade dig det.
de: Wenn du später versuchst, die [code]cell_size[/code] durch einen Wert eines anderen Typs zu ersetzen, wird ein Fehler angezeigt.
ru: Если после этого вы попробуете поместить в [code]cell_size[/code] значение другого типа, компьютер не позволит вам это сделать.
ta: [குறியீடு] செல்_சைச் [/குறியீடு] ஐ மற்றொரு வகையின் மதிப்புடன் மாற்ற முயற்சித்தால், கணினி உங்களை அனுமதிக்காது.
uk: Якщо ви пізніше спробуєте замінити [code]cell_size[/code] на значення іншого типу, комп’ютер вам не дозволить.
zh_hant: 如果你之後嘗試用其他類型的值替換 [code]cell_size[/code]，電腦將不允許你這麼做。

source: Letting the computer figure it out
cs: Nechte počítač, aby to vyřešil
da: Lad computeren finde ud af det
de: Lass es den Computer herausfinden
ru: Позволяем компьютеру обозначить тип самостоятельно
ta: கணினி அதை கண்டுபிடிக்க அனுமதிக்கிறது
uk: Дозвольте комп’ютеру розібратися
zh_hant: 讓電腦自動判斷

source: GDScript comes with a feature called [i]type inference[/i]. In many cases, but not all, the computer can figure out the type of a variable for you.
da: GDScript leveres med en funktion kaldet [i]typeinferens[/i]. I mange tilfælde, men ikke alle, kan computeren finde ud af typen af en variabel for dig.
de: GDScript verfügt über eine Funktion namens [i]type inference[/i]. In vielen Fällen, aber nicht in allen, kann der Computer den Typ einer Variablen für uns herausfinden.
ru: GDScript имеет особенность, называемую [i]вывод типов[/i]. Благодаря ей, во многих случаях, но не во всех, компьютер сможет самостоятельно обозначить тип переменной за вас.
ta: GDSCRIPT [I] வகை அனுமானம் [/i] எனப்படும் அம்சத்துடன் வருகிறது. பல சந்தர்ப்பங்களில், ஆனால் அனைத்துமே இல்லை, கணினி உங்களுக்கான மாறியின் வகையை கண்டுபிடிக்க முடியும்.
uk: GDScript має функцію під назвою [i]виведення типу[/i]. У багатьох випадках, але не у всіх, комп’ютер може визначити для вас тип змінної.

source: To do so, you write [code]:=[/code], without the type. The computer will set the type using the value after the equal sign. We could make [code]cell_size[/code] a variable of type [code]Vector2[/code] like so:
da: For at gøre det, skriver du [code]:=[/code] uden typen. Computeren vil indstille typen ved hjælp af værdien efter lighedstegnet. Vi kunne lave [code]cell_size[/code] til en variabel af typen [code]Vector2[/code] sådan her:
de: Dazu schreibst du [code]:=[/code], ohne den Typ. Der Computer bestimmt den Typ anhand des Wertes nach dem Gleichheitszeichen. So könnten wir [code]cell_size[/code] zu einer Variablen des Typs [code]Vector2[/code] machen ohne selbst den Typ anzugeben:
ru: Для того, чтобы ею воспользоваться, напишите [code]:=[/code] без типа. Компьютер установит переменной тот тип, который имеет значение после знака равенства. Мы можем сделать [code]cell_size[/code] переменной типа [code]Vector2[/code] вот так:
ta: அவ்வாறு செய்ய, நீங்கள் [குறியீடு]: = [/குறியீடு], வகை இல்லாமல் எழுதுகிறீர்கள். சமமான அடையாளத்திற்குப் பிறகு மதிப்பைப் பயன்படுத்தி கணினி வகையை அமைக்கும். [குறியீடு] செல்_சைச் [/குறியீடு] வகை [குறியீடு] திசையன் 2 [/குறியீடு] இன் மாறியை உருவாக்கலாம்:
uk: Для цього напишіть [code]:=[/code] без типу. Комп’ютер встановить тип, використовуючи значення після знака рівності. Ми могли б зробити [code]cell_size[/code] змінною типу [code]Vector2[/code] так:

source: This takes little typing, yet you get the benefits of using type hints, like the computer reporting errors better and faster.
cs: To vyžaduje jen trochu psaní, ale získáte výhody používání nápovědy k typu, například počítač lépe a rychleji hlásí chyby.
da: Det kræver kun lidt indtastning, men du får fordelene ved at bruge typetips, som f.eks. at computeren rapporterer fejl bedre og hurtigere.
de: Dies erfordert nur ein bisschen mehr Tipparbeit, aber du profitierst von den Vorteilen der Typen-Hinweise, so dass der Computer Fehler besser und schneller melden kann.
ru: Это почти не требует дополнительных усилий, но позволяет вам получить преимущества использования строгой типизации, с которой компьютер будет находить ошибки лучше и быстрее.
ta: இது சிறிய தட்டச்சு எடுக்கும், ஆனால் கணினி அறிக்கையிடல் பிழைகள் சிறப்பாகவும் வேகமாகவும் போன்ற வகை குறிப்புகளைப் பயன்படுத்துவதன் நன்மைகளைப் பெறுவீர்கள்.
uk: Для цього потрібно небагато набору тексту, але ви отримуєте переваги використання підказок типу, наприклад, комп’ютер краще та швидше повідомляє про помилки.
zh_hant: 這樣只要打一點字，卻能獲得使用型別提示的好處，像是電腦能更快、更準確地報告錯誤。

source: Why bother to add hints?
cs: Proč přidávat nápovědy typu?
da: Hvorfor besvære sig med at tilføje hints?
de: Warum sich die Mühe machen, Typen-Hinweise hinzuzufügen?
ru: Чем полезно обозначение типов?
ta: குறிப்புகளைச் சேர்க்க ஏன் கவலைப்படுவது?
uk: Навіщо додавати підказки?
zh_hant: 為什麼要加上型別提示？

source: When you give the language hints like that, it will [i]prevent[/i] major type errors. When you work in Godot, you will see that the computer can report issues as you write the code. It makes the benefit even greater.
da: Når du giver sproghints på den måde, vil det [i]forebygge[/i] større typefejl. Når du arbejder i Godot, vil du se, at computeren kan rapportere problemer, mens du skriver koden. Det gør fordelen endnu større.
de: Wenn Du dem Computer solche Hinweise gibst, wird er [i]größere Typenfehler verhindern[/i]. Wenn Du in Godot arbeitest, wirst du sehen, dass der Computer Probleme melden kann, während Du den Code schreibst. Das ist sehr nützlich und spart Zeit.
ru: Когда вы даёте языку подобные подсказки, это [i]предотвращает[/i] большую часть ошибок, связанных с неправильным использованием типов. При работе в Godot вы увидите, что компьютер будет оповещать вас об ошибках сразу же после написания кода. В дальнейшем это даст свои плоды.
ta: நீங்கள் அதுபோன்ற மொழி குறிப்புகளை வழங்கும்போது, அது [/i] முக்கிய வகை பிழைகளைத் தடுக்கும். நீங்கள் கோடோட்டில் பணிபுரியும் போது, நீங்கள் குறியீட்டை எழுதும்போது கணினி சிக்கல்களைப் புகாரளிக்க முடியும் என்பதை நீங்கள் காண்பீர்கள். இது நன்மையை இன்னும் அதிகமாக்குகிறது.
uk: Коли ви даєте такі підказки щодо мови, це [i]запобігає[/i] основним помилкам типу. Коли ви працюєте в Godot, ви побачите, що комп’ютер може повідомляти про проблеми під час написання коду. Це робить користь ще більшою.

source: Type hints can also help improve the readability of your code. It can help to put more information directly in the code. As we saw, types are essential when coding, and when using type hints, the computer will add them to the engine's built-in code documentation system.
da: Typehints kan også hjælpe med at forbedre læsbarheden af din kode. Det kan hjælpe med at sætte mere information direkte i koden. Som vi så, er typer afgørende, når man koder, og når man bruger typehints, vil computeren tilføje dem til motorens indbyggede kodedokumentationssystem.
de: Typ-Hinweise können auch dazu beitragen, die Lesbarkeit Deines Codes zu verbessern. Sie können helfen, mehr Informationen direkt in den Code einzubetten. Wie wir gesehen haben, sind Typen beim Programmieren unerlässlich, und wenn Du Typ-Hinweise verwendest, fügt der Computer sie dem integrierten Code-Dokumentationssystem der Engine hinzu.
ru: Обозначение типов также помогает улучшить читабельность вашего кода. Оно помогает поместить больше информации напрямую в код. Как мы сказали, типы — существенная часть программирования, строгое указание типов позволит компьютеру добавить их во встроенную в движок систему документации кода.
ta: உங்கள் குறியீட்டின் வாசிப்புத்திறனை மேம்படுத்தவும் வகை குறிப்புகள் உதவும். மேலும் தகவல்களை நேரடியாக குறியீட்டில் வைக்க இது உதவும். நாங்கள் பார்த்தபடி, குறியீட்டு முறை வகைகள் தேவை, மற்றும் வகை குறிப்புகளைப் பயன்படுத்தும் போது, கணினி அவற்றை இயந்திரத்தின் உள்ளமைக்கப்பட்ட குறியீடு ஆவணப்படுத்தல் அமைப்பில் சேர்க்கும்.
uk: Підказки щодо типів також можуть допомогти покращити читабельність вашого коду. Це може допомогти розмістити більше інформації безпосередньо в коді. Як ми бачили, типи є важливими під час кодування, і при використанні підказок типу комп’ютер додасть їх до вбудованої системи документації коду двигуна.
