Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-2-your-first-error.po
Languages: cs, da, de, es, fr, ja, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: When you program, you are bound to run into errors. Tons of them.
cs: Při programování určitě narazíte na chyby. Je jich spousta.
da: Når du programmere, er du dømt til at støde ind i fejl. Tonsvis af dem.
es: Cuando programas, es normal que te encuentres con errores. Toneladas de ellos.
fr: Lorsque vous programmez, vous allez forcément rencontrer des erreurs. Des tas.
ja: プログラミングをしていると、必ずと言っていいほどエラーに遭遇します。しかも頻繁に。
pt_br: Quando você programa, você está sujeito a cometer erros, um monte deles.
ru: В процессе программирования, вы обязательно столкнетесь с ошибками. С тоннами ошибок.
ta: நீங்கள் நிரல் செய்யும் போது, நீங்கள் பிழைகள் ஓட வேண்டியிருக்கும். அவற்றில் டன்.
tr: Program yazarken, hatalar ile karşılaşmanız kaçınılmaz. Hem de sürüyle.
zh_hans: 当你编写程序时，你肯定会遇到报错，而且超级多。

source: But you shouldn't worry! On the computer, [b]errors are a good thing[/b].
cs: Ale neměli byste si dělat starosti! V počítači jsou [b]chyby dobrá věc[/b].
da: Men du bør ikke bekymre dig! På computeren er [b]fejl en god ting[/b].
es: ¡Pero no debes preocuparte! En la computadora, [b]los errores son algo bueno[/b].
fr: Mais ne vous en faites pas ! Sur l'ordinateur, [b]les erreurs sont une bonne chose[/b].
ja: でも心配することはありません。コンピュータの世界では[b]エラーは良いモノ[/b]なのです。
pt_br: Mas não se preocupe! No computador, [b]erros são coisas boas[/b].
ru: Но не стоит беспокоиться! Ошибки в компьютере — [b]это хорошо и полезно[/b].
ta: ஆனால் நீங்கள் கவலைப்படக்கூடாது! கணினியில், [b] பிழைகள் ஒரு நல்ல சேதி [/b].
tr: Ama merak etmeyin! Bilgisayarla çalışırken, [b]hatalar iyi şeylerdir[/b].
zh_hans: 不过你不必担心！对于计算机而言，[b]报错是好事[/b]。

source: You will encounter errors, and [i]that's okay[/i]: every programmer does. Especially professionals.
cs: S chybami se setkáte a [i]to je v pořádku[/i]: setká se s nimi každý programátor. Zvláště profesionálové.
da: Du vil støde på fejl, og [i]det er okay[/i]: det gør enhver programmør. Især professionelle.
es: Te encontrarás con errores, y [i]eso está bien[/i]: a todos los programadores les pasa. Especialmente a los profesionales.
fr: Vous rencontrerez des erreurs et [i]c'est tout à fait normal[/i] : cela arrive à tous les programmeurs. Surtout aux professionnels.
ja: エラーにはよく遭遇します。しかし、[i]それでいいんです[/i]。プログラマーなら誰でもそうですし、もちろんプロも例外ではありません。
pt_br: Você vai se deparar com erros, e [i]está tudo bem[/i]: todo programador comete erros. Especialmente profissionais.
ru: Вы будете сталкиваться с ошибками, и [i]это нормально[/i]: каждый программист с ними сталкивается. Особенно профессионалы.
ta: நீங்கள் பிழைகளை சந்திப்பீர்கள், [i] அது சரி [/i]: ஒவ்வொரு புரோகிராமரும் செய்கிறார். குறிப்பாக தொழில் வல்லுநர்கள்.
tr: Hatalarla karşılaşacaksınız ve [i]bunda sorun yok[/i]: her programcının başına gelir. Özellikle profesyonel olanların.
zh_hans: 你会遇到报错，但[i]没有什么大不了的[/i]：所有程序员都会遇到。专业人士遇到得尤其多。

source: At school, maybe you learned that mistakes are a bad thing. When you code something, it's not the case: [b]errors help you write correct programs[/b] because they show you what is wrong in your programs.
cs: Ve škole jste se možná učili, že chyby jsou špatná věc. Když něco programujete, není tomu tak: [b]chyby vám pomáhají psát správné programy[/b], protože vám ukazují, co je ve vašich programech špatně.
da: På skolen, lærte du måske, at fejl er en dårlig ting. Når du koder noget, er det ikke tilfældet: [b]fejl hjælper dig med at skrive korrekte programmer[/b], fordi de viser dig, hvad der er galt i dine programmer.
es: En la escuela, quizás aprendiste que los errores son algo malo. Cuando codificas algo, no es así: [b]los errores te ayudan a escribir programas correctos[/b] porque te muestran lo que está mal en tus programas.
fr: À l'école, vous avez peut-être appris que les erreurs sont une mauvaise chose. Lorsque vous codez quelque chose, ce n'est pas le cas : [b]les erreurs vous aident à écrire des programmes corrects[/b] car elles vous montrent ce qui ne va pas dans vos programmes.
ja: 学校では間違いは悪いことだと習ったかもしれません。しかしプログラミングするときはそうではありません。[b]エラーは正しいプログラムを書くのに役に立ちます[/b]。
pt_br: Na escola, você pode ter aprendido que erros são coisas ruins. Quando você programa alguma coisa, esse não é o caso: [b]os erros te ajudam a escrever os programas corretamente[/b].
ru: В школе, возможно, вас научили тому, что ошибки — это плохо. Когда вы что-то программируете, это не так: [b]ошибки помогают вам писать правильные программы[/b], показывая что именно не так в ваших программах.
ta: பள்ளியில், தவறுகள் ஒரு மோசமான சேதி என்பதை நீங்கள் அறிந்து கொண்டிருக்கலாம். நீங்கள் எதையாவது குறியிடும்போது, அது அப்படி இல்லை: [b] சரியான நிரல்களை எழுத பிழைகள் உங்களுக்கு உதவுகின்றன [/b] ஏனெனில் உங்கள் நிரல்களில் என்ன தவறு இருக்கிறது என்பதை அவை உங்களுக்குக் காண்பிக்கும்.
tr: Okulda, hata yapmanın kötü bir şey olduğunu öğrenmiş olabilirsiniz. Bir şeyler kodlarken, durum böyle değildir: [i]hatalar size daha doğru programlar yazmakta yardımcı olur[/i] çünkü size programınızda neyin yanlış olduğunu gösterirler.
zh_hans: 在学校里，你可能认为犯错是坏事。当编写代码时，情况并非如此：[b]这些错误可以帮助你编写正确的程序[/b]，因为它们会告诉你在程序的哪里产生了错误。

source: A code error looks like this. It's a message that tells you some bit of your code doesn't work.
cs: Chybový kód vypadá takto. Je to zpráva, která vám říká, že některá část vašeho kódu nefunguje.
da: En kodefejl ligner dette. Det er en besked, der fortæller dig at lidt af din kode ikke virker.
de: Ein Codefehler sieht folgendermaßen aus. Es ist eine Nachricht, die dir sagt, dass ein Teil deines Codes nicht funktioniert.
es: Un error de código se ve así. Es un mensaje que te dice que alguna parte de tu código no funciona.
fr: Une erreur de code ressemble à ceci. C'est un message qui vous indique qu'une partie de votre code ne fonctionne pas.
ja: 例えばエラーは次のようなものです。これはコードの一部が動作しないことを伝えてくれるメッセージです。
pt_br: Um erro de código se parece com isso aqui. É uma mensagem que fala pra você que uma parte do seu código não está funcionando.
ru: Ошибка в коде выглядит следующим образом. Это сообщение, которое говорит вам, что какой-то фрагмент вашего кода не работает.
ta: ஒரு குறியீடு பிழை இப்படி தெரிகிறது. இது உங்கள் குறியீட்டில் சிலவற்றைச் சொல்லும் செய்தி.
tr: Bir kod hatası şöyle görünür. Size, kodunuzun bir parçasının çalışmadığını söyleyen bir bildirim (açıklaması da aşağıda).
uk: Помилка в коді виглядає так. Це повідомлення, в якому вам кажуть, що якийсь фрагмент коду не працює.
zh_hans: 代码错误看上去类似这样。这就是一条消息，告诉你你的代码里有些内容无法正常工作。
zh_hant: 程式碼錯誤看起來像這樣。這是個告訴你程式碼哪裡無法運作的訊息。

source: Making errors friendlier
cs: Přívětivější zacházení s chybami
da: At gøre fejl mere venlige
de: Fehler verständlicher machen
es: Hacer más amigables los errores
fr: Rendre les erreurs plus conviviales
ja: エラーと仲良くなるために
pt_br: Tornando os erros mais amigáveis
ru: Дружим вас с ошибками
ta: பிழைகள் நட்பானவை
tr: Hataları, daha dost canlısı yapmak
uk: Дружимо вас із помилками
zh_hans: 让报错更友好
zh_hant: 讓錯誤友善點

source: Error messages can look a bit cryptic. This is because they're designed by programmers, for trained programmers.
cs: Chybová hlášení mohou vypadat poněkud záhadně. Je to proto, že je navrhli programátoři pro vyškolené programátory.
da: Fejlmeddelelser kan se lidt kryptiske ud. Dette skyldes, at de er designet af programmører til uddannede programmører.
es: Los mensajes de error pueden parecer un poco crípticos. Esto se debe a que están diseñados por programadores, para programadores entrenados.
fr: Les messages d'erreur peuvent sembler un peu énigmatiques. C'est parce qu'ils sont conçus par des programmeurs, pour des programmeurs expérimentés.
ja: エラーメッセージは少し不可解に見えることがあります。こういったプログラムのエラーメッセージは、訓練されたプログラマー向けに設計されたものだからです。
pt_br: Mensagens de erro podem parecer um pouco enigmáticas. Isso ocorre porque eles foram feito por programadores, para programadores que já são treinados.
ru: Сообщения об ошибках могут выглядеть немного загадочно. Это потому, что они разработаны программистами, для подготовленных программистов.
ta: பிழை செய்திகள் சற்று ரகசியமாக இருக்கும். ஏனென்றால், அவர்கள் பயிற்சி பெற்ற புரோகிராமர்களுக்காக புரோகிராமர்களால் வடிவமைக்கப்பட்டுள்ளனர்.
tr: Hata bildirimleri biraz şifreli gibi görünebilir. Bunun sebebi, programcılar tarafından ve yine eğitimli programcılar için tasarlanmış olmaları.
zh_hans: 错误消息可能看上去很难理解。这是因为它们是程序员设计的，针对的是训练有素的程序员。

source: We added an error translator in this app that will help you get started.
cs: Do této aplikace jsme přidali překladač chyb, který vám pomůže začít.
da: Vi har tilføjet en fejloversætter i denne app, der hjælper dig med at komme i gang.
es: Hemos añadido un traductor de errores en esta aplicación que te ayudará a empezar.
fr: Nous avons ajouté un traducteur d'erreurs dans cette application qui vous aidera à démarrer.
ja: でも安心してください。このアプリにはエラー翻訳機能があります！
pt_br: Nós adicionamos um tradutor de erro nesse aplicativo que irá te ajudar a começar.
ru: Мы добавили в это приложение переводчик ошибок, который поможет вам начать работу.
ta: இந்த பயன்பாட்டில் பிழை மொழிபெயர்ப்பாளரை நாங்கள் சேர்த்துள்ளோம், அது தொடங்குவதற்கு உதவும்.
tr: Bu uygulama içerisinde, başlamanıza yardımcı olması için bir hata tercümanı ekledik.
zh_hans: 我们在这个应用中添加了错误翻译器，来帮助你入门。

source: It shows you why an error happens and what the message means. It also gives you some tips on how to fix it.
cs: Ukáže vám, proč k chybě dochází a co daná zpráva znamená. Poskytne vám také několik tipů, jak ji opravit.
da: Den viser dig, hvorfor en fejl opstår, og hvad meddelelsen betyder. Den giver dig også nogle tips til, hvordan du retter den.
es: Te muestra por qué se produce un error y qué significa el mensaje. También te da algunos consejos sobre cómo solucionarlo.
fr: Il vous montre pourquoi une erreur se produit et ce que signifie son message. Il vous donne également quelques conseils pour la corriger.
ja: なぜエラーが発生するのか、そのメッセージが何を意味するのかが分かりやすく解説されます。またそれを修正するためのヒントも教えてくれます。
pt_br: Ele mostra pra você o por que o erro está acontecendo e o que a mensagem significa. Ele também te dá algumas dicas de como resolver o erro.
ru: Он показывает, почему возникает ошибка и что означает данное сообщение. Переводчик также дает вам несколько советов о том, как исправить ошибку.
ta: பிழை ஏன் நடக்கிறது, செய்தி என்ன பொருள் என்பதை இது காட்டுகிறது. அதை எவ்வாறு சரிசெய்வது என்பதற்கான சில உதவிக்குறிப்புகளையும் இது வழங்குகிறது.
tr: Bu size, hatanın neden oluştuğunu ve hata mesajının ne anlama geldiğini gösterecek. Bunun yanında, onu nasıl düzelteceğiniz hakkında bazı ipuçları da verecek.
zh_hans: 它会显示为什么会报这个错误，以及错误消息是含义是什么。还会给你一些修复建议。

source: Error messages are designed on purpose by fellow programmers who came before you. They anticipated you might have specific issues and wanted to help you fix them.
cs: Chybová hlášení jsou záměrně navržena kolegy programátory, kteří přišli před vámi. Předpokládali, že byste mohli mít konkrétní problémy, a chtěli vám pomoci s jejich odstraněním.
da: Fejlmeddelelser er bevidst designet af andre programmører, der kom før dig. De forudså, at du måske havde specifikke problemer, og ville hjælpe dig med at løse dem.
es: Los errores son mensajes diseñados a propósito por otros programadores que te precedieron. Anticiparon que podrías tener problemas específicos.
fr: Les messages d'erreurs sont conçus exprès par d'autres programmeurs qui vous ont précédé. Ils ont anticipé que vous pourriez avoir des problèmes spécifiques et voulaient vous aider à les corriger.
ja: エラーは先人のプログラマーが意図的に作ったメッセージです。彼らはあなたが具体的な問題を抱えるかもしれないことを予期していたのです。
pt_br: Mensagens de erro são mensagens criadas por programadores que vieram antes de você. Eles anteciparam que você poderia ter alguns problemas específicos e queriam te ajudar a solucioná-los.
ru: Ошибки — это сообщения, специально созданные другими программистами, работавшими до вас. Они предполагали, что у вас могут возникнуть определенные проблемы.
ta: பிழை செய்திகள் உங்களுக்கு முன் வந்த தம புரோகிராமர்களால் நோக்கமாக வடிவமைக்கப்பட்டுள்ளன. உங்களுக்கு குறிப்பிட்ட சிக்கல்கள் இருக்கலாம் என்று அவர்கள் எதிர்பார்த்தனர், அவற்றை சரிசெய்ய உங்களுக்கு உதவ விரும்பினர்.
tr: Hata bildirimleri, sizden önce gelen meslektaş programcılar tarafından bilerek böyle tasarlandı. Sizin başınıza gelebilecek belirli sorunları önceden tahmin ettiler ve size bunları düzeltme konusunda yardım etmek istediler.
zh_hans: 错误信息是在你之前的程序员有意设计的。他们预计你会遇到特定的问题，并希望帮助你解决这些问题。

source: You shouldn't think of errors as failures. They are like mentors helping you from the past. Importantly, errors won't break your computer. At least not with GDScript because it's a pretty safe language.
cs: Chyby byste neměli považovat za selhání. Jsou jako rádci, kteří vám pomáhají z minulosti. Důležité je, že chyby váš počítač nerozbijí. Alespoň ne v jazyce GDScript, protože je to docela bezpečný jazyk.
da: Du bør ikke tænke på fejl som fiaskoer. De er som mentorer, der hjælper dig fra fortiden. Vigtigt er det, at fejl ikke vil ødelægge din computer. I hvert fald ikke med GDScript, fordi det er et ret sikkert sprog.
es: No debes considerar los errores como fallos. Son como mentores que te ayudan desde el pasado. Y lo que es más importante, los errores no romperán tu computadora. Al menos no con GDScript porque es un lenguaje bastante seguro.
fr: Vous ne devez pas considérer les erreurs comme des échecs. Elles sont comme des mentors qui vous aident depuis le passé. Aussi, sachez que les erreurs ne vont pas casser votre ordinateur. Du moins pas avec GDScript car c'est un langage assez sûr.
ja: エラーを失敗と考えるべきではありません。エラーはあなたを助けてくれる先生のような存在です。重要なのはエラーが起きてもあなたのコンピュータは壊れないということです。少なくともGDScriptは安全な言語ですから。
pt_br: Você não deve pensar que esses erros são falhas que você cometeu. Eles são como mentores que vieram do passado pra te ajudar. E o mais importante, esses erros não vão quebrar seu computador. Pelo menos não com o GDScript, que é uma linguagem bem segura.
ru: Вы не должны думать об ошибках как о неудачах. Они подобны наставникам, помогающим вам из прошлого. Важно отметить, что ошибки не сломают ваш компьютер. По крайней мере, не ошибки в GDScript, потому что этот язык довольно безопасен.
ta: பிழைகள் தோல்விகள் என்று நீங்கள் நினைக்கக்கூடாது. அவர்கள் கடந்த காலத்திலிருந்து உங்களுக்கு உதவும் வழிகாட்டிகளைப் போன்றவர்கள். முக்கியமாக, பிழைகள் உங்கள் கணினியை உடைக்காது. குறைந்தபட்சம் GDSCRIPT உடன் இல்லை, ஏனெனில் இது மிகவும் பாதுகாப்பான மொழி.
tr: Hataları, birer başarısızlık olarak düşünmemeye çalışın. Bunlar, geçmişten fırlayıp size yardım etmeye gelmiş rehberler gibidir. Daha önemlisi, hatalar bilgisayarınızı bozmazlar. En azından GDScript bunu yapmaz, çünkü oldukça güvenli bir dildir.
zh_hans: 你不应该把错误理解为自己的失败。它们是来自过去的导师，是来帮助你的。重要的是，错误并不会破坏你的电脑。至少用 GDScript 的时候不会，因为这是一门相当安全的语言。

source: Ultimately, you want to fix all the errors in your program. Understanding what is causing the errors, with the help of error messages, is key to fixing them.
cs: V konečném důsledku chcete opravit všechny chyby ve svém programu. Klíčem k jejich opravě je pochopení toho, co chyby způsobuje, pomocí chybových hlášení.
da: I sidste ende vil du rette alle fejlene i dit program. At forstå, hvad der forårsager fejlene, ved hjælp af fejlmeddelelser, er nøglen til at løse dem.
es: En definitiva, tienes que solucionar todos los errores de tu programa. Entender qué está causando los errores, con la ayuda de los mensajes de error, es clave para solucionarlos.
fr: Ultimement, vous voulez corriger toutes les erreurs de votre programme. La compréhension de la cause des erreurs, à l'aide des messages d'erreur, est essentielle pour les corriger.
ja: 最終的には、プログラム内のすべてのエラーを修正する必要があります。 エラー メッセージを利用してエラーの原因を理解することが、エラーを修正する鍵となります。
pt_br: O objetivo é corrigir todos os erros do seu programa. Entender a causa deles, com a ajuda das mensagens de erro, é a chave para corrigi-los.
ru: В конечном итоге вы хотите исправить все ошибки в вашей программе. Понимание причин ошибок с помощью сообщений об ошибках является ключом к их исправлению.
ta: இறுதியில், உங்கள் நிரலில் உள்ள அனைத்து பிழைகளையும் சரிசெய்ய விரும்புகிறீர்கள். பிழைகளை ஏற்படுத்துவதை, பிழை செய்திகளின் உதவியுடன் அவற்றைப் புரிந்துகொள்வது அவற்றை சரிசெய்ய முக்கியமானது.
tr: Eninde sonunda, programınızdaki tüm hataları düzeltmek isteyeceksiniz. Hata bildirimlerinin yardımıyla hataların sebebini anlamak, onları düzeltmenin anahtarıdır.
zh_hans: 最终，你需要修复程序中的所有错误。在错误信息的帮助下，了解导致错误的原因，这是修复错误的关键。

source: Are error messages a good or a bad thing in code?
cs: Jsou chybová hlášení v kódu dobrá nebo špatná věc?
da: Er fejlmeddelelser en god eller dårlig ting i kode?
de: Sind Fehler eine positive oder negative Erfahrung im Code?
es: ¿Los mensajes de error son buenos o malos en el código?
fr: Les messages d'erreur sont-ils une bonne ou une mauvaise chose dans le code ?
ja: プログラムのエラーは良いモノ？悪いモノ？
pt_br: Mensagens de erro são coisas boas ou ruins em um código?
ru: Ошибки в коде — это хорошо или плохо?
ta: பிழை செய்திகள் குறியீட்டில் நல்லதா அல்லது மோசமான விசயமா?
tr: Kodundaki hata bildirimleri iyi mi, yoksa kötü mü?
uk: Помилки в коді – це добре чи погано?
zh_hans: 代码中错误信息是好事还是坏事？
zh_hant: 程式碼的錯誤訊息是好事還壞事？

source: Yes, error messages are here to help you!
cs: Ano, chybová hlášení jsou tu proto, aby vám pomohla!
da: Ja, fejlmeddelelser er her for at hjælpe dig!
es: Sí, ¡los errores están aquí para ayudarte!
fr: Oui, les messages d'erreurs sont là pour vous aider !
ja: そうです。エラーメッセージはあなたを助けてくれる良いモノなのです。
pt_br: Sim, as mensagens de erro estão aqui pra te ajudar!
ru: Да, ошибки здесь, чтобы помочь вам!
ta: ஆம், உங்களுக்கு உதவ பிழை செய்திகள் இங்கே உள்ளன!
tr: Evet, hata bildirimleri size yardım etmek için buradalar.
zh_hans: 是的，报错是来帮你的！

source: Pay attention to them, and do your best to read and understand them. With experience, you'll learn to make your code work more reliably thanks to error messages.
cs: Věnujte jim pozornost a snažte se je číst a porozumět jim. Se zkušenostmi se naučíte, aby váš kód díky chybovým hlášením fungoval spolehlivěji.
da: Vær opmærksom på dem, og gør dit bedste for at læse og forstå dem. Med erfaring lærer du at få din kode til at fungere mere pålideligt takket være fejlmeddelelser.
es: Préstales atención, y haz todo lo posible para leerlos y comprenderlos. Con la experiencia, aprenderás a hacer que tu código funcione de forma más fiable gracias a los mensajes de error.
fr: Faites-y attention et faites de votre mieux pour les lire et les comprendre. Avec l'expérience, vous apprendrez à faire fonctionner votre code de manière plus fiable grâce aux messages d'erreur.
ja: エラーエラーメッセージを注意して読んで理解できるように頑張りましょう。経験を積めばエラーメッセージのおかげで、より確実にコードを動作させることができるようになります。
pt_br: Preste atenção nelas e faça o seu melhor para ler e entender o que elas significam. Com experiência, você vai aprender a fazer o seu código funcionar de forma mais confiável graças às essas mensagens de erro.
ru: Обращайте на них внимание и делайте всё возможное, чтобы прочитать и понять их. С опытом вы научитесь делать так, чтобы ваш код работал более надёжно благодаря сообщениям об ошибках.
ta: அவர்களிடம் கவனம் செலுத்துங்கள், அவற்றைப் படிக்கவும் புரிந்துகொள்ளவும் உங்களால் முடிந்த அனைத்தையும் செய்யுங்கள். அனுபவத்துடன், பிழை செய்திகளுக்கு உங்கள் குறியீடு மிகவும் நம்பத்தகுந்த வகையில் நன்றி தெரிவிக்க கற்றுக்கொள்வீர்கள்.
tr: Onlara dikkatinizi verin ve okuyup anlamak için elinizden gelenin en iyisini yapın. Deneyim kazandıkça, hata mesajlarının yardımıyla kodunuzun güvenilir ve hatasız şekilde çalışmasını sağlamayı öğreneceksiniz.
zh_hans: 请集中注意，尽最大努力去阅读和理解它们。随着经验的积累，你将逐渐学会利用错误信息来让你的代码更可靠地工作。

source: They're bad: error messages are always bad.
cs: Jsou špatné: chybové zprávy jsou vždy špatné.
da: De er dårlige: fejlmeddelelser er altid dårlige.
de: Sie sind schlecht: Fehler sind immer schlecht.
es: Son malos: los errores siempre son malos.
fr: Ils sont mauvais : les messages d'erreurs sont toujours mauvais.
ja: エラーは常に悪いモノです。
pt_br: Elas são ruins: mensagens de erro são sempre ruins.
ru: Они плохие: ошибки — это всегда плохо.
ta: அவை மோசமானவை: பிழை செய்திகள் எப்போதும் மோசமானவை.
tr: Onlar kötü: hata mesajları her zaman kötüdür.
uk: Вони погані: помилки це завжди погано.
zh_hans: 它们很糟糕：错误消息总是不好的。
zh_hant: 它們很糟：錯誤訊息總是糟糕的。

source: They're good: they're here to help.
cs: Jsou dobré: jsou tu, aby pomohli.
da: De er gode: de er her for at hjælpe.
de: Sie sind gut: Sie sind hier, um zu helfen.
es: Son buenos: están aquí para ayudar.
fr: Ils sont bons : ils sont là pour vous aider.
ja: エラーは私たちを助けてくれる良いモノです。
pt_br: Eles são bons: eles estão aqui para ajudar.
ru: Они хорошие: они здесь, чтобы помочь.
ta: அவர்கள் நல்லவர்கள்: அவர்கள் உதவ இங்கே இருக்கிறார்கள்.
tr: Onlar iyi: bize yardım etmek için buradalar.
uk: Вони хороші: вони тут, щоб допомогти.
zh_hans: 好事：它们能帮到你。
zh_hant: 它們很好：它們是來幫助你的。

source: Okay, let's see an error in action. Once again, click the [i]Practice[/i] button below to face your first real error.
cs: Podívejme se na chybu v akci. Ještě jednou klikněte na [i]Practice[/i] tlačítko níže, abyste se setkali s první skutečnou chybou.
da: Okay, lad os se en fejl i aktion. Klik igen på knappen [i]Øvelse[/i] nedenfor for at se din første rigtige fejl i øjnene.
de: Okay, lass uns einen Fehler in Aktion sehen. Klicke erneut auf die Schaltfläche [i]Üben[/i], um dich deinem ersten, echten Fehler zu stellen.
es: Bien, veamos un error en acción. Una vez más, haz clic en el botón [i]Práctica[/i] de abajo para enfrentarte a tu primer error real.
fr: Ensuite, voyons une erreur en action. Une fois de plus, cliquez sur le bouton [i]Pratique[/i] ci-dessous pour faire face à votre première erreur.
ja: では実際にエラーを見てみましょう。下の[i]演習[/i]ボタンをクリックして、最初のエラーを確認してください。
pt_br: Certo, vamos ver um erro em ação agora. Mais uma vez, clique no botão [i]Praticar[/i] logo abaixo para você encarar seu primeiro erro.
ru: Итак, давайте посмотрим на ошибку в действии. Еще раз нажмите кнопку [i]Практика[/i] ниже, чтобы увидеть свою первую реальную ошибку.
ta: சரி, செயலில் பிழையைப் பார்ப்போம். மீண்டும், உங்கள் முதல் உண்மையான பிழையை எதிர்கொள்ள கீழே உள்ள [i] பயிற்சி [/i] பொத்தானைக் சொடுக்கு செய்க.
tr: Tamam, hadi bir hatayı iş başında izleyelim. Bir kez daha, aşağıdaki [i]Alıştırma[/i] düğmesine basın ve ilk gerçek hatanız ile yüzleşin.
uk: Отже, погляньмо на помилку в дії. Ще раз натисніть нижче кнопку [i]Практика[/i], щоб побачити свою першу справжню помилку.
zh_hans: 好了，让我们来看看实际操作中的报错。还是那句话，请点击下方的[i]练习[/i]按钮，迎接你的第一个实际的错误。
zh_hant: 好了，來實際演練一次錯誤看看。再一次，請按下[b]練習[/b]按鈕來面對你的第一個真正的錯誤。

source: Fix Your First Error
cs: Opravte svou první chybu
da: Fix din første fejl
de: Behebe deinen ersten Fehler
es: Soluciona tu primer error
fr: Corrigez votre première erreur
ja: 最初のエラーを修正する
pt_br: Conserte seu primeiro erro
ru: Исправьте свою первую ошибку
ta: உங்கள் முதல் பிழையை சரிசெய்யவும்
tr: İlk Hatanızı Düzeltin
uk: Виправте свою першу помилку
zh_hans: 修正你的第一个错误
zh_hant: 修正你的第一個錯誤

source: This code is incorrect and will cause an error when you try to run it.
cs: Tento kód je nesprávný a při pokusu o jeho spuštění dojde k chybě.
da: Denne kode er forkert og vil forårsage en fejl, når du forsøger at køre den.
es: Este código es incorrecto y provocará un error cuando intentes ejecutarlo.
fr: Ce code est incorrect et provoquera une erreur lorsque vous essayerez de l'exécuter.
ja: このコードは間違っていて、実行するとエラーになってしまいます。
pt_br: Esse código está errado e vai causar um erro quando você tentar executar ele.
ru: Этот код неверен и вызовет ошибку когда вы попытаетесь его выполнить.
ta: இந்தக் குறியீடு தவறானது மற்றும் நீங்கள் அதை இயக்க முயற்சிக்கும்போது பிழையை ஏற்படுத்தும்.
tr: Bu kod yanlış ve çalıştırmayı denerseniz bir hataya sebep olacak.
zh_hans: 这段代码并不正确，你尝试运行的话就会引起报错。
