Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-11-time-delta.po
Languages: cs, da, de, es, fr, it, ja, ru, ta, tr, uk, zh_hant

source: When you multiply a speed by a time delta, it gives you an angle.
da: Når du ganger en hastighed med et tidsdelta, får du en vinkel.
fr: Lorsque vous multipliez une vitesse par un delta de temps, cela vous donne un angle.
ja: 速度に時間デルタを掛けると、角度が得られます。
tr: Bir hızı, bir zaman deltası ile çarptığınızda, size bir açı verir.

source: Don't worry if it's a little confusing for now. It'll eventually click as you deal with speed, acceleration, and motion in your game projects.
da: Bare rolig, hvis det er lidt forvirrende lige nu. Det vil til sidst give mening, når du håndterer hastighed, acceleration og bevægelse i dine spilprojekter.
fr: Ne vous inquiétez pas si c'est un peu déroutant pour l'instant. Vous finirez par comprendre lorsque vous implémenterez la vitesse, l'accélération et le mouvement dans vos projets de jeu.
ja: 今のところ少し混乱していても心配しないでください。ゲームプロジェクトで速度、加速度、モーションを扱ううちに、いずれ理解できるようになります。
tr: Şimdilik biraz kafanız karıştıysa, endişelenmeyin. Oyun projelerinde hız, ivme ve hareketle uğraşırken, eninde sonunda her şey yerine oturacaktır.

source: Why the time between frames matters
cs: Proč záleží na době mezi snímky
da: Hvorfor tiden mellem billederne er vigtig
de: Warum die Zeit zwischen den Frames wichtig ist
es: Por qué es importante el tiempo entre fotogramas
fr: Pourquoi le temps entre les images est important
it: Perché il tempo tra i frame importa
ja: フレーム間の時間が重要な理由
ru: Почему разница во времени между кадрами важна
ta: பிரேம்களுக்கு இடையிலான நேரம் ஏன் முக்கியமானது
tr: Oyun kareleri arasındaki süre neden önemli
uk: Чому різниця в часі між кадрами має значення
zh_hant: 為什麼幀之間的時間很重要

source: The time it takes to display a new frame varies.
da: Den tid det tager at vise et nyt billede varierer.
fr: Le temps qu'il faut pour afficher une nouvelle image varie.
ja: 新しいフレームの表示にかかる時間はさまざまです。
tr: Yeni bir karenin görüntülenmesi için geçen süre değişir.

source: If you don't take that time into account in your code, your game will have gameplay issues and bugs. Godot provides that time to the [code]_process()[/code] function through the [code]delta[/code] parameter.
da: Hvis du ikke tager højde for den tid i din kode, vil dit spil have gameplay-problemer og fejl. Godot leverer den tid til funktionen [code]_process()[/code] via parameteren [code]delta[/code].
fr: Si vous ne tenez pas compte de ce temps dans votre code, votre jeu aura des problèmes de gameplay et des bugs. Godot fournit ce temps à la fonction [code]_process()[/code] via le paramètre [code]delta[/code].
ja: コードでその時間を考慮しないと、ゲームにゲームプレイの問題やバグが発生します。Godotは、[code]delta[/code]パラメータを介して[code]_process()[/code]関数にその時間を提供します。
tr: Kodunuzda bu süreyi dikkate almazsanız, oyununuzda oynanış sorunları ve hatalar olacaktır. Godot bu zamanı, [code]_process()[/code] fonksiyonuna [code]delta[/code] alınan değişkeni aracılığıyla sağlar.

source: In the example below, the top robot moves using [code]delta[/code]. As a result, it moves at a fixed speed.
da: I eksemplet nedenfor bevæger den øverste robot sig ved hjælp af [code]delta[/code]. Som et resultat bevæger den sig med en fast hastighed.
fr: Dans l'exemple ci-dessous, le robot du haut se déplace en utilisant [code]delta[/code]. En conséquence, il se déplace à une vitesse fixe.
ja: 以下の例では、一番上のロボットが [code]delta[/code] を使用して移動しています。その結果、一定の速度で移動します。
tr: Aşağıdaki örnekte, üstteki robot [code]delta[/code] kullanarak hareket ediyor. Sonuç olarak, sabit bir hızda hareket eder.

source: The bottom robot moves over a constant distance every frame, [i]without[/i] taking [code]delta[/code] into account. It will move faster or slower than the top robot on [i]your[/i] computer.
da: Den nederste robot bevæger sig over en konstant afstand hver frame, [i]uden[/i] at tage [code]delta[/code] i betragtning. Den vil bevæge sig hurtigere eller langsommere end den øverste robot på [i]din[/i] computer.
fr: Le robot du bas se déplace sur une distance constante à chaque image, [i]sans[/i] prendre en compte [code]delta[/code]. Il se déplacera plus vite ou plus lentement que le robot du haut sur [i]votre[/i] ordinateur.
ja: 一番下のロボットは、[code]delta[/code]を考慮[i]せず[/i]に、フレームごとに一定の距離を移動します。コンピューターの一番上のロボットよりも速くまたは遅く動きます。
tr: Alttaki robot ise, [code] delta[/code] hesaba [i]alınmadan[/i], her karede sabit bir mesafe boyunca hareket eder. [i]Bilgisayarında[/i], üstteki robottan daha hızlı veya daha yavaş hareket edecektir.

source: The bottom robot will move [i]differently for everyone[/i]!
da: Den nederste robot vil bevæge sig [i]forskelligt for alle[/i]!
fr: Le robot du bas se déplacera [i]différemment pour tout le monde[/i] !
ja: 一番下のロボットの動きは[i]人それぞれ[/i]です!
tr: Alttaki robot, [i]herkes için farklı[/i] hareket edecektir!

source: Multiplying time-sensitive values by [code]delta[/code] makes them [b]time-dependent[/b] rather than [b]frame-dependent[/b].
da: Ved at multiplicere tidsfølsomme værdier med [code]delta[/code] bliver de [b]tidsafhængige[/b] snarere end [b]billede-afhængige[/b].
fr: Multiplier les valeurs sensibles au temps par [code]delta[/code] les rend [b]dépendantes du temps[/b] plutôt que [b]dépendantes de l'image[/b].
ja: 時間依存の値に [code]delta[/code] を掛けると、それらは [b] フレーム依存 [/b] ではなく [b] 時間依存 [/b] になります。
tr: Zamana duyarlı değerleri [code]delta[/code] ile çarpmak, onları [b]kareye bağlı[/b] olmaktan çıkarıp, [b]zamana bağlı[/b] hale getirir.

source: Thanks to that, we get reliable movement over time.
da: Takket være dette får vi pålidelig bevægelse over tid.
fr: Grâce à cela, nous obtenons un mouvement fiable dans le temps.
ja: おかげで、時間の経過とともに信頼性の高い動きが得られます。
tr: Bu sayede, güvenilir bir zamansal hareket elde ediyoruz.

source: Without [code]delta[/code], frame times vary from computer to computer and during gameplay. Because of that, the movement will differ for every player, making the game inconsistent and messy.
da: Uden [code]delta[/code] varierer billede-tider fra computer til computer og under spillet. På grund af dette vil bevægelsen variere for hver spiller, hvilket gør spillet inkonsekvent og rodet.
fr: Sans [code]delta[/code], les temps d'image varient d'un ordinateur à l'autre et pendant le jeu. Pour cette raison, le mouvement sera différent pour chaque joueur, ce qui rende le jeu incohérent et désordonné.
ja: [code]delta[/code] を使用しない場合、フレーム時間はコンピューターごと、ゲームプレイ中に異なります。そのため、プレイヤーごとに動きが異なり、ゲームに一貫性がなく、乱雑になります。
tr: [code]delta[/code] olmadan, kare süreleri bilgisayardan bilgisayara ve oyun sırasında değişir. Bu olursa, hareket, her oyuncu için farklılık gösterecek, oyunu tutarsız ve can sıkıcı hale getirecektir.

source: What does this mean?
cs: Co to znamená?
da: Hvad betyder det?
de: Was bedeutet das?
es: ¿Qué significa esto?
fr: Qu’est-ce que cela signifie ?
it: Cosa significa questo?
ja: これはどういう意味ですか?
ru: Что это значит?
ta: இதன் பொருள் என்ன?
tr: Bu ne anlama geliyor?
uk: Що це означає?
zh_hant: 這代表什麼？

source: The [code]*[/code] symbol means we're multiplying [code]rotation_speed[/code] by [code]delta[/code] time.
cs: Symbol [code]*[/code] znamená, že násobíme [code]rychlost rotace[/code] [code]delta[/code]časem.
da: [code]*[/code] symbol betyder, at vi ganger [code]rotation_speed[/code] med [code]delta[/code] tid.
de: Das Symbol [code]*[/code] bedeutet, dass wir [code]rotation_speed[/code] mit [code]delta[/code] multiplizieren.
es: El símbolo [code]*[/code] significa que estamos multiplicando [code]rotation_speed[/code] por el tiempo [code]delta[/code].
fr: Le symbole [code]*[/code] signifie que nous multiplions [code]rotation_speed[/code] par le temps [code]delta[/code].
it: Il simbolo [code]*[/code] significa moltiplicare [code]rotation_speed[/code] per il tempo [code]delta[/code].
ja: [code]*[/code] 記号は、[code]rotation_speed[/code] に [code]delta[/code] 時間を掛けていることを意味します。
ru: Символ [code]*[/code] обозначает умножение [code]rotation_speed[/code] на [code]delta[/code] времени.
tr: [code]*[/code] sembolü, [code]rotation_speed[/code] (dönme hızı) ile [code]delta[/code] zamanını çarptığımız anlamına gelir.
uk: Символ [code]*[/code] означає множення [code]rotation_speed[/code] на [code]delta[/code] часу.
zh_hant: [code]*[/code] 符號表示我們將 [code]rotation_speed[/code] 乘以 [code]delta[/code] 時間。

source: We're multiplying rotation_speed by delta.
cs: Násobíme rotation_speed deltou.
da: Vi ganger rotation_speed med delta.
de: Wir multiplizieren rotation_speed mit delta.
es: Que multiplicamos la rotation_speed por delta.
fr: Que nous multiplions rotation_speed par delta.
it: Stiamo moltiplicando rotation_speed per delta.
ja: rotation_speedにデルタを掛けています。
ru: Мы умножаем rotation_speed на delta.
ta: நாங்கள் டெல்டாவால் சுழற்சி_ச்பீட்டை பெருக்கி வருகிறோம்.
tr: rotation_speed (dönme hızı) ile deltayı çarpıyoruz.
uk: Ми множимо rotation_speed на delta.
zh_hant: 我們將 rotation_speed 乘以 delta。

source: We're dividing delta by rotation_speed.
cs: Dělíme deltu rychlostí rotace.
da: Vi dividerer delta med rotation_speed.
de: Wir teilen delta durch rotation_speed.
es: Que dividimos delta por la rotation_speed.
fr: Que nous divisons delta par rotation_speed.
it: Stiamo dividendo il delta per rotation_speed.
ja: デルタをrotation_speedで割っています。
ru: Мы делим delta на rotation_speed.
ta: நாங்கள் டெல்டாவை சுழற்சி_ச்பீட் மூலம் பிரிக்கிறோம்.
tr: rotation_speed (dönme hızı) nı, deltaya bölüyoruz.
uk: Ми ділимо delta на rotation_speed.
zh_hant: 我們將 delta 除以 rotation_speed。

source: We're adding rotation_speed to delta.
cs: Přidáváme rotation_speed do delta.
da: Vi lægger rotation_speed til delta.
de: Wir fügen delta rotation_speed hinzu.
es: Que le sumamos la rotation_speed a delta.
fr: Que nous ajoutons rotation_speed à delta.
it: Stiamo aggiungendo rotation_speed a delta.
ja: デルタにrotation_speedを追加しています。
ru: Мы прибавляем rotation_speed к delta.
ta: நாங்கள் டெல்டாவில் சுழற்சி_ச்பீட்டைச் சேர்க்கிறோம்.
tr: rotation_speed (dönme hızı) na delta'yı ekliyoruz.
uk: Ми додаємо rotation_speed до delta.
zh_hant: 我們將 rotation_speed 加到 delta。

source: We're subtracting delta from rotation_speed.
cs: Odečteme delta od rotation_speed.
da: Vi trækker delta fra rotation_speed.
de: Wir subtrahieren delta von rotation_speed.
es: Que le restamos delta a la rotation_speed.
fr: Que nous soustrayons delta de rotation_speed.
it: Stiamo sottraendo delta da rotation_speed.
ja: rotation_speedからデルタを差し引いています。
ru: Мы вычитаем delta из rotation_speed.
ta: நாங்கள் சுழற்சி_ச்பீட்டிலிருந்து டெல்டாவைக் கழிக்கிறோம்.
tr: rotation_speed (dönme hızı) ndan delta'yı çıkartıyoruz.
uk: Ми віднімаємо delta від rotation_speed.
zh_hant: 我們將 delta 從 rotation_speed 中減去。

source: In the next practice, we'll use delta to make rotating time-dependent.
cs: V dalším cvičení použijeme delta k tomu, aby rotace závisela na čase.
da: I den næste øvelse bruger vi delta til at gøre rotation tidsafhængig.
de: In der nächsten Übung werden wir delta verwenden, um das Drehen zeitabhängig zu machen.
es: En la siguiente práctica, usaremos el delta para hacer que la rotación dependa del tiempo.
fr: Dans la pratique suivante, nous utiliserons delta pour rendre la rotation dépendante du temps.
it: Nella prossima pratica, useremo delta per rendere le rotazioni tempo-dipendenti.
ja: 次の演習では、デルタを使用して回転を時間依存にします。
ru: В следующем упражнении мы будем использовать delta чтобы сделать вращение зависимым от времени.
ta: அடுத்த நடைமுறையில், சுழலும் நேரத்தைச் சார்ந்ததாக மாற்ற டெல்டாவைப் பயன்படுத்துவோம்.
tr: Sıradaki uygulamada, dönmeyi zamana bağlı hale getirmek için delta kullanacağız.
uk: У наступній вправі ми використаємо дельту, щоб зробити обертання залежним від часу.
zh_hant: 在下一個練習中，我們將使用 delta 讓旋轉與時間變得有關聯。

source: Rotating Using Delta
cs: Otáčení pomocí Delta
da: Rotation ved Hjælp af Delta
de: Drehen mit delta
es: Girar usando delta
fr: Rotation à l'aide de delta
it: Rotando Usando Il Delta
ja: デルタを使用した回転
ru: Вращение с использованием дельты
ta: டெல்டாவைப் பயன்படுத்தி சுழலும்
tr: Delta Kullanarak Döndürmek
uk: Обертання з використанням дельти
zh_hant: 使用 Delta 來旋轉

source: At the moment, the rotation of the robot is frame-dependent.
da: I øjeblikket er robottens rotation billed-afhængig.
fr: Pour le moment, la rotation du robot est dépendante de l'image.
ja: 現時点では、ロボットの回転はフレームに依存しています。
tr: Şu anda robotun dönüşü oyun-karesine-bağlı durumda.

source: Add [code]delta[/code] to make the rotational speed time-dependent.
da: Læg [code]delta[/code] til for at gøre rotationshastigheden tidsafhængig.
fr: Ajoutez [code]delta[/code] pour rendre la vitesse de rotation dépendante du temps.
ja: [code]delta[/code]を追加して、回転速度を時間依存にします。
tr: Dönüş hızını zamana-bağlı hale getirmek için [code]delta[/code] ekleyin.

source: The robot should rotate [code]2[/code] radians per second.
da: Robotten skal rotere [code]2[/code] radianer pr. sekund.
fr: Le robot doit tourner de [code]2[/code] radians par seconde.
ja: ロボットは毎秒 [code]2[/code] ラジアン回転する必要があります。
tr: Robot saniyede [code]2[/code] radyan dönmelidir.

source: Moving in a Circle Using Delta
cs: Pohyb v kruhu pomocí Delta
da: Bevægelse i en Cirkel ved Hjælp af Delta
de: Bewegen im Kreis mit delta
es: Moverse en un círculo usando delta
fr: Se déplacer en cercle en utilisant delta
it: Muovendo in un Cerchio Usando Il Delta
ja: デルタを使用して円を描くように移動する
ru: Перемещение по кругу с использованием дельты
ta: டெல்டாவைப் பயன்படுத்தி வட்டத்தில் நகரும்
tr: Delta Kullanarak, Daire Şeklinde Hareket Etmek
uk: Переміщення по колу з урахуванням дельти
zh_hant: 使用 Delta 的圓周運動

source: In this practice, make the robot move in a smooth circle using delta.
da: I denne øvelse skal robotten bevæge sig i en jævn cirkel ved hjælp af delta.
fr: Dans cet exercice, faites bouger le robot en un cercle de manière douce en utilisant delta.
ja: この演習では、デルタを使用してロボットを滑らかな円で動かします。
tr: Bu uygulamada, delta kullanarak, robotun düzgün bir daire çizmesini sağlayın.

source: To get this movement, the robot should rotate [code]2[/code] radians per second and move [code]100[/code] pixels per second towards clockwise.
da: For at opnå denne bevægelse skal robotten rotere [code]2[/code] radianer pr. sekund og bevæge sig [code]100[/code] pixels pr. sekund med uret.
fr: Pour obtenir ce mouvement, le robot doit tourner de [code]2[/code] radians par seconde et se déplacer de [code]100[/code] pixels par seconde dans le sens des aiguilles d'une montre.
ja: この動きを得るには、ロボットは毎秒 [code]2[/code] ラジアンを回転させ、[code]100[/code] ピクセル/秒を時計回りに動かす必要があります。
tr: Bu hareketi elde etmek için, robotun, saat yönünde, saniyede [code]2[/code] radyan dönmesi (rotate) ve saniyede [code]100[/code] piksel hareket etmesi (move_local_x) gerekir.

source: [b]Note:[/b] Please write the values in the parentheses when calling the functions. If you define extra variables, we will not be able to check your practice.
da: [b]Bemærk:[/b] Skriv venligst værdierne i parenteserne, når du kalder funktionerne. Hvis du definerer ekstra variabler, kan vi ikke kontrollere din øvelse.
fr: [b]Note :[/b] Veuillez écrire les valeurs entre parenthèses lorsque vous appelez les fonctions. Si vous définissez des variables supplémentaires, nous ne pourrons pas vérifier votre pratique.
ja: [b]注:[/b]関数を呼び出すときは、括弧内に値を書き込んでください。余分な変数を定義すると、演習をチェックできなくなります。
tr: [b]Not:[/b] Lütfen, fonksiyonları çağırırken, değerleri parantez içine yazın. Eğer fazladan değişken tanımlarsanız, uygulamanızı kontrol edemeyiz.

source: Time Delta
cs: Delta času
da: Tids-Delta
de: Zeit Differenz
es: Delta de tiempo
fr: Delta de Temps
it: Tempo Delta
ja: タイムデルタ
ru: Дельта времени
ta: நேரம் டெல்டா
tr: Küçük Zaman Değişimi (Time Delta)
uk: Дельта часу
zh_hant: 時間增量 Delta

source: [code]rotation_speed * delta[/code]
ta: [குறியீடு] சுழற்சி_ச்பீட் * டெல்டா [/குறியீடு]
tr: [code]rotation_speed * delta[/code] (dönme_hızı * delta)

source: But it's not just our character that has a [code]_process()[/code] function; Almost everything in the game has a [code]_process()[/code] function! Dozens of times per second, Godot runs every [code]_process()[/code] function in the game to update the game world. After that, it displays an image of the game world on the screen. We call that image a [b]frame[/b]. Godot then moves on to calculating the next frame. As this happens dozens of times per second, you get the illusion of movement. This is similar to how traditional animation works.
cs: Ale nejen naše postava má funkci [code]_process()[/code]; téměř vše ve hře má funkci [code]_process()[/code]! Desítkykrát za sekundu spustí Godot každou [code]_process()[/code] funkci ve hře, aby aktualizoval herní svět. Poté zobrazí na obrazovce obraz herního světa. Tento obrázek nazýváme [b]snímek[/b] (frame). Godot pak přejde k výpočtu dalšího snímku. Protože se to děje desítkykrát za sekundu, vzniká iluze pohybu. Je to podobné tradiční animaci.
de: Aber es ist nicht nur unser Charakter, der eine [code]_process()[/code] Funktion hat; Fast alles im Spiel hat eine [code]_process()[/code] Funktion! Dutzende Male pro Sekunde führt Godot jede [code]_process()[/code]-Funktion im Spiel aus, um die Spielwelt zu aktualisieren. Danach zeigt es ein Bild der Spielwelt auf dem Bildschirm an. Wir nennen dieses Bild einen [b]frame[/b]. Godot fährt dann mit der Berechnung des nächsten Frames fort. Da dies Dutzende Male pro Sekunde geschieht, erhältst Du die Illusion von Bewegung. Dies ähnelt der Funktionsweise herkömmlicher Animationen.
es: Pero no es sólo nuestro personaje el que tiene una función [code]_process()[/code]; ¡casi todo en el juego tiene una función [code]_process()[/code]! Docenas de veces por segundo, Godot ejecuta cada función [code]_process()[/code] en el juego para actualizar el mundo del juego. Después, muestra una imagen del mundo del juego en la pantalla. Llamamos a esa imagen un [b]fotograma[/b]. A continuación, Godot pasa a calcular el siguiente fotograma. Como esto ocurre decenas de veces por segundo, obtenemos la ilusión de movimiento. Esto es similar a cómo funciona la animación tradicional.
it: Ma il nostro personaggio non è l'unico ad avere la funzione [code]_process()[/code]; Quasi tutto in un gioco possiede la funzione [code]_process()[/code]. Dozzine di volte al secondo, Godot esegue ogni funzione [code]_process()[/code] nel gioco per aggiornare il mondo di gioco. Dopo ciò, mostra un'immagine del mondo di gioco sullo schermo. Chiamiamo questa immagine un [b]frame[/b]. Godot in seguito procede a calcolare il frame successivo. Dato che questo avviene dozzine di volte al secondo, hai l'illusione del movimento. Questo è analogo a come l'animazione tradizionale funziona.
ru: Но не только наш персонаж имеет функцию [code]_process()[/code]; почти всё в игре имеет функцию [code]_process()[/code]! Десятки раз в секунду Godot запускает каждую функцию [code]_process()[/code] в игре, чтобы обновить игровой мир. После этого он выводит изображение игрового мира на экран. Мы называем это изображение [b]кадром[/b]. Затем Godot переходит к вычислению следующего кадра. Поскольку обновление кадра происходит десятки раз в секунду, создается иллюзия движения. Это похоже на то, как работает традиционная анимация.
ta: ஆனால் இது எங்கள் பாத்திரம் மட்டுமல்ல, [குறியீடு] _ செயல்முறை () [/குறியீடு] செயல்பாட்டைக் கொண்டுள்ளது; விளையாட்டில் கிட்டத்தட்ட எல்லாவற்றிலும் [குறியீடு] _ செயல்முறை () [/குறியீடு] செயல்பாடு உள்ளது! நொடிக்கு டசன் கணக்கான முறை, கோடோட் விளையாட்டு உலகத்தைப் புதுப்பிக்க விளையாட்டில் ஒவ்வொரு [குறியீடு] _ செயல்முறை () [/குறியீடு] செயல்பாட்டை இயக்குகிறது. அதன் பிறகு, இது திரையில் விளையாட்டு உலகின் ஒரு படத்தைக் காட்டுகிறது. அந்த படத்தை ஒரு [b] சட்டகம் [/b] என்று அழைக்கிறோம். கோடோட் பின்னர் அடுத்த சட்டகத்தைக் கணக்கிட நகர்கிறார். இது நொடிக்கு டசன் கணக்கான முறை நிகழும்போது, இயக்கத்தின் மாயையை நீங்கள் பெறுவீர்கள். இது பாரம்பரிய அனிமேசன் எவ்வாறு செயல்படுகிறது என்பதைப் போன்றது.
uk: Але не лише наш персонаж має функцію [code]_process()[/code]; майже все у грі має функцію [code]_process()[/code]! Десятки разів на секунду Godot запускає кожну функцію [code]_process()[/code] у грі, щоб оновити ігровий світ. Після цього виводить зображення ігрового світу на екран. Ми називаємо це зображення [b]кадром[/b]. Потім Godot переходить до обчислення наступного кадра. Оскільки оновлення кадру відбувається десятки разів на секунду, створюється ілюзія руху. Це схоже на те, як працює традиційна анімація.
zh_hant: 但不只是我們的角色有 [code]_process()[/code] 函式；遊戲中的幾乎每個東西都有 [code]_process()[/code] 函式！ 每秒多次，Godot 會執行遊戲中每個 [code]_process()[/code] 函式來更新遊戲世界。 接著它會在螢幕上顯示遊戲世界的圖像。我們稱這個圖像為一[b]幀[/b]。 然後 Godot 會繼續計算下一幀。 由於這個過程每秒發生數十次，會感覺到動作在進行。這與傳統動畫的運作方式相似。

source: You may have heard of frames per second, or FPS for short. Games often run at 60 frames per second. It means that everything in the game updates 60 times each second. The number varies while playing, depending on the game and the device it runs on. On powerful computers, you may get frame rates in the hundreds or thousands of frames per second.
cs: Možná jste už slyšeli o snímcích za sekundu, zkráceně FPS. Hry často běží rychlostí 60 snímků za sekundu. To znamená, že se vše ve hře aktualizuje 60krát za sekundu. Toto číslo se během hraní mění v závislosti na hře a zařízení, na kterém běží. Na výkonných počítačích můžete dosáhnout snímkové frekvence v řádu stovek nebo tisíců snímků za sekundu.
de: Du hast vielleicht von Bildern pro Sekunde gehört, kurz FPS(frames per second). Spiele laufen oft mit 60 Bildern pro Sekunde. Es bedeutet, dass alles im Spiel 60 Mal pro Sekunde aktualisiert wird. Die Anzahl variiert während des Spiels, abhängig vom Spiel und dem Gerät, auf dem es läuft. Auf leistungsstarken Computern kannst Du Bildraten von Hunderten oder Tausenden von Bildern pro Sekunde erhalten.
es: Es posible que hayas oído hablar de los fotogramas por segundo, o FPS para abreviar. Los juegos a menudo se ejecutan a 60 fotogramas por segundo. Esto significa que todo en el juego se actualiza 60 veces por segundo. El número varía mientras se juega, dependiendo del juego y del dispositivo en el que se ejecute. En computadoras potentes, puedes obtener velocidades de fotogramas de cientos o miles de fotogramas por segundo.
it: Potresti aver sentito di frame al secondo o FPS abbreviato. I giochi spesso vanno a 60 frame al secondo. Questo significa che ogni cosa nel gioco si aggiorna 60 volte ogni secondo. Il numero varia quando giochi, in base al gioco e al dispositivo su cui gira il gioco. Sui computer potenti, potresti avere una frequenza di frame sulle centinaia o migliaia di frame al secondo.
ru: Возможно, вы слышали о частоте кадров в секунду, или FPS, если сокращённо. Часто игры работают со скоростью 60 кадров в секунду. Это означает, что всё в игре обновляется 60 раз каждую секунду. Во время игры это число меняется в зависимости от характеристик игры и устройства, на котором она запущена. На мощных компьютерах частота кадров может составлять сотни или тысячи кадров в секунду.
ta: நீங்கள் நொடிக்கு பிரேம்கள் அல்லது சுருக்கமாக FPS பற்றி கேள்விப்பட்டிருக்கலாம். விளையாட்டுகள் பெரும்பாலும் நொடிக்கு 60 பிரேம்களில் இயங்கும். விளையாட்டில் உள்ள அனைத்தும் ஒவ்வொரு நொடியும் 60 முறை புதுப்பிக்கும் என்று அர்த்தம். விளையாட்டு மற்றும் அது இயங்கும் சாதனத்தைப் பொறுத்து விளையாடும்போது எண் மாறுபடும். சக்திவாய்ந்த கணினிகளில், நீங்கள் ஒரு நொடிக்கு நூற்றுக்கணக்கான அல்லது ஆயிரக்கணக்கான பிரேம்களில் பிரேம் விகிதங்களைப் பெறலாம்.
uk: Можливо, ви чули про частоту кадрів на секунду, або, скорочено, FPS. Часто ігри працюють зі швидкістю 60 кадрів на секунду. Це означає, що все у грі оновлюється 60 разів на секунду. Під час гри це число змінюється залежно від характеристик гри та пристрою, на якому її запущено. На потужних комп'ютерах частота кадрів може становити сотні чи тисячі кадрів за секунду.
zh_hant: 你可能聽過每秒幀數，簡稱 FPS。遊戲通常以每秒 60 幀的速度運行。 這意味著遊戲中的一切每秒更新 60 次。 這個數字會根據遊戲和執行的裝置而有所變化。 在高效能的電腦上，你可能會看到每秒數百或數千幀的幀率。

source: [code] func _process(delta): rotate(0.05) [/code]
ta: [குறியீடு] FUNC _PROCESS (டெல்டா): சுழலும் (0.05) [/குறியீடு]
