Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-1-what-code-*-like.po
Languages: cs, da, de, es, fr, it, ja, nl, ru, ta, tr, uk, zh_hant

source: Programming is a skill, so to get good at it, you must practice. It is why we built this app. Each lesson is followed by an interactive practice to use what you learned. Speaking of which, it's time to look at the practice screen! To continue, click the [i]Practice[/i] button below. It will give you a short run through how practices work.
fr: La programmation est une compétence, donc pour la maîtriser, vous devez vous entraîner. C'est pourquoi nous avons créé cette application. Chaque leçon est suivie d'une pratique interactive pour utiliser ce que vous avez appris. À propos de cela, il est temps de regarder l'écran des pratiques ! Pour continuer, cliquez sur le bouton [i]Pratique[/i] ci-dessous. Il vous donnera un bref aperçu du fonctionnement des pratiques.
it: Programmare è un'abilità, e come tale per poter migliorare serve molta pratica. Per questo abbiamo creato questa applicazione. Dopo ogni breve lezione troverai un esercizio interattivo che ti permetterà di mettere in pratica ciò che hai appena imparato. A tal proposito, diamo un'occhiata alla schermata dell'esercitazione! Per continuare, clicca sul tasto [i]Pratica[/i] qui sotto. Ti mostrerà in breve come funzionano questi esercizi.
nl: Programmeren is een vak, dus om er goed in te worden moet je oefenen. Daarom hebben we deze app gebouwd. Elke les wordt gevolgd door een interactieve oefening om het geleerde te gebruiken. Daarover gesproken, het is tijd om naar het oefenscherm te kijken! Klik op de knop [i]Oefenen[/i] hieronder om verder te gaan. Het zal je een korte uitleg geven over hoe oefeningen werken.
ta: நிரலாக்கமானது ஒரு திறமை, எனவே அதைப் பெறுவதற்கு, நீங்கள் பயிற்சி செய்ய வேண்டும். அதனால்தான் இந்த பயன்பாட்டை நாங்கள் கட்டினோம். ஒவ்வொரு பாடமும் நீங்கள் கற்றுக்கொண்டதைப் பயன்படுத்த ஒரு ஊடாடும் நடைமுறையைத் தொடர்ந்து. அதைப் பற்றி பேசும்போது, பயிற்சித் திரையைப் பார்க்க வேண்டிய நேரம் இது! தொடர, கீழே உள்ள [i] பயிற்சி [/i] பொத்தானைக் சொடுக்கு செய்க. நடைமுறைகள் எவ்வாறு செயல்படுகின்றன என்பதை இது ஒரு குறுகிய ஓட்டத்தை உங்களுக்கு வழங்கும்.
zh_hant: 程式是種技能，所以要變得擅長，你一定要練習。因此我們做了這個程式。 每個課程都會有個互動式練習來使用你剛學到的東西。 提到這個，是時候看看練習畫面了！ 點擊[b]練習[/b]按鈕以繼續。它將帶你快速了解練習的運作方式。

source: We prepared a code sample for you. For this practice, you don't need to change anything. To test the code, click the [i]Run[/i] button below the code editor.
fr: Nous avons préparé un exemple de code pour vous. Pour cette pratique, vous n'avez rien à changer. Pour tester le code, clique sur le bouton [i]Exécuter[/i] sous l'éditeur de code.
it: Abbiamo preparato per te un piccolo esempio di codice. Per questo esercizio, non dovrai modificare nulla. Per provare questo codice, clicca il bottone [i]Esegui[/i] sotto l'editor del codice.
nl: We hebben een codevoorbeeld voor je voorbereid. Voor deze oefening hoef je niets te veranderen. Klik op de knop [i]Uitvoeren[/i] onder de code-editor om de code te testen.
ta: உங்களுக்காக ஒரு குறியீடு மாதிரியை நாங்கள் தயாரித்தோம். இந்த நடைமுறைக்கு, நீங்கள் எதையும் மாற்ற தேவையில்லை. குறியீட்டைச் சோதிக்க, குறியீடு எடிட்டருக்கு கீழே [i] இயக்க [/i] பொத்தானைக் சொடுக்கு செய்க.
zh_hant: 我們準備了範例程式碼給你。在此練習中，你不需要改動任何東西。 點擊編輯器下的[b]執行[/b]按鈕以測試程式碼。
