Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-3-standing-on-shoulders-of-giants.po
Languages: cs, da, de, es, fr, it, ja, nl, pt_br, ru, ta, uk, zh_hant

source: [code]degrees = radians * 180 / PI[/code]
cs: [code]stupně = radiány * 180 / PI[/code].
da: [code]grader = radianer * 180 / PI[/code]
fr: [code]degrés = radians * 180 / PI[/code]
ja: [code] 度=ラジアン * 180 / PI [/code]
nl: [code]graden = radialen * 180 / PI[/code]
pt_br: [code]graus = radiano * 180 / PI[/code]
ta: [குறியீடு] டிகிரி = ரேடியன்கள் * 180 / பை [ / குறியீடு]

source: An angle of [code]PI[/code] radians corresponds to [code]180[/code] degrees. And [code]2 * PI[/code] is a full turn: [code]360[/code] degrees.
cs: Úhel [code]PI[/code] radiánů odpovídá [code]180[/code] stupňům. A [code]2 * PI[/code] odpovídá plné otáčce: [code]360[/code] stupňů.
da: En vinkel på [code]PI[/code] radianer svarer til [code]180[/code] grader. Og [code]2 * PI[/code] er en hel omdrejning: [code]360[/code] grader.
fr: Un angle de [code]PI[/code] radians correspond à [code]180[/code] degrés. Et [code]2 * PI[/code] correspond à un tour complet : [code]360[/code] degrés.
ja: [code] PI [/code]ラジアンの角度は[code]180[/code]度に対応します。そして[code]2 * PI[/code]は一周 [code]360[/code]度です。
nl: Een hoek van [code]PI[/code] radialen komt overeen met [code]180[/code] graden. En [code]2 * PI[/code] is een volledige omwenteling: [code]360[/code] graden.
pt_br: Um ângulo que possui [code]PI[/code] radiano corresponde a [code]180[/code] graus. E [code]2 * PI[/code] é uma volta completa no círculo: [code]360[/code] graus.
ru: Угол [code]PI[/code] радиан соответствует [code]180[/code] градусам. А [code]2 * PI[/code] — это полный оборот: [code]360[/code] градусов.
ta: [குறியீடு] பை [/குறியீடு] ரேடியன்களின் கோணம் [குறியீடு] 180 [/குறியீடு] டிகிரிக்கு ஒத்திருக்கிறது. மற்றும் [குறியீடு] 2 * பை [/குறியீடு] ஒரு முழு திருப்பமாகும்: [குறியீடு] 360 [/குறியீடு] டிகிரி.
uk: Кут [code]PI[/code] радіан відповідає [code]180[/code] градусам. А [code]2 * PI[/code] — це повний оберт: [code]360[/code] градусів.
zh_hant: [code]PI[/code] 弧度對應 [code]180[/code] 度，而 [code]2 * PI[/code] 則是一整圈，也就是 [code]360[/code] 度。

source: [b]How do radians work exactly?[/b]
cs: [b]Jak přesně fungují radiány?[/b].
da: [b]Hvordan fungerer radianer præcist?[/b]
fr: [b]Comment fonctionnent exactement les radians ?[/b]
ja: [b]ラジアンはどのように正確に機能しますか？[/b]
nl: [b]Hoe werken radialen precies?[/b]
pt_br: [b]Como exatamente funciona o radiano?[/b]
ru: [b]Как именно работают радианы?[/b]
ta: [ஆ] ரேடியன்கள் சரியாக எவ்வாறு செயல்படுகின்றன? [/b]
uk: [b]Як саме працюють радіани?[/b]
zh_hant: [b]那麼，弧度到底是如何運作的？[/b]

source: Radians are a way to measure angles based on the radius of a circle.
cs: Radiány jsou způsobem měření úhlů na základě poloměru kružnice.
da: Radianer er en måde at måle vinkler baseret på en cirkels radius.
fr: Les radians sont un moyen de mesurer les angles en fonction du rayon d'un cercle.
ja: ラジアンは弧度法という円の半径に基づいて角度を測定する方法です。
nl: Radialen zijn een manier om hoeken te meten op basis van de straal van een cirkel.
pt_br: Radiano é um jeito de medir ângulos baseados no raio de um círculo.
ru: Радианы — это способ измерения углов на основе радиуса окружности.
ta: ரேடியன்கள் ஒரு வட்டத்தின் ஆரம் அடிப்படையில் கோணங்களை அளவிடுவதற்கான ஒரு வழியாகும்.
uk: Радіани — це спосіб вимірювання кутів на основі радіуса кола.
zh_hant: 弧度是根據圓的半徑來衡量角度的一種方式。

source: To get the angle in radians, you take the circle's radius and wrap it around the circle. That angle is [code]1[/code] radian because you are wrapping the radius [code]1[/code] time around the circle.
cs: Úhel v radiánech získáte tak, že vezmete poloměr kruhu a vyznačujete jej kolem kružnice. Tento úhel je [code]1[/code] radián, protože ovíjíte poloměr [code]1[/code] kolem kružnice.
da: For at få vinklen i radianer tager du cirklens radius og vikler den rundt om cirklen. Den vinkel er [code]1[/code] radian, fordi du vikler radius [code]1[/code] gang rundt om cirklen.
fr: Pour obtenir l'angle en radians, vous prenez le rayon du cercle et l'enroulez autour du cercle. Cet angle correspond à [code]1[/code] radian car vous enroulez le rayon [code]1[/code] fois autour du cercle.
ja: ラジアンで角度を取得するには、円の半径を取りそれを円に巻き付けます。半径[code]1[/code]の長さを円に巻き付けたとき、その角度は[code] 1[/code]ラジアンです。
nl: Om de hoek in radialen te krijgen, neem je de straal van de cirkel en wikkel je deze om de cirkel. Deze hoek is [code]1[/code] radiaal omdat je de straal [code]1[/code] keer om de cirkel wikkelt.
pt_br: Para obter o ângulo em radiano, você pega o valor do raio do círculo e o envolve ao redor do círculo. Esse ângulo é [code]1[/code] radiano porque você está envolvendo o raio [code]1[/code] vez ao redor do círculo.
ru: Чтобы получить угол в радианах, вы берёте длину радиуса окружности и отмеряете на окружности дугу, равную этой длине. Угол этой дуги составит [code]1[/code] радиан, потому что вы отмерили длину радиуса на окружности [code]1[/code] раз.
ta: ரேடியன்களில் கோணத்தைப் பெற, நீங்கள் வட்டத்தின் ஆரம் எடுத்து வட்டத்தை சுற்றி போடுவீர்கள். அந்த கோணம் [குறியீடு] 1 [/குறியீடு] ரேடியன், ஏனெனில் நீங்கள் வட்டத்தை சுற்றி ஆரம் [குறியீடு] 1 [/குறியீடு] நேரத்தை மடக்குகிறீர்கள்.
uk: Щоб отримати кут у радіанах, візьміть довжину радіуса кола і відміряйте на колі дугу, рівну цій довжині. Кут цієї дуги становитиме [code]1[/code] радіан, оскільки довжину радіуса на колі відкладено [code]1[/code] раз.
zh_hant: 要得到弧度角度，你需要將圓的半徑長度繞在圓上。這樣所形成的角度就稱為 [code]1[/code] 弧度，因為你將半徑繞圓一圈。

source: Because the perimeter of a circle is [code]2 * PI * radius[/code], a full turn (360°) corresponds to [code]2 * PI[/code] radians: you need to wrap the radius of a circle [code]2 * PI[/code] times around the circle to make a full circle.
cs: Protože obvod kruhu je [code]2 * PI * poloměr[/code], odpovídá plnému otočení (360°) [code]2 * PI[/code] radiánů: abyste udělali plný kruh, musíte obtočit poloměr kruhu [code]2 * PI[/code]krát kolem kruhu (tedy asi 6.24 krát).
da: Fordi omkredsen af en cirkel er [code]2 * PI * radius[/code], svarer en hel omdrejning (360°) til [code]2 * PI[/code] radianer: du skal vikle radius af en cirkel [code]2 * PI[/code] gange rundt om cirklen for at lave en hel cirkel.
fr: Comme le périmètre d'un cercle est [code]2 * PI * rayon[/code], un tour complet (360°) correspond à [code]2 * PI[/code] radians : vous devez enrouler le rayon d'un cercle [code]2 * PI[/code] fois autour du cercle pour faire un tour complet.
ja: 円周は[code]2* PI * 半径[/code]であるため、1回転(360°)は[code] 2 * PI [/code]ラジアンに対応します。[code] 2 * PI [/code]回円周率を回すと完全な円が出来ます。
nl: Omdat de omtrek van een cirkel [code]2 * PI * radius[/code] is, komt een volledige draai (360°) overeen met [code]2 * PI[/code] radialen: je moet de straal van een cirkel [code]2 * PI[/code] keer rond de cirkel wikkelen om een volledige cirkel te maken.
pt_br: Por causa que o perímetro do círculo é [code]2 * PI * raio[/code], uma volta completa (360°) corresponde a [code]2 * PI[/code] radiano: você precisa envolver o raio de um círculo [code]2 * PI[/code] vezes em volta do círculo para fazer um círculo completo.
ru: Поскольку периметр окружности равен [code]2 * PI * radius[/code], полный оборот (360°) соответствует [code]2 * PI[/code] радианам: вам нужно отмерить на окружности дугу равную [code]2 * PI[/code] радиусам, чтобы сделать полный круг.
ta: ஒரு வட்டத்தின் சுற்றளவு [குறியீடு] 2 * பை * ஆரம் [/குறியீடு] என்பதால், ஒரு முழு திருப்பம் (360 °) [குறியீடு] 2 * பை [/குறியீடு] ரேடியன்களுக்கு ஒத்திருக்கிறது: நீங்கள் ஒரு வட்டத்தின் ஆரம் போர்த்த வேண்டும் [குறியீடு] 2 * பை [/குறியீடு] முழு வட்டத்தை உருவாக்க வட்டத்தை சுற்றி முறை.
uk: Оскільки довжина кола дорівнює [code]2 * PI * radius[/code], повний оберт (360°) відповідає [code]2 * PI[/code] радіанам: щоб отримати повне коло, вам доведеться відкласти радіус уздовж нього [code]2 * PI[/code] разів.
zh_hant: 由於圓的周長是 [code]2 * PI * 半徑[/code]，因此一整圈（360°）對應 [code]2 * PI[/code] 弧度：你需要將圓的半徑繞圓 [code]2 * PI[/code] 次，才能繞出一整圈。

source: What does the code below do?
cs: K čemu slouží níže uvedený kód?
da: Hvad gør koden nedenfor?
de: Was bewirkt der folgende Code?
es: ¿Qué hace el código siguiente?
fr: Que fait le code ci-dessous ?
it: Cosa fa il codice qui sotto?
ja: 以下のコードは何を実行するしょうか？
nl: Wat doet de onderstaande code?
pt_br: O que o código abaixo faz?
ru: Что делает код приведенный ниже?
ta: கீழே உள்ள குறியீடு என்ன செய்கிறது?
uk: Що робить код, наведений нижче?
zh_hant: 下面的程式碼會做什麼？

source: [code]show()[/code]
ta: [குறியீடு] காட்டு () [/குறியீடு]

source: Both answers were right! Technically, the code calls the [code]show()[/code] function. And doing so makes the game entity visible.
cs: Obě odpovědi byly správné! Technicky kód volá funkci [code]show()[/code]. A tím se herní entita zviditelní.
da: Begge svar var rigtige! Teknisk set kalder koden funktionen [code]show()[/code]. Og hvis du gør det, bliver spillets enhed synlig.
de: Beide Antworten sind richtig! Technisch gesehen ruft der Code die Funktion [code]show()[/code] auf. Und das macht die Spielentität sichtbar.
es: ¡Ambas respuestas son correctas! Técnicamente, el código llama a la función [code]show()[/code]. Y al hacerlo, la entidad del juego se vuelve visible.
fr: Les deux réponses étaient correctes ! Techniquement, le code appelle la fonction [code]show()[/code]. Et ce faisant, l'entité du jeu devient visible.
it: Entrambe le risposte sono giuste! Tecnicamente, il codice chiama la funzione [code]show()[/code]. Facendo ciò rende l'elemento di gioco visibile.
ja: どちらも正解です！ 技術的にはどちらのコードも[code]show()[/code]関数を呼び出します。そうすることでゲームにエンティティが表示されます。
nl: Beide antwoorden waren juist! Technisch gezien roept de code de [code]show()[/code] functie aan. Hierdoor wordt het spelobject zichtbaar.
pt_br: Ambas as respostas estavam corretas! Tecnicamente, o código chama a função [code]show()[/code]. E fazendo isso, ela deixa a entidade do jogo visível.
ru: Оба ответа были правильными! Технически код вызывает функцию [code]show()[/code], а эта функция, в свою очередь, делает игровой объект видимым.
ta: இரண்டு பதில்களும் சரியாக இருந்தன! தொழில்நுட்ப ரீதியாக, குறியீடு [குறியீடு] காட்சி () [/குறியீடு] செயல்பாட்டை அழைக்கிறது. அவ்வாறு செய்வது விளையாட்டு நிறுவனத்தை காண வைக்கிறது.
uk: Обидві відповіді були правильними! Технічно код викликає функцію [code]show()[/code], а ця функція, своєю чергою, робить ігровий об'єкт видимим.
zh_hant: 這兩個答案都是正確的！從技術上來說，這段程式碼會呼叫 [code]show()[/code] 函式。這樣做會讓遊戲中的實體變得可見。

source: It calls the function named "show".
da: Den kalder funktionen med navnet "show".
de: Sie ruft die Funktion mit dem Namen "show" auf.
fr: Il appelle la fonction nommée « show ».
ja: "show"という名前の関数を呼び出します。
nl: Het roept de functie met de naam "show" aan.
pt_br: Ele chama a função chamada "show".
ru: Он вызывает функцию с именем «show».
ta: இது "நிகழ்ச்சி" என்று பெயரிடப்பட்ட செயல்பாட்டை அழைக்கிறது.
uk: Він викликає функцію з назвою «show».
zh_hant: 它呼叫了名為 "show" 的函式。

source: It makes the entity (like a game character or a sprite) visible.
cs: Zviditelní entitu (například herní postavu nebo sprite).
da: Det gør enheden (som en spilfigur eller en sprite) synlig.
de: Es macht die Entität (z.B. einen Spielcharakter oder ein Sprite) sichtbar.
es: Hace que la entidad (como un personaje del juego o un sprite) sea visible.
fr: Il rend l'entité (comme un personnage de jeu ou un sprite) visible.
it: Rende un elemento (come ad esempio uno sprite o un personaggio) visibile.
ja: エンティティ（ゲームのキャラクターやスプライトなど）が表示されます。
nl: Het maakt het object (zoals een spelfiguur of een sprite) zichtbaar.
pt_br: Ele faz a entidade ficar visível (como um personagem ou uma sprite).
ru: Он делает игровой объект (к примеру, персонажа или спрайт) видимым.
ta: இது நிறுவனம் (ஒரு விளையாட்டு எழுத்து அல்லது ஒரு ச்பிரிட் போன்றது) தெரியும்.
uk: Він робить ігровий об'єкт (наприклад, персонажа або спрайт) видимим.
zh_hant: 它讓實體（例如遊戲角色或精靈）變得可見。

source: Another example: With the [code]move_local_x()[/code] function, you can move the character to its left and right. The function takes one argument: a number of pixels to offset the entity.
da: Et andet eksempel: Med funktionen [code]move_local_x()[/code] kan du flytte figuren til venstre og højre. Funktionen tager ét argument: et antal pixels for at forskyde entiteten.
fr: Un autre exemple : avec la fonction [code]move_local_x()[/code], vous pouvez déplacer le personnage vers sa gauche et sa droite. La fonction prend un argument : un nombre de pixels pour décaler l'entité.
ja: 別の例：[code]move_local_x()[/code]関数を使用すると、キャラクターを左右に移動できます。 この関数はエンティティの位置をオフセットするためのピクセル数という1つの引数を取ります。
nl: Een ander voorbeeld: Met de functie [code]move_local_x()[/code] kun je het personage naar links en naar rechts verplaatsen. De functie vraagt één argument: het aantal pixels dat het object moet verschuiven.
pt_br: Outro exemplo: com a função [code]move_local_x()[/code], você pode mover o personagem para sua esquerda e direita. Essa função requer um argumento: o número de pixels para deslocar a entidade.
ru: Другой пример: с помощью функции [code]move_local_x()[/code] вы можете перемещать персонажа влево и вправо. Функция принимает один аргумент: количество пикселей для смещения объекта.
ta: மற்றொரு எடுத்துக்காட்டு: [குறியீடு] MOVE_LOCAL_X () [/code] செயல்பாட்டுடன், நீங்கள் எழுத்தை அதன் இடது மற்றும் வலதுபுறமாக நகர்த்தலாம். செயல்பாடு ஒரு வாதத்தை எடுக்கிறது: நிறுவனத்தை ஈடுசெய்ய பல பிக்சல்கள்.
uk: Інший приклад: за допомогою функції [code]move_local_x()[/code] можна переміщувати персонажа вліво і вправо. Функція приймає один аргумент: кількість пікселів для зміщення об'єкта.
zh_hant: 另一個範例：使用 [code]move_local_x()[/code] 函式，你可以讓角色向左右移動。這個函式需要一個引數：偏移實體的像素數量。

source: The complementary function [code]move_local_y()[/code] makes the character move up and down.
cs: Doplňková funkce [code]move_local_y()[/code] způsobí, že se [i]sprite[/i] pohybuje nahoru a dolů.
da: Den komplementære funktion [code]move_local_y()[/code] får figuren til at bevæge sig op og ned.
fr: La fonction complémentaire [code]move_local_y()[/code] permet de déplacer le personnage vers le haut et le bas.
ja: 別の関数[code]move_local_y()[/code]は、キャラクターを上下に動かします。
nl: De complementaire functie [code]move_local_y()[/code] laat het personage omhoog en omlaag bewegen.
pt_br: A função complementar [code]move_local_y()[/code] faz com que o personagem se mova para cima e para baixo.
ru: Похожая функция [code]move_local_y()[/code] заставляет персонажа перемещаться вверх и вниз.
ta: நிரப்பு செயல்பாடு [குறியீடு] MOVE_LOCAL_Y () [/code] எழுத்தை மேலும் கீழும் நகர்த்த வைக்கிறது.
uk: Схожа функція [code]move_local_y()[/code] змушує персонажа переміщуватися вгору та вниз.
zh_hant: 對應的函式 [code]move_local_y()[/code] 則是讓角色上下移動。

source: This is one way to move a character in a game, although we'll see more powerful ways to do this later.
cs: Toto je jeden ze způsobů, jak pohnout postavou ve hře, i když později uvidíme komfortnější způsoby, jak toho dosáhnout.
da: Dette er én måde at flytte en figur i et spil på, selvom vi vil se mere effektive måder at gøre dette på senere.
fr: C'est une façon de déplacer un personnage dans un jeu, bien que nous verrons des moyens plus puissants de le faire plus tard.
ja: これはゲーム内でキャラクターを動かす1つの方法ですが、これを行うためのより強力な方法については後で説明します。
nl: Dit is één manier om een personage in een spel te verplaatsen, maar we zullen later krachtigere manieren zien om dit te doen.
pt_br: Esse é apenas um jeito de mover um personagem dentro de um jogo. Veremos mais tarde maneiras mais poderosas de fazer isso.
ru: Мы показали один из способов перемещения персонажа в игре, хотя позже мы рассмотрим более эффективные способы.
ta: ஒரு விளையாட்டில் ஒரு கதாபாத்திரத்தை நகர்த்துவதற்கான ஒரு வழி இது, இருப்பினும் இதைச் செய்வதற்கான அதிக சக்திவாய்ந்த வழிகளைக் காண்போம்.
uk: Це один зі способів переміщення персонажа у грі, хоча пізніше ми розглянемо ефективніші способи.
zh_hant: 這是移動遊戲角色的一種方式，雖然我們稍後會看到更強大的方法來實現這個功能。

source: Why move_local_y(20) moves the character down
cs: Proč move_local_y(20) přesune znak dolů
da: Hvorfor flytter move_local_y(20) karakteren nedad
de: Warum move_local_y(20) den Charakter nach unten verschiebt
es: ¿Por qué move_local_y(20) mueve el personaje hacia abajo?
fr: Pourquoi move_local_y(20) déplace le personnage vers le bas
it: Perché move_local_y(20) fa muovere il personaggio verso il basso
ja: move_local_y(20)がキャラクターを下に移動する理由
nl: Waarom move_local_y(20) het personage naar beneden verschuift
pt_br: Por quê a função move_local_y(20) move o personagem para baixo
ru: Почему move_local_y(20) перемещает персонажа вниз
ta: ஏன் move_local_y (20) பாத்திரத்தை கீழே நகர்த்துகிறது
uk: Чому move_local_y(20) переміщує персонажа вниз
zh_hant: 為什麼 move_local_y(20) 會讓角色向下移動

source: With positive values ([code]20[/code]), the code above moves the robot to the right and down.
cs: Při kladných hodnotách ([code]20[/code]) výše uvedený kód posune robota doprava a dolů.
da: Med positive værdier ([code]20[/code]) bevæger koden ovenfor robotten til højre og nedad.
fr: Avec des valeurs positives ([code]20[/code]), le code ci-dessus déplace le robot vers la droite et vers le bas.
ja: 正の値（[code]20[/code]）の場合、上記のコードはロボットを右下に移動します。
nl: Met positieve waarden ([code]20[/code]) beweegt de bovenstaande code de robot naar rechts en naar beneden.
pt_br: Com o valor positivo ([code]20[/code]), o código acima move o robô para a direita e para baixo.
ru: При положительных значениях ([code]20[/code]) приведенный выше код перемещает робота вправо и вниз.
ta: நேர்மறை மதிப்புகள் ([குறியீடு] 20 [/குறியீடு]) உடன், மேலே உள்ள குறியீடு ரோபோவை வலதுபுறமாகவும் கீழ்நோக்கி நகர்த்துகிறது.
uk: За додатних значень ([code]20[/code]) наведений вище код переміщує робота вправо і вниз.
zh_hant: 使用正數值（[code]20[/code]），上述程式碼會將機器人向右和向下移動。

source: This is probably different than what you studied at school: in math classes, the horizontal axis points to the right, like here, but the vertical axis points up.
cs: To se pravděpodobně liší od toho, co jste se učili ve škole: v hodinách matematiky ukazuje vodorovná osa doprava, jako zde, ale svislá osa ukazuje nahoru.
da: Dette er sandsynligvis anderledes end det, du lærte i skolen: i matematiktimerne peger den vandrette akse til højre, som her, men den lodrette akse peger opad.
fr: C'est probablement différent de ce que vous avez étudié à l'école : dans les cours de mathématiques, l'axe horizontal pointe vers la droite, comme ici, mais l'axe vertical pointe vers le haut.
ja: これはおそらく学校で勉強したものとは異なります。数学の授業では横軸の＋はこのように右を指しますが、縦軸の＋は上を指します。
nl: Dit is waarschijnlijk anders dan wat je op school hebt geleerd: in wiskundelessen wijst de horizontale as naar rechts, zoals hier, maar de verticale as wijst omhoog.
pt_br: Isso provavelmente é diferente do que você deve ter estudado na escola: nas aulas de matemática, o eixo horizontal aponta para a direita, igual aqui, mas o eixo vertical aponta para cima.
ru: Вероятно, это отличается от того, что вы изучали в школе: на уроках математики горизонтальная ось направлена вправо, как и здесь, но вертикальная ось направлена вверх.
ta: இது பள்ளியில் நீங்கள் படித்ததை விட வேறுபட்டது: கணித வகுப்புகளில், கிடைமட்ட அச்சு வலதுபுறம் சுட்டிக்காட்டுகிறது, இங்கே போல, ஆனால் செங்குத்து அச்சு சுட்டிக்காட்டுகிறது.
uk: Ймовірно, це відрізняється від того, що ви вивчали у школі: на уроках математики горизонтальна вісь спрямована вправо, як і тут, але вертикальна вісь спрямована вгору.
zh_hant: 這可能與你在學校學到的有些不同：在數學課中，水平軸是向右的，如同這裡的範例，但垂直軸是向上的。

source: In video games, and generally in 2D computer graphics, the vertical axis points down instead. So whenever you move something on the Y-axis with a positive value, it'll move [i]down[/i].
cs: Ve videohrách a obecně ve 2D počítačové grafice svislá osa místo toho ukazuje dolů. Takže kdykoli pohnete něčím na ose Y s kladnou hodnotou, posune se to [i] dolů[/i].
da: I videospil og generelt i 2D-computergrafik peger den lodrette akse nedad i stedet. Så når du bevæger noget på Y-aksen med en positiv værdi, vil det bevæge sig [i]nedad[/i].
fr: Dans les jeux vidéo, et généralement dans l'infographie 2D, l'axe vertical pointe plutôt vers le bas. Ainsi, chaque fois que vous déplacez quelque chose sur l'axe Y avec une valeur positive, il se déplace [i]vers le bas[/i].
ja: ビデオゲーム、および一般的に2Dコンピュータグラフィックスでは、縦軸の＋は下向きになります。 したがってY軸上で正の値で何かを移動すると、[i]下[/i]に移動します。
nl: In videospellen, en in het algemeen in 2D computer graphics, wijst de verticale as naar beneden. Dus wanneer je iets op de Y-as met een positieve waarde beweegt, beweegt het [i]naar beneden[/i].
pt_br: Em jogos, e geralmente em computação gráfica em 2D, o eixo vertical aponta para baixo ao invés de para cima. Então toda vez que você mover alguma coisa no eixo Y com um valor positivo, ela vai se mover [i]para baixo[/i].
ru: В видеоиграх и, как правило, в компьютерной 2D-графике вертикальная ось направлена вниз. Поэтому всякий раз, когда вы перемещаете что-то по оси Y с положительным значением, оно перемещается [i]вниз[/i].
ta: வீடியோ கேம்களில், பொதுவாக 2 டி கணினி கிராபிக்ச், அதற்கு பதிலாக செங்குத்து அச்சு சுட்டிக்காட்டுகிறது. ஆகவே, நீங்கள் y- அச்சில் எதையாவது நேர்மறையான மதிப்புடன் நகர்த்தும்போதெல்லாம், அது [i] கீழே நகரும் [/i].
uk: У відеоіграх і, як правило, у комп'ютерній 2D-графіці вертикальна вісь спрямована вниз. Тому щоразу, коли ви переміщуєте щось по осі Y з додатним значенням, воно переміщується [i]вниз[/i].
zh_hant: 然而在遊戲中，尤其是在2D電腦圖形中，垂直軸是向下的。因此當你在Y軸上使用正數值移動物體時，它會向[b]下[/b]移動。

source: How do you call a function?
cs: Jak zavoláte funkci?
da: Hvordan kalder du en funktion?
de: Wie ruft man eine Funktion auf?
es: ¿Cómo se llama a una función?
fr: Comment appeler une fonction ?
it: Come chiamare una funzione?
ja: どのように関数を呼び出しますか？
nl: Hoe roep je een functie aan?
pt_br: Como você chama uma função?
ru: Как вызвать функцию?
ta: ஒரு செயல்பாட்டை எவ்வாறு அழைக்கிறீர்கள்?
uk: Як викликати функцію?
zh_hant: 你如何呼叫一個函式？

source: What is the syntax you use to call a function in general?
cs: Jakou syntaxi obecně používáte pro volání funkce?
da: Hvad er den syntaks, man bruger til at kalde en funktion generelt?
de: Welche Syntax verwendest Du, um eine Funktion im Allgemeinen aufzurufen?
es: ¿Cuál es la sintaxis que se utiliza para llamar a una función en general?
fr: Quelle est la syntaxe que vous utilisez pour appeler une fonction en général ?
it: Qual è la sintassi da usare per chiamare una funzione in generale?
ja: 一般的に関数を呼び出すために使用する構文は何ですか？
nl: Welke vorm gebruik je in het algemeen om een functie aan te roepen?
pt_br: Qual é a sintaxe que você geralmente usa para chamar uma função?
ru: Какой синтаксис можно использовать для вызова функции?
ta: பொதுவாக ஒரு செயல்பாட்டை அழைக்க நீங்கள் பயன்படுத்தும் தொடரியல் என்ன?
uk: Який синтаксис можна використовувати для дзвінка?
zh_hant: 一般來說，呼叫函式的語法是什麼？

source: To call a function, you need to write its exact name followed by an opening and a closing parenthesis.
cs: Chcete-li zavolat funkci, musíte napsat její přesný název, za kterým následuje otevírací a uzavírací závorka.
da: For at kalde en funktion skal du skrive dens nøjagtige navn efterfulgt af en indledende og en afsluttende parentes.
fr: Pour appeler une fonction, vous devez écrire son nom exact suivi d'une parenthèse ouvrante et d'une parenthèse fermante.
ja: 関数を呼び出すには、正確な関数名の後に開き括弧と閉じ括弧を付ける必要があります。
nl: Om een functie aan te roepen, schrijf je de exacte naam ervan, gevolgd door een openend en een sluitend haakje.
pt_br: Para chamar uma função, você precisa escrever seu nome exato seguido por uma abertura e fechamento de parêntesis.
ru: Чтобы вызвать функцию, нужно написать ее точное имя, а затем поставить открывающую и закрывающую круглые скобки.
ta: ஒரு செயல்பாட்டை அழைக்க, நீங்கள் அதன் சரியான பெயரை எழுத வேண்டும், அதைத் தொடர்ந்து ஒரு திறப்பு மற்றும் இறுதி அடைப்புக்குறிப்பு.
uk: Щоб викликати функцію, потрібно написати її точну назву, а потім поставити відкриту і закриту круглі дужки.
zh_hant: 要呼叫一個函式，你需要寫下它的精確名稱，後面跟著一個左括號和一個右括號。
