Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-24-access-array-indices.po
Languages: cs, da, de, es, fr, it, ja, nl, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: In the following practices, you will use array indices to realign train tracks and grab the correct item in an inventory.
cs: V následujících praktických příkladech budete používat indexy polí k zarovnání vlakových kolejí a k uchopení správné položky v inventáři.
da: I de følgende øvelser vil du bruge array-indekser til at justere togskinner og finde den korrekte genstand i et lager.
de: In den folgenden Übungen verwendest du Array-Indizes, um Zuggleise neu auszurichten und das richtige Element in einem Inventar zu erfassen.
es: En las siguientes prácticas, utilizarás índices de arrays para realinear vías de tren y tomar el artículo correcto de un inventario.
fr: Dans la pratique suivante, vous allez utiliser des indices de tableau pour réaligner des voies ferrées et saisir l'article correct d'un inventaire.
it: Nelle seguenti pratiche, userai gli indici per riallineare i binari di un treno e per prendere l'oggetto corretto in un inventario.
ja: 次の演習では、配列インデックスを使用して線路を再調整し、インベントリ内の正しいアイテムを取得します。
nl: In de volgende oefeningen zul je indices gebruiken om treinrails opnieuw uit te lijnen en het juiste voorwerp in een inventaris te pakken.
pt: Nas práticas a seguir, vai usar índices de array para realinhar trilhos de comboio e escolher o item correto num inventário.
pt_br: Nas práticas a seguir, você vai usar índices de array para realinhar trilhos de trem e pegar o item correto em um inventário.
ru: В последующих упражнениях вы будете получать элементы из массивов по индексам для починки железной дороги и вытаскивания правильных предметов из инвентаря.
ta: பின்வரும் நடைமுறைகளில், ரயில் தடங்களை மாற்றியமைக்க வரிசை குறியீடுகளைப் பயன்படுத்துவீர்கள், மேலும் சரியான உருப்படியை ஒரு சரக்குகளில் கைப்பற்றுவீர்கள்.
tr: Sıradaki alıştırmalarda, tren raylarını yeniden hizalamak ve bir envanterdeki doğru öğeyi almak için dizinleri kullanacaksınız.
uk: У наступних вправах ви будете використовувати індекси масиву, щоб переставити залізничні колії та отримати правильний предмет в інвентарі.
zh_hans: 在下面的练习中，你需要使用数组索引来重新排列火车轨道，还有在背包里掏出正确的物品。
zh_hant: 在接下來的練習中，你將會使用陣列索引來重新對齊火車軌道，還有從背包中抓取正確的物品。

source: Using the right items
cs: Používání správných položek
da: Brug af de rigtige genstande
de: Benutze die richtigen Gegenstände
es: Utilizar los objetos adecuados
fr: Utiliser les bons objets
it: Usando gli oggetti giusti
ja: 適切なアイテムの使用
nl: De juiste voorwerpen gebruiken
pt: Usando os itens certos
pt_br: Usando os itens certos
ru: Использование правильных предметов
ta: சரியான உருப்படிகளைப் பயன்படுத்துதல்
tr: Doğru öğeleri kullanmak
uk: Використання правильних предметів
zh_hans: 使用正确的物品
zh_hant: 使用正確的物品

source: In our game, the player has an inventory that works as an array under the hood.
da: I vores spil har spilleren et lager, der fungerer som et array under motorhjelmen.
fr: Dans notre jeu, le joueur a un inventaire qui fonctionne comme un tableau sous le capot.
pt: No nosso jogo, o jogador tem um inventário que, na verdade, funciona como um array.
ru: В нашей игре у игрока есть инвентарь, который работает как массив под капотом.
tr: Oyunumuzda, oyuncunun aslında bir dizi olarak işlenen bir envanteri var.

source: The player knows they have a sword and a shield somewhere in their inventory, but they don't remember exactly where.
da: Spilleren ved, at de har et sværd og et skjold et sted i deres inventar, men de kan ikke huske præcis hvor.
fr: Le joueur sait qu'il a une épée et un bouclier quelque part dans son inventaire, mais il ne se souvient pas exactement où.
ru: Игрок знает, что где-то в его инвентаре есть меч и щит, но он не помнит, где именно.
tr: Oyuncu envanterinde bir yerde bir kılıç ve bir kalkan olduğunu biliyor, ancak tam olarak nerede olduğunu hatırlamıyor.

source: You can see the inventory drawn on the right, along with the index of each item in the inventory.
da: Du kan se inventaret tegnet til højre sammen med indekset for hver genstand i lageret.
fr: Vous pouvez voir l'inventaire dessiné à droite, avec l'indice de chaque objet dans l'inventaire.
ru: Справа вы можете увидеть инвентарь, а также индекс каждого предмета в инвентаре.
tr: Sağda envanteri görebilirsiniz; envanterdeki her bir öğe kendi indeksi ile verildi.

source: Your task is to find one sword and one shield in the array using their index, then call [code]use_item()[/code] on each of them so the player can equip those items.
da: Din opgave er at finde et sværd og et skjold i arrayet ved hjælp af deres indeks og derefter kalde [code]use_item()[/code] på hver af dem, så spilleren kan udstyre disse genstande.
fr: Votre tâche est de trouver une épée et un bouclier dans le tableau en utilisant leur indice, puis d'appeler [code]use_item()[/code] sur chacun d'eux pour que le joueur puisse équiper ces objets.
ru: Ваша задача — найти один меч и один щит в массиве, используя их индекс, а затем вызвать [code]use_item()[/code] для каждого из них, чтобы игрок мог экипировать эти предметы.
tr: Göreviniz, bir kılıç ve bir kalkanı dizideki indekslerini kullanarak bulmak, ardından her biri için [code]use_item()[/code] işlevini çağırmak ve böylece oyuncunun bu eşyaları kuşanabilmesini sağlamaktır.

source: For example, if the first item in the array is what you need, you would call [code]use_item(inventory[0])[/code].
da: For eksempel, hvis den første genstand i arrayet er det, du har brug for, ville du kalde [code]use_item(inventory[0])[/code].
fr: Par exemple, si le premier objet du tableau est ce dont vous avez besoin, vous pouvez appeler [code]use_item(inventory[0])[/code].
ru: Например, если вам нужен первый элемент массива, вы можете вызвать [code]use_item(inventory[0])[/code].
tr: Örneğin, ihtiyacınız olan şey dizideki ilk öğe ise, [code]use_item( inventory[0] )[/code] çağırırsınız.

source: Find the right items to use in the player's inventory, using their index.
da: Find de rigtige genstande at bruge i spillerens inventar ved hjælp af deres indeks.
es: Encuentra los objetos adecuados para usar en el inventario del jugador, usando su índice.
fr: Trouvez les bons objets à utiliser dans l'inventaire du joueur, en utilisant leur index.
ru: Найдите нужные предметы в инвентаре игрока, используя его индекс.
tr: Oyuncunun envanterinde kullanılacak doğru öğeleri bulun, indekslerini kullanın.

source: Realigning the train tracks
cs: Přerovnání vlakových kolejí
da: Omlægning af togskinnerne
de: Neuausrichtung der Bahngleise
es: Realinear las vías del tren
fr: Réalignement des voies ferrées
it: Riallinea i binari del treno
ja: 線路の再編成
nl: De treinsporen opnieuw uitlijnen
pt: Realinhando os trilhos do comboio
pt_br: Realinhando os trilhos do trem
ru: Починка железной дороги
ta: ரயில் தடங்களை மறுசீரமைத்தல்
tr: Tren raylarını yeniden hizalamak
uk: Перепланування залізничних колій
zh_hans: 重新调整火车轨道
zh_hant: 重新調整火車軌道

source: We have train tracks broken down into little chunks in our game. We use them to make modular tracks and draw circuits of all shapes and sizes.
da: I vores spil har vi opdelt togskinner i små bidder. Vi bruger dem til at lave modulære spor og tegne baner i alle former og størrelser.
fr: Nous avons des vois ferrées décomposées en petits morceaux dans notre jeu. Nous les utilisons pour faire des pistes modulaires et dessiner des circuits de toutes formes et tailles.
pt: Temos trilhos de comboio divididos em pequenos pedaços em nosso jogo. Usamos-o para fazer trilhos modulares e desenhar circuitos de todas as formas e tamanhos.
ru: В нашей игре есть рельсовые пути, разбитые на маленькие части. Мы используем их для составления маршрутов любых форм и размеров.
tr: Oyunumuzda küçük parçalara ayrılmış tren raylarımız var. Bunları kolay takılan (modüler) raylar yapmak ve her şekil ve boyutta yollar çizmek için kullanıyoruz.

source: However, several chunks are misaligned. You need to find them in the [code]tracks[/code] array and pass them to the [code]align()[/code] function.
da: Der er dog flere bidder, der er forkert justeret. Du skal finde dem i [code]tracks[/code]-arrayet og sende dem til [code]align()[/code]-funktionen.
fr: Cependant, plusieurs morceaux sont mal alignés. Vous devez les trouver dans le tableau [code]tracks[/code] et les passer à la fonction [code]align()[/code].
pt: No entanto, vários pedaços estão desalinhados. Precisa encontrá-los no array [code]tracks[/code] e passá-los à função [code]align()[/code].
ru: Но сейчас несколько частей расположены неправильно. Вам нужно достать их из массива [code]tracks[/code] и передать в функцию [code]align()[/code].
tr: Ancak, birkaç parça yanlış hizalanmış. Bunları [code]tracks[/code] (raylar) dizisinde bulmanız ve [code]align()[/code] (hizala) fonksiyonuna aktarmanız gerekir.

source: To do so, you need to access the array by index.
da: For at gøre det skal du tilgå arrayet via indeks.
fr: Pour ce faire, vous devez accéder au tableau avec des indices.
pt: Para fazê-lo, precisa aceder o array por índice.
ru: Для этого вам нужно получить элементы массива по индексам.
tr: Bunu yapmak için öğelere dizinlerine göre erişmeniz gerekir.

source: This time, though, you need to access them with [i]negative indices[/i].
da: Denne gang skal du dog tilgå dem med [i]negative indekser[/i].
fr: Cette fois, cependant, vous devez y accéder avec des [i]indices négatifs[/i].
pt: Desta vez, porém, deve acede-los com [i]índices negativos[/i].
ru: В этот раз используйте [i]отрицательные индексы[/i].
tr: Ancak bu kez, bunlara [i]negatif dizin numaraları[/i] ile erişmeniz gerekiyor.

source: Some chunks of our train tracks are misaligned, and the train can't pass. Find the faulty pieces and realign them.
cs: Některé kusy našich vlakových kolejí jsou špatně zarovnané a vlak nemůže projet. Najděte vadné kusy a znovu je zarovnejte.
da: Nogle dele af vores togskinnerne er forkert justeret, og toget kan ikke passere. Find de defekte dele, og juster dem.
de: Einige Abschnitte unserer Bahngleise sind falsch ausgerichtet und der Zug kann nicht passieren. Finde die fehlerhaften Teile und richte sie neu aus.
es: Algunas partes de las vías del tren están desalineadas y el tren no puede pasar. Encuentra las partes defectuosas y realinéalas.
fr: Certaines parties de nos rails de train sont mal alignés, et le train ne peut pas passer. Trouvez les pièces défectueuses et réalignez-les.
it: Alcuni pezzi delle nostre rotaie sono disallineati e il treno non può passare. Trova i pezzi sbagliati e riallineali.
ja: 線路の一部がずれていて、電車が通れません。欠陥のある部品を見つけて再調整します。
nl: Sommige stukken van onze treinrails zijn niet goed uitgelijnd en de trein kan er niet langs. Zoek de defecte stukken en lijn ze opnieuw uit.
pt: Alguns pedaços de nossos trilhos de comboio estão desalinhados e o comboio não pode passar. Encontre as peças defeituosas e realinhe elas.
pt_br: Alguns pedaços de nossos trilhos de trem estão desalinhados e o trem não pode passar. Encontre as peças defeituosas e realinhe elas.
ru: Несколько частей железной дороги расположены неправильно, это мешает поезду проехать. Найдите проблемные части и исправьте их.
ta: எங்கள் ரயில் தடங்களின் சில துகள்கள் தவறாக வடிவமைக்கப்பட்டுள்ளன, மேலும் ரயில் கடந்து செல்ல முடியாது. தவறான துண்டுகளைக் கண்டுபிடித்து அவற்றை மாற்றியமைக்கவும்.
tr: Tren raylarımızın bazı parçaları yanlış hizalanmış ve tren geçemiyor. Hatalı parçaları bulun ve yeniden hizalayın.
uk: Деякі шматки наших залізничних колій зміщені, і поїзд не може проїхати. Знайдіть несправні деталі та переставте їх.
zh_hans: 我们的一些火车轨道错位了，火车无法通过。 找到不对头的部分并重新调整它们。
zh_hant: 有一些火車軌道段落沒有對齊，導致火車無法通過。找出那些故障的軌道段，並將它們重新對齊。

source: Accessing values in arrays
cs: Přístup k hodnotám v polích
da: Adgang til værdier i arrays
de: Zugreifen auf Werte in Arrays
es: Acceder a los valores de las matrices
fr: Accéder aux valeurs dans les tableaux
it: Accedendo ai valori negli array
ja: 配列内の値へのアクセス
nl: Toegang tot waarden in arrays
pt: Acessando valores em arrays
pt_br: Acessando valores em arrays
ru: Получение значений из массивов
ta: வரிசைகளில் மதிப்புகளை அணுகும்
tr: Dizilerdeki değerlere erişmek
uk: Доступ до значень у масивах
zh_hans: 访问数组中的值
zh_hant: 存取陣列中的值

source: They want to equip a sword and a shield to buff their characters. Like before, we need you to find them in the array.
pt: Eles querem usar uma espada e um escudo para aumentar a força das suas personagens. Como antes, precisamos que você os encontre no array.

source: You need to access elements in the [code]inventory[/code] array by index to do so.
pt: Para fazê-lo, deve aceder os elementos no array [code]inventory[/code] usando índice.

source: Call the [code]use_item()[/code] function with the item as an argument to use an item. For example, you can use the first item by calling [code]use_item(inventory[0])[/code].
pt: Chame a função [code]use_item()[/code] com o item como um argumento para usar um item. Por exemplo, pode usar o primeiro item chamando a função [code]use_item(inventory[0])[/code].

source: Find the right items to use in the player's inventory.
pt: Encontre os itens certos para usar no inventário do jogador.

source: But what if you need to access the third item in the player's inventory? The tenth item? There's a dedicated notation to access one element in an array by index. To do so, you use square brackets with a number inside the brackets.
cs: Ale co když potřebujete získat přístup ke třetímu předmětu v inventáři hráče? Nebo desátý předmět? Existuje speciální zápis pro přístup k jednomu prvku pole podle indexu. Použijete k tomu hranaté závorky s číslem uvnitř závorek.
de: Aber was ist, wenn du auf den dritten Gegenstand im Inventar des Spielers zugreifen musst? Oder den zehnten Gegenstand? Um auf ein Element in einem Array über seinen Index zuzugreifen, gibt es eine bestimmte Notation. Dafür nimmst du eine Zahl innerhalb von eckigen Klammern.
es: ¿Pero qué pasa si necesitas acceder al tercer objeto del inventario del jugador? ¿O al décimo objeto? Existe una notación específica para acceder a un elemento de una matriz con su índice. Para ello, utilizas corchetes con un número dentro de los corchetes.
it: Ma se volessi accedere al terzo oggetto nell'inventario del giocatore? Oppure il decimo? Esiste una notazione dedicata per accedere ad un elemento in un array attraverso un indice. Per fare questo, si utilizzano delle parentesi quadre con un numero all'interno.
ja: しかし、プレイヤーのインベントリの3番目のアイテムにアクセスする必要がある場合はどうでしょうか?10番目のアイテムは? 配列内の 1 つの要素にインデックスでアクセスするための専用の表記法があります。 これを行うには、角括弧を使用し、括弧内に数字を入れます。
nl: Maar wat als je het derde voorwerp in de inventaris van de speler nodig hebt? Of het tiende voorwerp? Er is een speciale notatie om bij een element in een array op een bepaalde index te komen. Hiervoor gebruik je vierkante haken met een getal tussen de haakjes.
pt_br: Mas e se você precisar acessar o terceiro item no inventário do jogador? O décimo item? Há uma notação dedicada para acessar um elemento em um array por índice. Para fazer isso, você usa colchetes com um número dentro dos colchetes.
ta: ஆனால் பிளேயரின் சரக்குகளில் மூன்றாவது உருப்படியை அணுக வேண்டுமானால் என்ன செய்வது? பத்தாவது உருப்படி? குறியீட்டின் மூலம் ஒரு வரிசையில் ஒரு உறுப்பை அணுக ஒரு பிரத்யேக குறியீடு உள்ளது. அவ்வாறு செய்ய, அடைப்புக்குறிக்குள் ஒரு எண்ணைக் கொண்ட சதுர அடைப்புக்குறிகளைப் பயன்படுத்துகிறீர்கள்.
uk: Але що, якщо вам потрібно отримати доступ до третього предмета в інвентарі гравця? Десятий пункт? Існує спеціальна нотація для доступу до одного елемента в масиві за індексом. Для цього ви використовуєте квадратні дужки з числом усередині дужок.
zh_hans: 但是，如果需要访问的是玩家背包中的第三个第三个东西怎么办？ 或者第十个？ 有一种专门的符号可以通过索引访问数组中的一个元素。 要这么做，选哟使用方括号，括号内有一个数字。
zh_hant: 但如果你需要存取玩家背包中的第三個物品呢？第十個物品呢？ 有一種專門的語法可以透過索引來存取陣列中的特定元素。 要做到這點，你可以使用方括號，並在括號內填入一個數字。

source: Index one is the [i]second[/i] element in the array, and so on. You would access the [i]fourth[/i] element in the [code]inventory[/code] array like so.
cs: Index jedna je [i]druhý[/i] prvek pole atd. K [i]čtvrtému[/i] prvku v poli [code]inventář[/code] byste přistupovali takto.
de: Index eins ist das [i]zweite[/i]-Element im Array und so weiter. Du würdest auf das [i]vierte[/i]-Element im [code]inventory[/code]-Array wie folgt zugreifen.
es: El índice uno es el [i]segundo[/i] elemento de la matriz, y así sucesivamente. Accederías al [i]cuarto[/i] elemento de la matriz llamada [code]inventory[/code] de la siguiente manera.
it: Indice uno è il [i]secondo[/i] elemento nell'array e così via. Accederesti al [i]quarto[/i] elemento nell'array [code]inventory[/code] così.
ja: インデックス 1 は配列の [i]2番目[/i] の要素であり、以下同様です。 [code]inventory[/code] 配列の [i]4番目[/i] の要素には、次のようにアクセスします。
nl: Index één is het [i]tweede[/i] element in de array, enzovoort. Je zou het [i]vierde[/i] element in de [code]inventory[/code] array als volgt bereiken.
pt_br: O índice número um é o [i]segundo[/i] elemento no array e assim por diante. Você acessaria o [i]quarto[/i] elemento no array [code]inventory[/code] assim.
ta: குறியீட்டு ஒன்று வரிசையில் உள்ள [i] இரண்டாவது [/i] உறுப்பு, மற்றும் பல. [குறியீடு] சரக்கு [/குறியீடு] வரிசையில் [i] நான்காவது [/i] உறுப்பை நீங்கள் அணுகுவீர்கள்.
uk: Індекс один — це [i]другий[/i] елемент у масиві тощо. Ви отримаєте доступ до [i]четвертого[/i] елемента в масиві [code]inventory[/code] таким чином.
zh_hans: 索引是1的是数组中的 [i]第二个[/i] 元素，依此类推。 可以像下面这样访问 [code]inventory[/code] （库存，背包）数组中的 [i]第四个[/i] 元素。
zh_hant: 索引 1 是陣列中的[b]第二個[/b]元素，以此類推。 你可以這樣存取 [code]inventory[/code] 陣列中的[b]第四個[/b]元素。

source: inventory[2]
ta: சரக்கு [2]
uk: інвентар[2]

source: inventory[3]
ta: சரக்கு [3]
uk: інвентар[3]

source: What if you want to access the last or second-before-last item in the [code]inventory[/code]? In that case, you can use negative indices. If you write [code]-1[/code] in the brackets, you will get the last item in the array. You will get the second-to-last item if you write [code]-2[/code].
cs: Co když chcete získat přístup k poslední nebo předposlední položce v [code]inventory[/code]? V takovém případě můžete použít záporné indexy. Pokud do závorek napíšete [code]-1[/code], získáte poslední položku v poli. Pokud napíšete [code]-2[/code], získáte předposlední položku (druhou od konce).
de: Was ist, wenn du auf das letzte oder vorletzte Element im [code]inventory[/code] zugreifen möchtest? In diesem Fall kannst du negative Indizes verwenden. Wenn du [code]-1[/code] in die Klammern schreibst, greifst du auf das letzte Element im Array zu. Mit der Angabe von [code]-2[/code] erhältst du den Wert des vorletzten Elements.
es: ¿Y qué pasa si quieres acceder al último o penúltimo objeto del [code]inventory[/code]? En ese caso, puedes utilizar índices negativos. Si escribes [code]-1[/code] en los corchetes, obtendrás el último elemento de la matriz. Si escribes [code]-2[/code], obtendrás el penúltimo elemento.
it: Come faresti per accedere all'ultimo o al penultimo oggetto nell'[code]inventory[/code]? In questo caso, puoi usare gli indici negativi. Se scrivi [code]-1[/code] tra parentesi, otterrai l'ultimo valore nell'array. Per ottenere il penultimo scriverai [code]-2[/code].
ja: [code]inventory[/code]の最後または最後から2番目のアイテムにアクセスしたい場合はどうなりますか? その場合は、負のインデックスを使用できます。括弧内に[code]-1[/code]と書くと、配列の最後の項目が取得されます。[code]-2[/code]と書くと最後から2番目の項目になります。
nl: Wat als je het laatste of een-na-laatste item in de [code]inventaris[/code] wilt gebruiken? In dat geval kun je negatieve indices gebruiken. Als je [code]-1[/code] tussen de haakjes schrijft, krijg je het laatste item in de array. Je krijgt het een-na-laatste item als je [code]-2[/code] schrijft.
pt_br: E se você quiser acessar o último ou penúltimo item no array [code]inventory[/code]? Nesse caso, você pode usar índices negativos. Se você escrever [code]-1[/code] nos colchetes, você vai obter o último item do array. Você vai obter o penúltimo item se escrever [code]-2[/code].
ta: [குறியீடு] சரக்கு [/குறியீடு] இல் கடைசி அல்லது இரண்டாம் இடத்திற்கு முன்னதாகவே உருப்படியை அணுக விரும்பினால் என்ன செய்வது? அவ்வாறான நிலையில், நீங்கள் எதிர்மறை குறியீடுகளைப் பயன்படுத்தலாம். அடைப்புக்குறிக்குள் [குறியீடு] -1 [/குறியீடு] எழுதினால், கடைசி உருப்படியை வரிசையில் பெறுவீர்கள். நீங்கள் [குறியீடு] -2 [/குறியீடு] எழுதினால் இரண்டாவது முதல் கடைசி உருப்படியைப் பெறுவீர்கள்.
uk: Що робити, якщо ви хочете отримати доступ до останнього або передостаннього елемента в [code]інвентарі[/code]? У цьому випадку можна використовувати від’ємні показники. Якщо написати [code]-1[/code] у дужках, ви отримаєте останній елемент у масиві. Ви отримаєте передостанній предмет, якщо напишете [code]-2[/code].
zh_hans: 假设你想访问 [code]inventory[/code] 中的最后一个或倒数第二个东西怎么办？ 在这种情况下，你可以使用负索引。 如果你在括号中写 [code]-1[/code]，会得到数组中的最后一项。 如果写 [code]-2[/code]，就是倒数第二个项目。
zh_hant: 如果你想存取 [code]inventory[/code] 中的最後一個或倒數第二個項目的話怎麼做？ 在這種情況下，你可以使用負索引。若在方括號內寫入 [code]-1[/code]，將會獲取陣列中的最後一個項目。若寫入 [code]-2[/code]，則會獲取倒數第二個項目。
