Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-25-creating-dictionaries.po
Languages: cs, da, es, fr, it, ja, pt, ru, ta, tr, uk, zh_hant

source: Dictionaries can map about any value to any other value. For example, we can use the name of an item as a key and the amount as the corresponding value. This makes dictionaries excellent for keeping track of a player's inventory.
ru: Словари могут сопоставлять любое значение с любым другим значением. Например, мы можем использовать название предмета в качестве ключа и количество таких объектов в качестве значения в паре. Это делает словари отличным инструментом для создания инвентаря игрока.
ta: அகராதிகள் வேறு எந்த மதிப்புக்கும் எந்த மதிப்பையும் வரைபடமாக்கலாம். எடுத்துக்காட்டாக, ஒரு பொருளின் பெயரையும் ஒரு விசையாகவும், தொகையை தொடர்புடைய மதிப்பாகவும் பயன்படுத்தலாம். இது ஒரு வீரரின் சரக்குகளை கண்காணிக்க அகராதிகளை சிறந்ததாக்குகிறது.
uk: Словники можуть зіставляти будь-яке значення з будь-яким іншим значенням. Наприклад, ми можемо використовувати назву елемента як ключ, а суму – як відповідне значення. Це робить словники чудовими для відстеження інвентарю гравця.
zh_hant: 字典可以將任何值映射到其他值。 例如，我們可以使用物品的名稱作為鍵，並將數量作為對應的值。這使得字典非常適合用來追蹤玩家的背包物品。

source: Here we matched the name (a string) to the amount (a number). But a key could be a string, a number, or even a vector! Although we can have all of these different keys, keep in mind that every key has to be [i]unique[/i]. That means we [i]couldn't[/i] have a dictionary like the following.
ru: Здесь мы сопоставили имя (строку) и количество (число). Но вместо строки ключ может быть и числом, и даже вектором! Хоть мы и можем использовать разные ключи, всегда держите в голове, что каждый ключ должен быть [i]уникальным[/i]. Это значит, что мы [i]не должны[/i] использовать словари, как в примере ниже.
ta: இங்கே நாங்கள் பெயரை (ஒரு சரம்) தொகையுடன் (ஒரு எண்) பொருத்தினோம். ஆனால் ஒரு விசை ஒரு சரம், எண் அல்லது ஒரு திசையன் கூட இருக்கலாம்! இந்த வெவ்வேறு விசைகள் அனைத்தையும் நாம் கொண்டிருக்க முடியும் என்றாலும், ஒவ்வொரு விசையும் [i] தனித்துவமாக இருக்க வேண்டும் என்பதை நினைவில் கொள்ளுங்கள் [/i]. அதாவது, பின்வருவனவற்றைப் போன்ற ஒரு அகராதி எங்களால் [/i] இருக்க முடியவில்லை.
uk: Тут ми зіставили назву (рядок) із сумою (числом). Але ключ може бути рядком, числом або навіть вектором! Хоча ми можемо мати всі ці різні ключі, майте на увазі, що кожен ключ має бути [i]унікальним[/i]. Це означає, що ми [i]не могли[/i] мати такий словник, як наведений нижче.
zh_hant: 在這裡，我們將名稱(字串)與數量(數字)對應起來。但是鍵可以是字串、數字、甚至是向量！ 雖然我們可以擁有這些不同類型的鍵，但請記住每個鍵必須是[b]唯一的[/b]。這意味著我們[b]不能[/b]擁有像以下這樣的字典。

source: The key [code]"healing heart"[/code] appears [b]twice[/b] in the dictionary. In the above example, Godot wouldn't know whether to return [code]3[/code] or [code]8[/code] when using [code]inventory["healing heart"][/code]. This is why keys need to be unique.
ru: Ключ [code]"healing heart"[/code] используется в словаре [b]дважды[/b]. При выполнении кода из примера выше, Godot не поймёт, что он должен возвращать, [code]3[/code] или [code]8[/code], при попытке получить значение по ключу [code]"healing heart"[/code] из [code]inventory[/code]. Поэтому ключи должны быть уникальными.
ta: முக்கிய [குறியீடு] "குணப்படுத்தும் இதயம்" [/குறியீடு] அகராதியில் [b] [/b] தோன்றும். மேலே உள்ள எடுத்துக்காட்டில், [குறியீடு] 3 [/குறியீடு] அல்லது [குறியீடு] 8 [/குறியீடு] ஐ [குறியீடு] சரக்கு ["குணப்படுத்தும் இதயம்"] [/குறியீடு] ஐப் பயன்படுத்தும்போது கோடோட் அறிய மாட்டார். இதனால்தான் விசைகள் தனித்துவமாக இருக்க வேண்டும்.
uk: Ключ [code]"цілюще серце"[/code] з'являється [b]двічі[/b] у словнику. У наведеному вище прикладі Годо не знав, чи повертати [code]3[/code] чи [code]8[/code] під час використання [code]inventory["healing heart"][/code]. Ось чому ключі повинні бути унікальними.
zh_hant: 鍵值 [code]"healing heart"[/code] 在字典中出現了 [b]兩次[/b]。 在上面的例子中，Godot 無法知道在使用 [code]inventory["healing heart"][/code] 時應該回傳 [code]3[/code] 還是 [code]8[/code]。這就是為什麼鍵值需要是唯一的原因。

source: Dictionaries are also called mappings or [i]associative arrays[/i]. Under the hood, they use arrays and several functions to efficiently store and retrieve values across arrays. Precisely, dictionaries use a [i]hashing algorithm[/i]. Hashing algorithms convert one value into another. In this case, hashing consists of converting a given key into a unique whole number. The dictionary then uses that number as an array's index! That's how a dictionary works: when you give it a key, it converts it into a unique index and uses that index to retrieve the corresponding value in the computer's memory. That's also why you can't have the same key twice: it would map to the same array index, causing you to overwrite an existing value.
ru: Словари также называют маппингами [i]ассоциативными массивами[/i]. Под капотом, они используют массивы и несколько функций для эффективного хранения и извлечения значений этих массивов. Для этого словари используют [i]алгоритм хеширования[/i]. Алгоритмы хеширования преобразуют одно значение в другое. В нашем случае, хеширование состоит в конвертации переданного значения в уникальное целое число. Затем словари используют это число для получения значения по индексу из массива! Вот как работают словари: когда вы передаёте ему ключ, он преобразует его в уникальный индекс и использует этот индекс для извлечения сопоставленного значения из памяти компьютера. Так же это объясняет, почему вы не можете использовать один ключ дважды: он будет преобразовываться к такому же индексу массива, что приведёт к перезаписи существующего значения.
ta: அகராதிகள் மேப்பிங்ச் அல்லது [i] துணை வரிசைகள் [/i] என்றும் அழைக்கப்படுகின்றன. ஊட்டின் கீழ், வரிசைகள் முழுவதும் மதிப்புகளை திறம்பட சேமித்து மீட்டெடுக்க வரிசைகள் மற்றும் பல செயல்பாடுகளைப் பயன்படுத்துகின்றன. துல்லியமாக, அகராதிகள் ஒரு [i] ஆசிங் வழிமுறையைப் பயன்படுத்துகின்றன [/i]. ஆசிங் வழிமுறைகள் ஒரு மதிப்பை மற்றொன்றாக மாற்றுகின்றன. இந்த விசயத்தில், ஆசிங் கொடுக்கப்பட்ட விசையை ஒரு தனித்துவமான முழு எண்ணாக மாற்றுவதைக் கொண்டுள்ளது. அகராதி பின்னர் அந்த எண்ணை ஒரு வரிசையின் குறியீடாகப் பயன்படுத்துகிறது! ஒரு அகராதி எவ்வாறு செயல்படுகிறது: நீங்கள் அதை ஒரு விசையை கொடுக்கும்போது, அதை ஒரு தனித்துவமான குறியீடாக மாற்றி, கணினியின் நினைவகத்தில் தொடர்புடைய மதிப்பை மீட்டெடுக்க அந்த குறியீட்டைப் பயன்படுத்துகிறது. அதனால்தான் நீங்கள் ஒரே விசையை இரண்டு முறை வைத்திருக்க முடியாது: இது அதே வரிசை குறியீட்டில் வரைபடமாக்கும், இதனால் ஏற்கனவே இருக்கும் மதிப்பை மேலெழுதும்.
uk: Словники також називають відображеннями або [i]асоціативними масивами[/i]. Під капотом вони використовують масиви та кілька функцій для ефективного зберігання та отримання значень у масивах. Точніше, словники використовують [i]алгоритм хешування[/i]. Алгоритми хешування перетворюють одне значення в інше. У цьому випадку хешування полягає в перетворенні даного ключа в унікальне ціле число. Потім словник використовує це число як індекс масиву! Ось як працює словник: коли ви даєте йому ключ, він перетворює його на унікальний індекс і використовує цей індекс для отримання відповідного значення в пам’яті комп’ютера. Ось чому ви не можете мати той самий ключ двічі: він зіставлятиметься з тим самим індексом масиву, що призведе до перезапису існуючого значення.
zh_hant: 字典也被稱為映射或[b]關聯陣列(associative arrays)[/b]。在底層它們使用陣列和多種函式來有效地在陣列中存儲和檢索數值。 具體來說，字典使用[b]雜湊演算法(hashing algorithm)[/b]。雜湊演算法會將一個值轉換為另一個值。 在這種情況下，雜湊的過程是將給定的鍵轉換為一個唯一的整數。字典會使用該數字作為陣列的索引！ 這就是字典的運作方式：當你提供一個鍵時，它會將該鍵轉換為一個唯一的索引，並使用該索引在電腦的記憶體中檢索對應的值。 這也是為什麼同一個鍵不能出現兩次：因為它會對應到相同的陣列索引，導致覆蓋已存在的數值。

source: We need to make sure the key is the same as we defined in the dictionary. In our case, [code]var item_count = inventory["gems"][/code] is correct.
ru: Мы должны быть уверены, что получаем значение именно по тому ключу, который использовали при определении массива. В нашем случае, правильным является [code]var item_count = inventory["gems"][/code].
ta: அகராதியில் நாம் வரையறுத்துள்ளதைப் போலவே முக்கியமானது என்பதை உறுதிப்படுத்த வேண்டும். எங்கள் விசயத்தில், [குறியீடு] var item_count = சரக்கு ["ரத்தினங்கள்"] [/குறியீடு] சரியானது.
uk: Нам потрібно переконатися, що ключ такий самий, як ми визначили в словнику. У нашому випадку [code]var item_count = inventory["gems"][/code] є правильним.
zh_hant: 我們需要確保鍵與字典中定義的鍵相同。 在這個例子中，[code]var item_count = inventory["gems"][/code] 是正確的。

source: var item_count = inventory["gem"]
ta: var item_count = சரக்கு ["GEM"]

source: var item_count = inventory["gems"]
ta: var item_count = சரக்கு ["ரத்தினங்கள்"]

source: var item_count = inventory["sword"]
ta: var item_count = சரக்கு ["வாள்"]

source: Let's give some items to the player. We use a dictionary for the player's inventory. We defined the [code]inventory[/code] variable for you, but it contains no items yet. Give the player the following items by adding the correct keys and values to the dictionary: - Three "healing heart". - Nine "gems". - One "sword". The keys should be text strings, and the values whole numbers.
ru: Давайте дадим несколько предметов игроку. Мы используем словарь в качестве инвентаря игрока. Переменная [code]inventory[/code] уже определена, но в ней нет значений. Дайте игроку перечисленные предметы, при помощи добавления правильных ключей и значений в словарь: - Три "healing heart". - Девять "gems". - Один "sword". В качестве ключей должны использоваться строки, а в качестве значений — целые числа.
ta: பிளேயருக்கு சில பொருட்களைக் கொடுப்போம். வீரரின் சரக்குகளுக்கு ஒரு அகராதியைப் பயன்படுத்துகிறோம். உங்களுக்கான [குறியீடு] சரக்கு [/குறியீடு] மாறியை நாங்கள் வரையறுத்துள்ளோம், ஆனால் அதில் இதுவரை எந்த உருப்படிகளும் இல்லை. அகராதியில் சரியான விசைகள் மற்றும் மதிப்புகளைச் சேர்ப்பதன் மூலம் பிளேயருக்கு பின்வரும் உருப்படிகளைக் கொடுங்கள்: - மூன்று "குணப்படுத்தும் இதயம்". - ஒன்பது "ரத்தினங்கள்". - ஒரு "வாள்". விசைகள் உரை சரங்களாகவும், மதிப்புகள் முழு எண்களாகவும் இருக்க வேண்டும்.
uk: Давайте дамо деякі предмети гравцеві. Ми використовуємо словник для інвентарю гравця. Ми визначили для вас змінну [code]inventory[/code], але вона ще не містить елементів. Дайте гравцеві наступні елементи, додавши правильні ключі та значення до словника: - Три «цілющі серця». - Дев'ять "самоцвітів". — Один «меч». Ключі повинні бути текстовими рядками, а значення – цілими числами.
zh_hant: 讓我們給玩家一些物品。 我們使用字典來存放玩家的背包。我們已經為你定義了 [code]inventory[/code] 變數，但目前裡面還沒有任何物品。 請在字典中用正確的鍵和對應的值加入以下物品，讓玩家獲得： - 三個 "healing heart(治癒之心)"。 - 九個 "gems(寶石)"。 - 一把 "sword(劍)"。 鍵應該要是字串，而值應該要是整數。

source: We want to change the item counts in the player's inventory whenever the player picks up or uses an item. We've started the [code]add_item()[/code] function for you. The [code]inventory[/code] dictionary should use the [code]item_name[/code] parameter as the key to access its values, and we should increase the value by [code]amount[/code]. To test this practice, we'll use your [code]add_item()[/code] function to increase the item count of Healing Heart, Gems, and Sword.
ru: Мы хотим изменять количество предметов в инвентаре игрока каждый раз, когда он подбирает или использует предмет. Мы уже начали функцию [code]add_item()[/code] за вас. Словарь [code]inventory[/code] должен использовать параметр [code]item_name[/code] в качестве ключа для получения количества предметов, а количество должно увеличиваться на [code]amount[/code]. Для проверки этого упражнения мы будем использовать вашу функцию [code]add_item()[/code] для увеличения количества Healing Heart, Gems и Sword.
ta: வீரர் எடுக்கும் போதெல்லாம் அல்லது ஒரு பொருளைப் பயன்படுத்தும்போதெல்லாம் பிளேயரின் சரக்குகளில் உள்ள உருப்படி எண்ணிக்கையை மாற்ற விரும்புகிறோம். உங்களுக்கான [குறியீடு] add_item () [/குறியீடு] செயல்பாட்டை நாங்கள் தொடங்கினோம். . இந்த நடைமுறையை சோதிக்க, குணப்படுத்தும் இதயம், ரத்தினங்கள் மற்றும் வாள் ஆகியவற்றின் உருப்படி எண்ணிக்கையை அதிகரிக்க உங்கள் [குறியீடு] add_item () [/குறியீடு] செயல்பாட்டைப் பயன்படுத்துவோம்.
uk: Ми хочемо змінити кількість предметів в інвентарі гравця щоразу, коли гравець бере або використовує предмет. Ми запустили для вас функцію [code]add_item()[/code]. Словник [code]inventory[/code] має використовувати параметр [code]item_name[/code] як ключ для доступу до своїх значень, і ми повинні збільшити значення на [code]amount[/code]. Щоб перевірити цю практику, ми скористаємося вашою функцією [code]add_item()[/code], щоб збільшити кількість предметів Лікуючого серця, самоцвітів і меча.
zh_hant: 我們希望每當玩家撿起或使用物品時，能夠改變玩家物品庫中的物品數量。 我們已經為你準備了 [code]add_item()[/code] 函式。 [code]inventory[/code] 字典應該使用 [code]item_name[/code] 參數作為鍵來存取其值，並且我們應該將該值增加 [code]amount[/code]。 為了測試這個練習，我們將使用你的 [code]add_item()[/code] 函式來增加「治癒之心」、「寶石」、和「劍」的物品數量。
