Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-14-multiplying.po
Languages: cs, da, de, es, fr, it, ja, pt, ru, ta, zh_hant

source: Our robot's health is always between [code]0[/code] and [code]100[/code].
da: Vores robots liv er altid mellem [code]0[/code] og [code]100[/code].
fr: La santé de notre robot est toujours comprise entre [code]0[/code] et [code]100[/code].
it: La vita del nostro robot è sempre tra [code]0[/code] e [code]100[/code].
ja: ロボットの体力は常に [code]0[/code] から [code]100[/code] の間です。
pt: A vida do nosso robô está sempre entre [code]0[/code] e [code]100[/code].
ru: Здоровье нашего робота всегда находится между [code]0[/code] и [code]100[/code].

source: But as our robot fights, we want to increase its strength and toughness.
da: Men som vores robot kæmper, vil vi øge dens styrke og sejhed.
fr: Mais au fur et à mesure que notre robot se bat, nous voulons augmenter sa force et sa résistance.
it: Ma quando il nostro robot combatte, vogliamo aumentare la sua forza e la sua resistenza.
ja: しかし、ロボットが戦うにつれて、その強さとタフさを高めたいと考えています。
pt: Mas enquanto nosso robô luta, queremos aumentar a força e resistência dele.
ru: Но после сражений, мы хотим увеличивать его силу и прочность.

source: When a character levels up, it might deal more damage to enemies, gain new abilities or, in our case, gain more health.
da: Når en karakter stiger i level, kan den forvolde mere skade på fjender, få nye evner eller i vores tilfælde, få mere liv.
fr: Lorsqu'un personnage monte de niveau, il peut infliger plus de dégâts aux ennemis, acquérir de nouvelles capacités ou, dans notre cas, gagner plus de santé.
it: Quando un personaggio sale di livello, potrebbe infliggere più danni ai nemici, acquisire nuove abilità o nel nostro caso, guadagnare più punti vita.
ja: キャラクターがレベルアップすると、敵に与えるダメージが増えたり、新しい能力を獲得したり、私たちの場合は体力が増えたりします。
pt: Quando uma personagem sobe de nível, pode causar mais dano aos inimigos, ganhar novas habilidades ou, no nosso caso, ganhar mais vida.
ru: После прокачки до нового уровня персонаж должен наносить больше урона противникам, получать новые способности или, в нашем случае, иметь больше здоровья.

source: We define a [code]level[/code] variable to keep track of the level of the robot. It starts at level one.
da: Vi definerer en [code]level[/code] variabel for at holde styr på robottens level. Den starter på level ét.
fr: Nous définissons une variable appelée [code]level[/code] pour faire un suivi du niveau du robot. Cela commence au niveau un.
it: Definiamo una variabile [code]level[/code] per tenere conto del livello del robot. Inizia al livello uno.
ja: ロボットのレベルを追跡するために [code]level[/code] 変数を定義します。レベル 1 から始まります。
pt: Definimos uma variável chamada [code]level[/code] para acompanhar o nível do robô. Ele começa no nível um.
ru: Мы определяем переменную [code]level[/code] для отслеживания уровня прокачки робота. На старте робот имеет первый уровень.

source: When the robot has defeated enough enemies, we call the [code]level_up()[/code] function to increment the robot's level.
da: Når robotten har besejret nok fjender, kalder vi funktionen [code]level_up()[/code] for at forøge robottens level.
fr: Lorsque le robot a vaincu suffisamment d'ennemis, nous appelons la fonction [code]level_up()[/code] pour incrémenter le niveau du robot.
it: Quando il robot ha sconfitto abbastanza nemici, chiamiamo la funzione [code]level_up()[/code] per incrementare il livello del robot.
ja: ロボットが十分な数の敵を倒したら、[code]level_up()[/code]関数を呼び出してロボットのレベルを上げます。
pt: Quando o robô derrotar inimigos suficientes, vamos chamar a função [code]level_up()[/code] para aumentar o nível dele.
ru: Когда робот побеждает достаточное количество противников, мы вызываем функцию [code]level_up()[/code], чтобы повысить его уровень.

source: As we briefly saw in the last lesson, our robot could have a range of variables that could increase when it levels up.
cs: Jak jsme krátce viděli v minulé lekci, náš robot může mít řadu proměnných, které se mohou zvýšit, když se zvýší jeho úroveň.
da: Som vi kort så i den forrige lektion, kunne vores robot have en række variabler, der kunne øges, når den stiger i level.
de: Wie wir in der letzten Lektion gesehen haben, könnte unser Roboter eine Reihe von Variablen haben, die zunehmen könnten, wenn er aufsteigt.
es: Como vimos brevemente en la última lección, nuestro robot podría tener un rango de variables que podrían aumentar cuando sube de nivel.
fr: Comme nous l'avons brièvement vu dans la dernière leçon, notre robot pourrait avoir une gamme de variables qui pourraient augmenter lorsqu'il monte de niveau.
it: Come abbiamo brevemente visto nell'ultima lezione, il nostro robot potrebbe avere un insieme di variabili che potrebbero aumentare quando sale di livello.
ja: 前回のレッスンで簡単に説明したように、ロボットはレベルアップすると増加する可能性のあるさまざまな変数を持つことができます。
pt: Como vimos brevemente na última lição, nosso robô pode ter uma série de variáveis que podem aumentar quando ele sobe de nível.
ru: Как мы кратко упомянули в последнем уроке, наш робот мог бы иметь большое количество переменных, способных увеличиваться при повышении уровня.
ta: கடைசி பாடத்தில் நாம் சுருக்கமாகப் பார்த்தது போல, எங்கள் ரோபோவில் பலவிதமான மாறிகள் இருக்கக்கூடும், அது அதிகரிக்கும் போது அதிகரிக்கக்கூடும்.
zh_hant: 如同我們在上堂課中簡單提到的，當機器人升級時，它可以有一系列會隨著等級提升而增加的變數。

source: In this lesson, we'll just focus on increasing the robot's [code]max_health[/code].
da: I denne lektion fokuserer vi kun på at øge robottens [code]max_health[/code].
fr: Dans cette leçon, nous allons nous concentrer sur l'augmentation de la [code]max_health[/code], ou santé maximale, du robot.
it: In questa lezione, ci concentreremo soltanto sull'aumentare la [code]max_health[/code] del robot.
ja: このレッスンでは、ロボットの [code]max_health[/code] を増やすことに焦点を当てます。
pt: Nessa lição, vamos nos concentrar apenas em aumentar a vida máxima do robô com a variável [code]max_health[/code].
ru: В этом уроке мы сфокусируемся на повышении [code]max_health[/code] робота.

source: The variable [code]max_health[/code] is the maximum amount the robot's [code]health[/code] can be. We change our [code]heal()[/code] function to use this variable.
da: Variablen [code]max_health[/code] er det maksimale beløb, robottens [code]health[/code] kan være. Vi ændrer vores [code]heal()[/code]-funktion til at bruge denne variabel.
fr: La variable [code]max_health[/code] est le montant maximum que peut atteindre la [code]health[/code] du robot. Nous modifions notre fonction [code]heal()[/code] pour utiliser cette variable.
it: La variabile [code]max_health[/code] è il valore massimo che la [code]health[/code] del robot può avere. Cambiamo la nostra funzione [code]heal()[/code] per usare questa variabile.
ja: 変数 [code]max_health[/code] は、ロボットの [code]health[/code] の最大量です。この変数を使用するように [code]heal()[/code] 関数を変更します。
ru: Переменная [code]max_health[/code] — это максимальное значение, которое [code]health[/code] робота может иметь. Мы изменим нашу функцию [code]heal()[/code] и используем эту переменную в ней.

source: We could add [code]5[/code] to the [code]max_health[/code] every time the robot levels up.
cs: Mohli bychom přidat [code]5[/code] k [code]max_health[/code] při každém zvýšení úrovně robota.
da: Vi kunne tilføje [code]5[/code] til [code]max_health[/code] hver gang robotten stiger i level.
de: Wir könnten [code]max_health[/code] jedes Mal um [code]5[/code] erhöhen, wenn der Roboter aufsteigt.
es: Podríamos añadirle [code]5[/code] a la [code]max_health[/code] cada vez que el robot suba de nivel.
fr: Nous pourrions ajouter [code]5[/code] à la [code]max_health[/code] chaque fois que le robot monte de niveau.
it: Potremmo aggiungere [code]5[/code] alla [code]max_health[/code] ogni volta che il robot sale di livello.
ja: ロボットがレベルアップするたびに [code]max_health[/code] に [code]5[/code] を追加することができます。
pt: Poderíamos adicionar [code]5[/code] na variável [code]max_health[/code] sempre que o robô subir de nível.
ru: Мы можем добавлять [code]5[/code] к [code]max_health[/code] каждый раз, когда робот повышает уровень.
ta: ஒவ்வொரு முறையும் ரோபோ அதிகரிக்கும் போது [குறியீடு] 5 [/குறியீடு] [குறியீடு] அதிகபட்ச_எல்த் [/குறியீடு] இல் சேர்க்கலாம்.
zh_hant: 每次機器人升級時，我們可以將 [code]5[/code] 加到 [code]max_health[/code]。

source: This would increase [code]max_health[/code] the same amount every time.
da: Dette ville øge [code]max_health[/code] med samme beløb hver gang.
fr: Cela augmenterait la [code]max_health[/code] du même montant à chaque fois.
it: Questo incrementerebbe la [code]max_health[/code] la stessa quantità ogni volta.
ja: これにより、[code]max_health[/code]が毎回同じ量増加します。
pt: Isso aumentaria o [code]max_health[/code] na mesma quantidade todas as vezes.
ru: Это увеличит [code]max_health[/code] на одну и ту же величину при каждом повышении уровня.

source: If we graphed [code]max_health[/code], it'd look something like this.
da: Hvis vi tegnede [code]max_health[/code] grafisk, ville det se nogenlunde sådan ud.
fr: Si nous faisions un graphique de [code]max_health[/code], cela ressemblerait à quelque chose comme ceci :
it: Se rappresentassimo graficamente la [code]max_health[/code], somiglierebbe a qualcosa del genere.
ja: [code]max_health[/code]をグラフ化すると、次のようになります。
pt: Se grafássemos [code]max_health[/code], seria algo assim.
ru: Если мы построим график [code]max_health[/code], он будет выглядеть примерно так.

source: This growth is [b]linear[/b].
da: Denne vækst er [b]lineær[/b].
fr: Cette croissance est [b]linéaire[/b].
it: Questa crescita è [b]lineare[/b].
ja: この成長は[b]直線的[/b]です。
pt: Esse crescimento é [b]linear[/b].
ru: Этот рост является [b]линейным[/b].

source: In our case, we want a feeling of more and more power as the robot levels up.
da: I vores tilfælde ønsker vi en følelse af mere og mere kraft, efterhånden som robotten stiger i level.
fr: Dans notre cas, nous voulons une sensation de puissance de plus en plus grande à mesure que le robot monte en niveau.
it: Nel nostro caso, vogliamo un senso di più e più potere mano a mano che il robot continua a salire di livello.
ja: 私たちの場合、ロボットがレベルアップするにつれて、ますますパワーを感じる必要があります。
pt: No nosso caso, queremos uma sensação de poder cada vez maior à medida que o robô sobe de nível.
ru: В нашем случае мы хотим, чтобы по мере роста уровня робота создавалось ощущение всё большей и большей мощи.

source: We want a graph like this.
da: Vi ønsker en graf som denne.
fr: Nous voulons un graphique comme celui-ci :
it: Vogliamo un grafico del genere.
ja: このようなグラフが欲しいのです。
pt: Queremos um gráfico como esse.
ru: Мы хотим получить график, подобный этому.

source: This growth is [b]exponential[/b].
da: Denne vækst er [b]eksponentiel[/b].
fr: Cette croissance est [b]exponentielle[/b].
it: Questa crescita è [b]esponenziale[/b].
ja: この成長は[b]指数関数的[/b]です。
pt: Esse crescimento é [b]exponencial[/b].
ru: Этот рост является [b]экспоненциальным[/b].

source: With each level, more [code]max_health[/code] is added than the previous level up.
da: Med hvert level tilføjes mere [code]max_health[/code] end det foregående level.
fr: Avec chaque niveau, on ajoute plus de [code]max_health[/code] que pour la montée du niveau précédente.
it: Con ogni livello, più [code]max_health[/code] viene aggiunta rispetto al livello precedente.
ja: 各レベルでは、前のレベルよりも多くの[code]max_health[/code]が追加されます。
pt: A cada nível, mais [code]max_health[/code] é adicionado comparado com o nível anterior.
ru: С каждым уровнем добавляется больше [code]max_health[/code], чем на предыдущем уровне.

source: To get the exponential growth, we multiply the [code]max_health[/code] by an amount greater than [code]1[/code] each time the robot levels up.
da: For at få den eksponentielle vækst ganger vi [code]max_health[/code] med et beløb, der er større end [code]1[/code], hver gang robotten stiger i level.
fr: Pour obtenir la croissance exponentielle, nous multiplions la [code]max_health[/code] par une quantité supérieure à [code]1[/code] chaque fois que le robot monte de niveau.
it: Per ottenere una crescita esponenziale, moltiplichiamo la [code]max_health[/code] per una quantità maggiore di [code]1[/code] ogni volta che il robot sale di livello.
ja: 指数関数的な成長を得るには、ロボットがレベルアップするたびに [code]max_health[/code] に [code]1[/code] よりも大きい量を掛けます。
pt: Para obter o crescimento exponencial, multiplicamos o [code]max_health[/code] por um valor maior que [code]1[/code] cada vez que o robô sobe de nível.
ru: Для получения экспоненциального роста, мы умножаем [code]max_health[/code] на величину больше [code]1[/code] каждый раз, когда робот повышает уровень.

source: To multiply values together, we use [code]*[/code].
da: For at gange værdier sammen bruger vi [code]*[/code].
fr: Pour multiplier des valeurs ensemble, nous utilisons [code]*[/code].
it: Per moltiplicare dei valori, usiamo [code]*[/code].
ja: 値を乗算するには、[code]*[/code] を使用します。
pt: Para multiplicar valores juntos, usamos o símbolo [code]*[/code].
ru: Чтобы перемножить значения, мы используем [code]*[/code].

source: What is the value of damage?
cs: Jaká je hodnota škody?
da: Hvad er værdien af skaden?
de: Wie hoch ist der errechnete Schaden?
es: ¿Cuál es el valor del daño (o [i]damage[/i])?
fr: Quelle est la valeur des dégâts ?
it: Quant'è il valore del danno?
ja: ダメージの価値は?
pt: Qual o valor do dano?
ru: Какое значение имеет damage?
ta: சேதத்தின் மதிப்பு என்ன?
zh_hant: 傷害的值是多少？

source: We multiply [code]power[/code] by [code]level[/code] using [code]*[/code] to get the result of [code]15[/code].
cs: Vynásobíme [code]power[/code] úrovní [code]level[/code] pomocí [code]*[/code], abychom získali výsledek [code]15[/code].
da: Vi ganger [code]power[/code] med [code]level[/code] ved at bruge [code]*[/code] for at få resultatet [code]15[/code].
de: Wir multiplizieren [code]power[/code] mit [code]level[/code] unter Verwendung von [code]*[/code], um das Ergebnis von [code]15[/code] zu erhalten.
es: Multiplicamos [code]power[/code] por [code]level[/code] utilizando [code]*[/code] para obtener el resultado de [code]15[/code].
fr: Nous multiplions [code]power[/code] (ou la « puissance ») par [code]level[/code] (le « niveau ») en utilisant [code]*[/code] pour obtenir le résultat de [code]15[/code].
it: Moltiplichiamo la [code]power[/code] per il [code]level[/code] usando [code]*[/code] per ottenere il risultato di [code]15[/code].
ja: [code]*[/code] を使用して [code]power[/code] に [code]level[/code] を掛けて、[code]15[/code] の結果を取得します。
pt: Multiplicamos [code]power[/code] por [code]level[/code] usando [code]*[/code] para obter o resultado de [code]15[/code].
ru: Мы умножили [code]power[/code] на [code]level[/code], при помощи [code]*[/code], и получили [code]15[/code] в результате.
ta: [குறியீடு] 15 [/குறியீடு] இன் முடிவைப் பெற [குறியீடு]*[/குறியீடு] பயன்படுத்தி [குறியீடு] நிலை [/குறியீடு] மூலம் [குறியீடு] சக்தியை [/குறியீடு] பெருக்குகிறோம்.
zh_hant: 我們使用 [code]*[/code] 將 [code]power[/code] 與 [code]level[/code] 相乘，結果是 [code]15[/code]。

source: We can use [code]*=[/code] in the same way as [code]-=[/code] and [code]+=[/code].
cs: Stejně jako [code]*=[/code] můžeme použít [code]-=[/code] a [code]+=[/code].
da: Vi kan bruge [code]*=[/code] på samme måde som [code]-=[/code] og [code]+=[/code].
de: Wir können [code]*=[/code] auf die gleiche Weise wie [code]-=[/code] und [code]+=[/code] verwenden.
es: Podemos utilizar [code]*=[/code] de la misma forma que [code]-=[/code] y [code]+=[/code].
fr: Nous pouvons utiliser [code]*=[/code] de la même manière que [code]-=[/code] et [code]+=[/code].
it: Possiamo usare [code]*=[/code] così come per [code]-=[/code] e [code]+=[/code].
ja: [code]*=[/code] は [code]-=[/code] や [code]+=[/code] と同じように使用できます。
pt: Podemos usar [code]*=[/code] da mesma forma que [code]-=[/code] e [code]+=[/code].
ru: Мы можем использовать [code]*=[/code] так же, как [code]-=[/code] и [code]+=[/code].
ta: [குறியீடு]-= [/குறியீடு] மற்றும் [குறியீடு]+= [/குறியீடு] போன்ற அதே வழியில் [குறியீடு]*= [/குறியீடு] ஐப் பயன்படுத்தலாம்.
zh_hant: 我們可以像使用 [code]-=[/code] 和 [code]+=[/code] 一樣，使用 [code]*=[/code]。

source: What is the value of damage now?
cs: Jaká je nyní hodnota škody?
da: Hvad er værdien af skaden nu?
de: Wie hoch ist der Schaden jetzt?
es: ¿Cuál es el valor del daño ahora?
fr: Quelle est la valeur des dégâts maintenant ?
it: Qual è il valore del danno adesso?
ja: 今のダメージの価値は?
pt: Qual é o valor do dano agora?
ru: Какое значение имеет damage теперь?
ta: இப்போது சேதத்தின் மதிப்பு என்ன?
zh_hant: 現在傷害的值是多少？

source: The value of [code]damage[/code] starts as [code]15[/code].
da: Værdien af [code]damage[/code] starter som [code]15[/code].
fr: La valeur de [code]damage[/code] commence par [code]15[/code].
it: Il valore del [code]damage[/code] inizia da [code]15[/code].
ja: [code]damage[/code] の値は [code]15[/code] で始まります。
pt: O valor de [code]damage[/code] começa com [code]15[/code].
ru: Вначале значение [code]damage[/code] равно [code]15[/code].

source: Then, [code]damage *= 2[/code] multiplies it by [code]2[/code] to get [code]30[/code].
da: Derefter, [code]damage *= 2[/code] ganger det med [code]2[/code] for at få [code]30[/code].
fr: Ensuite, [code]damage *= 2[/code] multiplie cette valeur par [code]2[/code] pour obtenir [code]30[/code].
it: Poi, [code]damage *= 2[/code] lo moltiplica per [code]2[/code] per ottenere [code]30[/code].
ja: 次に、[code]damage *= 2[/code] に [code]2[/code] を掛けて [code]30[/code] を取得します。
pt: Então, o resultado de [code]damage *= 2[/code] é multiplicado por [code]2[/code] para obter o valor de [code]30[/code].
ru: Затем [code]damage *= 2[/code] умножает его на [code]2[/code], в результате получается [code]30[/code].

source: Let's level up our robot and add exponential growth to [code]max_health[/code].
cs: Zvyšme úroveň našeho robota a přidejme exponenciální růst do [code]max_health[/code].
da: Lad vores robot stige i level og tilføje eksponentiel vækst til [code]max_health[/code].
de: Lasse uns unseren Roboter aufstufen und [code]max_health[/code] exponentiell wachsen.
es: Subamos de nivel a nuestro robot y agreguémosle un crecimiento exponencial a [code]max_health[/code].
fr: Faisons monter le niveau de notre robot et ajoutons une croissance exponentielle à [code]max_health[/code].
it: Facciamo salire di livello il nostro robot e aggiungiamo la crescita esponenziale alla [code]max_health[/code].
ja: ロボットをレベルアップして、[code]max_health[/code]に指数関数的な成長を加えましょう。
pt: Vamos aumentar o nível do nosso robô e adicionar crescimento exponencial ao [code]max_health[/code].
ru: Давайте повысим уровень нашего робота и сделаем так, чтобы [code]max_health[/code] увеличилось экспоненциально.
ta: எங்கள் ரோபோவை சமன் செய்வோம் மற்றும் [குறியீடு] அதிகபட்சம்_எல்த் [/குறியீடு] இல் அதிவேக வளர்ச்சியைச் சேர்ப்போம்.
zh_hant: 讓我們讓機器人升級並將指數增長添加到 [code]max_health[/code]。

source: In the practices, you'll increase the robot's [code]max_health[/code] and add a special ability to our robot to make it extra tough at high levels.
cs: Během cvičení zvýšíte [code]max_health[/code] robota a přidáte našemu robotovi speciální schopnost, aby byl na vysokých úrovních mimořádně odolný.
da: I øvelserne øger du robottens [code]max_health[/code] og tilføjer en særlig evne til vores robot for at gøre den ekstra stærk på høje levels.
de: In den Übungen erhöhst Du die Variable [code]max_health[/code] des Roboters und fügst unserem Roboter eine spezielle Fähigkeit hinzu, um ihn auf hohen Stufen besonders widerstandsfähig machen.
es: En las prácticas, aumentarás la [code]max_health[/code] del robot y le añadirás una habilidad especial a nuestro robot para hacerlo ultrarresistente en los niveles altos.
fr: Dans la pratique suivante, vous augmenterez la [code]max_health[/code] du robot et ajouterez une capacité spéciale à notre robot pour le rendre encore plus résistant à des niveaux élevés.
it: Nelle pratiche, incrementerai la [code]max_health[/code] del robot e gli aggiungerai una abilità speciale per renderlo più resistente a livelli più elevati.
ja: 演習では、ロボットの[code]max_health[/code]を増やし、ロボットに特殊能力を追加して、高レベルでさらにタフにします。
pt: Nas práticas, vai aumentar o [code]max_health[/code] do robô e vai adicionar uma habilidade especial ao nosso robô para torná-lo ainda mais resistente em níveis mais altos.
ru: В упражнении вы будете увеличивать [code]max_health[/code] робота и добавите ему специальную способность, делающую его особенно крепким на высоких уровнях.
ta: நடைமுறைகளில், நீங்கள் ரோபோவின் [குறியீடு] MAX_HEALTH [/code] ஐ அதிகரிப்பீர்கள், மேலும் உயர் மட்டங்களில் கூடுதல் கடினமாக்க எங்கள் ரோபோவுக்கு ஒரு சிறப்பு திறனைச் சேர்ப்பீர்கள்.
zh_hant: 在練習中，你將增加機器人的 [code]max_health[/code] 並為我們的機器人添加一個特殊能力，使其在等級高時變得更加強大。

source: Increasing maximum health exponentially
cs: Exponenciální zvyšování maximálního zdraví
da: Eksponentiel stigning i maksimal liv
de: Maximales Leben exponentiell steigern
es: Aumentar la salud máxima exponencialmente
fr: Augmenter la santé maximale de façon exponentielle
it: Aumentando la vita massima esponenzialmente
ja: 最大体力を指数関数的に増加させる
pt: Aumentando a vida máxima exponencialmente
ru: Экспоненциальное увеличение максимума здоровья
ta: அதிகபட்ச சுகாதாரத்தை அதிகரிக்கும்
zh_hant: 以指數方式增加最大血量

source: Let's make the robot stronger when it levels up.
da: Lad os gøre robotten stærkere, når den stiger i level.
fr: Rendons le robot plus fort lorsqu'il monte de niveau.
it: Rendiamo il robot più forte quando sale di livello.
ja: ロボットがレベルアップしたら強くしましょう。
pt: Vamos fazer o robô ficar mais forte quando ele subir de nível.
ru: Давайте сделаем так, чтобы робот усиливался при повышении уровня.

source: Add to the [code]level_up()[/code] function so it does the following:
da: Tilføj det til [code]level_up()[/code]-funktionen, så den gør følgende:
fr: Ajoutez du code à la fonction [code]level_up()[/code] pour qu'elle fasse :
it: Aggiungi alla funzione [code]level_up()[/code] così ché faccia le seguenti cose:
ja: [code]level_up()[/code] 関数に追加して、次のことを行います。
pt: Adicione na função [code]level_up()[/code] alguma coisa para que faça o seguinte:
ru: Доработайте функцию [code]level_up()[/code], чтобы она:

source: - Increases [code]level[/code] by one. - Increases [code]max_health[/code] by 10%.
da: - Øger [code]level[/code] med én. - Øger [code]max_health[/code] med 10%.
fr: - Augmenter le [code]level[/code] de un. - Augmenter la [code]max_health[/code] de 10 %.
it: - Aumenti il [code]level[/code] di uno. - Aumenti la [code]max_health[/code] del 10%.
ja: - [code]level[/code]が1つ上がります。 - [code]max_health[/code]が10%増加する。
pt: - Aumentar o [code]level[/code] por um. - Aumentar o [code]max_health[/code] por 10%.
ru: - Увеличивала [code]level[/code] на единицу. - Увеличивала [code]max_health[/code] на 10%.

source: We want our robot to increase in strength as it levels up. Let's increase its health exponentially!
cs: Chceme, aby se síla našeho robota zvyšovala s tím, jak se bude zvyšovat jeho úroveň. Zvyšme jeho zdraví exponenciálně!
da: Vi ønsker, at vores robot skal øges i styrke, efterhånden som den stiger i level. Lad os øge dens liv eksponentielt!
de: Wir möchten, dass unser Roboter mit zunehmender Stufe an Stärke zunimmt. Lass uns sein Leben exponentiell steigern!
es: Queremos que nuestro robot aumente su fuerza a medida que sube de nivel. ¡Aumentemos su salud exponencialmente!
fr: Nous voulons que notre robot augmente sa force à mesure qu'il monte de niveau. Augmentons sa santé de façon exponentielle !
it: Vogliamo che il nostro robot aumenti di potenza quando sale di livello. Aumentiamo la sua vita esponenzialmente!
ja: ロボットのレベルが上がるにつれて、ロボットの強度が増していきます。体力を指数関数的に増やしましょう!
pt: Queremos que nosso robô aumente em força à medida que sobe de nível. Vamos aumentar a vida dele exponencialmente!
ru: Мы хотим, чтобы наш робот становился сильнее при повышении уровня. Давайте увеличивать его здоровье экспоненциально!
ta: எங்கள் ரோபோ வலிமையை அதிகரிக்க வேண்டும் என்று நாங்கள் விரும்புகிறோம். அதன் ஆரோக்கியத்தை அதிவேகமாக அதிகரிப்போம்!
zh_hant: 我們希望機器人升級時變得更強。讓它的血量以指數方式增長！
