Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-27-value-types.po
Languages: cs, da, de, es, fr, it, ja, nl, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: However, you cannot directly add or subtract a number to a vector. You'll get an error. That's why, in earlier lessons, you had to access the sub-variables of [code]position[/code] to add numbers to them.
cs: K vektoru však nelze přímo přičíst nebo odečíst číslo. Vyskytne se chyba. Proto jste v dřívějších lekcích museli přistupovat k dílčím proměnným [code]position[/code], abyste k nim mohli přičítat čísla.
da: Du kan dog ikke direkte tilføje eller trække et tal fra en vektor. Du får en fejl. Derfor skulle du i tidligere lektioner tilgå undervariablerne af [code]position[/code] for at tilføje tal til dem.
de: Du kannst jedoch nicht direkt eine Zahl zu einem Vektor addieren oder subtrahieren. Du wirst eine Fehlermeldung erhalten. Aus diesem Grund musstest Du in früheren Lektionen auf die Untervariablen von [code]position[/code] zugreifen, um ihnen Zahlen hinzuzufügen.
ru: В любом случае, вы не можете напрямую вычитать число из вектора. При попытке вы получите ошибку. Именно поэтому в предыдущих уроках вы сначала получали внутренние переменные из [code]position[/code], а потом уже добавляли числа к ним.
ta: இருப்பினும், நீங்கள் ஒரு திசையனில் ஒரு எண்ணை நேரடியாக சேர்க்கவோ கழிக்கவோ முடியாது. உங்களுக்கு பிழை கிடைக்கும். அதனால்தான், முந்தைய பாடங்களில், அவற்றில் எண்களைச் சேர்க்க [குறியீடு] நிலையின் [/குறியீடு] துணை மாறிகள் அணுக வேண்டியிருந்தது.
tr: Ancak, bir vektöre doğrudan sayı ekleyemez veya çıkaramazsınız. Bir hata alırsınız. Bu nedenle, önceki derslerde, vektörlere sayı eklemek için [code]position[/code] (konum) değişkeninin alt-değişkenlerine (x ve y) erişmeniz gerekiyordu.
uk: Однак ви не можете безпосередньо додати чи відняти число до вектора. Ви отримаєте повідомлення про помилку. Ось чому на попередніх уроках вам потрібно було отримати доступ до підзмінних [code]position[/code], щоб додати до них числа.

source: A surprising result
cs: Překvapivý výsledek
da: Et overraskende resultat
de: Ein überraschendes Ergebnis
es: Un resultado sorprendente
fr: Un résultat surprenant
it: Un risultato sorprendente
ja: 意外な結果
nl: Een verrassend resultaat
pt_br: Um resultado surpreendente
ru: Неожиданный результат
ta: ஒரு ஆச்சரியமான முடிவு
tr: Şaşırtıcı bir sonuç
uk: Дивовижний результат
zh_hans: 出人意料的结果
zh_hant: 出人意料的結果

source: Take the following division: [code]3/2[/code]. What result would you expect to get? [code]1.5[/code]?
cs: Vezměte si následující dělení: [code]3/2[/code]. Jaký výsledek byste očekávali? [code]1.5[/code]?
da: Tag følgende division: [code]3/2[/code]. Hvilket resultat ville du forvente at få? [code]1.5[/code]?
de: Nehmen wir die folgende Abteilung: [code]3/2[/code]. Welches Ergebnis würdest Du erwarten? [code]1.5[/code]?
es: Realiza la siguiente división: [code]3/2[/code]. ¿Qué resultado esperarías obtener? ¿[code]1.5[/code]?
fr: Prenez la division suivante : [code]3/2[/code]. Quel résultat vous attendriez-vous à obtenir ? [code]1.5[/code] ?
it: Prendi la seguente divisione: [code]3/2[/code]. Ché risultato ti aspetti di ottenere? [code]1.5[/code]?
ja: [code]3/2[/code]という区分を取ります。どのような結果が得られると思いますか?[code] 1.5 [/code]?
nl: Neem de volgende deling: [code]3/2[/code]. Welk resultaat zou je verwachten te krijgen? [code]1.5[/code]?
pt_br: Veja a seguinte divisão: [code]3/2[/code]. Que resultado você esperaria obter? [code]1.5[/code]?
ru: Попробуйте выполнить деление [code]3/2[/code]. Какой результат вы ожидаете получить? [code]1.5[/code]?
ta: பின்வரும் பிரிவை எடுத்துக் கொள்ளுங்கள்: [குறியீடு] 3/2 [/குறியீடு]. நீங்கள் என்ன முடிவைப் பெறுவீர்கள்? [குறியீடு] 1.5 [/குறியீடு]?
tr: Şu bölme işlemini ele alalım: [code]3/2[/code]. Nasıl bir sonuç almayı beklersiniz? [code]1.5[/code]?
uk: Візьміть такий розподіл: [code]3/2[/code]. Який результат ви очікуєте отримати? [code]1.5[/code]?
zh_hans: 以这个除法为例：[code]3/2[/code]。你觉得会得到什么结果？[code]1.5[/code]？
zh_hant: 進行以下除法運算：[code]3/2[/code]。你預期會得到什麼結果？[code]1.5[/code]？

source: Well, for the computer, the result of [code]3/2[/code] is [code]1[/code].
cs: Pro počítač je výsledkem [code]3/2[/code] [code]1[/code].
da: For computeren er resultatet af [code]3/2[/code], [code]1[/code].
de: Nun, für den Computer ist das Ergebnis von [code]3/2[/code], [code]1[/code].
ru: А для компьютера, результатом деления [code]3/2[/code] будет [code]1[/code].
ta: சரி, கணினியைப் பொறுத்தவரை, [குறியீடு] 3/2 [/குறியீடு] இன் விளைவாக [குறியீடு] 1 [/குறியீடு].
tr: Aslında, bilgisayar için, [code]3/2[/code]'in sonucu [code]1[/code]'dir.
uk: Що ж, для комп’ютера результатом [code]3/2[/code] є [code]1[/code].

source: Wait, what?!
cs: Počkat, cože?!
da: Vent, hvad?!
de: Moment, was?!
ru: Подождите, что?!
ta: காத்திருங்கள், என்ன?!
tr: Bekle, ne?!
uk: Почекай, що?!

source: That's because, for the computer, the division of two whole numbers should always result in a whole number.
cs: To proto, že pro počítač by dělení dvou celých čísel mělo vždy vést k celému číslu.
da: Det skyldes, at division af to hele tal for computeren altid skal resultere i et helt tal.
de: Das liegt daran, dass für den Computer die Division von zwei ganzen Zahlen immer zu einer ganzen Zahl führen sollte.
ru: Всё потому, что для компьютера, результатом деления двух целых чисел будет являться целое число.
ta: ஏனென்றால், கணினியைப் பொறுத்தவரை, இரண்டு முழு எண்களின் பிரிப்பும் எப்போதும் முழு எண்ணிக்கையை விளைவிக்க வேண்டும்.
tr: Bunun nedeni, bilgisayar için iki tam sayının bölünmesinin her zaman bir tam sayı ile sonuçlanması gerektiğidir.
uk: Це тому, що для комп’ютера ділення двох цілих чисел завжди має призводити до цілого числа.

source: When you divide decimal numbers instead, you will get a decimal number as a result.
cs: Když místo toho dělíte desetinná čísla, dostanete jako výsledek desetinné číslo.
da: Når du dividerer decimaltal i stedet, får du et decimaltal som resultat.
de: Wenn Du stattdessen Dezimalzahlen teilst, erhälst Du als Ergebnis eine Dezimalzahl.
ru: А при делении десятичных дробей, в результате вы получите десятичную дробь.
ta: அதற்கு பதிலாக தசம எண்களைப் பிரிக்கும்போது, இதன் விளைவாக ஒரு தசம எண்ணைப் பெறுவீர்கள்.
tr: Bunun yerine ondalık sayıları böldüğünüzde, sonuç olarak ondalık bir sayı elde edersiniz.
uk: Якщо натомість ви поділите десяткові числа, ви отримаєте десяткове число.

source: Even if it's just a [code]0[/code], adding a decimal place tells the computer we want decimal numbers.
cs: I když je to jen [code]0[/code], přidáním desetinného místa říkáme počítači, že chceme desetinná čísla.
da: Selv hvis det bare er et [code]0[/code], fortæller tilføjelsen af et decimaltegn computeren, at vi vil have decimaltal.
de: Selbst wenn es sich nur um einen [code]0[/code] handelt, teilt das Hinzufügen einer Dezimalstelle dem Computer mit, dass wir Dezimalzahlen wünschen.
ru: Даже при использовании числа [code]0[/code], добавление десятичной части сообщит компьютеру, что мы хотим использовать десятичные дроби.
ta: இது ஒரு [குறியீடு] 0 [/குறியீடு] தான் என்றாலும், ஒரு தசம இடத்தைச் சேர்ப்பது கணினியைச் சொல்கிறது, இது எங்களுக்கு தசம எண்களை விரும்புகிறோம்.
tr: Yalnızca bir [code]0[/code] olsa bile, ondalık basamak eklemek bilgisayara ondalık sayılar istediğimizi söyler.
uk: Навіть якщо це просто [code]0[/code], додавання десяткового знака повідомляє комп’ютеру, що ми хочемо мати десяткові числа.

source: This shows you how mindful you need to be with types. Otherwise, you will get unexpected results. It can get pretty serious: number errors can lead to bugs like controls not working as intended or charging the wrong price to players.
cs: To vám ukazuje, jak pozorně je třeba zacházet s typy. Jinak se dočkáte neočekávaných výsledků. Chyby mohou mít nepříjemné výsledky: chyby v číslech mohou vést k chybám, jako je nefunkčnost ovládacích prvků nebo účtování nesprávné ceny hráčům.
da: Dette viser dig, hvor omhyggelig du skal være med typer. Ellers får du uventede resultater. Det kan blive ret alvorligt: talfejl kan føre til fejl, som f.eks. at kontroller ikke fungerer som tilsigtet, eller at spillerne opkræver den forkerte pris.
de: Dies zeigt Dir, wie achtsam Du mit Typen umgehen musst. Andernfalls erhälts Du unerwartete Ergebnisse. Es kann ziemlich ernst werden: Zahlenfehler können dazu führen, dass Fehler wie Steuerelemente nicht wie beabsichtigt funktionieren oder den Spielern den falschen Preis berechnen.
ru: Поэтому работать с типами нужно очень внимательно. В противном случае результаты будут неожиданными. Последствия могут быть довольно серьёзными: ошибки в числах могут привести к ошибочному поведению программы, например, неправильной работе управления или неправильной цене для игроков.
ta: வகைகளுடன் நீங்கள் எவ்வளவு கவனமாக இருக்க வேண்டும் என்பதை இது காட்டுகிறது. இல்லையெனில், நீங்கள் எதிர்பாராத முடிவுகளைப் பெறுவீர்கள். இது மிகவும் தீவிரமாக இருக்கும்: எண் பிழைகள் கட்டுப்பாடுகள் போன்ற பிழைகள் நோக்கம் கொண்டதாக செயல்படாது அல்லது வீரர்களுக்கு தவறான விலையை வசூலிக்க வழிவகுக்கும்.
tr: Bu, değer tipleri ile ne kadar dikkatli olmanız gerektiğini gösterir. Aksi takdirde, beklenmedik sonuçlar alırsınız. Bu sorun oldukça ciddi olabilir: sayı hataları, oyun tuşlarının amaçlandığı gibi çalışmaması veya oyunculardan yanlış ücretlendirme talep etmek gibi hatalara neden olabilir.
uk: Це показує, наскільки уважним потрібно бути з типами. В іншому випадку ви отримаєте несподівані результати. Це може стати досить серйозним: помилки в цифрах можуть призвести до помилок, наприклад, елементів керування, які не працюють належним чином, або стягнення неправильної ціни з гравців.

source: Understanding and mastering types is a key skill for developers
cs: Porozumění typům a jejich zvládnutí je pro vývojáře klíčovou dovedností.
da: At forstå og mestre typer er en nøglefærdighed for udviklere
de: Das Verstehen und Beherrschen von Typen ist eine Schlüsselkompetenz für Entwickler
es: Entender y dominar los tipos es una habilidad clave para los desarrolladores
fr: Comprendre et maîtriser les types est une compétence clé pour les développeurs
it: Capire e avere padronanza dei tipi di valore è una competenza chiave per gli sviluppatori
ja: 型を理解して習得することは、開発者にとって重要なスキルです
nl: Types begrijpen en beheersen is een belangrijke vaardigheid voor ontwikkelaars
pt_br: Compreender e dominar os tipos é uma habilidade fundamental para os desenvolvedores
ru: Понимание и освоение типов — ключевой навык для разработчиков
ta: புரிதல் மற்றும் மாச்டரிங் வகைகள் டெவலப்பர்களுக்கு ஒரு முக்கிய திறமையாகும்
tr: Değer tiplerini anlamak ve bunlara hakim olmak, geliştiriciler için önemli bir beceridir
uk: Розуміння та опанування типів є ключовим навиком для розробників
zh_hans: 理解和掌握值类型是开发人员的必备技能
zh_hant: 理解和掌握值的類型是開發者的必備技能

source: Programming beginners often struggle due to the lack of understanding of types.
cs: Začátečníci v programování mají často potíže s nepochopením typů.
da: Begyndere inden for programmering kæmper ofte på grund af manglende forståelse af typer.
de: Programmieranfänger kämpfen oft aufgrund des mangelnden Verständnisses von Typen.
ru: Начинающие программисты часто испытывают трудности из-за недостаточного понимания типов.
ta: நிரலாக்க துவக்கம் பெரும்பாலும் வகைகளைப் புரிந்து கொள்ளாததால் போராடுகிறது.
tr: Programlamaya yeni başlayanlar, genellikle değer tiplerini eksik anlamak ile mücadele ederler.
uk: Початківці програмувальники часто відчувають труднощі через відсутність розуміння типів.

source: Languages like GDScript hide the types from you by default. As a result, if you don't understand that some are incompatible, you can get stuck when facing type-related errors.
cs: Jazyky, jako je GDScript, před vámi typy ve výchozím nastavení skrývají. Výsledkem je, že pokud nechápete, že některé z nich jsou nekompatibilní, můžete se zaseknout, když se setkáte s chybami, které souvisí s typy.
da: Sprog som GDScript skjuler som standard typerne for dig. Som følge heraf kan du gå i stå, når du støder på typerelaterede fejl, hvis du ikke forstår, at nogle er inkompatible.
de: Sprachen wie GDScript blenden die Typen standardmäßig vor Ihnen aus. Wenn Du also nicht verstehst, dass einige inkompatibel sind, könntest Du bei typbezogenen Fehlern stecken bleiben.
ru: Языки, такие как GDScript, по умолчанию скрывают от вас типы. В результате, непонимание того, что некоторые из них несовместимы, может привести вас в тупик, при столкновении с ошибками, связанными с неправильным их использованием.
ta: GDSCRIPT போன்ற மொழிகள் உங்களிடமிருந்து வகைகளை இயல்பாக மறைக்கின்றன. இதன் விளைவாக, சில பொருந்தாதவை என்பதை நீங்கள் புரிந்து கொள்ளாவிட்டால், வகை தொடர்பான பிழைகளை எதிர்கொள்ளும்போது நீங்கள் சிக்கிக்கொள்ளலாம்.
tr: GDScript gibi diller, varsayılan olarak tipleri sizden gizler. Sonuç olarak, bazılarının uyumsuz olduğunu anlamazsanız, bir tip ile ilgili hatalarla karşılaştığınızda takılıp kalabilirsiniz.
uk: Такі мови, як GDScript, за умовчанням приховують від вас типи. У результаті, якщо ви не розумієте, що деякі з них несумісні, ви можете застрягти, стикаючись із помилками, пов’язаними з типом.

source: You'll want to keep that in mind in your learning journey. When writing code, you will need to understand everything that's happening.
cs: Při psaní kódu budete muset rozumět všemu, co se děje.
da: Du bør huske på det i din læringsproces. Når du skriver kode, skal du forstå alt, hvad der sker.
de: Du solltest dies bei Deiner Lernreise im Hinterkopf behalten. Wenn Du Code schreibst, musst Du alles verstehen, was passiert.
ru: Вам следует помнить об этом в процессе обучения. При написании кода необходимо чётко понимать всё, что происходит.
ta: உங்கள் கற்றல் பயணத்தில் அதை மனதில் கொள்ள விரும்புவீர்கள். குறியீட்டை எழுதும்போது, நடக்கும் அனைத்தையும் நீங்கள் புரிந்து கொள்ள வேண்டும்.
tr: Öğrenme yolculuğunuz boyunca bunu aklınızda tutmak isteyeceksiniz. Kod yazarken, olan her şeyi anlamanız gerekir.
uk: Пам’ятайте про це під час навчання. Під час написання коду вам потрібно буде розуміти все, що відбувається.

source: That said, let's practice some type conversions.
cs: Jak již bylo řečeno, procvičme si některé typové konverze.
da: Når det er sagt, lad os øve os på nogle typekonverteringer.
de: Lass uns jedoch einige Typkonvertierungen üben.
ru: Поэтому, давайте поупражняемся в преобразовании типов.
ta: சில வகை மாற்றங்களை பயிற்சி செய்வோம் என்று கூறினார்.
tr: Bunu da söylediğimize göre, artık bazı tipleri dönüştürme alıştırması yapalım.
uk: Тим не менш, давайте попрактикуємося в деяких перетвореннях типів.

source: Displaying the player's health and energy
cs: Zobrazení zdraví a energie hráče
da: Visning af spillerens liv og energi
de: Anzeige des Lebens und der Energie des Spielers
es: Mostrar la salud y la energía del jugador
fr: Afficher la santé et l'énergie du joueur
it: Mostrare la vita e l'energia del giocatore
ja: プレイヤーの体力とエネルギーを表示する
nl: De gezondheid en energie van de speler weergeven
pt_br: Exibindo a vida e a energia do jogador
ru: Отображение энергии игрока
ta: வீரரின் ஆரோக்கியத்தையும் ஆற்றலையும் காண்பிக்கும்
tr: Oyuncunun sağlığını ve enerjisini göstermek
uk: Відображення здоров'я та енергії гравця
zh_hans: 显示玩家的生命值和能量值
zh_hant: 顯示玩家的血量和能量

source: We want to display the player's energy in the user interface.
cs: V uživatelském rozhraní chceme zobrazit energii hráče.
da: Vi ønsker at vise spillerens energi i brugergrænsefladen.
de: Wir möchten die Energie des Spielers in der Benutzeroberfläche anzeigen.
ru: Мы хотим отобразить энергию игрока в интерфейсе пользователя.
ta: பயனர் இடைமுகத்தில் பிளேயரின் ஆற்றலைக் காட்ட விரும்புகிறோம்.
tr: Oyuncunun enerjisini kullanıcı arayüzünde göstermek istiyoruz.
uk: Ми хочемо відобразити енергію гравця в інтерфейсі користувача.

source: Currently, our code has a type error. We're trying to display a whole number while the [code]display_energy()[/code] function expects a string.
cs: V současné době má náš kód typovou chybu. Snažíme se zobrazit celé číslo, zatímco funkce [code]display_energy()[/code] očekává řetězec.
da: I øjeblikket har vores kode en typefejl. Vi forsøger at vise et helt tal, mens funktionen [code]display_energy()[/code] forventer en streng.
de: Derzeit weist unser Code einen Typfehler auf. Wir versuchen, eine ganze Zahl anzuzeigen, während die Funktion [code]display_energy()[/code] eine Zeichenfolge erwartet.
ru: Сейчас наш код содержит ошибки типов. Мы пытаемся отобразить целое число, а функция [code]display_energy()[/code] ожидает строку в качестве аргумента.
ta: தற்போது, எங்கள் குறியீட்டில் ஒரு வகை பிழை உள்ளது. [குறியீடு] டிச்ப்ளே_இனெர்சி () [/குறியீடு] செயல்பாடு ஒரு சரத்தை எதிர்பார்க்கும்போது முழு எண்ணையும் காண்பிக்க முயற்சிக்கிறோம்.
tr: Şu anda kodumuzda bir değer tipi hatası var. [code]display_energy()[/code] (göster_enerji) fonksiyonu bir dize bekliyor ama biz bir tam sayı görüntülemeye çalışıyoruz.
uk: Наразі наш код містить помилку типу. Ми намагаємося відобразити ціле число, тоді як функція [code]display_energy()[/code] очікує рядок.

source: Using the [code]str()[/code] function, clear the type error and make the energy amount display on the interface.
cs: Pomocí funkce [code]str()[/code] zrušte typovou chybu a zajistěte, aby se množství energie zobrazilo na rozhraní.
da: Brug funktionen [code]str()[/code] til at fjerne typefejlen og få energimængden vist på brugergrænsefladen.
de: Lösch mit der Funktion [code]str()[/code] den Typfehler und zeig die Energiemenge auf der Schnittstelle an.
ru: Избавьтесь от ошибки и отобразите количество энергии в интерфейсе при помощи функции [code]str()[/code].
ta: [குறியீடு] str () [/code] செயல்பாட்டைப் பயன்படுத்தி, வகை பிழையை அழித்து, இடைமுகத்தில் ஆற்றல் அளவு காட்சியை உருவாக்கவும்.
tr: [code]str()[/code] fonksiyonunu kullanarak, yazım hatasını temizleyin ve enerji miktarının arayüzde görüntülenmesini sağlayın.
uk: Використовуючи функцію [code]str()[/code], очистіть помилку типу та відобразіть кількість енергії в інтерфейсі.

source: You can't change the [code]energy[/code] variable definition: setting it to [code]"80"[/code] would break the rest of the game's code. You must convert the value when calling [code]display_energy()[/code].
cs: Definici proměnné [code]energy[/code] nesmíte měnit: její nastavení na [code]"80"[/code] by porušilo zbytek kódu hry. Při volání [code]display_energy()[/code] musíte hodnotu převést.
da: Du kan ikke ændre definitionen af variabel [code]energy[/code]: at indstille den til [code]"80"[/code] ville ødelægge resten af spillets kode. Du skal konvertere værdien, når du kalder [code]display_energy()[/code].
de: Du kannst die Definition der Variablen [code]energy[/code] nicht ändern: Wenn Du sie auf [code]"80"[/code] setzt, wird der Rest des Codes des Spiels unterbrochen. Du musst den Wert konvertieren, wenn Du [code]display_energy()[/code] aufrufst.
ru: Изменять значение переменной [code]energy[/code] на [code]"80"[/code] нельзя, это приведёт к неисправностям в других частях игрового кода. Вы должны преобразовать значение при передаче его в функцию [code]display_energy()[/code].
ta: நீங்கள் [குறியீடு] ஆற்றல் [/குறியீடு] மாறி வரையறையை மாற்ற முடியாது: அதை [குறியீடு] "80" [/குறியீடு] என அமைப்பது விளையாட்டின் மீதமுள்ள குறியீட்டை உடைக்கும். [குறியீடு] display_energy () [/code] ஐ அழைக்கும்போது நீங்கள் மதிப்பை மாற்ற வேண்டும்.
tr: [code]energy[/code] değişken tanımını sakın değiştirmeyin: (hile yapıp) [code]"80"[/code] olarak ayarlamak oyun kodunun geri kalanını bozar. [code]display_energy()[/code] fonksiyonunu çağırırken verdiğiniz değeri dönüştürmelisiniz.
uk: Ви не можете змінити визначення змінної [code]energy[/code]: встановлення значення [code]"80"[/code] порушить решту коду гри. Ви повинні перетворити значення під час виклику [code]display_energy()[/code].

source: We want to display the player's energy in the interface but face a type error. Use your new knowledge to fix it.
cs: Chceme v rozhraní zobrazit energii hráče, ale nejde to kvůli chybě typu. Použijte své nové znalosti k její opravě.
da: Vi vil gerne vise spillerens energi i brugerfladen, men støder på en type fejl. Brug din nye viden til at rette den.
de: Wir möchten die Energie des Spielers in der Benutzeroberfläche anzeigen, aber wir werden mit einem Typfehler konfrontiert. Verwende Dein neues Wissen, um ihn zu beheben.
es: Queremos mostrar la energía del jugador en la interfaz, pero nos encontramos con un error de tipo. Utiliza tus nuevos conocimientos para solucionarlo.
fr: Nous voulons afficher l'énergie du joueur dans l'interface mais nous sommes confrontés à une erreur de type. Utilisez vos nouvelles connaissances pour la corriger.
it: Vogliamo mostrare l'energia del giocatore nell'interfaccia ma abbiamo un errore causato dal tipo. Usa le tue conoscenze per risolverlo.
ja: プレイヤーのエネルギーをインターフェースに表示したいのですが、タイプエラーが発生します。新しい知識を使って修正してください。
nl: We willen de energie van de speler weergeven in de interface, maar krijgen te maken met een typefout. Gebruik je nieuwe kennis om het op te lossen.
pt_br: Queremos exibir a energia do jogador na interface, mas enfrentamos um erro de tipo. Use seu novo conhecimento para corrigi-lo.
ru: Мы хотим отобразить энергию игрока в интерфейсе, но ошибка мешает нам это сделать. Используйте свои знания, чтобы её исправить.
ta: பிளேயரின் ஆற்றலை இடைமுகத்தில் காண்பிக்க விரும்புகிறோம், ஆனால் ஒரு வகை பிழையை எதிர்கொள்கிறோம். அதை சரிசெய்ய உங்கள் புதிய அறிவைப் பயன்படுத்தவும்.
tr: Arayüzde oyuncunun enerjisini göstermek istiyoruz ancak bir yazım hatasıyla karşılaşıyoruz. Düzeltmek için yeni bilginizi kullanın.
uk: Ми хочемо відобразити енергію гравця в інтерфейсі, але стикаємося з помилкою типу. Використовуйте свої нові знання, щоб виправити це.
zh_hans: 我们想在界面中显示玩家的能量值，但是遇到了类型错误。用你学到的新知识来修复它。
zh_hant: 我們想在介面上顯示玩家的能量，但遇到了類型錯誤。使用你學到的新知識來修正它。

source: Letting the player type numbers
cs: Nechte hráče zadávat čísla
da: Lad spilleren indtaste tal
de: Dem Spieler ermöglichen Zahlen einzugeben
es: Dejar que el jugador escriba números
fr: Permettre au joueur écrire des nombres
it: Lasciare scrivere la giocatore dei numeri
ja: プレーヤーに数字を入力させる
nl: De speler getallen laten typen
pt_br: Deixando o jogador digitar números
ru: Позволяем игроку писать числа
ta: பிளேயர் வகை எண்களை அனுமதிக்கிறது
tr: Oyuncunun sayı yazmasına izin vermek
uk: Дозвольте гравцеві вводити числа
zh_hans: 让玩家输入数字
zh_hant: 讓玩家輸入數字

source: In our game's shops, we want to let the player type numbers to select the number of items they want to buy or sell.
cs: V našich herních obchodech chceme nechat hráče, aby si vybral počet položek, které chce koupit nebo prodat.
da: I vores spils butikker vil vi lade spilleren indtaste tal for at vælge antallet af varer, de vil købe eller sælge.
de: In den Geschäften unseres Spiels möchten wir den Spielern die Möglichkeit geben, Zahlen einzugeben, um die Anzahl der Gegenstände auszuwählen, die er kaufen oder verkaufen möchte.
ru: В магазинах нашей игры мы хотим позволить игроку печатать числа для выбора количества предметов для продажи или покупки.
ta: எங்கள் விளையாட்டின் கடைகளில், அவர்கள் வாங்க அல்லது விற்க விரும்பும் பொருட்களின் எண்ணிக்கையைத் தேர்ந்தெடுக்க பிளேயர் எண்களைத் தட்டச்சு செய்ய விரும்புகிறோம்.
tr: Oyunumuzun dükkanlarında oyuncunun, satın almak veya satmak istediği öğe sayısını seçmek için, sayı yazmasına izin vermek istiyoruz.
uk: У наших ігрових магазинах ми хочемо дозволити гравцям вводити числа, щоб вибрати кількість предметів, які вони хочуть купити або продати.
