Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-11-time-delta.po
Languages: cs, da, de, es, fr, it, ja, ru, ta, tr, uk, zh_hant

source: We've seen how we can use our character's [code]_process()[/code] function to make it move continuously.
cs: Viděli jsme, jak můžeme použít funkci [code]_process()[/code] naší postavy, aby se neustále pohybovala.
da: Vi har set, hvordan vi kan bruge vores karakters [code]_process()[/code] funktion til at få den til at flytte sig kontinuerligt.
de: Wir haben gesehen, wie wir die [code]_process()[/code]-Funktion unseres Charakters verwenden können, um ihn kontinuierlich zu bewegen.
es: Hemos visto cómo podemos utilizar la función [code]_process()[/code] de nuestro personaje para hacer que se mueva continuamente.
fr: Nous avons vu comment nous pouvons utiliser la fonction [code]_process()[/code] de notre personnage pour le faire bouger de façon continue.
it: Abbiamo visto come possiamo usare la funzione [code]_process()[/code] del nostro personaggio per farlo muovere in continuazione.
ja: キャラクターの [code]_process()[/code] 関数を使用して、キャラクターを連続的に動かす方法を見てきました。
ru: Мы видели, как можно использовать функцию [code]_process()[/code] нашего персонажа, чтобы заставить его двигаться непрерывно.
ta: உங்கள் கதாபாத்திரத்தின் [குறியீடு] செயல்முறை () [/குறியீடு] செயல்பாட்டை தொடர்ந்து நகர்த்துவதற்கு நாங்கள் எவ்வாறு பயன்படுத்தலாம் என்பதை நாங்கள் பார்த்துள்ளோம்.
tr: Bir karakterin [code]_process()[/code] fonksiyonu ile, onu nasıl sürekli hareket ettirebileceğimizi gördük.
uk: [/code]Ми бачили, як можна використати функцію [code]_process()[/code] нашого персонажа, щоб змусити його рухатися неперервно.
zh_hant: 我們已經看到如何使用角色的 [code]_process()[/code] 函式來讓它持續移動。

source: But it's not just our character that has a [code]_process()[/code] function; Almost everything in the game has a [code]_process()[/code] function!
da: Men det er ikke kun vores karakter, der har en [code]_process()[/code]-funktion; Næsten alt i spillet har en [code]_process()[/code]-funktion!
fr: Mais il n'y a pas que notre personnage qui a une fonction [code]_process()[/code] ; presque tout dans le jeu a une fonction [code]_process()[/code] !
ja: しかし、[code]_process()[/code]関数を持っているのは私たちのキャラクターだけではありません。ゲーム内のほとんどすべてに[code]_process()[/code]機能があります!
tr: Ancak [code]_process()[/code] fonksiyonuna sahip olan sadece bizim karakterimiz değil; oyundaki neredeyse her şeyin içinde bir [code]_process()[/code] fonksiyonu var!

source: Dozens of times per second, Godot runs every [code]_process()[/code] function in the game to update the game world.
da: Godot kører dusinvis af gange i sekundet hver [code]_process()[/code]-funktion i spillet for at opdatere spilverdenen.
fr: Des dizaines de fois par seconde, Godot exécute chaque fonction [code]_process()[/code] dans le jeu pour mettre à jour le monde du jeu.
ja: 毎秒数十回、Godotはゲーム内のすべての[code]_process()[/code]関数を実行して、ゲームの世界を更新します。
tr: Godot, oyun dünyasını güncellemek için, oyundaki her [code]_process()[/code] fonksiyonunu saniyede defalarca kez çalıştırır.

source: After that, it displays an image of the game world on the screen. We call that image a [b]frame[/b].
da: Derefter viser den et billede af spilverdenen på skærmen. Vi kalder dette billede en [b]frame[/b].
fr: Ensuite, il affiche une image du monde du jeu à l'écran. Nous appelons cette image un [b]« frame »[/b].
ja: その後、画面にゲーム世界の画像が表示されます。その画像を [b]フレーム[/b] と呼びます。
tr: Bunun ardından, oyun dünyasının bir görüntüsünü ekranda gösterir. Bu görüntüye, [b]bir oyun karesi[/b] (veya çerçevesi, frame) diyoruz.

source: Godot then moves on to calculating the next frame.
da: Godot går derefter videre til at beregne den næste frame.
fr: Godot passe ensuite au calcul de l'image suivante.
ja: その後、Godotは次のフレームの計算に移ります。
tr: Godot, bunu bitirince, bir sonraki kareyi hesaplamaya geçer.

source: As this happens dozens of times per second, you get the illusion of movement. This is similar to how traditional animation works.
da: Når dette sker dusinvis af gange i sekundet, får du illusionen af bevægelse. Dette minder om, hvordan traditionel animation fungerer.
fr: Comme cela se produit des dizaines de fois par seconde, on obtient l'illusion du mouvement. Ceci est similaire au fonctionnement de l'animation traditionnelle.
ja: これが毎秒何十回も起こると、動いているような錯覚に陥ります。これは、従来のアニメーションの仕組みと似ています。
tr: Bu saniyede onlarca kez gerçekleştiğinden, bir hareket yanılsaması elde edersiniz. Bu, geleneksel animasyonun (hareketli görüntü, çizgi film) çalışma şekline benzer.

source: This sounds like Frames Per Second...
da: Dette lyder som Billeder Per Sekund...
de: Das klingt nach Frames Per Second (Bilder pro Sekunde)...
es: Esto suena como Frames Per Second (Fotograma Por Segundo)...
fr: Ça ressemble à des images par seconde...
it: Sembra tipo Frames Per Second...
ja: これはフレーム/秒のように聞こえます...
ru: Это похоже на количество кадров в секунду...
ta: இது நொடிக்கு பிரேம்கள் போல் தெரிகிறது ...
tr: Bu kulağa Saniyedeki Kare Sayısı (Frames per Second, fps) gibi geliyor...
uk: Це схоже на кількість кадрів на секунду...
zh_hant: 這聽起來像是每秒幀數（Frames Per Second，簡稱 FPS）…

source: You may have heard of frames per second, or FPS for short. Games often run at 60 frames per second.
da: Du har måske hørt om billeder per sekund, eller FPS. Spil kører ofte med 60 billeder per sekund.
fr: Vous avez peut-être entendu parler d'images par seconde, ou IPS en abrégé. Les jeux tournent souvent à 60 images par seconde.
ja: フレーム/秒、略してFPSについて聞いたことがあるかもしれません。ゲームは多くの場合、毎秒 60 フレームで実行されます。
tr: Saniye başına kare sayısını ya da kısaca FPS'yi (frames per second) duymuş olabilirsiniz. Oyunlar genellikle saniyede 60 kare hızında çalışır.

source: It means that everything in the game updates 60 times each second.
da: Det betyder, at alt i spillet opdateres 60 gange hvert sekund.
fr: Cela signifie que tout dans le jeu est mis à jour 60 fois par seconde.
ja: これは、ゲーム内のすべてが毎秒60回更新されることを意味します。
tr: Bu, oyundaki her şeyin, her saniye 60 kez güncellendiği anlamına gelir.

source: The number varies while playing, depending on the game and the device it runs on.
da: Antallet varierer under spillet, afhængigt af spillet og den enhed, det kører på.
fr: Ce nombre varie pendant que l'on joue, en fonction du jeu et de l'appareil sur lequel il s'exécute.
ja: この数は、ゲームやゲームが動作するデバイスによって、プレイ中に異なります。
tr: Bu sayı, oyuna ve üzerinde çalıştığı cihaza bağlı olarak, oyun sırasında değişir.

source: On powerful computers, you may get frame rates in the hundreds or thousands of frames per second.
da: På kraftige computere kan du få billedhastigheder på hundredvis eller tusindvis af billeder per sekund.
fr: Sur des ordinateurs puissants, on peut obtenir des fréquences d'images de plusieurs centaines ou milliers d'images par seconde.
ja: 強力なコンピュータでは、毎秒数百または数千フレームのフレームレートが得られる場合があります。
tr: Güçlü bilgisayarlarda, saniyede yüzlerce veya binlerce kare hızı elde edebilirsiniz.

source: Let's look at the [code]_process()[/code] function in more detail.
cs: Podívejme se podrobněji na funkci [code]_process()[/code].
da: Lad os se på funktionen [code]_process()[/code] i flere detaljer.
de: Schauen wir uns die Funktion [code]_process()[/code] genauer an.
es: Veamos la función [code]_process()[/code] con más detalle.
fr: Regardons la fonction [code]_process()[/code] plus en détail.
it: Guardiamo la funzione [code]_process()[/code] più nel dettaglio.
ja: [code]_process()[/code]関数をもう少し詳しく見てみましょう。
ru: Давайте рассмотрим функцию [code]_process()[/code] более детально.
ta: [குறியீடு] _PROCESS () [/குறியீடு] செயல்பாட்டை இன்னும் விரிவாகப் பார்ப்போம்.
tr: Hadi şimdi, [code]_process()[/code] fonksiyonuna daha ayrıntılı olarak bakalım.
uk: Розгляньмо функцію [code]_process()[/code] докладніше.
zh_hant: 讓我們更詳細地看看 [code]_process()[/code] 函式。

source: What parameter does the _process() function take?
cs: Jaký parametr má funkce _process()?
da: Hvilken parameter tager _process() funktionen?
de: Welchen Parameter nimmt die Funktion _process() an?
es: ¿Qué parámetro toma la función _process()?
fr: Quel paramètre la fonction _process() prend-elle ?
it: Quale parametro prende la funzione _process()?
ja: _process()関数はどのパラメータを取りますか?
ru: Какой параметр принимает функция _process()?
ta: _PROCESS () செயல்பாடு எந்த அளவுருவை எடுக்கும்?
tr: _process() fonksiyonu hangi alınan değişkenlere (parametre) sahiptir?
uk: Який параметр приймає функція _process()?
zh_hant: _process() 函式的參數是什麼？

source: The [code]_process()[/code] function has one parameter named [code]delta[/code].
cs: Funkce [code]_process()[/code] má jeden parametr s názvem [code]delta[/code].
da: Funktionen [code]_process()[/code] har én parameter ved navn [code]delta[/code].
de: Die Funktion [code]_process()[/code] hat einen Parameter mit dem Namen [code]delta[/code].
es: La función [code]_process()[/code] tiene un parámetro llamado [code]delta[/code].
fr: La fonction [code]_process()[/code] a un paramètre nommé [code]delta[/code].
it: La funzione [code]_process()[/code] ha un solo parametro chiamato [code]delta[/code].
ja: [code]_process()[/code] 関数には、[code]delta[/code] という名前のパラメーターが 1 つあります。
ru: Функция [code]_process()[/code] принимает один параметр, называемый [code]delta[/code].
ta: The [code]_process()[/code] சார்பு has one கூறளவு named [code]delta[/code].
tr: [code]_process()[/code] fonksiyonunun, [code]delta[/code] (küçük değişim) adında bir tek alınan değişkeni vardır.
uk: Функція [code]_process()[/code] приймає один параметр, названий [code]delta[/code] (дельта).
zh_hant: [code]_process()[/code] 函式有一個參數，名為 [code]delta[/code]。

source: rotate
de: drehen
ja: 回転
ta: சுழற்றுங்கள்

source: delta
ja: デルタ
ta: டெல்டா

source: Frames take varying amounts of time to calculate
cs: Výpočet snímků trvá různě dlouho.
da: Det tager varierende tid at beregne billeder
de: Die Berechnung von Frames nimmt unterschiedlich lange Zeit in Anspruch
es: Los fotogramas tardan diferentes cantidades de tiempo en calcularse
fr: Les images prennent des quantités variables de temps pour être calculées
it: I frame impiegano quantità di tempo variabili per essere calcolati
ja: フレームの計算にかかる時間はさまざまです
ru: Кадры требуют различного количества времени на вычисление
ta: பிரேம்கள் கணக்கிட மாறுபட்ட நேரத்தை எடுத்துக்கொள்கின்றன
tr: Oyun karelerinin hesaplanması farklı süreler alır
uk: Кадри вимагають різного обсягу часу на обчислення
zh_hant: 每幀的計算所需時間會有所不同

source: Depending on the game, the computer, and what the game engine needs to calculate, frames take more or less time to display.
da: Afhængigt af spillet, computeren og hvad spilmotoren skal beregne, tager det mere eller mindre tid at vise billeder.
fr: Selon le jeu, l'ordinateur et ce que le moteur de jeu doit calculer, les images prennent plus ou moins de temps à s'afficher.
ja: ゲーム、コンピューター、およびゲームエンジンが計算する必要がある内容に応じて、フレームの表示にかかる時間は多かれ少なかれ異なります。
tr: Oyuna, bilgisayara ve oyun motorunun neyi hesaplaması gerektiğine bağlı olarak, karelerin görüntülenmesi daha fazla veya daha az zaman alır.

source: There will always be milliseconds variations from frame to frame.
da: Der vil altid være variationer i millisekunder fra billede til billede.
fr: Il y aura toujours des variations de quelques millisecondes d'une image à l'autre.
ja: フレームごとに常にミリ秒の変動があります。
tr: Kareden kareye, her zaman milisaniyelik farklılıklar olacaktır.

source: That is why the [code]_process()[/code] function receives a [code]delta[/code] parameter.
da: Derfor modtager funktionen [code]_process()[/code] en [code]delta[/code] parameter.
fr: C'est pourquoi la fonction [code]_process()[/code] reçoit un paramètre [code]delta[/code].
ja: そのため、[code]_process()[/code] 関数は [code]delta[/code] パラメーターを受け取ります。
tr: Bu nedenle [code]_process()[/code] fonksiyonunun bir [code]delta[/code] (küçük değişim) alınan değişkeni vardır.

source: Delta represents a time difference. It's the time passed since the previous frame, in seconds.
da: Delta repræsenterer en tidsforskel. Det er den tid, i sekunder, der er gået siden det forrige billede.
fr: Le mot « delta » représente une différence de temps. C'est le temps écoulé depuis l'image précédente, en secondes.
ja: デルタは時間差を表します。これは、前のフレームから経過した時間 (秒単位) です。
tr: Delta bir zaman farkını temsil eder. Önceki kareden bu yana, saniye cinsinden geçen süredir.

source: We can use it to ensure that the changes between frames don't make the game's behavior unreliable.
da: Vi kan bruge den til at sikre, at ændringerne mellem billeder ikke gør spillets opførsel upålidelig.
fr: Nous pouvons l'utiliser pour nous assurer que les variations entre les images ne rendent pas le comportement du jeu peu fiable.
ja: これを使用して、フレーム間の変更によってゲームの動作が信頼できなくなることがないようにすることができます。
tr: Bunu, iki kare arasında yapılan değişikliklerin, oyunun davranışını güvenilmez hale getirmemesini sağlamak için kullanabiliriz.

source: This is because different computers run differently, so a fast computer will have more frames per second than a slow computer.
da: Dette skyldes, at forskellige computere kører forskelligt, så en hurtig computer vil have flere billeder pr. sekund end en langsom computer.
fr: En effet, les ordinateurs fonctionnent différemment, de sorte qu'un ordinateur rapide aura plus d'images par seconde qu'un ordinateur lent.
ja: これは、コンピューターが異なれば動作が異なるため、高速のコンピューターは低速のコンピューターよりも毎秒のフレーム数が多いためです。
tr: Bunun nedeni farklı bilgisayarların farklı çalışmasıdır, yani hızlı bir bilgisayar, yavaş bir bilgisayara göre saniyede daha fazla kareye sahip olacaktır.

source: If we ignore [code]delta[/code], the game experience will vary, depending on the computer. Delta helps to make the game experience consistent for everyone.
da: Hvis vi ignorerer [code]delta[/code], vil spiloplevelsen variere afhængigt af computeren. Delta hjælper med at gøre spiloplevelsen ensartet for alle.
fr: Si nous ignorons [code]delta[/code], l'expérience de jeu variera en fonction de l'ordinateur. Le delta permet de rendre l'expérience de jeu cohérente pour tout le monde.
ja: [code]delta[/code] を無視すると、ゲーム体験はコンピューターによって異なります。デルタは、すべての人にとって一貫したゲーム体験を提供するお手伝いをします。
tr: Eğer [code]delta[/code] 'yı görmezden gelirsek, oyun deneyimi, bilgisayara bağlı olarak değişecektir. Delta, oyun deneyimini herkes için tutarlı hale getirmeye yardımcı olur.

source: What do we know about delta?
cs: Co víme o delta?
da: Hvad ved vi om delta?
de: Was wissen wir über Delta?
es: ¿Qué sabemos sobre delta?
fr: Que savons-nous de delta ?
it: Cosa sappiamo riguardo a delta?
ja: デルタについて私たちは何を知っていますか?
ru: Что мы знаем о параметре delta?
ta: டெல்டா பற்றி நமக்கு என்ன தெரியும்?
tr: Delta hakkında ne biliyoruz?
uk: Що ми знаємо про параметр delta?
zh_hant: 關於 delta 的事哪些是我們知道的？

source: [code]delta[/code] is the time it took Godot to complete the previous frame in seconds.
da: [code]delta[/code] er den tid, det tog Godot at fuldføre det forrige billede i sekunder.
fr: [code]delta[/code] est le temps qu'il faut à Godot pour terminer l'image précédente en secondes.
ja: [code]delta[/code]は、Godotが前のフレームを完了するのにかかった時間(秒単位)です。
tr: [code]delta[/code] Godot'nun bir önceki kareyi tamamlaması için geçen süreyi saniye cinsinden ifade eder.

source: It's very small because frames happen many times a second.
da: Den er meget lille, fordi der genereres mange billeder i sekundet.
fr: Il très petit car les images se produisent plusieurs fois par seconde.
ja: フレームは1秒間に何回も発生するため、非常に小さいです。
tr: Çok küçüktür, çünkü kareler saniyede birçok kez gerçekleşir.

source: It varies each frame because Godot needs to process more or less each frame.
da: Den varierer mellem hvert billede, fordi Godot skal behandle mere eller mindre hver billede.
fr: Il varie à chaque image car Godot a besoin de traiter plus ou moins chaque image.
ja: Godotは多かれ少なかれ各フレームを処理する必要があるため、フレームごとに異なります。
tr: Her karede değişir, çünkü Godot'nun her karede, daha az ya da daha çok işlem yapması gerekir.

source: It's a value in seconds.
cs: Je to hodnota v sekundách.
da: Det er en værdi i sekunder.
de: Es ist ein Wert in Sekunden.
es: Es un valor en segundos.
fr: C'est une valeur en secondes.
it: Viene espresso in secondi.
ja: これは秒単位の値です。
ru: Это значение в секундах.
ta: இது நொடிகளில் ஒரு மதிப்பு.
tr: Saniye cinsinden bir değerdir.
uk: Це значення в секундах.
zh_hant: 它是以秒為單位的數值。

source: It varies each frame.
cs: V každém snímku se mění.
da: Det varierer mellem hvert billede.
de: Es variiert jeden Frame.
es: Varía en cada fotograma.
fr: Il varie à chaque image.
it: Varia ad ogni frame.
ja: フレームごとに異なります。
ru: Он имеет различное значение каждый кадр.
ta: இது ஒவ்வொரு சட்டகத்தையும் மாறுபடும்.
tr: Her karede değişir.
uk: Воно відрізняється для кожного кадру.
zh_hant: 它的值每幀都不同。

source: It's the time it took Godot to complete the previous frame.
da: Det er den tid, det tog Godot at færdiggøre det forrige billede.
de: Es ist die Zeit, die Godot brauchte, um den vorherigen Frame zu vervollständigen.
es: Es el tiempo que le toma a Godot completar el fotograma anterior.
fr: C'est le temps qu'il a fallu à Godot pour terminer l'image précédente.
it: Rappresenta il tempo che Godot impiega a completare il frame precedente.
ja: これは、Godotが前のフレームを完成させるのにかかった時間です。
ru: Это время, которое затрачивает Godot для завершения предыдущего кадра.
ta: முந்தைய சட்டகத்தை முடிக்க கோடோட் எடுத்த நேரம் இது.
tr: Godot'nun, bir önceki kareyi tamamlaması için geçen süredir.
uk: Це час, за який Godot завершує попередній кадр.
zh_hant: 它是 Godot 完成上一幀所花費的時間。

source: Multiplying by delta
cs: Násobení deltou
da: Multiplikation med delta
de: Multiplikation mit Delta
es: Multiplicar por delta
fr: Multiplication par delta
it: Moltiplicando per delta
ja: デルタによる乗算
ru: Умножение на дельту
ta: டெல்டாவால் பெருக்கப்படுகிறது
tr: Delta ile çarpmak
uk: Множення на дельту
zh_hant: 乘上 delta

source: The [code]delta[/code] you get in [code]_process()[/code] is a time difference in seconds. It will generally be a tiny decimal number.
da: Den [code]delta[/code] du får i [code]_process()[/code] er en tidsforskel i sekunder. Det vil generelt være et lille decimaltal.
fr: Le [code]delta[/code] que vous obtenez dans [code]_process()[/code] est une différence de temps en secondes. Ce sera généralement un petit nombre décimal.
ja: [code]_process()[/code]で取得する[code]delta[/code]は秒単位の時差です。通常は小さな 10 進数です。
tr: [code]_process()[/code] içinde gelen [code]delta[/code], saniye cinsinden bir zaman farkıdır. Genellikle çok küçük bir ondalık sayı olacaktır.

source: To apply [code]delta[/code], you need to [i]multiply[/i] your speed values by it.
da: For at anvende [code]delta[/code] skal du [i]multiplicere[/i] dine hastighedsværdier med den.
fr: Pour appliquer le [code]delta[/code], vous devez [i]multiplier[/i] vos valeurs de vitesse par celui-ci.
ja: [code]delta[/code]を適用するには、速度値に[i]乗算[/i]する必要があります。
tr: [code]delta[/code]'yı uygulamak için, [i]hız değerleri[/i] ile çarpmanız gerekir.

source: When multiplying by [code]delta[/code], you make motion [i]time-dependent[/i] rather than [i]frame-dependent[/i].
da: Når man ganger med [code]delta[/code], gør man bevægelsen [i]tidsafhængig[/i] i stedet for [i]billede-afhængig[/i].
fr: En multipliant par [code]delta[/code], vous rendez le mouvement [i]dépendant du temps[/i] plutôt que [i]dépendant de l'image[/i].
ja: [code]delta[/code] を乗算すると、モーションを[i]フレーム依存[/i]ではなく[i]時間依存[/i]にします。
tr: [code]delta[/code] ile çarparken, hareketi, [i]oyun karesine[/i] değil [i]zamana bağlı[/i] yaparsınız.

source: That's essential to make your game consistent and fair.
da: Det er vigtigt for at gøre dit spil ensartet og retfærdigt.
fr: C'est essentiel pour rendre votre jeu cohérent et équitable.
ja: これは、ゲームの一貫性と公平性を保つために不可欠です。
tr: Oyununu tutarlı ve adil kılmak için bu çok önemlidir.

source: Why do we use the number 3.0 in this example?
cs: Proč v tomto příkladu používáme číslo 3.0?
da: Hvorfor bruger vi nummeret 3.0 i dette eksempel?
de: Warum verwenden wir in diesem Beispiel die Zahl 3.0?
es: ¿Por qué utilizamos el número 3.0 en este ejemplo?
fr: Pourquoi utilisons-nous le nombre 3.0 dans cet exemple ?
it: Perché utilizziamo il numero 3.0 in questo esempio?
ja: この例ではなぜ 3.0 という数字を使用するのでしょうか?
ru: Почему мы используем число 3.0 в этом примере?
ta: இந்த எடுத்துக்காட்டில் 3.0 என்ற எண்ணை ஏன் பயன்படுத்துகிறோம்?
tr: Bu örnekte, neden 3.0 sayısını kullanıyoruz?
uk: Чому в цьому прикладі ми використовуємо число 3.0?
zh_hant: 為什麼我們在這個例子中使用的值是 3.0？

source: At the top of the lesson, we made the robot rotate a fixed amount every frame: [code]0.05[/code] radians.
da: I starten af lektionen fik vi robotten til at rotere en fast mængde hver billede: [code]0.05[/code] radianer.
fr: Au début de la leçon, nous avons fait tourner le robot d'une quantité fixe à chaque image : [code]0.05[/code] radians.
ja: レッスンの冒頭で、ロボットをフレームごとに一定量回転させました:[code]0.05[/code]ラジアン。
tr: Dersin başında, robotun her karede sabit bir miktarda dönmesini sağladık: [code]0.05[/code] radyan.

source: In the example above, we now [i]multiply[/i] the argument by the very small [code]delta[/code] value, a value way below [code]1.0[/code]. It makes the robot turn at a constant speed over time.
da: I eksemplet ovenfor [i]multiplicerer[/i] vi nu argumentet med den meget lille [code]delta[/code] værdi, en værdi langt under [code]1.0[/code]. Det får robotten til at dreje med en konstant hastighed over tid.
fr: Dans l'exemple ci-dessus, nous [i]multiplions[/i] maintenant l'argument par la très petite valeur de [code]delta[/code], une valeur bien inférieure à [code]1.0[/code]. Cela fait tourner le robot à une vitesse constante dans le temps.
ja: 上の例では、[code]1.0[/code] よりはるかに小さい値である非常に小さな [code]delta[/code] 値を [i]乗算[/i]します。 これにより、ロボットは時間の経過とともに一定の速度で回転します。
tr: Yukarıdaki örnekte şimdi, girilen değişkeni, [code]1.0[/code] değerinin çok altında bir değer olan, çok küçük [code]delta[/code] değeriyle [i]çarpıyoruz[/i]. Bu, robotun zaman içinde sabit bir hızda dönmesini sağlar.

source: However, multiplying by a number below [code]1.0[/code] like [code]delta[/code] makes the result smaller.
da: Men ganges det med et tal under [code]1.0[/code] som [code]delta[/code] bliver resultatet mindre.
fr: Cependant, la multiplication par un nombre inférieur à [code]1.0[/code] comme [code]delta[/code] rend le résultat plus petit.
ja: ただし、[code]delta[/code]のように[code]1.0[/code]未満の数値を掛けると、結果が小さくなります。
tr: Ancak, [code]delta[/code] gibi [code]1.0[/code]'in altındaki bir sayı ile çarpmak sonucu daha da küçültür.

source: To compensate for that and make the robot turn fast enough, we use a larger number than before, [code]3.0[/code] instead of [code]0.05[/code].
da: For at kompensere for det og få robotten til at dreje hurtigt nok, bruger vi et større tal end før, [code]3.0[/code] i stedet for [code]0.05[/code].
fr: Pour compenser cela et faire en sorte que le robot tourne suffisamment vite, nous utilisons un nombre plus grand qu'auparavant, [code]3.0[/code] au lieu de [code]0.05[/code].
ja: それを補い、ロボットの回転速度を上げるために、[code]0.05[/code] ではなく [code]3.0[/code] という以前よりも大きな数値を使用します。
tr: Bunu telafi etmek ve robotun yeterince hızlı dönmesini sağlamak için, [code]0.05[/code] yerine [code]3.0[/code] gibi, öncekinden çok daha büyük bir sayı kullanıyoruz.

source: Those numbers have two different [i]units[/i]: [code]0.05[/code] is an [i]angle[/i] in radians, while [code]3.0[/code] is an [i]angular speed[/i] in radians per second.
da: Disse tal har to forskellige [i]enheder[/i]: [code]0.05[/code] er en [i]vinkel[/i] i radianer, mens [code]3.0[/code] er en [i]vinkelhastighed[/i] i radianer pr. sekund.
fr: Ces nombres ont deux [i]unités[/i] différentes : [code]0.05[/code] est un [i]angle[/i] en radians, tandis que [code]3.0[/code] est une [i]vitesse angulaire[/i] en radians par seconde.
ja: これらの数値には 2 つの異なる [i]単位 [/i] があります: [code]0.05[/code] はラジアン単位の[i]角度[/i]で、[code]3.0[/code] はラジアン/秒単位の[i]角速度[/i]です。
tr: Bu sayıların iki farklı [i]birimi[/i] vardır: [code]0.05[/code] radyan cinsinden bir [i]açı[/i] iken, [code]3.0[/code] ise saniyede radyan cinsinden bir [i]açısal hız[/i] 'dır.
