Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-23-append-to-arrays.po
Languages: cs, de, es, it, ja, ru, ta, uk, zh_hant

source: The [code]waiting_orders[/code] array will be filled over time. Your job is to move orders from the waiting list to the [code]completed_orders[/code] list using the array's [code]append()[/code] and [code]pop_front()[/code] functions. Remember that the array's [code]pop_front()[/code] function returns the popped value, which allows you to store it in a variable and then pass it to another function.
cs: Pole [code]waiting_orders[/code] bude postupem času naplněno. Vaším úkolem je přesunout objednávky z čekacího seznamu do seznamu [code]completed_orders[/code] pomocí funkcí [code]append()[/code] a [code]pop_front()[/code]. Pamatujte, že funkce [code]pop_front()[/code] vrací odstraněnou hodnotu, což umožňuje její uložení do proměnné a následné předání jiné funkci.
uk: Масив [code]waiting_orders[/code] з часом буде заповнено. Ваше завдання — перемістити замовлення зі списку очікування до списку [code]completed_orders[/code] за допомогою функцій [code]append()[/code] і [code]pop_front()[/code] масиву. Пам’ятайте, що функція [code]pop_front()[/code] масиву повертає отримане значення, що дозволяє зберегти його в змінній, а потім передати в іншу функцію.
zh_hant: [code]waiting_orders[/code] 陣列將會隨著時間填滿。 你的工作是使用陣列的 [code]append()[/code] 和 [code]pop_front()[/code] 函式，將訂單從等待清單移動到 [code]completed_orders[/code] 清單中。 記得 [code]pop_front()[/code] 函式會回傳被移除的值，這樣你就可以將它儲存到變數中，然後再傳遞給另一個函式。

source: Crates are piling up on the platform. Move them out of the way by popping them from the [code]crates[/code] array. You need to remove them from top to bottom using the array's [code]pop_back()[/code] function. Your code should remove all the crates in the array using a while loop. [b]Careful![/b] if you run a while loop carelessly, you can lock the software. You can check if the [code]crates[/code] array still contains values by writing [code]while crates:[/code]
cs: Na plošině se hromadí bedny. Odstraňte je z cesty tak, že je vyjmete z pole [code] crates[/code]. Musíte je odstranit shora dolů pomocí funkce [code]pop_back()[/code]. Váš kód by měl odstranit všechny bedny v poli pomocí cyklu while. [b]Pozor!!![/b] Pokud neopatrně spustíte smyčku while, můžete program zablokovat. Můžete kontrolovat, zda pole [code]crates[/code] stále obsahuje hodnoty, když napíšete [code]while crates:[/code].
uk: На платформі накопичуються ящики. Пересуньте їх, витягнувши їх із масиву [code]ящиків[/code]. Вам потрібно видалити їх зверху вниз за допомогою функції [code]pop_back()[/code] масиву. Ваш код має видалити всі ящики в масиві за допомогою циклу while. [b]Обережно![/b] Якщо ви необережно запустите цикл while, ви можете заблокувати програмне забезпечення. Ви можете перевірити, чи масив [code]crates[/code] все ще містить значення, написавши [code]while crates:[/code]
zh_hant: 箱子堆積在平台上。請透過從 [code]crates[/code] 陣列中移除它們來清理空間。 你需要從上到下使用陣列的 [code]pop_back()[/code] 函式移除它們。 你的程式碼應該使用 [code]while[/code] 迴圈來移除陣列中的所有箱子。 [b]小心！[/b]如果不小心錯誤地執行 [code]while[/code] 迴圈，可能會意外造成程式鎖死。 你可以透過寫 [code]while crates:[/code] 來檢查 [code]crates[/code] 陣列是否還有資料
