Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-10-the-game-loop.po
Languages: cs, da, de, es, fr, ja, pt, ru, ta, tr, uk, zh_hant

source: As we've seen, Godot has functions that do certain actions. For example, the [code]show()[/code] and [code]hide()[/code] functions change the visibility of things. We can also create our own functions to make custom effects like adding or removing health to a character. Godot also has special functions we can customize or add to. Take the [code]_process()[/code] function.
cs: Jak jsme viděli, Godot má funkce, které provádějí určité akce. Například funkce [code]show()[/code] a [code]hide()[/code] mění viditelnost věcí. Můžeme také vytvářet vlastní funkce pro vytváření vlastních efektů, jako je přidávání nebo odebírání zdraví postavě. Godot má také speciální funkce, které si můžeme přizpůsobit nebo doplnit. Například funkce [code]_process()[/code].
de: Wie wir gesehen haben, hat Godot Funktionen, die bestimmte Handlungen ausführen. Beispielsweise ändern die Funktionen [code]show()[/code] und [code]hide()[/code] die Sichtbarkeit von Dingen. Wir können auch unsere eigenen Funktionen erstellen, um benutzerdefinierte Effekte wie das Hinzufügen oder Entfernen von Leben zu einem Charakter zu erstellen. Godot hat auch spezielle Funktionen, die wir anpassen oder ergänzen können. Schaue dir die Funktion [code]_process()[/code] an.
es: Como hemos visto, Godot tiene funciones que realizan ciertas acciones. Por ejemplo, las funciones [code]show()[/code] y [code]hide()[/code] cambian la visibilidad de las cosas. También podemos crear nuestras propias funciones para hacer efectos personalizados, como agregarle o quitarle salud a un personaje. Godot también tiene funciones especiales que podemos personalizar o añadir. Por ejemplo, toma la función [code]_process()[/code].
ru: Как мы уже видели, в Godot есть функции, которые выполняют определенные действия. Например, [code]show()[/code] и [code]hide()[/code] изменяют видимость объектов. Также мы можем создавать собственные функции, оказывающие нужные нам эффекты, например, снижающие или восстанавливающие здоровье персонажа. В Godot также есть специальные функции, которые мы можем настраивать и использовать в наших скриптах. Рассмотрим функцию [code]_process()[/code].
ta: நாம் பார்த்தபடி, கோடோட் சில செயல்களைச் செய்யும் செயல்பாடுகளைக் கொண்டுள்ளது. எடுத்துக்காட்டாக, [குறியீடு] காட்சி () [/குறியீடு] மற்றும் [குறியீடு] மறை () [/குறியீடு] செயல்பாடுகள் விசயங்களின் தெரிவுநிலையை மாற்றுகின்றன. ஒரு கதாபாத்திரத்தில் ஆரோக்கியத்தைச் சேர்ப்பது அல்லது அகற்றுவது போன்ற தனிப்பயன் விளைவுகளைச் செய்ய எங்கள் சொந்த செயல்பாடுகளையும் உருவாக்கலாம். கோடோட் நாம் தனிப்பயனாக்க அல்லது சேர்க்கக்கூடிய சிறப்பு செயல்பாடுகளையும் கொண்டுள்ளது. [குறியீடு] _PROCESS () [/குறியீடு] செயல்பாட்டை எடுத்துக் கொள்ளுங்கள்.
uk: Як ми вже бачили, в Godot є функції, які виконують певні дії. Наприклад, [code]show()[/code] і [code]hide()[/code] змінюють видимість об'єктів. Також ми можемо створювати власні функції, що надають потрібні нам ефекти, наприклад, знижують або відновлюють здоров'я персонажа. В Godot також є особливі функції, які ми можемо налаштовувати та використовувати в наших скриптах. Розгляньмо функцію [code]_process()[/code].
zh_hant: 正如我們所見，Godot 內建了一些執行特定動作的函式。例如，[code]show()[/code] 和 [code]hide()[/code] 函式可以改變物件的可見性。 我們也可以創建自己的函式，以實現自訂效果，例如為角色增加或減少生命值。 此外，Godot 還提供了一些特殊的函式，允許我們自訂或擴充其行為。 以 [code]_process()[/code] 函式為例。

source: The [code]_process()[/code] function gets its name because it does calculations or continuous actions. It's like a juice factory that [b]processes[/b] juice bottles: the bottles are always moving along a conveyor belt, while different machines operate on them.
cs: Funkce [code]_process()[/code] získá svůj název, protože provádí výpočty nebo nepřetržité akce. Je to jako továrna na džusy, která [b] zpracovává [/b] láhve na džusy: lahve se vždy pohybují podél dopravního pásu, zatímco na nich pracují různé stroje.
de: Die Funktion [code]_process()[/code] erhält ihren Namen, weil sie Berechnungen oder fortlaufende Aktionen ausführt. Es ist wie in einer Saftfabrik, die Saftflaschen [b]verarbeite[/b]t: Die Flaschen bewegen sich immer entlang eines Förderbandes, während verschiedene Maschinen mit ihnen arbeiten.
es: La función [code]_process()[/code] recibe su nombre porque realiza cálculos o acciones continuas. Es como una fábrica de jugos que [b]procesa[/b] botellas de jugo: las botellas se mueven siempre a lo largo de una cinta transportadora, mientras diferentes máquinas operan sobre ellas.
ru: Функция [code]_process()[/code] получила свое название потому, что она выполняет вычисления или непрерывные действия. Она похожа на фабрику сока, выполняющую [b]процесс обработки[/b] бутылок сока: бутылки постоянно движутся по конвейеру, а различные машины совершают операции над ними.
ta: [குறியீடு] _PROCESS () [/குறியீடு] செயல்பாடு அதன் பெயரைப் பெறுகிறது, ஏனெனில் இது கணக்கீடுகள் அல்லது தொடர்ச்சியான செயல்களைச் செய்கிறது. இது ஒரு சாறு தொழிற்சாலை போன்றது, இது [b] செயலாக்குகிறது [/b] சாறு பாட்டில்கள்: பாட்டில்கள் எப்போதும் ஒரு கன்வேயர் பெல்ட்டுடன் நகர்கின்றன, அதே நேரத்தில் வெவ்வேறு இயந்திரங்கள் அவற்றில் இயங்குகின்றன.
uk: Функція [code]_process()[/code] має таку назву тому, що вона виконує обчислення чи неперервні дії. Вона схожа на фабрику соку, яка виконує [b]процес обробки[/b] пляшок соку: пляшки постійно рухаються по конвеєру, а різні машини здійснюють операції над ними.
zh_hant: [code]_process()[/code] 函式之所以叫這個名字，是因為它負責執行計算或持續進行的動作。 它就像一座果汁工廠，[b]處理[/b]果汁瓶。瓶子會一直沿著輸送帶移動，而不同的機器會對它們進行加工。

source: [code] func _process(delta): [/code]
ta: [குறியீடு] FUNC _PROCESS (டெல்டா): [/குறியீடு]

source: The [code]_process()[/code] function takes one parameter: [code]delta[/code]. We'll look at what [code]delta[/code] is in the next lesson, as well as show how to use it.
cs: Funkce [code]_process()[/code] má jeden parametr: [code]delta[/code]. V další lekci se podíváme na to, co je [code]delta[/code], a také ukážeme, jak ji používat.
de: Die Funktion [code]_process()[/code] akzeptiert einen Parameter: [code]delta[/code]. Wir werden uns in der nächsten Lektion ansehen, was [code]delta[/code] ist, und zeigen, wie man es benutzt.
es: La función [code]_process()[/code] toma un parámetro: [code]delta[/code]. En la próxima lección veremos qué es [code]delta[/code], así como también te mostraremos cómo utilizarlo.
ru: Функция [code]_process()[/code] принимает один параметр: [code]delta[/code]. Мы рассмотрим, что такое [code]delta[/code] в следующем уроке, а также покажем, как этот параметр использовать.
ta: [குறியீடு] _PROCESS () [/குறியீடு] செயல்பாடு ஒரு அளவுருவை எடுக்கும்: [குறியீடு] டெல்டா [/குறியீடு]. [குறியீடு] டெல்டா [/குறியீடு] அடுத்த பாடத்தில் என்ன இருக்கிறது என்பதைப் பார்ப்போம், அத்துடன் அதை எவ்வாறு பயன்படுத்துவது என்பதைக் காண்பிப்போம்.
uk: Функція [code]_process()[/code] приймає один параметр: [code]delta[/code]. Що таке [code]delta[/code] ми розглянемо в наступному уроці, а також покажемо, як використовувати цей параметр.
zh_hant: [code]_process()[/code] 函式接受一個參數：[code]delta[/code]。 我們將在下堂課中介紹 [code]delta[/code] 是什麼，以及如何使用它。

source: The [code]_process()[/code] function won't do anything until we add something to it. You might notice the underscore [code]_[/code] in front of the function name. This is a convention programmers use to coordinate work, and it'll only make sense once you have experience coding in Godot. For now, all you need to know is that if the function exists in your code, and it is called precisely [code]_process[/code], then Godot will automatically run it every [i]frame[/i]. When Godot draws on the screen, we call that a frame.
de: Die Funktion [code]_process()[/code] bewirkt nichts bis wir ihr etwas hinzufügen. Achte auf den Unterstrich [code]_[/code] vor dem Funktionsnamen. Dies ist eine Konvention, die Programmierer verwenden, um ihre Arbeit zu koordinieren, und sie wird erst dann Sinn machen, wenn du etwas mehr Erfahrung mit der Programmierung in Godot hast. Im Moment musst du nur wissen, dass die Funktion von Godot automatisch bei jedem [i]frame[/i] ausgeführt wird, sobald sie existiert und [code]_process[/code] heißt. Wenn Godot auf dem Bildschirm zeichnet, nennen wir das einen Frame.
ru: Функция [code]_process()[/code] не будет ничего делать, пока мы не добавим в неё что-нибудь. Вы можете заметить подчеркивание [code]_[/code] перед именем функции. Этот символ является частью соглашения принятого разработчиками для координации работ, он станет значим для вас после того, как вы наберётесь опыта в программировании в Godot. Всё что вам нужно знать сейчас — если в вашем в коде существует функция [code]_process[/code], то Godot будет автоматически запускать её каждый [i]кадр[/i]. Когда Godot рисует на экране, мы называем это кадром.
ta: [குறியீடு] _ செயல்முறை () [/குறியீடு] செயல்பாடு நாம் ஏதாவது சேர்க்கும் வரை எதையும் செய்யாது. செயல்பாட்டு பெயருக்கு முன்னால் உள்ள அடிக்கோடிட்டு [குறியீடு] _ [/குறியீடு] ஐ நீங்கள் கவனிக்கலாம். இது வேலையை ஒருங்கிணைக்க ஒரு மாநாட்டு புரோகிராமர்கள் பயன்படுத்தும் ஒரு மாநாட்டு, நீங்கள் கோடோட்டில் அனுபவக் குறியீட்டு முறை கிடைத்தவுடன் மட்டுமே இது அர்த்தமுள்ளதாக இருக்கும். இப்போதைக்கு, நீங்கள் தெரிந்து கொள்ள வேண்டியது என்னவென்றால், உங்கள் குறியீட்டில் செயல்பாடு இருந்தால், அது துல்லியமாக [குறியீடு] _ செயல்முறை [/குறியீடு] என்று அழைக்கப்படுகிறது, பின்னர் கோடோட் தானாகவே ஒவ்வொரு [i] சட்டகத்தையும் இயக்கும் [/i]. கோடோட் திரையில் வரையும்போது, அதை ஒரு சட்டகம் என்று அழைக்கிறோம்.
uk: Функція [code]_process()[/code] не буде нічого робити, поки ми не додамо в неї що-небудь. Можливо, ви помітити підкреслення [code]_[/code] перед назвою функції. Цей символ є частиною домовленості розробників для координації робіт, він набуде для вас сенсу після того, як у вас з'явиться досвід програмування в Godot. Все що вам потрібно знати зараз – якщо у вашому коді є функція [code]_process[/code], то Godot буде автоматично запускати її для кожного [i]кадру[/i]. Коли Godot малює на екрані, ми називаємо це кадром.
zh_hant: [code]_process()[/code] 函式在我們為它添加內容之前不會做任何事。 你可能會注意到函式名稱前面的底線("_")。這是程式設計師用來協調工作的慣例，直到你在 Godot 中有一定的編程經驗後，這個習慣才會變得有意義。 目前，你只需要知道的是，如果函式存在於你的程式碼中，並且它的名稱正好是 [code]_process[/code]，那麼 Godot 就會自動在每個[b]幀[/b]更新時執行它。 當 Godot 在螢幕上繪製畫面時，我們稱之為一個幀。

source: It's perhaps better to see the [code]_process()[/code] function in action. Take the following example.
cs: Možná je lepší vidět funkci [code]_process()[/code] v akci. Vezměte si následující příklad.
de: Es ist vielleicht besser, die Funktion [code]_process()[/code] in Aktion zu sehen. Nehmen wir das folgende Beispiel.
es: Quizá sea mejor ver la función [code]_process()[/code] en acción Toma el siguiente ejemplo.
ru: Чтобы ответить на этот вопрос, давайте посмотрим на функцию [code]_process()[/code] в действии. Рассмотрим следующий пример.
ta: [குறியீடு] _ நடைமுறையில் () [/குறியீடு] செயல்பாட்டைப் பார்ப்பது நல்லது. பின்வரும் உதாரணத்தை எடுத்துக் கொள்ளுங்கள்.
uk: Щоб відповісти на це питання, погляньмо на функцію [code]_process()[/code] в дії. Розгляньмо такий приклад.
zh_hant: 或許親自看看 [code]_process()[/code] 函式如何運作更好。 請看以下範例。

source: When you click the button [code]set_process(true)[/code], you activate processing on the robot. From there, every frame, Godot runs the [code]_process()[/code] function. Since we wrote a [code]rotate()[/code] instruction, Godot is rotating the character by [code]0.05[/code] radians [b]many[/b] times a second.
cs: Když kliknete na tlačítko [code]set_process(true)[/code], aktivujete zpracování robota. Odtud Godot každý snímek spustí funkci [code]_process()[/code]. Protože jsme napsali instrukci [code]rotate()[/code], Godot otáčí postavu o [code]0,05[/code] radiánů [b]mnohokrát[/b] za sekundu.
de: Wenn Du auf die Schaltfläche [code]set_process(true)[/code] klickst, aktivierst Du die Verarbeitung auf dem Roboter. Von dort aus führt Godot in jedem Frame die Funktion [code]_process()[/code] aus. Da wir eine [code]rotate()[/code]-Anweisung geschrieben haben, dreht Godot den Roboter um [code]0,05[/code] Bogenmaß [b]viele[/b] Male pro Sekunde.
es: Cuando haces clic en el botón [code]set_process(true)[/code], activas el procesamiento en el robot. A partir de ahí, en cada fotograma, Godot ejecuta la función [code]_process()[/code]. Como hemos escrito una instrucción [code]rotate()[/code], Godot gira el personaje [code]0.05[/code] radianes [b]muchas[/b] veces por segundo.
ru: Нажатием кнопки [code]set_process(true)[/code] вы активируете дальнейшее выполнение процесса на роботе. После этого каждый кадр Godot запускает функцию [code]_process()[/code]. Поскольку мы написали инструкцию [code]rotate()[/code], Godot поворачивает персонажа на [code]0.05[/code] радиан [b]много[/b] раз в секунду.
ta: நீங்கள் பொத்தானைக் சொடுக்கு செய்தால் [குறியீடு] set_process (உண்மை) [/குறியீடு], நீங்கள் ரோபோவில் செயலாக்கத்தை செயல்படுத்துகிறீர்கள். அங்கிருந்து, ஒவ்வொரு சட்டகமும், கோடோட் [குறியீடு] _ செயல்முறை () [/குறியீடு] செயல்பாட்டை இயக்குகிறது. நாங்கள் ஒரு [குறியீடு] சுழலும் () [/குறியீடு] அறிவுறுத்தலை எழுதியுள்ளதால், கோடோட் [குறியீடு] 0.05 [/குறியீடு] ரேடியன்கள் [b] பல [/b] ஒரு நொடிக்கு எழுத்துக்களை சுழற்றுகிறது.
uk: Натиском кнопки [code]set_process(true)[/code] ви активуєте подальше виконання процесу для робота. Після цього для кожного кадру Godot запускає функцію [code]_process()[/code]. Оскільки ми написали інструкцію [code]rotate()[/code], Godot повертає персонажа на [code]0.05[/code] радіан [b]багато[/b] разів на секунду.
zh_hant: 當你點擊按鈕 [code]set_process(true)[/code] 時，你會啟動機器人的處理功能。 從那時起，每一幀，Godot 都會執行 [code]_process()[/code] 函式。 由於我們寫了 [code]rotate()[/code] 指令，Godot 會每秒旋轉角色 [code]0.05[/code] 弳度 [b]多次[/b]。

source: The faster your computer, the more times [code]_process()[/code] will run. Godot will try and run [code]_process()[/code] as quickly as it can. This makes sure any movement or animations look smooth and fluid.
cs: Čím rychlejší je váš počítač, tím vícekrát se [code]_process()[/code] spustí. Godot se bude snažit spustit [code]_process()[/code] co nejrychleji. Tím se zajistí, že jakýkoli pohyb nebo animace budou vypadat plynule a hladce.
de: Je schneller Dein Computer ist, desto öfter wird [code]_process()[/code] ausgeführt. Godot wird versuchen, [code]_process()[/code] so schnell wie möglich auszuführen. Dies stellt sicher, dass alle Bewegungen oder Animationen glatt und flüssig aussehen.
es: Cuanto más rápido sea tu computadora, más veces se ejecutará [code]_process()[/code]. Godot intentará ejecutar [code]_process()[/code] tan rápido como pueda. Esto asegura que cualquier movimiento o animación se vea de forma suave y fluida.
ru: Чем быстрее ваш компьютер, тем чаще будет выполняться [code]_process()[/code]. Godot постарается выполнить [code]_process()[/code] так быстро, как только сможет. Благодаря этому любое движение или анимация выглядят плавными и текучими.
ta: உங்கள் கணினி வேகமாக, அதிக முறை [குறியீடு] _ செயல்முறை () [/குறியீடு] இயங்கும். கோடோட் [குறியீடு] _ நடைமுறைக்கு () [/குறியீடு] முடிந்தவரை விரைவாக முயற்சித்து இயக்கும். இது எந்த இயக்கம் அல்லது அனிமேசன்கள் மென்மையாகவும் திரவமாகவும் இருப்பதை உறுதி செய்கிறது.
uk: Що швидший ваш комп'ютер, то частіше виконуватиметься [code]_process()[/code]. Godot намагається виконати [code]_process()[/code] якомога швидше. Завдяки цьому будь-який рух або анімація виглядають плавними.
zh_hant: 你的電腦越快，[code]_process()[/code] 執行的次數就會越多。 Godot 會盡可能快地執行 [code]_process()[/code]，這樣可以確保任何的移動或動畫看起來都平滑且流暢。

source: Make the robot rotate slowly by adding to the [code]_process()[/code] function. A rotation speed of about [code]0.05[/code] each frame should do.
cs: Přimějte robota, aby se pomalu otáčel, přidáním funkce [code]_process()[/code]. Měla by stačit rychlost otáčení přibližně [code]0,05[/code] v každém snímku.
de: Lasse den Roboter langsam rotieren, indem Du die Funktion [code]_process()[/code] erweiterst. Eine Rotationsgeschwindigkeit von etwa [code]0.05[/code]Bogenmaß pro Frame sollte reichen.
es: Haz que el robot gire lentamente añadiendo código a la función [code]_process()[/code]. Una velocidad de rotación de aproximadamente [code]0.05[/code] por fotograma debería de ser suficiente.
ru: Заставьте робота медленно вращаться, изменив функцию [code]_process()[/code]. Скорости вращения в [code]0.05[/code] радиан за кадр будет достаточно.
ta: [குறியீடு] _PROCESS () [/குறியீடு] செயல்பாட்டில் சேர்ப்பதன் மூலம் ரோபோவை மெதுவாக சுழற்றுங்கள். ஒவ்வொரு சட்டமும் செய்ய வேண்டிய [குறியீடு] 0.05 [/குறியீடு] சுழற்சி விரைவு.
uk: Змусьте робота повільно обертатися, змінивши функцію [code]_process()[/code]. Швидкості обертання [code]0.05[/code] радіан на кадр вистачить.
zh_hant: 在 [code]_process()[/code] 函式中添加程式碼讓機器人慢慢旋轉。 每一幀旋轉約 [code]0.05[/code] 應該就可以了。

source: Make the robot move in a large circle slowly by rotating it and simultaneously moving it along its x direction. To do this, add the [code]rotate()[/code] and [code]move_local_x()[/code] functions to [code]_process()[/code]. Use a rotation speed of [code]0.05[/code] radians per frame, and move the robot [code]5[/code] pixels per frame.
cs: Nechte robota pohybovat se ve velkém kruhu pomalu tím, že ho otočíte a současně ho pohybujete po jeho směru x. Chcete-li to provést, přidejte funkce [code]rotate()[/code] a [code]move_local_x()[/code] do funkce [code]_process()[/code]. Použijte rychlost otáčení [code]0,05[/code] radiánů na snímek a pohybujte robotem [code]5[/code] pixelů na snímek.
de: Lasse den Roboter sich langsam in einem großen Kreis bewegen, indem Du ihn drehst und gleichzeitig in seiner x-Richtung bewegst. Füge dazu die Funktionen [code]rotate()[/code] und [code]move_local_x()[/code] zu [code]_process()[/code] hinzu. Verwende eine Rotationsgeschwindigkeit von [code]0,05[/code] Bogenmaß pro Frame und bewege den Roboter [code]5[/code] Pixel pro Frame.
es: Haz que el robot se mueva lentamente en un gran círculo, girándolo y moviéndolo simultáneamente a lo largo de su dirección x. Para hacer esto, agrega las funciones [code]rotate()[/code] y [code]move_local_x()[/code] a [code]_process()[/code]. Utiliza una velocidad de rotación de [code]0.05[/code] radianes por fotograma, y mueve el robot [code]5[/code] pixeles por fotograma.
ru: Заставьте робота медленно двигаться по большому кругу, вращая его и одновременно перемещая вдоль направления x. Для этого добавьте функции [code]rotate()[/code] и [code]move_local_x()[/code] в [code]_process()[/code]. Используйте скорость вращения [code]0.05[/code] радиан за кадр и перемещайте робота на [code]5[/code] пикселей каждый кадр.
ta: ரோபோவை ஒரு பெரிய வட்டத்தில் மெதுவாகச் சுழற்றி அதன் ஃச் திசையில் நகர்த்துவதன் மூலம் மெதுவாக நகர்த்தவும். இதைச் செய்ய, [குறியீடு] சுழற்சி () [/குறியீடு] மற்றும் [குறியீடு] MOVE_LOCAL_X () [/குறியீடு] செயல்பாடுகளை [குறியீடு] _PROCESS () [/குறியீடு] இல் சேர்க்கவும். ஒரு சட்டகத்திற்கு [குறியீடு] 0.05 [/குறியீடு] ரேடியன்களின் சுழற்சி வேகத்தைப் பயன்படுத்தவும், மேலும் ஒரு சட்டகத்திற்கு ரோபோ [குறியீடு] 5 [/குறியீடு] பிக்சல்களை நகர்த்தவும்.
uk: Змусьте робота повільно рухатися великим колом, обертаючи його й одночасно переміщуючи вздовж напрямку x. Для цього додайте в [code]_process()[/code] функції [code]rotate()[/code] і [code]move_local_x()[/code]. Використовуйте швидкість обертання [code]0.05[/code] радіана на кадр и переміщуйте робота на [code]5[/code] пікселів на кадр.
zh_hant: 讓機器人慢慢沿著大圓形移動，透過旋轉它並同時沿著 x 方向移動。 為此，將 [code]rotate()[/code] 和 [code]move_local_x()[/code] 函式加入 [code]_process()[/code] 中。 每一幀使用 [code]0.05[/code] 弧度的旋轉速度，並讓機器人每一幀移動 [code]5[/code] 像素。

source: The [code]_process()[/code] function won't do anything until we add something to it. You might notice the underscore [code]_[/code] in front of the function name. This is a convention. It means the function is already defined by Godot. If the function exists, and is called exactly [code]_process[/code], then Godot will automatically run it every frame.
es: La función [code]_process()[/code] no hará nada hasta que le agreguemos algo. Puedes observar el guión bajo [code]_[/code] delante del nombre de la función. Esta es una convención. Significa que la función ya está definida por Godot. Si la función existe y se llama exactamente [code]_process[/code], entonces Godot la ejecutará automáticamente en cada fotograma.
