Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-26-looping-over-dictionaries.po
Languages: cs, da, de, it, ja, pt, pt_br, ru, ta, tr, uk, zh_hant

source: Like with arrays, you can loop over dictionaries. You can loop over both their keys and values.
da: Ligesom med arrays, kan du loope over ordbøger. Du kan loope over både deres nøgler og værdier.
de: Wie bei Arrays kannst du auch Dictionaries mittels einer Schleife durchlaufen. Du kannst sowohl ihre Schlüssel (Keys) als auch ihre Werte (Values) durchlaufen.
it: Come con gli array, puoi manipolare con un ciclo i dizionari. Puoi farlo sia con le chiavi e sia con i valori.
ja: 配列と同様に、辞書をループできます。キーと値の両方をループできます。
pt: Assim como com os arrays, pode fazer um loop sobre os dicionários. Pode fazer um loop sobre as chaves e valores deles.
pt_br: Assim como com os arrays, você pode fazer um loop sobre os dicionários. Você pode fazer um loop sobre suas chaves e valores.
ru: Вы можете перебирать элементы словарей в цикле так же, как элементы массивов. Перебрать циклом можно как ключи, так и значения.
tr: Dizilerde olduğu gibi, sözlükler üzerinde de döngü oluşturabilirsiniz. Hem anahtarların hem de değerlerin üzerinde döngü oluşturabilirsiniz.
uk: Як і у випадку з масивами, ви можете перебирати словники. Ви можете переглядати як їхні ключі, так і значення.

source: Let's see how it works with two examples.
da: Lad os se, hvordan det virker med to eksempler.
de: Schauen wir anhand der beiden Beispiele, wie das funktioniert.
it: Vediamo come si può fare con due esempi.
ja: 2つの例でどのように機能するか見てみましょう。
pt: Vamos ver como funciona com dois exemplos.
pt_br: Vamos ver como funciona com dois exemplos.
ru: Давайте посмотрим на несколько примеров того, как это работает.
tr: İki örnekle nasıl çalıştığını görelim.
uk: Давайте подивимося, як це працює, на двох прикладах.

source: Displaying an inventory's content
cs: Zobrazení obsahu inventáře
da: Viser et lagers indhold
de: Anzeigen des Inhalts eines Inventars
it: Mostrando un contenuto dell'inventario
ja: インベントリーのコンテンツの表示
pt: Exibindo o conteúdo de um inventário
pt_br: Exibindo o conteúdo de um inventário
ru: Отображение содержимого инвентаря
ta: சரக்குகளின் உள்ளடக்கத்தைக் காண்பிக்கும்
tr: Bir envanterin içeriğini görüntülemek
uk: Відображення вмісту інвентарю=
zh_hant: 顯示背包中的內容

source: To display the player's inventory, you need to know what it contains. You need the name and amount of each object.
da: For at vise spillerens lager, skal du vide, hvad det indeholder. Du har brug for navnet og mængden af hvert objekt.
de: Um das Inventar des Spielers anzuzeigen, musst du wissen, was es enthält. Du benötigst den Namen und die Menge jedes Objekts.
it: Per visualizzare l'inventario del giocatore, devi sapere cosa contiene. Hai bisogno del nome e della quantità di ogni oggetto.
ja: プレイヤーのインベントリを表示するには、そのインベントリに何が含まれているかを知る必要があります。各オブジェクトの名前と金額が必要です。
pt: Para exibir o inventário do jogador, deve saber o que esse inventário contém. Precisa do nome e quantidade de cada objeto.
pt_br: Para exibir o inventário do jogador, você precisa saber o que esse inventário contém. Você precisa do nome e quantidade de cada objeto.
ru: Для отображения инвентаря игрока вам нужно знать, что он содержит. Вам нужно имя и количество каждого объекта.
tr: Oyuncunun envanterini görüntülemek için, neleri içerdiğini bilmeniz gerekir. Her nesnenin adına ve miktarına ihtiyacınız vardır.
uk: Щоб відобразити інвентар гравця, потрібно знати, що він містить. Потрібно вказати назву та суму кожного об’єкта.

source: And from code, you can only achieve that by looping over the whole dictionary and processing key-value pairs one by one.
da: Og via kode, kan du kun opnå dette ved at loope over hele ordbogen og behandle nøgleværdipar en efter en.
de: Vom Code aus kannst du das nur erreichen, indem du das gesamte Dictionary in einer Schleife durchläufst und Schlüssel-Wert-Paare (key-value pairs) nacheinander verarbeitest.
it: Dal codice, l'unico modo per accedere a queste informazioni è attraverso dei cicli che analizzando l'intero dizionario e processano le coppie chiave-valore ona ad una.
ja: また、コードからは、辞書全体をループし、キーと値のペアを 1 つずつ処理することによってのみ、これを実現することができます。
pt: E a partir do código, só pode conseguir isso fazendo um loop em todo o dicionário e processando os pares de valores-chave um por um.
pt_br: E a partir do código, você só pode conseguir isso fazendo um loop em todo o dicionário e processando os pares de valores-chave um por um.
ru: Единственный способ сделать это в коде — пройтись циклом по всему словарю и обработать пары ключ-значение одну за одной.
tr: Ve kodunuzun içinde, bunu yalnızca sözlüğün tamamı üzerinde döngü oluşturarak, ve anahtar-değer çiftlerini tek tek işleyerek başarabilirsiniz.
uk: А з коду ви можете досягти цього лише шляхом циклічного перегляду всього словника та обробки пар ключ-значення одну за одною.

source: To get the list of keys in the dictionary, you can call its [code]keys()[/code] member function.
da: For at få listen over nøgler i ordbogen, kan du kalde dens [code]keys()[/code] medlemsfunktion.
de: Um die Liste der Schlüssel (Keys) im Dictionary abzurufen, kannst du die [code]keys()[/code]-Memberfunktion aufrufen.
it: Per ottenere la lista di chiavi nel dizionario, puoi chiamare la sua funzione membro [code]keys()[/code].
ja: 辞書内のキーのリストを取得するには、その [code]keys()[/code] メンバー関数を呼び出します。
pt: Para obter a lista de chaves no dicionário, pode chamar a função membro deles [code]keys()[/code].
pt_br: Para obter a lista de chaves no dicionário, você pode chamar sua função membro [code]keys()[/code].
ru: Для получения списка ключей словаря вы можете вызвать его внутреннюю функцию [code]keys()[/code].
tr: Sözlükteki anahtarların listesini almak için [code]keys()[/code] (anahtarlar) üye fonksiyonunu çağırabilirsiniz.
uk: Щоб отримати список ключів у словнику, ви можете викликати його функцію-член [code]keys()[/code].

source: But it's something we do so much that you don't need to call the function.
da: Men det er noget, vi gør så ofte, at du ikke behøver at kalde funktionen.
de: Aber das ist etwas, was wir so oft tun, dass du die Funktion nicht aufrufen musst.
ja: しかし、これは私たちが行うことなので、関数を呼び出す必要はありません。
pt: Mas é o que fazemos tanto que não precisa chamar a função.
pt_br: Mas é algo que fazemos tanto que você não precisa chamar a função.
ru: Нам это нужно настолько часто, что для этого предусмотрен более лёгкий способ.
tr: Ancak bu o kadar çok yaptığımız bir şey ki, bu fonksiyonu çağırmanıza gerek yok.
uk: Але ми так багато робимо, що вам не потрібно викликати функцію.

source: Instead, you can directly [ignore]type the variable name in a [code]for[/code] loop after the [code]in[/code] keyword. The language understands that you implicitly want to loop over the dictionary's keys.
da: I stedet kan du direkte skrive variabelnavnet i en [code]for[/code]-løkke efter nøgleordet [code]in[/code]. Sproget forstår, at du implicit vil løbe hen over ordbogens nøgler.
de: Stattdessen kannst du den Variablennamen direkt in eine [code]for[/code]-Schleife nach dem Schlüsselwort [code]in[/code] eingeben. Die Programmiersprache versteht, dass du die Schleife auf die Schlüssel (Keys) des Dictionary anwenden möchtest.
it: Invece, puoi direttamente scrivere il nome della variabile in un ciclo [code]for[/code] dopo la parola chiave [code]in[/code]. Il linguaggio capisce implicitamente che vuoi accedere in modo ciclico alle chiavi del dizionario.
ja: 代わりに、[code]in[/code]キーワードの後に[code]for[/code]ループで変数名を直接[無視]入力できます。言語は、辞書のキーを暗黙的にループする必要があることを理解します。
pt_br: Ao invés disso, você pode digitar diretamente o nome da variável em um loop [code]for[/code] após a palavra-chave [code]in[/code]. A linguagem entende que você deseja fazer um loop sobre as chaves do dicionário implicitamente.
ru: Вместо вызова этой функции вы можете напрямую ввести имя переменной в цикл [code]for[/code] после ключевого слова [code]in[/code]. Godot поймёт, что вы хотите пройтись по ключам словаря в цикле.
tr: Bunun yerine, [code]for[/code] döngüsünde, [code]in[/code] (içinde) anahtar sözcüğünden sonra doğrudan değişkenin adını yazabilirsiniz. Dil, dolaylı olarak sözlüğün anahtarları üzerinde döngü yapmak istediğinizi anlar.
uk: Натомість ви можете безпосередньо [ігнорувати]ввести назву змінної в циклі [code]for[/code] після ключового слова [code]in[/code]. Мова розуміє, що ви неявно хочете перейти до ключів словника.

source: You can get the values with the syntax [code]dictionary[key][/code] as you learned in the previous lesson.
da: Du kan få værdierne med syntaksen [code]dictionary[key][/code], som du lærte i den forrige lektion.
de: Du kannst die Werte mit der Syntax [code]dictionary[key][/code] abrufen, wie du in der vorherigen Lektion gelernt hast.
it: Puoi ottenere i valori usando la seguente sintassi [code]dictionary[key][/code], come hai già imparato nella lezione precedente.
ja: 前のレッスンで学習したように、構文 [code]dictionary[key][/code] を使用して値を取得できます。
pt: Pode obter os valores com a sintaxe [code]dictionary[key][/code] conforme aprendeu na lição anterior.
pt_br: Você pode obter os valores com a sintaxe [code]dictionary[key][/code] conforme aprendeu na lição anterior.
ru: В прошлых уроках вы научились получать значения при помощи конструкции [code]dictionary[key][/code].
tr: Önceki derste öğrendiğiniz gibi [code]sözlük_değişkeni[anahtar][/code] sözdizimi ile değerleri alabilirsiniz.
uk: Ви можете отримати значення за допомогою синтаксису [code]словник[ключ][/code], як ви вивчали на попередньому уроці.

source: We can loop over the inventory keys, get the corresponding values, and display all that information in the user interface.
da: Vi kan løbe over lager-nøglerne, få de tilsvarende værdier og vise alle disse oplysninger i brugergrænsefladen.
de: Wir können die Inventarschlüssel (Keys) durchlaufen, die entsprechenden Werte abrufen und alle diese Informationen in der Benutzeroberfläche anzeigen.
it: Possiamo accedere ciclicamente alle chiavi dell'inventario, prendere il valore corrispondente e visualizzare tutte queste informazioni nell'interfaccia utente.
ja: インベントリ キーをループし、対応する値を取得して、そのすべての情報をユーザー インターフェイスに表示できます。
pt: Podemos percorrer as chaves de inventário, obter os valores correspondentes e exibir todas essas informações na interface do utilizador.
pt_br: Podemos percorrer as chaves de inventário, obter os valores correspondentes e exibir todas essas informações na interface do usuário.
ru: Мы можем перебирать ключи в инвентаре, получать значения по этим ключам и отображать всю эту информацию в интерфейсе пользователя.
tr: Envanter anahtarları üzerinde döngü yapabilir, karşılık gelen değerleri alabilir, ve tüm bu bilgileri kullanıcı arayüzünde görüntüleyebiliriz.
uk: Ми можемо перейти до ключів інвентаризації, отримати відповідні значення та відобразити всю цю інформацію в інтерфейсі користувача.

source: Instead of printing the key-value pairs to the output console, we can code and call a dedicated function that displays items in the user interface.
cs: Místo vypisování dvojic klíč-hodnota na výstupní konzolu můžeme nakódovat a zavolat vyhrazenou funkci, která zobrazí položky v uživatelském rozhraní.
da: I stedet for at udskrive nøgle-værdi-parrene til outputkonsollen, kan vi kode og kalde en dedikeret funktion, der viser elementer i brugergrænsefladen.
de: Anstatt die Schlüssel-Wert-Paare (key-value pairs) in die Ausgabekonsole zu schreiben, können wir eine Funktion programmieren und aufrufen, die Elemente in der Benutzeroberfläche anzeigt.
it: Al posto di stampare le coppie di chiavi-valori sulla console, possiamo programmare una funzione dedicata che mostra gli oggetti nell'interfaccia utente.
ja: キーと値のペアを出力コンソールに出力する代わりに、ユーザー インターフェイスに項目を表示する専用の関数をコーディングして呼び出すことができます。
pt: Ao invés de imprimir os pares chave-valor no console de saída, podemos programar e chamar uma função dedicada que exibe itens na interface do utilizador.
pt_br: Ao invés de imprimir os pares chave-valor no console de saída, podemos programar e chamar uma função dedicada que exibe itens na interface do usuário.
ru: Вместо того, чтобы выводить пары ключ-значение в консоль, мы можем написать и вызвать специальную функцию для отображения предметов в пользовательском интерфейсе.
ta: வெளியீட்டு கன்சோலுக்கு முக்கிய மதிப்பு சோடிகளை அச்சிடுவதற்குப் பதிலாக, பயனர் இடைமுகத்தில் உருப்படிகளைக் காண்பிக்கும் பிரத்யேக செயல்பாட்டை குறியிட்டு அழைக்கலாம்.
tr: Anahtar-değer çiftlerini çıktı penceresine yazdırmak yerine, bu öğeleri kullanıcı arayüzünde görüntüleyen özel bir fonksiyon kodlayıp çağırabiliriz.
uk: Замість того, щоб виводити пари ключ-значення на консоль виводу, ми можемо закодувати та викликати спеціальну функцію, яка відображає елементи в інтерфейсі користувача.
zh_hant: 我們可以編寫並呼叫一個專門顯示物品的函式，將項目顯示在使用者介面上，而不是將鍵值對輸出到控制台。

source: Mapping grid cells to units
cs: Mapování buněk mřížky na jednotky
da: Kortlægning af gitterceller til enheder
de: Zuordnen von Rasterzellen zu Einheiten
it: Mappando le unità nelle celle della griglia
ja: グリッドセルを単位にマッピングする
pt: Mapeando células de grid para unidades
pt_br: Mapeando células de grid para unidades
ru: Сопоставление ячейки сетки с юнитами
ta: கட்டம் செல்களை அலகுகளுக்கு மேப்பிங் செய்வது
tr: Izgara hücrelerini birimlere eşlemek
uk: Відображення клітинок сітки в одиниці
zh_hant: 將網格座標對應到單位

source: We can also use a dictionary to map units to their position on a game board.
da: Vi kan også bruge en ordbog til at knytte enheder til deres position på et spillebræt.
de: Wir können auch ein Dictionary verwenden, um Einheiten ihrer Position auf einem Spielbrett zuzuordnen.
it: Possiamo in oltre utilizzare un dizionario per mappare unità alla loro posizione nella tavola di gioco.
ja: 辞書を使用して、ユニットをゲームボード上の位置にマッピングすることもできます。
pt: Também podemos usar um dicionário para mapear unidades para sua posição num tabuleiro de jogo.
pt_br: Também podemos usar um dicionário para mapear unidades para sua posição em um tabuleiro de jogo.
ru: Использовать словари, также, можно для сопоставления юнитов с их позицией на игровой доске.
tr: Birimleri, bir oyun tahtasındaki konumlarına eşlemek için bir sözlük de kullanabiliriz.
uk: Ми також можемо використовувати словник, щоб зіставити одиниць з їхньою позицією на ігровому полі.

source: That's how you'd typically code a board game, a grid-based RPG, or a tactical RPG.
da: Det er sådan, man typisk ville kode et brætspil, et gitterbaseret RPG eller et taktisk RPG.
de: So würdest Du normalerweise ein Brettspiel, ein Raster-basiertes RPG oder ein taktisches RPG programmieren.
it: Così è come di solito si programma un gioco da tavola, un RPG basato su griglia o un RPG tattico.
ja: これは、ボードゲーム、グリッドベースのRPG、または戦術RPGの一般的なコーディング方法です。
pt: É assim que normalmente programa um jogo de tabuleiro, um RPG baseado num grid ou um RPG tático.
pt_br: É assim que você normalmente programa um jogo de tabuleiro, um RPG baseado em grid ou um RPG tático.
ru: Именно так обычно и создаются настольные игры, grid-based RPG и тактические RPG.
tr: Genellikle bir masa oyununu, ızgara tabanlı bir RPG'yi, veya taktiksel bir RPG'yi bu şekilde kodlarsınız.
uk: Так ви зазвичай кодуєте настільну гру, рольову гру на основі сітки чи тактичну рольову гру.

source: While we focused on [code]String[/code] keys so far, GDScript dictionaries accept any value type as a key, allowing you to map anything to anything.
da: Selvom vi indtil videre har fokuseret på [code]String[/code]-nøgler, accepterer GDScript-ordbøger enhver værditype som en nøgle, hvilket giver dig mulighed for at knytte hvad som helst til hvad som helst.
de: Während wir uns bisher auf [code]String[/code]-Schlüssel (Keys) konzentriert haben, akzeptieren GDScript-Dictionaries jeden Werttyp als Schlüssel, sodass Du alles zu allem zuordnen kannst.
it: Anche se ci siamo concentrati su chiavi in formato [code]String[/code] fin'ora, ma i dizionari in GDScript accettano ogni tipo di valore come chiave! Questo ti permette di mappare qualsiasi cosa con qualsiasi altra.
ja: ここまでは[code]String[/code]キーに焦点を当ててきましたが、GDScript辞書は任意の値型をキーとして受け入れ、あらゆるものを何にでもマッピングすることができます。
pt: Enquanto nos concentramos em chaves [code]String[/code] até agora, os dicionários em GDScript aceitam qualquer tipo de valor como chave, permitindo que mapeie qualquer coisa para qualquer coisa.
pt_br: Enquanto nos concentramos em chaves [code]String[/code] até agora, os dicionários em GDScript aceitam qualquer tipo de valor como chave, permitindo que você mapeie qualquer coisa para qualquer coisa.
ru: Хотя до сих пор мы фокусировались на ключах [code]String[/code], словари в GDScript позволяют использовать ключи любого типа, что позволяет сопоставлять что угодно с чем угодно.
tr: Şimdiye kadar dize tipinde ([code]String[/code]) anahtarlarına odaklanmış olsak ta, GDScript sözlükleri herhangi bir değer tipini anahtar olarak kabul edebilir, ve herhangi bir şeyi herhangi başka bir şeyle eşlemenize olanak tanır.
uk: Поки що ми зосереджувалися на ключах [code]String[/code], словники GDScript приймають будь-який тип значення як ключ, дозволяючи вам зіставляти що завгодно з чим завгодно.

source: The only limitation is that every key must be unique.
da: Den eneste begrænsning er, at hver nøgle skal være unik.
de: Die einzige Einschränkung besteht darin, dass jeder Schlüssel eindeutig sein muss.
it: L'unica limitazione è che ogni chiave deve essere unica.
ja: 唯一の制限は、すべてのキーが一意でなければならないことです。
pt: A única limitação é que cada chave deve ser única.
pt_br: A única limitação é que cada chave deve ser única.
ru: Единственное ограничение — ключи должны быть уникальными.
tr: Tek sınırlama, her anahtarın benzersiz olması gerektiğidir.
uk: Єдине обмеження полягає в тому, що кожен ключ має бути унікальним.

source: Using a [code]for[/code] loop, you can use the key-value pairs to place units on the board at the start of a game.
cs: Pomocí cyklu [code]for[/code] můžete na začátku hry umístit jednotky na hrací plochu pomocí dvojic klíč-hodnota.
da: Ved at bruge en [code]for[/code]-løkke kan du bruge nøgle-værdi-parrene til at placere enheder på spillebrættet i starten af et spil.
de: Mit einer [code]for[/code]-Schleife kannst du die Schlüssel-Wert-Paare (key-value pairs) verwenden, um zu Beginn eines Spiels Einheiten auf dem Brett zu platzieren.
it: Usando un ciclo [code]for[/code], puoi usare le coppie di chiave-valore per posizionare le unità sulla tavola all'inizio della partita.
ja: [code]for[/code] ループを使用すると、キーと値のペアを使用して、ゲームの開始時にボード上にユニットを配置できます。
pt: Usando um loop [code]for[/code], pode usar os pares chave-valor para pôr unidades no tabuleiro no início de um jogo.
pt_br: Usando um loop [code]for[/code], você pode usar os pares chave-valor para colocar unidades no tabuleiro no início de um jogo.
ru: При помощи цикла [code]for[/code] вы можете использовать пары ключ-значение для размещения юнитов на игровой доске при начале игры.
ta: [/குறியீடு] வளையத்திற்கு [குறியீடு] ஐப் பயன்படுத்தி, ஒரு விளையாட்டின் தொடக்கத்தில் பலகையில் அலகுகளை வைக்க விசை மதிப்பு சோடிகளைப் பயன்படுத்தலாம்.
tr: Oyunun başında birimleri tahtaya yerleştirmek için, [code]for[/code] döngüsünü ile anahtar-değer çiftlerini kullanabilirsiniz.
uk: Використовуючи цикл [code]for[/code], ви можете використовувати пари ключ-значення для розміщення одиниць на дошці на початку гри.
zh_hant: 使用 [code]for[/code] 迴圈，你可以使用鍵值對在遊戲開始時將單位放置在棋盤上。

source: In the following practices, you will loop over dictionaries and process their content.
cs: V následujících postupech budete procházet slovníky a zpracovávat jejich obsah.
da: I de følgende øvelser vil du gennemgå ordbøger og bearbejde deres indhold.
de: In den folgenden Übungen durchläufst du Dictionaries und verarbeitest deren Inhalt.
it: Nelle prossime pratiche, analizzerai ciclicamente dei dizionari e processerai il loro contenuto.
ja: 次の演習では、辞書をループ処理し、その内容を処理します。
pt: Nas práticas a seguir, vai fazer um loop nos dicionários e processar o conteúdo deles.
pt_br: Nas práticas a seguir, você vai fazer um loop nos dicionários e processar seu conteúdo.
ru: В следующих упражнениях вы будете перебирать содержимое словарей циклами и обрабатывать его.
ta: பின்வரும் நடைமுறைகளில், நீங்கள் அகராதிகள் மீது நுழைந்து அவற்றின் உள்ளடக்கத்தை செயலாக்குவீர்கள்.
tr: Sıradaki alıştırmalarda, sözlükler üzerinde döngü oluşturacak ve içeriklerini işleyeceksiniz.
uk: У наступних вправах ви проходите по циклу словників і оброблятимете їхній вміст.
zh_hant: 在接下來的練習中，你將會遍歷字典並處理它們的內容。

source: Displaying the inventory
cs: Zobrazení inventáře
da: Visning af lagerbeholdningen
de: Inventar anzeigen
it: Visualizzando l'inventario
ja: インベントリの照会
pt: Mostrar o inventário
pt_br: Mostrando o inventário
ru: Отображение инвентаря
ta: சரக்குகளைக் காண்பிக்கும்
tr: Envanteri görüntülemek
uk: Відображення інвентарю
zh_hant: 顯示背包的內容

source: We use a dictionary to represent the player's inventory in this game. The dictionary keys are the name of items, and they map to the number of items that the player owns.
da: Vi bruger en ordbog til at repræsentere spillerens inventar i dette spil. Ordbogsnøglerne er navnene på genstande, og de relaterer sig til antallet af genstande, som spilleren ejer.
de: Wir verwenden ein Dictionary, um das Inventar des Spielers in diesem Spiel darzustellen. Die Dictionary-Schlüssel (Keys) sind die Namen der Objekte und werden der Anzahl der Objekte zugeordnet, die der Spieler besitzt.
it: Usiamo i dizionari per rappresentare l'inventario del giocatore in questo gioco. Le chiavi del dizionario sono i nomi degli oggetti, questi sono mappati alla quantità dell'oggetto che il giocatore possiede.
ja: このゲームでは、プレイヤーのインベントリを表すために辞書を使用します。辞書キーはアイテムの名前であり、プレイヤーが所有するアイテムの数にマッピングされます。
pt: Usamos um dicionário para representar o inventário do jogador nesse jogo. As chaves do dicionário são o nome dos itens e mapeiam o número de itens que o jogador possui.
pt_br: Usamos um dicionário para representar o inventário do jogador nesse jogo. As chaves do dicionário são o nome dos itens e mapeiam o número de itens que o jogador possui.
ru: Мы используем словарь для представления инвентаря игрока в этой игре. Ключи словаря — это названия предметов, они сопоставляются с количеством таких предметов, которые есть у игрока.
tr: Bu oyunda, oyuncunun envanterini temsil etmek için bir sözlük kullanıyoruz (inventory). Sözlüğün anahtarları öğelerin isimleridir ve oyuncunun sahip olduğu öğe sayılarıyla eşlenir.
uk: Ми використовуємо словник, щоб представити інвентар гравця в цій грі. Ключі словника — це назви предметів, і вони відповідають кількості предметів, якими володіє гравець.

source: You need to loop over the dictionary and display the name and amount of every item in the inventory.
da: Du skal løbe hen over ordbogen og vise navnet og mængden af hver genstand i inventaret.
de: Durchlaufe den Dictionary um den Namen und die Menge jedes Objektes im Inventar anzuzeigen.
it: Devi analizzare ciclicamente il dizionario e mostrare il nome e la quantità di ogni oggetto nell'inventario.
ja: 辞書をループして、インベントリ内のすべてのアイテムの名前と量を表示する必要があります。
pt: Precisa percorrer o dicionário com um loop e exibir o nome e a quantidade de cada item no inventário.
pt_br: Você precisa percorrer o dicionário com um loop e exibir o nome e a quantidade de cada item no inventário.
ru: Вам нужно перебрать словарь циклом и отобразить название и количество каждого предмета в инвентаре.
tr: Sözlüğün üzerinde döngü yapmanız ve envanterdeki her öğenin adını ve miktarını görüntülemeniz gerekiyor.
uk: Вам потрібно прокрутити словник і відобразити назву та кількість кожного предмета в інвентарі.
