Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-25-creating-dictionaries.po
Languages: cs, da, es, fr, it, ja, pt, ru, ta, tr, uk, zh_hant

source: In the last lesson, we used an array to represent a player's inventory.
cs: V minulé lekci jsme použili pole k reprezentaci inventáře hráče.
da: I den sidste lektion brugte vi et array til at repræsentere en spillers lager.
es: En la última lección, utilizamos una matriz para representar el inventario de un jugador.
fr: Dans la dernière leçon, nous avons utilisé un tableau pour représenter l'inventaire d'un joueur.
it: Nell'ultima lezione, abbiamo usato un array per rappresentare l'inventario del giocatore.
ja: 前回のレッスンでは、配列を使用してプレイヤーのインベントリを表現しました。
pt: Na lição anterior, usamos um array para representar o inventário de um jogador.
tr: Son derste, bir oyuncunun envanterini temsil etmek için bir dizi kullandık.

source: With just an array of item names, though, we can't easily keep track of the amount of each item.
cs: S pouhým polem názvů položek však nemůžeme snadno sledovat množství jednotlivých položek.
da: Med bare en række navne på ting, kan vi ikke nemt kan holde styr på mængden af hver genstand.
es: Sin embargo, con sólo una matriz de nombres de objetos, no podemos llevar fácilmente la cuenta de la cantidad de cada objeto.
fr: Cependant, avec juste un tableau de noms d'objets, nous ne pouvons pas facilement garder trace de la quantité de chaque objet.
it: Però con soltanto un array di nomi di oggetti, non possiamo tenere conto delle quantità di ogni oggetto.
ja: ただし、アイテム名の配列だけでは、各アイテムの量を簡単に追跡することはできません。
pt: Com apenas um array de nomes de itens, no entanto, não podemos acompanhar facilmente a quantidade de cada item.
tr: Bununla birlikte, yalnızca bir öğe dizisi adıyla, her bir öğeden kaç tane olduğunu kolayca takip edemeyiz.

source: Instead, we can bundle the item names and amounts into a single [i]dictionary[/i].
cs: Avšak můžeme názvy položek a jejich množství spojit do jednoho [i]slovníku (dictionary) [/i].
da: I stedet kan vi pakke navne og mængde ind i en enkelt [i]ordbog[/i].
es: En su lugar, podemos agrupar los nombres de los objetos y las cantidades en un único [i]diccionario[/i].
fr: Au lieu de cela, nous pouvons regrouper les noms et les quantités des objets dans un seul [i]dictionnaire[/i] « dictionnary ».
it: Piuttosto, possiamo raggruppare i nomi degli oggetti e le relative quantità in un singolo [i]dizionario[/i].
ja: 代わりに、項目名と金額を 1 つの[i]辞書[/i]にまとめることができます。
pt: Ao invés disso, podemos agrupar os nomes e valores dos itens num único [i]dicionário[/i].
tr: Bunun yerine, öğe adlarını ve miktarlarını tek bir [i]sözlükte[/i] (dictionary) bir araya getirebiliriz.

source: A dictionary is a data structure that allows you to map pairs of values. In the pair, we call the first value a [i]key[/i] as we use it to access the second.
cs: Slovník je datová struktura, která umožňuje mapovat dvojice hodnot. V této dvojici nazýváme první hodnotu [i]klíč[/i], protože ji používáme pro přístup k druhé hodnotě.
da: En ordbog er en datastruktur, der giver dig mulighed for at kortlægge par af værdier. I parret kalder vi den første værdi en [i]nøgle[/i] som vi bruger den til at få adgang til den anden.
es: Un diccionario es una estructura de datos que te permite mapear pares de valores. En el par, llamamos al primer valor una [i]clave[/i], ya que lo utilizamos para acceder al segundo.
fr: Un dictionnaire est une structure de données qui vous permet de [i]mapper[/i], ou mettre en correspondance, des paires de valeurs. Dans la paire, nous appelons la première valeur une [i]clé[/i] « key » car nous l'utilisons pour accéder à la seconde.
it: Un dizionario è una struttura di dati che ti permette di mappare una coppia di valori. In questa coppia, chiamiamo il primo valore una [i]chiave[/i] dato che lo usiamo per ottenere il secondo.
ja: ディクショナリは、値のペアをマッピングできるデータ構造です。ペアでは、最初の値を[i]キー[/i]と呼び、それを使用して 2 番目の値にアクセスします。
pt: Um dicionário é uma estrutura de dados que permite mapear pares de valores. No par, chamamos o primeiro valor de [i]chave[/i] enquanto o usamos para aceder o segundo.
tr: Bir sözlük, değer çiftlerini eşlemenize olanak tanıyan bir veri yapısıdır. Bu çifti, birinci değeri bir [i]anahtar[/i] (ya da adres) olarak kullanıp ikinciye erişmek için kullanırız.

source: In other words, a dictionary has a list of [i]keys[/i], and each key points to a [i]value[/i].
cs: Jinými slovy, slovník má seznam [i]klíčů[/i] a každý klíč ukazuje na [i]hodnotu[/i].
da: Med andre ord, en ordbog har en liste over [i]nøgler[/i], og hver nøglepunkter til en [i]værdi[/i].
es: En otras palabras, un diccionario tiene una lista de [i]claves[/i], y cada clave apunta a un [i]valor[/i].
fr: En d'autres termes, un dictionnaire possède une liste de [i]clés[/i], et chaque clé pointe vers une [i]valeur[/i].
it: In altre parole, un dizionario ha una lista di [i]chiavi[/i] ed ogni chiave punta ad un [i]valore[/i].
ja: つまり、辞書には[i]キー[/i]のリストがあり、各キーは[i]値[/i]を指します。
pt: Em outras palavras, um dicionário tem uma lista de [i]chaves[/i] e cada chave aponta para um [i]valor[/i].
tr: Başka bir deyişle, bir sözlük bir çeşit [i]anahtarlar[/i] listesidir ve her bir anahtar bir [i]değere[/i] işaret eder.

source: To define a dictionary, we use curly brackets. A colon separates each key and its value. A comma separates each key and value pair.
cs: Pro definici slovníku používáme složené závorky - {}. Dvojtečka odděluje každý klíč a jeho hodnotu. Čárka odděluje každou dvojici klíče a hodnoty.
da: For at definere en ordbog, bruger vi krøllede parenteser. Et kolon adskiller hver nøgle og dens værdi. Et komma adskiller hvert nøgle- og værdipar.
es: Para definir un diccionario, utilizamos llaves. Los dos puntos separan cada clave y su valor. Una coma separa cada par de clave y valor.
fr: Pour définir un dictionnaire, nous utilisons des accolades. Les deux-points séparent chaque clé et sa valeur. Une virgule sépare chaque paire clé-valeur.
it: Per definire un dizionario, usiamo le parentesi graffe. Dei due punti separano ogni chiave dal suo valore. Una virgola separa ogni coppia di chiave e valore.
ja: 辞書を定義するには、中括弧を使用します。コロンは、各キーとその値を区切ります。各キーと値のペアはコンマで区切られます。
pt: Para definir um dicionário, usamos colchetes. O sinal de dois pontos separa cada chave e o valor dele. Uma vírgula separa cada par de chaves.
tr: Bir sözlüğü tanımlamak için süslü parantezler kullanırız, "{" ve "}". Her anahtarı ve değerini, iki nokta üst üste işareti ayırır. Ve virgül de, her bir anahtar-değer çiftini ayırır.

source: Dictionaries can hold any values
cs: Slovníky mohou obsahovat libovolné hodnoty
da: Ordbøger kan holde alle værdier
es: Los diccionarios pueden contener cualquier valor
fr: Les dictionnaires peuvent contenir n'importe quelles valeurs
it: I dizionari possono conservare ogni valore
ja: 辞書は任意の値を保持できます
pt: Os dicionários podem conter quaisquer valores
ru: Словари могут содержать любые значения
ta: அகராதிகள் எந்த மதிப்புகளையும் வைத்திருக்க முடியும்
tr: Sözlükler herhangi bir değeri tutabilir
uk: Словники можуть містити будь-які значення
zh_hant: 字典可以保存任何值

source: Dictionaries can map about any value to any other value.
cs: Slovníky mohou mapovat jakoukoli hodnotu na jakoukoli jinou hodnotu.
da: Ordbøger kan knytte enhver værdi til enhver anden værdi.
es: Los diccionarios pueden mapear cualquier valor a cualquier otro valor.
fr: Les dictionnaires peuvent mapper n'importe quelle valeur avec n'importe quelle autre valeur.
it: I dizionari possono mappare praticamente ogni valore ad ogni altro.
ja: 辞書は、任意の値を他の任意の値にマップできます。
pt: Os dicionários podem mapear qualquer valor para qualquer outro valor.
tr: Sözlükler herhangi bir değeri, başka herhangi bir değerle eşleyebilir.

source: For example, we can use the name of an item as a key and the amount as the corresponding value. This makes dictionaries excellent for keeping track of a player's inventory.
cs: Jako klíč můžeme například použít název položky a jako odpovídající hodnotu částku. Díky tomu jsou slovníky vynikající pro sledování inventáře hráče.
da: For eksempel kan vi bruge navnet på en genstand som en nøgle og mængden som den tilsvarende værdi. Dette gør ordbøger fremragende til at holde styr på en spillers lager.
es: Por ejemplo, podemos utilizar el nombre de un objeto como clave y la cantidad como valor correspondiente. Esto hace que los diccionarios sean excelentes para llevar la cuenta del inventario de un jugador.
fr: Par exemple, nous pouvons utiliser le nom d'un objet comme clé et la quantité comme valeur correspondante. Cela rend les dictionnaires excellents pour faire un suivi de l'inventaire d'un joueur.
it: Per esempio, possiamo usare il nome di un oggetto come chiave e la quantità come valore corrispondente. Questo rende i dizionari eccellenti per implementare un inventario.
ja: たとえば、アイテムの名前をキーとして使用し、金額を対応する値として使用できます。これにより、辞書はプレイヤーのインベントリを追跡するのに最適です。
pt: Por exemplo, podemos usar o nome de um item como chave e a quantidade como o valor correspondente. Isso torna os dicionários excelentes para acompanhar o inventário de um jogador.
tr: Örneğin, bir öğenin adını anahtar olarak ve kaç tane olduğunu da karşılık gelen değer olarak kullanabiliriz. Bu, sözlükleri, bir oyuncunun envanterini takip etmek için mükemmel yapar.

source: Here we matched the name (a string) to the amount (a number). But a key could be a string, a number, or even a vector!
cs: Zde jsme přiřadili název (řetězec) k částce (číslo). Klíčem však může být řetězec, číslo nebo dokonce vektor!
da: Her matchede vi navnet (en streng) med mængden (et tal). Men en nøgle kunne være en streng, et tal eller endda en vektor!
es: Aquí hicimos coincidir el nombre (una cadena) con la cantidad (un número). Pero una clave puede ser una cadena, un número ¡o incluso un vector!
fr: Ici, nous avons fait correspondre le nom (une chaîne de caractères) à la quantité (un nombre). Mais une clé peut être une chaîne de caractères, un nombre, ou même un vecteur !
it: Qui abbiamo abbinato il nome (una stringa) alla quantità (un numero). Ma una chiave può essere una tringa, un numero o anche un vettore!
ja: ここでは、名前(文字列)と金額(数値)を一致させました。しかし、キーは文字列、数値、またはベクトルである可能性があります！
pt: Aqui combinamos o nome (uma string) com a quantidade (um número). Mas uma chave pode ser uma string, um número ou até mesmo um vetor!
tr: Burada ismi (bir dize) miktarla (bir sayı) eşleştirdik. Ancak bir anahtar, bir dize, bir sayı, ve hatta bir vektör olabilir!

source: Although we can have all of these different keys, keep in mind that every key has to be [i]unique[/i]. That means we [i]couldn't[/i] have a dictionary like the following.
cs: Ačkoli můžeme mít všechny tyto různé klíče, mějte na paměti, že každý klíč musí být [i]jedinečný[/i]. To znamená, že bychom [i]nemohli mít[/i] slovník, jako je následující.
da: Selvom vi kan have alle disse forskellige nøgler, skal man huske på, at hver nøgle skal være [i]unik[/i]. Det betyder, at vi [i]ikke kunne[/i] have en ordbog som den følgende.
es: Aunque podemos tener todas estas claves diferentes, ten en cuenta que cada clave tiene que ser [i]única[/i]. Eso significa que [i]no podríamos[/i] tener un diccionario como el siguiente:
fr: Bien que nous puissions avoir toutes ces clés différentes, gardez à l'esprit que chaque clé doit être [i]unique[/i]. Cela signifie que nous [i]ne pourrions pas[/i] avoir un dictionnaire comme le suivant.
it: Anche se possiamo avere tutte queste chiavi differenti, tieni bene a mente che ogni chiave deve essere [i]unica[/i]. Questo significa che [i]non possiamo[/i] avere un dizionario come il seguente.
ja: これらすべての異なるキーを使用できますが、すべてのキーは[i]一意[/i]である必要があることに注意してください。つまり、次のような辞書は作成[i]できませんでした[/i]。
pt: Embora possamos ter todas essas chaves diferentes, lembre-se que cada chave deve ser [i]única[/i]. Isso significa que [i]não poderíamos[/i] ter um dicionário como o desse exemplo a seguir.
tr: Bu farklı anahtarların tümünü kullanabiliyor olsak ta, her anahtarın [i]benzersiz[/i] olması gerektiğini unutmayın. Bunun anlamı, aşağıdaki gibi bir sözlüğe sahip [i]olamayacağımızdır[/i].

source: We would get the following error.
cs: Objevila by se následující chyba.
da: Vi vil få følgende fejl.
es: Obtendríamos el siguiente error.
fr: Nous obtiendrions l'erreur suivante.
it: Otterremmo il seguente errore.
ja: 次のエラーが発生します。
pt: Teríamos o seguinte erro.
ru: Это приведёт к следующей ошибке.
ta: பின்வரும் பிழையைப் பெறுவோம்.
tr: Böyle bir durumda aşağıdaki hatayı alırız. (tekrarlanan anahtar bulundu).
uk: Ми отримаємо наступну помилку.
zh_hant: 我們會得到以下錯誤。

source: In the above example, which key would cause an error?
cs: Který klíč by ve výše uvedeném příkladu způsobil chybu?
da: Hvilken nøgle ville forårsage en fejl i ovenstående eksempel?
es: En el ejemplo anterior, ¿qué clave provocaría un error?
fr: Dans l'exemple ci-dessus, quelle clé provoquerait une erreur ?
it: Nell'esempio qui sopra, quale chiave causerebbe un errore?
ja: 上記の例では、どのキーがエラーの原因になりますか?
pt: No exemplo acima, qual chave causaria um erro?
ru: Использование какого ключа приводит к ошибке в предыдущем примере?
ta: மேலே உள்ள எடுத்துக்காட்டில், எந்த விசை பிழையை ஏற்படுத்தும்?
tr: Yukarıdaki örnekte, anahtarlarda hangisi hataya sebep olur?
uk: У наведеному вище прикладі, який ключ спричинить помилку?
zh_hant: 在上面的例子，哪個鍵會造成錯誤？

source: The key [code]"healing heart"[/code] appears [b]twice[/b] in the dictionary.
cs: Klíč [code]"healing heart"[/code] se ve slovníku objevuje [b]dvakrát[/b].
da: Nøglen [code]"healing heart"[/code] optræder [b]to gange[/b] i ordbogen.
es: La clave [code]"healing heart"[/code] aparece [b]dos veces[/b] en el diccionario.
fr: La clé [code]"healing heart"[/code] apparaît [b]deux fois[/b] dans le dictionnaire.
it: La chiave [code]"healing heart"[/code] compare [b]due volte[/b] nel dizionario.
ja: キー[code]"healing heart"[/code]は辞書に[b]2回[/b]登場します。
pt: A chave [code]"healing heart"[/code] aparece [b]duas vezes[/b] no dicionário.
tr: [code]"healing heart"[/code] anahtarı, sözlükte [b]iki kez[/b] görünüyor.

source: In the above example, Godot wouldn't know whether to return [code]3[/code] or [code]8[/code] when using [code]inventory["healing heart"][/code]. This is why keys need to be unique.
cs: Ve výše uvedeném příkladu by Godot nevěděl, zda má vrátit [code]3[/code] nebo [code]8[/code] při použití [code]inventory["healing heart"][/code]. Proto musí být klíče jedinečné.
da: I ovenstående eksempel ville Godot ikke vide, om den skulle returnere [code]3[/code] eller [code]8[/code], når [code]inventory["healing heart"][/code] bliver brugt. Derfor skal nøgler være unikke.
es: En el ejemplo anterior, Godot no sabría si devolver [code]3[/code] u [code]8[/code] al utilizar [code]inventory["healing heart"][/code]. Es por esta razón que las claves deben ser únicas.
fr: Dans l'exemple ci-dessus, Godot ne saurait pas s'il doit renvoyer [code]3[/code] ou [code]8[/code] lors de l'utilisation d'[code]inventory["healing heart"][/code]. C'est pourquoi les clés doivent être uniques.
it: Nell'esempio qui sopra, Godot non saprebbe se ritornare il valore [code]3[/code] o [code]8[/code] quando viene chiamato [code]inventory["healing heart"][/code]. Questo è perchè la chiave deve essere unico.
ja: 上記の例では、Godotは[code]inventory["healing heart"][/code]を使用するときに[code]3 [/code]または[code] 8 [/code]を返すかどうかを知りません。これが、キーが一意である必要がある理由です。
pt: No exemplo acima, a Godot não saberia se deveria retornar [code]3[/code] ou [code]8[/code] ao usar [code]inventory["healing heart"][/code]. É por isso que as chaves precisam ser exclusivas.
tr: Yukarıdaki örnekte Godot, öğelere erişirken [code]inventory["healing heart"][/code] kullanırsanız, geriye [code]3[/code] mü yoksa [code]8[/code] mi döndüreceğini bilemez. Bu nedenle anahtarların benzersiz olması gerekir.

source: "healing heart"
es: "healing heart" (corazón sanador)
fr: "healing heart" (cœur de guérison)
ja: 「体力回復」
ta: "குணப்படுத்தும் இதயம்"
uk: "цілюще серце"

source: "shield"
es: "shield" (escudo)
fr: "shield" (bouclier)
ja: 「シールド」
ta: "கவசம்"
uk: "щит"

source: "sword"
es: "sword" (espada)
fr: "sword" (épée)
ja: 「剣」
ta: "வாள்"
uk: "меч"

source: How dictionaries work under the hood
cs: Jak fungují slovníky uvnitř
da: Hvordan ordbøger fungerer under kølerhjelmen
es: Cómo funcionan los diccionarios bajo el capó
fr: Comment les dictionnaires fonctionnent sous le capot
it: Come funzionano i dizionari realmente
ja: 辞書の内部でのしくみ
pt: Como os dicionários funcionam
ta: அகராதிகள் பேட்டைக்கு அடியில் எவ்வாறு செயல்படுகின்றன
tr: Sözlükler, kaputun altında, nasıl çalışır
uk: Як словники працюють під капотом
zh_hant: 字典的運作原理是如何

source: Dictionaries are also called mappings or [i]associative arrays[/i]. Under the hood, they use arrays and several functions to efficiently store and retrieve values across arrays.
cs: Slovníky se také nazývají mapování nebo [i]asociativní pole[/i]. Uvnitř používají pole a několik funkcí k efektivnímu ukládání a načítání hodnot napříč poli.
da: Ordbøger kaldes også mappings eller [i]associative arrays[/i]. Under motorhjelmen bruger de arrays og adskillige funktioner til effektivt at gemme og hente værdier på tværs af arrays.
es: Los diccionarios también se llaman mapeos o [i]matrices asociativas[/i]. Bajo el capó, utilizan matrices y varias funciones para almacenar y recuperar de forma eficiente valores en matrices.
fr: Les dictionnaires sont aussi appelés mappages ou [i]tableaux associatifs[/i]. Sous le capot, ils utilisent des tableaux et plusieurs fonctions pour stocker et récupérer efficacement des valeurs dans des tableaux.
it: I dizionari vengono anche chiamati mappature o [i]array associativi[/i]. In realtà, usano degli array e molte funzioni per conservare efficientemente e recuperare valori tra gli array.
ja: 辞書は、マッピングまたは[i]連想配列[/i]とも呼ばれます。内部的には、配列といくつかの関数を使用して、配列間で値を効率的に格納および取得します。
pt: Os dicionários também são chamados de mapeamentos ou [i]arrays associativos[/i]. Os dicionários usam arrays e várias funções para armazenar e recuperar valores entre arrays com eficiência.
tr: Sözlüklere, eşlemeler (mappings) veya [i]ilişkisel diziler[/i] de denir. Kaputun altında, diziler arasındaki değerleri verimli bir şekilde depolamak ve almak için dizileri ve çeşitli fonksiyonları kullanırlar.

source: Precisely, dictionaries use a [i]hashing algorithm[/i]. Hashing algorithms convert one value into another.
cs: Přesněji řečeno, slovníky používají [i]hashovací algoritmus[/i]. Hashovací algoritmy převádějí jednu hodnotu na jinou.
da: Præcist bruger ordbøger en [i]hashing-algoritme[/i]. Hashing-algoritmer konverterer én værdi til en anden.
es: Precisamente, los diccionarios utilizan un [i]algoritmo hash[/i]. Los algoritmos hash convierten un valor en otro.
fr: Précisément, les dictionnaires utilisent un [i]algorithme de hachage[/i]. Les algorithmes de hachage convertissent une valeur en une autre.
it: In particolare, i dizionari usano un [i]algoritmo di hashing[/i]. Gli algoritmi si hash convertono un valore in un altro.
ja: 正確には、辞書は [i]ハッシュアルゴリズム[/i]を使用します。ハッシュアルゴリズムは、ある値を別の値に変換します。
pt: Precisamente, os dicionários usam um [i]algoritmo hash[/i]. Algoritmos hash convertem um valor em outro.
tr: Tam olarak, sözlükler [i]karma (hashing) algoritması[/i] kullanır. Karma algoritmalar bir değeri başka bir değere dönüştürür.

source: In this case, hashing consists of converting a given key into a unique whole number. The dictionary then uses that number as an array's index!
cs: V tomto případě hashování spočívá v převodu daného klíče na jedinečné celé číslo. Slovník pak toto číslo použije jako index pole!
da: I dette tilfælde består hashing af at konvertere en given nøgle til et unikt heltal. Ordbogen bruger derefter dette tal som et arrays indeks!
es: En este caso, el [i]hashing[/i] consiste en convertir una clave dada en un número entero único. ¡El diccionario luego utiliza ese número como índice de una matriz!
fr: Dans ce cas, le hachage consiste à convertir une clé donnée en un nombre entier unique. Le dictionnaire utilise ensuite ce nombre comme indice d'un tableau !
it: In questo caso, hash consiste nel convertire una chiave in un numero intero unico. Il dizionario poi usa quel numero come indice dell'array!
ja: この場合、ハッシュは、特定のキーを一意の整数に変換することで構成されます。辞書は、その数値を配列のインデックスとして使用します。
pt: Nesse caso, hash consiste em converter uma determinada chave num número inteiro único. O dicionário então usa esse número como índice de um array!
tr: Bu durumda, karma oluşturma, belirli bir anahtarı benzersiz bir tam sayıya dönüştürme işlemini içerir. Sözlük daha sonra bu sayıyı bir dizi için dizin sayısı olarak kullanır!

source: That's how a dictionary works: when you give it a key, it converts it into a unique index and uses that index to retrieve the corresponding value in the computer's memory.
cs: Slovník funguje takto: když mu dáte klíč, převede jej na jedinečný index a použije tento index k načtení odpovídající hodnoty v paměti počítače.
da: Sådan fungerer en ordbog: Når du giver den en nøgle, konverterer den den til et unikt indeks og bruger dette indeks til at hente den tilsvarende værdi i computerens hukommelse.
es: Así es como funciona un diccionario: cuando le das una clave, la convierte en un índice único y utiliza ese índice para recuperar el valor correspondiente en la memoria de la computadora.
fr: C'est ainsi qu'un dictionnaire fonctionne : lorsque vous lui donnez une clé, il la convertit en un indice unique et utilise cet indice pour retrouver la valeur correspondante dans la mémoire de l'ordinateur.
it: Così funzionano i dizionari: quando gli dai una chiave, la converte in un indice unico e lo usa come indice per recuperare il valore corrispondente nella memoria del computer.
ja: 辞書は、キーを与えると、それを一意のインデックスに変換し、そのインデックスを使用してコンピューターのメモリ内の対応する値を取得します。
pt: É assim que um dicionário funciona: quando lhe dá uma chave, ele converte-a a um índice único e usa esse índice para recuperar o valor correspondente na memória do computador.
tr: Bir sözlük böyle çalışır: ona bir anahtar verdiğinizde, onu benzersiz bir dizin sayısına dönüştürür, ve bilgisayarın belleğinden karşılık gelen değeri almak için bu dizini kullanır.

source: That's also why you can't have the same key twice: it would map to the same array index, causing you to overwrite an existing value.
cs: To je také důvod, proč nemůžete mít stejný klíč dvakrát: mapoval by se na stejný index pole, což by způsobilo přepsání existující hodnoty.
da: Det er også derfor, du ikke kan have den samme nøgle to gange: den ville mappes til det samme array-indeks, hvilket får dig til at overskrive en eksisterende værdi.
es: Esa es también la razón por la que no puedes tener la misma clave dos veces: se mapearía al mismo índice de matriz, lo que haría que se sobrescribiera un valor existente.
fr: C'est aussi pourquoi vous ne pouvez pas avoir deux fois la même clé : elle correspondrait au même indice de tableau, ce qui entraînerait l'écrasement d'une valeur existante.
it: Questo è anche il motivo per cui non puoi avere la stessa chiave due volte: verrebbe mappato allo stesso indice di array, facendoti sovrascrivere un valore esistente.
ja: また、同じキーを 2 回持つことができないのもそのためです: 同じ配列インデックスにマップされ、既存の値を上書きしてしまいます。
pt: É por isso que não pode ter a mesma chave duas vezes: ela mapearia para o mesmo índice do array, fazendo com que sobrescrevesse um valor existente.
tr: Aynı anahtara iki kez sahip olamamanızın nedeni de budur: aynı dizin sayısı ile eşlenir, ve var olan bir değerin üzerine yazmanıza neden olur.

source: Accessing values
cs: Přístup k hodnotám
da: Adgang til værdier
es: Acceder a los valores
fr: Accéder aux valeurs
it: Accedere ai valori
ja: 値へのアクセス
pt: Acessando valores
ru: Получение значений
ta: மதிப்புகளை அணுகும்
tr: Değerlere erişmek
uk: Доступ до значень
zh_hant: 存取字典的值
