Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-17-while-loops.po
Languages: cs, da, de, es, fr, it, ta, tr, uk, zh_hant

source: Because we don't increment [code]number[/code] within the [code]while[/code] loop, it always stays at [code]0[/code].
da: Fordi vi ikke øger [code]number[/code] i [code]while[/code]-løkken, forbliver den altid på [code]0[/code].
de: Da wir [code]number[/code] nicht innerhalb der [code]while[/code]-Schleife inkrementieren, bleibt sie immer bei [code]0[/code].
fr: Comme nous n'incrémentons pas [code]nombre[/code] dans la boucle [code]while[/code], il reste toujours à [code]0[/code].
it: Dato che non incrementiamo [code]number[/code] all'interno del ciclo [code]while[/code], rimane sempre a [code]0[/code].
ta: [/குறியீடு] சுழற்சியில் [குறியீடு] எண்ணை [/குறியீடு] அதிகரிக்காததால், அது எப்போதும் [குறியீடு] 0 [/குறியீடு] இல் இருக்கும்.
tr: [code]while[/code] döngüsü içinde [code]number[/code] değişkenini arttırmadığımız için, her zaman [code]0[/code] değerinde kalır.
uk: Оскільки ми не збільшуємо [code]число[/code] в циклі [code]while[/code], воно завжди залишається на [code]0[/code].

source: As a result, the number is always lower than [code]10[/code], so we never break out of the loop.
da: Som et resultat er tallet altid lavere end [code]10[/code], så vi bryder aldrig ud af løkken.
de: Infolgedessen ist die Zahl immer niedriger als [code]10[/code], so dass wir nie aus der Schleife ausbrechen.
fr: Par conséquent, le nombre est toujours inférieur à [code]10[/code], ce qui fait que nous ne sortons jamais de la boucle.
it: Quindi, il numero rimane sempre inferiore a [code]10[/code], ergo non usciamo mai dal ciclo.
ta: இதன் விளைவாக, எண்ணிக்கை எப்போதும் [குறியீடு] 10 [/குறியீடு] ஐ விட குறைவாக இருக்கும், எனவே நாங்கள் ஒருபோதும் வளையத்திலிருந்து வெளியேற மாட்டோம்.
tr: Sonuç olarak, sayı her zaman [code]10[/code] 'dan küçüktür, bu nedenle döngüden asla çıkamayız.
uk: У результаті число завжди менше [code]10[/code], тому ми ніколи не виходимо з циклу.

source: Since there's no way to exit the [code]while[/code] loop, the computer will attempt to draw squares infinitely, which will freeze the program.
da: Da der ikke er nogen måde at afslutte [code]while[/code]-løkken, vil computeren forsøge at tegne firkanter uendeligt, hvilket vil fryse programmet.
de: Da es keine Möglichkeit gibt, die [code]while[/code]-Schleife zu beenden, wird der Computer versuchen, Quadrate unendlich oft zu zeichnen, wodurch das Programm eingefroren wird.
fr: Comme il n'y a aucun moyen de sortir de la boucle [code]while[/code], l'ordinateur tentera de dessiner des carrés à l'infini, ce qui bloquera le programme.
it: Dato che non c'è alcun modo per uscire dal ciclo [code]while[/code], il computer cercherà di disegnare quadrati all'infinito, questo farà bloccare il programma.
ta: [/குறியீடு] வளையத்திலிருந்து வெளியேற வழி இல்லை என்பதால், கணினி சதுரங்களை எண்ணற்றதாக வரைய முயற்சிக்கும், இது நிரலை முடக்கும்.
tr: [code]while[/code] döngüsünden çıkmanın bir yolu olmadığından da, bilgisayar sonsuza kadar kare çizmeye çalışacak ve bu da programı donduracaktır.
uk: Оскільки немає можливості вийти з циклу [code]while[/code], комп’ютер намагатиметься нескінченно малювати квадрати, що призведе до зависання програми.

source: When programs stop responding on your computer, it's often due to an infinite loop!
da: Når programmer holder op med at reagere på din computer, skyldes det ofte en uendelig løkke!
de: Wenn Programme auf Ihrem Computer nicht mehr reagieren, liegt das oft an einer Endlosschleife!
fr: Lorsque les programmes ne répondent plus sur votre ordinateur, c'est souvent dû à une boucle infinie !
it: Quando i programmi smettono di funzionare sul tuo computer, spesso è a causa di cicli infiniti!
ta: உங்கள் கணினியில் நிரல்கள் பதிலளிப்பதை நிறுத்தும்போது, அது பெரும்பாலும் எல்லையற்ற வளையத்தின் காரணமாகும்!
tr: Bilgisayarınızda programlar yanıt vermeyi durdurduğunda, bunun nedeni genellikle sonsuz bir döngüdür!
uk: Коли програми перестають відповідати на вашому комп’ютері, це часто відбувається через нескінченний цикл!

source: It would draw squares infinitely until the program is terminated
cs: Kreslil by čtverce donekonečna, dokud by program někdo neskončil (kill).
da: Den ville tegne firkanter uendeligt, indtil programmet afsluttes
de: Es würde Quadrate unendlich lange zeichnen, bis das Programm beendet ist
es: Dibujaría cuadrados infinitamente hasta que el programa sea finalizado
fr: Il dessinerait des carrés à l'infini jusqu'à ce que le programme soit termine
it: Disegnerebbe quadrati a oltranza finché il programma non venga terminato
ta: நிரல் நிறுத்தப்படும் வரை அது சதுரங்களை எண்ணற்றதாக இழுக்கும்
tr: Program sonlandırılmazsa, sonsuza kadar kareler çizecek
uk: Він нескінченно малював би квадрати, доки програма не завершиться
zh_hant: 它會無限繪製正方形，直到程式被終止

source: It would draw 10 squares
cs: Nakreslil by 10 čtverců
da: Det ville tegne 10 firkanter
de: Es würde 10 Felder zeichnen
es: Dibujaría 10 cuadrados
fr: Il dessinerait 10 carrés
it: Disegnerebbe 10 quadrati
ta: இது 10 சதுரங்களை ஈர்க்கும்
tr: 10 tane kare çizecek
uk: Це намалювало б 10 квадратів
zh_hant: 它會畫 10 個正方形

source: It would draw 20 squares
cs: Nakreslil by 20 čtverců
da: Det ville tegne 20 firkanter
de: Es würde 20 Quadrate zeichnen
es: Dibujaría 20 cuadrados
fr: Il dessinerait 20 carrés
it: Disegnerebbe 20 quadrati
ta: இது 20 சதுரங்களை ஈர்க்கும்
tr: 20 tane kare çizecek
uk: Це намалювало б 20 квадратів
zh_hant: 它會畫 20 個正方形

source: When to use while loops
cs: Kdy používat smyčky while
da: Hvornår skal man bruge while-løkker
de: Wann while-Schleifen zu verwenden sind
es: Cuándo utilizar los bucles while
fr: Quand utiliser les boucles while
it: Quando usare i cicli while
ta: சுழல்கள் போது எப்போது பயன்படுத்த வேண்டும்
tr: While döngüleri ne zaman kullanılır
uk: Коли використовувати цикли while
zh_hant: 何時使用 while 迴圈

source: At first, you will not need [code]while[/code] loops often. Even the code we show here has more efficient alternatives.
da: I starten behøver du ikke [code]while[/code]-løkker ofte. Selv den kode, vi viser her, har mere effektive alternativer.
de: Zunächst wirst Du [code]while[/code] nicht oft benötigen. Sogar der Code, den wir hier zeigen, hat effizientere Alternativen.
fr: Au début, vous n'aurez pas souvent besoin des boucles [code]while[/code]. Même le code que nous montrons ici a des alternatives plus efficaces.
it: All'inizio, non avrai così tanto bisogno di cicli [code]while[/code]. Difatti il codice che mostriamo ha alternative molto più efficienti.
ta: முதலில், [/குறியீடு] அடிக்கடி சுழலும் போது உங்களுக்கு [குறியீடு] தேவையில்லை. நாங்கள் இங்கே காண்பிக்கும் குறியீட்டில் கூட மிகவும் திறமையான மாற்றுகள் உள்ளன.
tr: Başlangıçta, [code]while[/code] döngülerine çok sık ihtiyaç duymayacaksınız. Burada gösterdiğimiz kodun bile daha verimli alternatifleri var.
uk: Спочатку вам не знадобляться часті цикли [code]while[/code]. Навіть код, який ми тут показуємо, має ефективніші альтернативи.

source: Also, there's a safer kind of loop, [code]for[/code] loops, which we'll look at in the next lesson.
da: Der findes også en mere sikker type løkke, [code]for[/code]-løkker, som vi vil se på i den næste lektion.
de: Außerdem gibt es eine sicherere Art von Schleife, die [code]for[/code]-Schleifen, die wir uns in der nächsten Lektion ansehen werden.
fr: Il existe également un type de boucle plus sûr, les boucles [code]for[/code], que nous examinerons dans la prochaine leçon.
it: Inoltre, c'è un tipo di ciclo più sicuro, i cicli [code]for[/code], che studieremo nella prossima lezione.
ta: மேலும், [/குறியீடு] சுழல்களுக்கான பாதுகாப்பான வகையான லூப், [குறியீடு] உள்ளது, இது அடுத்த பாடத்தில் பார்ப்போம்.
tr: Ayrıca, bir sonraki derste inceleyeceğimiz gibi, [code]for[/code] döngüleri gibi daha güvenli bir döngü türü de var.
uk: Крім того, існує безпечніший вид циклу, цикли [code]for[/code], які ми розглянемо в наступному уроці.

source: Yet, [code]while[/code] loops have important intermediate to advanced-level uses, so you at least need to know they exist and how to use them.
da: Alligevel har [code]while[/code]-løkker vigtige anvendelser på mellemniveau til avanceret niveau, så du skal i det mindste vide, at de eksisterer, og hvordan du bruger dem.
de: [code]while[/code]-Schleifen haben jedoch wichtige Anwendungsmöglichkeiten für Fortgeschrittene- und Profinutzer, sodass Du zumindest wissen musst, dass sie existieren und wie sie verwendet werden.
fr: Cependant, les boucles [code]while[/code] ont des utilisations importantes de niveau intermédiaire à avancé, vous devez donc au moins savoir qu'elles existent et comment les utiliser.
it: Eppure, i cicli [code]while[/code] hanno vari utilizzi nel medio e nell'alto livello di programmazione, quindi devi sapere almeno che esistono e come si usano.
ta: ஆயினும்கூட, [/குறியீடு] [/குறியீடு] சுழல்கள் மேம்பட்ட-நிலை பயன்பாடுகளுக்கு முக்கியமான இடைநிலைகளைக் கொண்டிருக்கின்றன, எனவே அவை உள்ளன, அவற்றை எவ்வாறு பயன்படுத்துவது என்பதை நீங்கள் அறிந்து கொள்ள வேண்டும்.
tr: Yine de, [code]while[/code] döngülerinin orta ve ileri düzeyde önemli kullanımları vardır, bu nedenle en azından var olduklarını ve nasıl kullanılacaklarını bilmeniz gerekir.
uk: Тим не менш, цикли [code]while[/code] мають важливе використання від проміжного до просунутого рівнів, тому вам принаймні потрібно знати, що вони існують і як ними користуватися.

source: We use [code]while[/code] loops every time we need to loop an unknown number of times.
da: Vi bruger [code]while[/code]-løkker, hver gang vi skal gennemgå et ukendt antal løkker.
de: Wir verwenden [code]while[/code]-Schleifen jedes Mal, wenn wir nicht sicher sind, wie oft wir eine Anweisung wiederholen müssen.
fr: Nous utilisons les boucles [code]while[/code] chaque fois que nous devons boucler un nombre inconnu de fois.
it: Usiamo i cicli [code]while[/code] ogni volta che dobbiamo eseguire il ciclo un numero sconosciuto di volte.
ta: ஒவ்வொரு முறையும் [/குறியீடு] சுழலும் போது நாம் [/குறியீடு] பயன்படுத்துகிறோம்.
tr: Bilinmeyen bir sayıda yinelemeye ihtiyaç duyduğumuz her seferde [code]while[/code] döngülerini kullanırız.
uk: Ми використовуємо цикли [code]while[/code] кожного разу, коли нам потрібно повторити невідому кількість разів.

source: For example, games run in a loop that typically generates sixty images per second until the user closes the game. This is possible thanks to [code]while[/code] loops.
da: For eksempel kører spil i et loop, der typisk genererer tres billeder i sekundet, indtil brugeren lukker spillet. Dette er muligt takket være [code]while[/code]-løkker.
de: Beispielsweise werden Spiele in einer Schleife ausgeführt, die in der Regel 60 Bilder pro Sekunde generiert, bis der Benutzer das Spiel schließt. Dies ist dank [code]While[/code]-Loops möglich.
fr: Par exemple, les jeux s'exécutent dans une boucle qui génère habituellement soixante images par seconde jusqu'à ce que l'utilisateur ferme le jeu. Cela est possible grâce aux boucles [code]while[/code].
it: Per esempio, i giochi eseguono il codice ciclicamente e generano sessanta immagini al secondo finché il giocatore non chiude il gioco. Questo è possibile grazie ai cicli [code]while[/code].
ta: எடுத்துக்காட்டாக, விளையாட்டுகளை மூடும் வரை பொதுவாக நொடிக்கு அறுபது படங்களை உருவாக்கும் ஒரு சுழற்சியில் விளையாட்டுகள் இயங்குகின்றன. [/குறியீடு] சுழல்களுக்கு இது [குறியீட்டிற்கு] நன்றி.
tr: Örneğin oyunlar, kullanıcı oyunu kapatana kadar genellikle saniyede altmış görüntü üreten bir döngü içinde çalışır. Bunu yapmak, [code]while[/code] döngüleri sayesinde mümkündür.
uk: Наприклад, ігри працюють у циклі, який зазвичай генерує шістдесят зображень на секунду, доки користувач не закриє гру. Це можливо завдяки циклам [code]while[/code].

source: There are other good uses for [code]while[/code] loops:
da: Der er andre gode anvendelser til [code]while[/code]-løkker:
de: Es gibt andere gute Anwendungen für die [code]while[/code]-Schleife:
fr: Il existe d'autres bonnes utilisations des boucles [code]while[/code] :
it: Ci sono altri buoni utilizzi per i cicli [code]while[/code]:
ta: [/குறியீடு] சுழல்கள் போது [குறியீட்டிற்கு] பிற நல்ல பயன்பாடுகள் உள்ளன:
tr: [code]while[/code] döngülerinin başka iyi kullanımları da var:
uk: Існують інші корисні способи використання циклів [code]while[/code]:

source: - Reading and processing a file, like a text document, line by line. - Processing a constant stream of data, like someone recording audio with a microphone. - Reading code and converting it into instructions the computer understands. - Various intermediate to advanced-level algorithms, like finding paths around a map for AI.
da: - Læsning og behandling af en fil, som et tekstdokument, linje for linje. - Behandling af en konstant strøm af data, som når nogen optager lyd med en mikrofon. - Læsning af kode og konvertering af den til instruktioner, som computeren forstår. - Forskellige algoritmer på mellem- til avanceret niveau, f.eks. at finde stier rundt på et kort til AI.
de: - Lesen und Bearbeiten einer Datei, wie einer Textdatei, Zeile für Zeile. - Verarbeitung eines konstanten Datenstroms, wie jemand, der Audio mit einem Mikrofon aufnimmt. - Lesen von Code und Konvertieren in Anweisungen, die der Computer versteht. - Anspruchsvollere und fortgeschrittene Algorithmen wie das Finden von Pfaden um eine Karte für KI.
fr: - Lire et traiter un fichier, comme un document texte, ligne par ligne. - Traiter un flux constant de données, comme quelqu'un qui enregistre de l'audio avec un microphone. - Lire du code et le convertir en instructions que l'ordinateur comprend. - Divers algorithmes de niveau intermédiaire à avancé, comme la recherche des chemins sur une carte pour l'IA.
it: - Leggere e processare un file, come un documento di testo, linea per linea. - Processare un flusso continuo di fati, come qualcuno che registra audio con un microfono. - Leggere codice e convertirlo in istruzioni che il computer comprende. - Vari algoritmi intermedi e avanzati, come fare path finding per una IA che vaga in una mappa.
ta: - ஒரு கோப்பைப் படித்தல் மற்றும் செயலாக்குதல், உரை ஆவணம் போன்ற, வரி மூலம் வரி. - மைக்ரோஃபோனுடன் ஆடியோவைப் பதிவுசெய்வது போல, தரவின் நிலையான ச்ட்ரீமை செயலாக்குகிறது. - குறியீட்டைப் படித்து கணினி புரிந்துகொள்ளும் வழிமுறைகளாக மாற்றுவது. - AI க்கான வரைபடத்தைச் சுற்றியுள்ள பாதைகளைக் கண்டுபிடிப்பது போன்ற மேம்பட்ட-நிலை வழிமுறைகளுக்கு பல்வேறு இடைநிலை.
tr: - Metin belgesi gibi bir dosyanın, satır satır okuyup işlemek. - Mikrofonla ses kaydı yapan biri gibi, sürekli bir veri akışını işlemek. - Bir kodu okumak ve içindekileri bilgisayarın anlayacağı talimatlara dönüştürmek. - Yapay zeka için bir haritanın etrafındaki yolları bulmak gibi çeşitli orta ve ileri düzey algoritmalar.
uk: - Читання та обробка файлу, як текстового документа, рядок за рядком. - Обробка постійного потоку даних, як хтось записує аудіо за допомогою мікрофона. - Читання коду та перетворення його на інструкції, зрозумілі комп’ютеру. - Різні алгоритми середнього та просунутого рівнів, як-от пошук шляхів навколо карти для ШІ.

source: Let's practice some [code]while[/code] loops, as they're useful to know. It's also an excellent opportunity to practice 2D vectors.
da: Lad os øve os på nogle [code]while[/code]-løkker, da de er nyttige at kende. Det er også en glimrende mulighed for at øve 2D-vektorer.
de: Lass uns [code]while[/code]-Schleifen schnell üben, da es nützlich ist sie zu kennen. Es ist auch eine ausgezeichnete Gelegenheit, um das Umgehen mit 2D-Vektoren zu üben.
fr: Faisons quelques exercices sur les boucles [code]while[/code], car il est utile de les connaître. C'est aussi une excellente occasion de réviser les vecteurs 2D.
it: Facciamo pratica con qualche ciclo [code]while[/code], poiché possono tornare utili in certe situazioni. Questa è anche una buona occasione per fare pratica con i vettori 2D.
ta: [/குறியீடு] சுழல்கள், அவை தெரிந்து கொள்ள பயனுள்ளதாக இருப்பதால் சில [குறியீட்டை] பயிற்சி செய்வோம். 2 டி திசையன்களைப் பயிற்சி செய்ய இது ஒரு சிறந்த வாய்ப்பாகும்.
tr: Hadi birkaç [code]while[/code] döngüsü üzerinde pratik yapalım, çünkü bunları bilmek faydalıdır. Bu aynı zamanda 2B vektörlerle pratik yapmak için de mükemmel bir fırsat.
uk: Давайте попрактикуємося в деяких циклах [code]while[/code], оскільки їх корисно знати. Це також чудова можливість потренуватися в 2D-векторах.

source: Then, we'll move on to the safer [code]for[/code] loops in the following lesson.
da: Derefter går vi videre til de mere sikre [code]for[/code]-løkker i den følgende lektion.
de: Dann gehen wir in der folgenden Lektion zu den sichereren [code]for[/code]-Schleifen über.
fr: Ensuite, nous passerons aux boucles [code]for[/code], qui sont plus sûres que les boucles while, dans la leçon suivante.
it: Nella prossima lezione, andremo a studiare cicli più sicuri come il [code]for[/code].
ta: பின்னர், பின்வரும் பாடத்தில் [/குறியீடு] சுழல்களுக்கான பாதுகாப்பான [குறியீட்டிற்கு] செல்வோம்.
tr: Ardından, bir sonraki derste, daha güvenli olan[code]for[/code] döngülerine geçeceğiz.
uk: Потім у наступному уроці ми перейдемо до безпечніших циклів [code]for[/code].

source: Moving to the end of a board
cs: Přesun na konec desky
da: Flytning til enden af et bræt
de: Verschieben an das Ende eines Bretts
es: Moverse al final de un tablero
fr: Déplacement à la fin d'un plateau
it: Andando alla fine di una tavola
ta: ஒரு பலகையின் முடிவுக்கு நகரும்
tr: Bir tahtanın sonuna gitmek
uk: Перехід до кінця дошки
zh_hant: 移動到棋盤的終點

source: Our robot has decided to stand at the top of the board.
da: Vores robot har besluttet sig for at stå øverst på brættet.
de: Unser Roboter hat sich entschieden, oben auf dem Brett zu stehen.
fr: Notre robot a décidé de se tenir sur la partie supérieure du plateau.
it: Il nostro robot ha deciso di posizionarsi in cima alla tavola.
ta: எங்கள் ரோபோ போர்டின் உச்சியில் நிற்க முடிவு செய்துள்ளது.
tr: Robotumuz, tahtanın en tepesinde durmaya karar verdi.
uk: Наш робот вирішив стати на вершину дошки.

source: Complete the [code]move_to_bottom()[/code] function so the robot moves to the bottom of the board.
da: Færdiggør funktionen [code]move_to_bottom()[/code] så robotten bevæger sig til bunden af brættet.
de: Vervollständige die Funktion [code]move_to_bottom()[/code], damit sich der Roboter an die Unterseite des Brettes bewegt.
fr: Complétez la fonction [code]move_to_bottom()[/code] pour que le robot se déplace vers la partie inférieure du plateau.
it: Completa la funzione [code]move_to_bottom()[/code] cosicché il robot arrivi in fondo alla tavola.
ta: [குறியீடு] MOVE_TO_BOTTOM () [/குறியீடு] செயல்பாட்டை முடிக்கவும், எனவே ரோபோ பலகையின் அடிப்பகுதிக்கு நகர்கிறது.
tr: Robotun, tahtanın en altına doğru hareket etmesi için, [code]move_to_bottom()[/code] (ilerle_en_alta) fonksiyonunu tamamlayın.
uk: Виконайте функцію [code]move_to_bottom()[/code], щоб робот перемістився вниз дошки.

source: The board size is determined by the [code]Vector2[/code] [code]board_size[/code].
da: Brættets størrelse bestemmes af [code]Vector2[/code]'eren [code]board_size[/code].
de: Die Brettgröße wird durch den [code]Vector2[/code] [code]board_size[/code] bestimmt.
fr: La taille du plateau est déterminée par le [code]board_size[/code] du [code]Vector2[/code].
it: La grandezza della tavola è determinata dalla variabile [code]Vector2[/code] chiamata [code]board_size[/code].
ta: போர்டு அளவு [குறியீடு] திசையன் 2 [/குறியீடு] [குறியீடு] போர்டு_சைச் [/குறியீடு] ஆல் தீர்மானிக்கப்படுகிறது.
tr: Tahtanın boyutu [code]Vector2[/code] tipinde [code]board_size[/code] (tahta_boyu) tarafından belirlenir.
uk: Розмір дошки визначається [code]Vector2[/code] [code]board_size[/code].

source: The robot's current cell is [code]Vector2(2, 0)[/code].
da: Robottens nuværende celle er [code]Vector2(2, 0)[/code].
de: Die aktuelle Zelle des Roboters ist [code]Vector2(2, 0)[/code].
fr: La case actuelle du robot est [code]Vector2(2, 0)[/code]
it: Il robot è ora posizionato nella cella [code]Vector2(2, 0)[/code].
ta: ரோபோவின் தற்போதைய செல் [குறியீடு] திசையன் 2 (2, 0) [/குறியீடு] ஆகும்.
tr: Robotun şu an durduğu hücrenin, cell, konum değeri [code]Vector2(2, 0)[/code].
uk: Поточна комірка робота — [code]Вектор2(2, 0)[/code].

source: Make sure to use a [code]while[/code] loop so the function works for any board size.
da: Sørg for at bruge en [code]while[/code]-løkke, så funktionen fungerer for alle brætstørrelser.
de: Stelle sicher, dass Du eine [code]while[/code]-Schleife verwendest, damit die Funktion für jede Brettgröße funktioniert.
fr: Assurez-vous d'utiliser une boucle [code]while[/code] pour que la fonction fonctionne quelle que soit la taille de la carte.
it: Utilizza il ciclo [code]while[/code] cosicché la funzione funzioni per ogni grandezza di tavola.
ta: [/குறியீடு] சுழற்சியில் [குறியீட்டை] பயன்படுத்துவதை உறுதிசெய்க, எனவே செயல்பாடு எந்த போர்டு அளவிற்கும் வேலை செய்கிறது.
tr: Fonksiyonun, herhangi bir tahta boyutuyla çalışması için [code]while[/code] döngüsünü kullandığınızdan emin olun.
uk: Обов’язково використовуйте цикл [code]while[/code], щоб функція працювала для плати будь-якого розміру.

source: Use a while loop to have our robot move from the top of the board to the bottom.
cs: Použijte smyčku while, aby se náš robot pohyboval z horní části desky do dolní.
da: Brug en while-løkke til at få vores robot til at bevæge sig fra toppen af brættet til bunden.
de: Verwende eine while-Schleife, damit sich unser Roboter von der Oberseite des Bretts nach unten bewegt.
es: Utiliza un bucle while para que nuestro robot se mueva desde la parte superior del tablero hasta la inferior.
fr: Utilisez une boucle while pour que notre robot se déplace de la partie supérieure du plateau vers l'inférieure.
it: Usa un ciclo while per far muovere il nostro robot dalla parte superiore alla parte inferiore della tavola.
ta: எங்கள் ரோபோ பலகையின் மேலிருந்து கீழே செல்ல சிறிது நேரம் வளையத்தைப் பயன்படுத்தவும்.
tr: Robotumuzun tahtanın en üstünden en altına doğru hareket etmesini sağlamak için bir while döngüsü kullanın.
uk: Використовуйте цикл while, щоб наш робот рухався від верхньої частини дошки до нижньої.
zh_hant: 使用 while 迴圈讓我們的機器人從棋盤頂部移動到底部。

source: Introduction to While Loops
cs: Úvod do smyček While
da: Introduktion til While-løkker
de: Einführung in while-Schleifen
es: Introducción a los bucles while
fr: Introduction aux boucles while
it: Introduzione ai Cicli While
ta: சுழல்களின் அறிமுகம்
tr: While Döngülerine Giriş
uk: Введення в цикли While
zh_hant: While 迴圈入門
