Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-20-looping-over-arrays.po
Languages: cs, da, de, es, it, ja, pt_br, ru, ta, tr, uk, zh_hant

source: Use a [code]for[/code] loop to draw every rectangle in the [code]rectangle_sizes[/code] array with the [code]draw_rectangle()[/code] function.
da: Brug en [code]for[/code]-løkke til at tegne hvert rektangel i [code]rectangle_sizes[/code] arrayet med funktionen [code]draw_rectangle()[/code].
de: Verwende eine [code]for[/code]-Schleife, um jedes Rechteck im [code]rectangle_sizes[/code]-Array mit der Funktion [code]draw_rectangle()[/code] zu zeichnen.
es: Utiliza un bucle [code]for[/code] para dibujar cada rectángulo en la matriz [code]rectangle_sizes[/code] con la función [code]draw_rectangle()[/code].
it: Usa un ciclo [code]for[/code] per disegnare ogni rettangolo nell'array [code]rectangle_sizes[/code] con la funzione [code]draw_rectangle()[/code].
ja: [code]for[/code] ループを使用して、[code]draw_rectangle()[/code] 関数で [code]rectangle_sizes[/code] 配列内のすべての長方形を描画します。
pt_br: Use um loop [code]for[/code] para desenhar cada retângulo no array [code]rectangle_sizes[/code] com a função [code]draw_rectangle()[/code].
ru: Используйте цикл [code]for[/code] для рисования каждого прямоугольника из массива [code]rectangle_sizes[/code] при помощи функции [code]draw_rectangle()[/code].
ta: [குறியீடு] செவ்வகம்_சைச் [/குறியீடு] வரிசையில் [குறியீடு] டிரா_ரெக்டாங்கல் () [/குறியீடு] செயல்பாட்டுடன் ஒவ்வொரு செவ்வகத்தையும் வரைய [/குறியீடு] வளையத்திற்கு [குறியீடு] பயன்படுத்தவும்.
tr: [code]draw_rectangle()[/code] fonksiyonu ile [code]rectangle_sizes[/code] dizisindeki her bir dikdörtgeni çizmek için bir [code]for[/code] döngüsü kullanın.
uk: Використовуйте цикл [code]for[/code], щоб намалювати кожен прямокутник у масиві [code]rectangle_sizes[/code] за допомогою функції [code]draw_rectangle()[/code].

source: The rectangles shouldn't overlap or cross each other. To avoid that, you'll need to call the [code]jump()[/code] function.
da: Rektanglerne bør ikke overlappe eller krydse hinanden. For at undgå det skal du kalde funktionen [code]jump()[/code].
de: Die Rechtecke sollten sich nicht überlappen oder kreuzen. Um dies zu vermeiden, musst Du die Funktion [code]jump()[/code] aufrufen.
es: Los rectángulos no deben superponerse ni cruzarse entre sí. Para evitar esto, tendrás que llamar a la función [code]jump()[/code].
it: I rettangoli non dovrebbero intersecarsi l'un l'altro. Per evitare questo, devi chiamare la funzione [code]jump()[/code].
ja: 四角形は互いに重なり合ったり交差したりしないでください。これを回避するには、[code]jump()[/code] 関数を呼び出す必要があります。
pt_br: Os retângulos não devem se sobrepor ou se cruzar. Para evitar isso, você vai precisar chamar a função [code]jump()[/code].
ru: Прямоугольники не должны перекрывать или пересекать друг друга. Чтобы избежать этого, вам нужно использовать функцию [code]jump()[/code].
ta: செவ்வகங்கள் ஒருவருக்கொருவர் ஒன்றுடன் ஒன்று அல்லது கடக்கக்கூடாது. அதைத் தவிர்க்க, நீங்கள் [குறியீடு] சம்ப் () [/குறியீடு] செயல்பாட்டை அழைக்க வேண்டும்.
tr: Dikdörtgenler üst üste gelmemeli veya birbirini kesmemelidir. Bunu önlemek için [code]jump()[/code] fonksiyonunu da çağırmanız gerek. (Ayrıca, Vector2'nin x ve y değerlerini tuttuğunu hatırlayın).
uk: Прямокутники не повинні накладатися або перетинатися. Щоб уникнути цього, вам потрібно буде викликати функцію [code]jump()[/code].

source: The drawing turtle makes its comeback. Fear not! Armed with loops, you'll make it draw faster than ever before.
cs: Kreslící želva se vrací na scénu. Neboj se! Vyzbrojeni smyčkami, budete kreslit rychleji než kdy předtím.
da: Tegneskildpadden vender tilbage. Frygt ej! Bevæbnet med løkker, får du den til at tegne hurtigere end nogensinde før.
de: Die zeichnende Schildkröte feiert ihr Comeback. Fürchte dich nicht! Bewaffnet mit Schleifen lässt Du sie schneller zeichnen als je zuvor.
es: La tortuga que dibuja está de vuelta. ¡No temas! Armada con bucles, harás que dibuje más rápido que nunca.
it: La tartaruga che disegna ritorna. Non ti preoccupare! Armato di cicli, la farai disegnare più veloce ché mai.
ja: 絵を描くカメが復活します。恐れることはありません!ループで武装して、これまで以上に速く描画します。
pt_br: A tartaruga que desenha está de volta. Não tenha medo! Armado com loops, você fará com que ela desenhe mais rápido do que nunca.
ru: Рисующая черепаха возвращается. Не бойтесь! Вооружённые циклами, вы сделаете процесс рисования быстрым, как никогда.
ta: வரைதல் ஆமை அதன் மறுபிரவேசம் செய்கிறது. பயப்பட வேண்டாம்! சுழல்களால் கருவி ஏந்திய நீங்கள் முன்பை விட வேகமாக வருவீர்கள்.
tr: Çizim kaplumbağası aramıza dönüyor. Ama korkmayın! Döngülerle donanmış olarak, her zamankinden daha hızlı çizmesini sağlayacaksınız.
uk: Малювальна черепаха повертається. Не бійся! Озброївшись петлями, ви зможете малювати швидше, ніж будь-коли раніше.
zh_hant: 會畫畫的海龜再次回歸。別擔心！有了迴圈的幫助，你將讓它畫得比以往更快。

source: Looping over arrays
cs: Smyčka v poli hodnot
da: Loope over arrays
de: Durchlaufen von Arrays
es: Hacer bucles sobre matrices
it: Ciclando degli array
ja: 配列のループ処理
pt_br: Fazendo loops dentro dos arrays
ru: Обход массивов в цикле
ta: வரிசைகளுக்கு மேல் சுழற்சி
tr: Diziler üzerinde döngü kurmak
uk: Перегляд масивів
zh_hant: 迴圈遍歷陣列

source: The [code]range()[/code] function produced an array that the [code]for[/code] keyword could loop over. We can give [code]for[/code] loops [i]any[/i] array, and they will loop over them just the same. Instead of using the [code]range()[/code] function, we could manually write the numbers and get the same result.
cs: Funkce [code]range()[/code] vytvořila pole, nad nímž může cyklus [code]for[/code] procházet. [code]for[/code] cyklu můžeme předat [i] libovolné[/i] pole, cyklus jej stejným způsobem projde. Místo použití funkce [code]range()[/code] bychom mohli čísla zapsat ručně a získat stejný výsledek.
zh_hant: [code]range()[/code] 函式會產生一個陣列，讓 [code]for[/code] 關鍵字可以對其進行迴圈。 我們可以將 [code]for[/code] 迴圈應用於[b]任何[/b]陣列，它們都會以相同的方式進行迴圈。 而且不使用 [code]range()[/code] 函式，我們也可以手動寫入數字，並獲得相同的結果。

source: For each element inside the array, the [code]for[/code] loop extracts it, stores it in the temporary variable named [code]number[/code], and executes the loop's code once. Inside the loop, you can access the [code]number[/code] variable, which changes on each [i]iteration[/i]. The code works regardless of the array or where you store it. Often, you will store arrays in variables for easy access.
cs: Každý prvek uvnitř pole cyklus [code]for[/code] extrahuje, uloží do dočasné proměnné [code]number[/code] a jednou provede kód cyklu. Uvnitř cyklu můžete přistupovat k proměnné [code]number[/code], která se mění při každé [i]iteraci[/i]. Kód funguje bez ohledu na pole nebo místo jeho uložení. Často ukládáte pole do proměnných pro snadný přístup.
zh_hant: 對於陣列中每個元素，[code]for[/code] 迴圈會提取該元素，將其存入名為 [code]number[/code] 的暫存變數，然後執行一次迴圈內的程式碼。 在迴圈內，你可以存取 [code]number[/code] 變數，且它會在每次[b]迭代[/b]時改變數值。 無論陣列的內容為何或儲存在哪裡，這段程式碼都能正常運作。通常會將陣列存入變數中，以便日後存取。

source: Compared to previous examples, we store the array in the [code]numbers[/code] variable. Using the [code]numbers[/code] variable in our [code]for[/code] loop allows the computer to access the array of numbers like before. We have three numbers in the array: [code]0[/code], [code]1[/code], and [code]2[/code]. The loop extracts each of them sequentially and assigns it to the [code]number[/code] temporary variable. As the loop processes each number, the output will print [code]0[/code], then [code]1[/code], then [code]2[/code], each on a separate line.
cs: Ve srovnání s předchozími příklady ukládáme pole do proměnné [code]numbers[/code]. Použití proměnné [code]numbers[/code] v naší smyčce [code]for[/code] umožňuje počítači přístup k poli čísel jako dříve. V poli máme tři čísla: [code]0[/code], [code]1[/code] a [code]2[/code]. Smyčka extrahuje každou z nich postupně a přiřadí ji k dočasné proměnné [code]number[/code]. Jak smyčka zpracovává každé číslo, výstup se vytiskne čísla [code]0[/code], pak [code]1[/code], pak [code]2[/code], každé na samostatném řádku.
zh_hant: 與先前的範例相比，我們將陣列存入 [code]numbers[/code] 變數中。在 [code]for[/code] 迴圈中使用 [code]numbers[/code] 變數，使電腦能夠像之前一樣存取這組數字陣列。 這個陣列內包含三個數字：[code]0[/code]、[code]1[/code] 和 [code]2[/code]。 迴圈會依序提取這些數字，並將它們指派給暫存變數 [code]number[/code]。當迴圈處理每個數字時，輸出結果將會逐行印出 [code]0[/code]，接著是 [code]1[/code]，最後是 [code]2[/code]。

source: It's a [code]for[/code] loop that makes the turtle walk along the path. The loop works like this: for each coordinate in the array, it moves the turtle once to that cell.
cs: Je to smyčka [code]for[/code], která způsobuje, že želva chodí po cestě. Smyčka funguje takto: pro každou souřadnici v poli přesune želvu jednou do této buňky.
zh_hant: 這是一個 [code]for[/code] 迴圈，使烏龜沿著路徑移動。 迴圈的運作方式如下：對於陣列中的每個座標，它會將烏龜移動到該格一次。

source: For each coordinate in an array named [code]selected_units[/code], we check if there is a unit in that cell. If so, we select it. In that case, we use an array, a loop, and a condition together.
cs: Pro každou souřadnici v poli s názvem [code]selected_units[/code] zkontrolujeme, zda se v dané buňce nachází jednotka. Pokud ano, vybereme ji. V takovém případě použijeme společně pole, cyklus a podmínku.
zh_hant: 對於名為 [code]selected_units[/code] 的陣列中每個座標，我們會檢查該格是否有單位存在。如果有，我們就選取它。 在這個例子下，我們將陣列、迴圈和條件結合使用。

source: The code above uses several features you haven't learned yet: - In a condition, the [code]in[/code] keyword allows you to check if a value exists [i]in[/i] an array. - The array's [code]append()[/code] function appends a new value at the end of the array. Notice the use of a period after the [code]selected_units[/code] variable, to call the [code]append()[/code] function. It's because this function exists only on arrays. When functions exist only on a specific value type, you write a dot after the value to call the function on it. We'll revisit those two features again in the following lessons.
cs: Výše uvedený kód používá několik funkcí, které jste se ještě nenaučili: - V podmínce vám klíčové slovo [code]in[/code] umožňuje zkontrolovat, zda existuje hodnota [i]v[/i] v poli. - Funkce pole [code]append()[/code] připojí novou hodnotu na konec pole. Všimněte si použití tečky za proměnnou [code]selected_units[/code] pro volání funkce [code]append()[/code]. Je to proto že tuto funkci lze volat pouze z pole. Pokud funkce existují pouze na určitém typu hodnoty, napíšete za identifikátorem hodnoty(proměnná, funkce) tečku, aby se funkce na ní zavolala. K těmto dvěma funkcím se znovu vrátíme v následujících lekcích.
zh_hant: 上面的程式碼使用了幾個你尚未學習的功能： - 在條件判斷中，[code]in[/code] 關鍵字可用來檢查某個值是否存在於陣列中。 - 陣列的 [code]append()[/code] 函式可以將新值加入陣列的末尾。 請注意在 [code]selected_units[/code] 變數後面使用了句點（.），以呼叫 [code]append()[/code] 函式。這是因為該函式僅適用於陣列。 當函式只適用於特定類型的值時，需要在該值後加上句點來呼叫該函式。 我們會在接下來的課程中再次探討這兩個功能。

source: The beauty of loops is that they work regardless of the size of your arrays. The code just works whether you have one or ten thousand units to select. It is all accomplished with only a couple lines of code. That's the power of computer programming. In the following practices, you will use arrays combined with [code]for[/code] loops to achieve similar results.
cs: Krása smyček spočívá v tom, že fungují bez ohledu na velikost pole. Kód prostě funguje, ať už máte na výběr jednu nebo deset tisíc jednotek. Toho všeho je dosaženo pomocí pouhých několika řádků kódu. V tom je síla počítačového programování. V následujících postupech budete k dosažení podobných výsledků používat pole v kombinaci s cykly [code]for[/code].
zh_hant: 迴圈的美妙之處在於，它們無論面對多大的陣列都能正常運作。 不管是選取一個單位還是一萬個單位，程式碼都能運行，並且只需要幾行程式碼就能完成這項工作。 這就是電腦程式設計的強大之處。 在接下來的練習中，你將結合陣列與 [code]for[/code] 迴圈來達成類似的結果。

source: Our AI pathfinding algorithm provided a path for the robot to move to the right edge of the grid. Your task is to use a [code]for[/code] loop to make the robot move. To move the robot, call [i]its[/i] [code]move_to()[/code] function, like so: [code]robot.move_to()[/code]. The [code]move_to()[/code] function only exists on the robot, which is why you need to access it this way.
cs: Náš algoritmus pro hledání cesty s umělou inteligencí určil robotovi cestu k pravému okraji mřížky. Vaším úkolem je pomocí smyčky [code]for[/code] přimět robota k pohybu. Chcete-li robota přesunout, zavolejte [i]jeho[/i] funkci [code]move_to()[/code], a to takto: [code]robot.move_to()[/code]. Funkce [code]move_to()[/code] existuje pouze na robotovi, a proto k ní musíte přistupovat tímto způsobem.
zh_hant: 我們的 AI 路徑尋找演算法已經提供了一條路徑，讓機器人能夠移動到網格的右邊緣。你的任務是使用 [code]for[/code] 迴圈來讓機器人移動。 要讓機器人移動，請呼叫[b]它的[/b][code]move_to()[/code] 函式，像是這樣：[code]robot.move_to()[/code]。 [code]move_to()[/code] 函式僅存在於機器人上，這就是為什麼你需要這樣存取它。

source: We want to draw many rectangles, something surprisingly common in games. However, writing this code by hand can get tedious. Instead, you could store the size of your shapes in arrays and use a loop to draw them all in batches. That's what you'll do in this practice. Use a [code]for[/code] loop to draw every rectangle in the [code]rectangle_sizes[/code] array with the [code]draw_rectangle()[/code] function. The rectangles shouldn't overlap or cross each other. To avoid that, you'll need to call the [code]jump()[/code] function.
cs: Chceme nakreslit mnoho obdélníků, což je ve hrách překvapivě běžné. Psaní tohoto kódu ručně však může být zdlouhavé. Místo toho můžete ukládat velikosti tvarů do polí a pomocí smyčky je všechny nakreslit v dávkách. Zkusíme si to v tomto cvičení. Pomocí smyčky [code]for[/code] nakreslete každý obdélník v poli [code]rectangle_sizes[/code] pomocí funkce [code]draw_rectangle()[/code]. Obdélníky by se neměly překrývat ani křížit. Abyste tomu zabránili, musíte volat funkci [code]jump()[/code].
zh_hant: 要畫出許多矩形，這在遊戲中是相當常見的需求。 不過手動寫這段程式碼會變得相當繁瑣。相反地，你可以將圖形的大小存儲在陣列中，並使用迴圈來批次繪製它們。 這正是你在這次練習中要做的事。 使用 [code]for[/code] 迴圈來繪製 [code]rectangle_sizes[/code] 陣列中的每一個矩形，並利用 [code]draw_rectangle()[/code] 函式來進行繪製。 矩形不應該互相重疊或交叉。為了避免這個問題，你需要呼叫 [code]jump()[/code] 函式。
