Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-22-functions-return-values.po
Languages: cs, da, de, es, it, ja, pt, pt_br, ru, ta, tr, uk, zh_hans, zh_hant

source: Well, cell coordinates don't correspond to positions on the screen. To find the center of any cell on the screen, we need to convert the cell's coordinates to a position on the screen, in pixels.
da: Cellekoordinater svarer ikke til positioner på skærmen. For at finde midten af en celle på skærmen skal vi konvertere cellens koordinater til en position på skærmen i pixels.
de: Nun, Zellenkoordinaten entsprechen nicht den Positionen auf dem Bildschirm, daher müssen wir Zellenpositionen in Bildschirmpositionen konvertieren.
es: Pues bien, las coordenadas de las celdas no se corresponden con las posiciones en la pantalla, así que tenemos que convertir las posiciones de las celdas en posiciones de la pantalla.
it: Le coordinate delle celle non corrispondono a posizioni sullo schermo. Per trovare il centro di una cella sullo schermo, dobbiamo convertire le coordinate della cella in una posizione sullo schermo, in pixel.
ja: セルの座標は画面上の位置に対応していません。画面上のセルの中心を見つけるには、セルの座標を画面上の位置(ピクセル単位)に変換する必要があります。
pt_br: Bem, as coordenadas das células não correspondem às posições na tela. Para encontrar o centro de uma célula na tela, precisamos converter as coordenadas da célula para uma posição na tela, em pixels.
ru: Так вот координаты ячейки отличаются от позиций на экране, поэтому нам нужно конвертировать позиции ячеек в позиции на экране.
tr: Aslına bakarsanız, hücre konumları ekran üzerindeki konumlara tam olarak karşılık gelmez. Ekrandaki herhangi bir hücrenin merkezini bulmak için, hücrenin konumunu ekrandaki bir konuma, piksel cinsinden, dönüştürmemiz gerekir.
zh_hans: 但是呢，单元格坐标和屏幕上的位置并不是对应的，所以我们需要将单元格位置转换为屏幕上的像素位置。

source: To do so, we use a function. The function does two things:
da: For at gøre det bruger vi en funktion. Funktionen gør to ting:
de: Dazu verwenden wir eine Funktion. Die Funktion macht zwei Dinge:
es: Para ello, utilizamos una función. La función hace dos cosas:
it: Per farlo, utilizziamo una funzione. La funzione fa due cose:
ja: そのために、関数を使用します。この関数は 2 つのことを行います。
pt_br: Para fazer isso, usamos uma função. A função faz suas coisas:
ru: Для этого мы используем функцию. Функция делает две вещи:
tr: Bunu yapmak için bir fonksiyon kullanırız. Fonksiyon iki şey yapar:
zh_hans: 为此，我们要用到一个函数。该函数应有两个功能：

source: 1. First, it multiplies the cell coordinates by the cell size, which gives us the position of the cell's top-left corner on the screen, in pixels. 2. Then, we add half of the cell size to get the center of the cell.
da: 1. Først ganger den cellekoordinaterne med cellestørrelsen, hvilket giver os positionen af cellens øverste venstre hjørne på skærmen i pixels. 2. Derefter lægger vi halvdelen af cellestørrelsen til for at få cellens centrum.
de: 1. Zuerst multipliziert sie die Zellkoordinaten mit der Zellgröße, was uns die Position der oberen linken Ecke der Zelle auf dem Bildschirm in Pixeln gibt. 2. Anschließend addieren wir die Hälfte der Zellgröße, um die Mitte der Zelle zu erhalten.
es: 1. Primero, multiplica las coordenadas de la celda por el tamaño de la celda, lo que nos da la posición de la esquina superior izquierda de la celda en la pantalla, en píxeles. 2. A continuación, sumamos la mitad del tamaño de la celda para obtener el centro de la misma.
it: 1. Innanzitutto, moltiplica le coordinate della cella per la dimensione della cella, ottenendo così la posizione dell'angolo superiore sinistro della cella sullo schermo, in pixel. 2. Poi aggiunge la metà della dimensione della cella per ottenere il centro della cella.
ja: 1.まず、セル座標にセルサイズを掛けて、画面上のセルの左上隅の位置をピクセル単位で求めます。 2.次に、セルサイズの半分を追加して、セルの中心を取得します。
pt_br: 1. Primeiro, ela multiplica a coordenada da célula pelo tamanho de célula. Isso nos dá a posição do canto superior esquerdo da célula na tela, em pixels. 2. Então, nós adicionamos metade do tamanho da célula para calcular o centro da célula.
ru: 1. Сначала координаты ячейки умножаются на размер ячейки, что даёт нам положение верхнего левого угла ячейки на экране в пикселях. 2. Затем мы добавляем половину размера ячейки, чтобы получить центр ячейки.
tr: 1. İlk olarak, hücre koordinatlarını hücre boyu ile çarpar, bu da bize hücrenin ekrandaki sol üst köşesinin konumunu piksel cinsinden verir. 2. Ardından, hücrenin merkezini elde etmek için hücre boyunun yarısını ekleriz.
zh_hans: 第一步，它将单元格坐标乘以单元格大小，得出单元格的左上角在屏幕上的位置（以像素为单位）。 第二步，加上一个单元格的大小的二分之一，得到单元格的中心点的位置。

source: The function returns the result, allowing us to store it in a variable.
da: Funktionen returnerer resultatet, så vi kan gemme det i en variabel.
de: Die Funktion gibt das Ergebnis zurück, sodass wir es in einer Variablen speichern können.
es: La función devuelve el resultado, lo que nos permite almacenarlo en una variable.
it: La funzione restituisce il risultato, che può essere memorizzato in una variabile.
ja: 関数は結果を返し、変数に格納できるようにします。
pt_br: A função retorna um resultado, o que nos permite armazená-lo em uma variável.
ru: Функция возвращает результат, что позволяет нам сохранить его в переменной.
tr: Fonksiyon geriye bir sonuç döndürerek bunu bir değişkende saklamamızı sağlar.
zh_hans: 函数会返回这个结果，然后我们就可以将其存储在变量中。

source: The [code]return[/code] keyword returns the value to the code calling the function. You'll receive the result where you call the function.
cs: Klíčové slovo [code]return[/code] vrací výslednou hodnotu na místo v kódu, odkud se funkce zavolala.
da: Nøgleordet [code]return[/code] returnerer værdien til den kode, der kalder funktionen. Du modtager resultatet, der hvor du kalder funktionen.
de: Das Schlüsselwort [code]return[/code] gibt den Wert an die Codezeile zurück, die, die Funktion aufruft. Du erhälst das Ergebnis, in dem du die Funktion aufrufst.
es: La palabra clave [code]return[/code] devuelve el valor al código que llama a la función. Recibirás el resultado donde llames a la función.
it: La parola chiave [code]return[/code] riporta il valore nella stringa di code in cui viene chiamata la funzione. Riceverai dunque il risultato della funzione nel punto in cui la chiami.
ja: [code]return[/code] キーワードは、関数を呼び出すコードに値を返します。 関数を呼び出した場所で結果を受け取ります。
pt: A palavra-chave [code]return[/code] retorna o valor para o código que chama a função. Vai receber o resultado onde chamar a função.
pt_br: A palavra-chave [code]return[/code] retorna o valor para o código que está chamando a função. Você vai receber o resultado onde chamar a função.
ru: Ключевое слово [code]return[/code] возвращает значение в то место в коде, где была вызвана функция. Вы получите результат после того, как вызовете функцию.
ta: [குறியீடு] திரும்ப [/குறியீடு] முக்கிய சொல் செயல்பாட்டை அழைக்கும் குறியீட்டிற்கு மதிப்பை வழங்குகிறது. நீங்கள் செயல்பாட்டை அழைக்கும் முடிவைப் பெறுவீர்கள்.
tr: [code]return[/code] anahtar kelimesi, ilgili değeri, fonksiyonu çağıran koda döndürür. Sonucu, fonksiyonu çağırdığınız yerde alırsınız.
uk: Ключове слово [code]return[/code] повертає значення коду, який викликає функцію. Ви отримаєте результат під час виклику функції.
zh_hans: [code]return[/code] 关键字将值返回给调用函数的代码。你会在调用该函数的位置收到结果。
zh_hant: [code]return[/code] 關鍵字會將值回傳給呼叫該函式的程式碼。你會在呼叫函式的地方收到這個結果。

source: Some functions return values, and some do not. During practices, you can learn which functions return a value using the documentation panel. It will display if the practice requires using specific functions or variables.
da: Nogle funktioner returnerer værdier, og andre gør ikke. Under øvelser kan du lære, hvilke funktioner der returnerer en værdi, ved hjælp af dokumentationspanelet. Det vil vise, om øvelsen kræver brug af specifikke funktioner eller variabler.
de: Einige Funktionen geben Werte zurück, andere nicht. Welche Funktionen ein Ergebnis zurückgeben, erfährst du in der Dokumentation im Übungsbild.
es: Algunas funciones devuelven valores y otras no. Puedes saber qué funciones devuelven un resultado utilizando el panel de documentación de la pantalla de prácticas. Te mostrará si la práctica requiere el uso de funciones o variables específicas.
it: Alcune funzioni restituiscono valori, altre no. Durante le esercitazioni, è possibile sapere quali funzioni restituiscono un valore utilizzando il pannello della documentazione. Il pannello mostrerà se l'esercizio richiede l'uso di funzioni o variabili specifiche.
ja: 戻り値を返す関数と戻さない関数があります。演習中に、どの関数が値を返すかをドキュメントパネルを使用して学習できます。演習で特定の関数または変数を使用する必要がある場合に表示されます。
pt_br: Algumas funções retornam valores e outras não. Você pode aprender quais funções retornam um resultado através do painel de documentação na tela de prática. Ele vai mostrar se a prática requer o uso de função ou variáveis específicas.
ru: Некоторые функции возвращают значения, а некоторые — нет. Вы можете узнать, какие функции возвращают значение при помощи панели документации на экране упражнения.
tr: Bazı fonksiyonlar değer döndürür, ve bazıları döndürmez. Alıştırmalar sırasında, dokümantasyon panelini kullanarak hangi fonksiyonların değer döndürdüğünü öğrenebilirsiniz. Eğer alıştırma, belirli fonksiyonların veya değişkenlerin kullanılmasını gerektiriyorsa görüntülenecektir.
zh_hans: 有些函数会返回值，有些不会。你可以使用练习界面中的文档面板了解哪些函数会返回结果。

source: There, functions that start with the term [code]void[/code] do not return a value. Any other term means the function does return a value. You'll learn more about what other terms mean in a couple of lessons when we explore value [i]types[/i].
da: Funktioner der starter med termen [code]void[/code], returnerer ikke en værdi. Ethvert andet term betyder, at funktionen returnerer en værdi. Du vil lære mere om, hvad andre termer betyder, om et par lektioner, når vi udforsker værdi [i]typer[/i].
de: Dort geben Funktionen, die mit dem Begriff [code]void[/code] beginnen, keinen Wert zurück. Jeder andere Begriff bedeutet, dass die Funktion einen Wert zurückgibt. Du wirst in ein paar Lektionen mehr darüber erfahren, was andere Begriffe bedeuten, wenn wir Wert[i]typen[/i] erforschen.
es: Allí, las funciones que empiezan con el término [code]void[/code] no devuelven ningún valor. Cualquier otro término significa que la función sí devuelve un valor. Aprenderás más sobre el significado de otros términos en un par de lecciones, cuando exploremos los [i]tipos[/i] de valores.
it: Le funzioni che iniziano con il termine [code]void[/code] non restituiscono un valore. Qualsiasi altro termine significa che la funzione restituisce un valore. Il significato degli altri termini verrà spiegato meglio tra un paio di lezioni, quando esploreremo i [i]tipi di valore[/i].
ja: そこでは、用語 [code]void[/code] で始まる関数は値を返しません。その他の用語は、関数が値を返すことを意味します。他の用語の意味については、値[i]型[/i]について調べるいくつかのレッスンで詳しく説明します。
pt_br: Lá, as funções que começam com o termo [code]void[/code] não retornam um valor. Qualquer outro termo significa que a função retorna um valor. Você vai aprender mais sobre o significado de outros termos mais pra frente quando explorarmos [i]tipos[/i] de valor.
ru: Здесь, функции, начинающиеся с термина [code]void[/code] не возвращают значение. В остальных случаях функция возвращает значение. Вы узнаете больше о том что значат другие термины через несколько уроков, когда мы рассмотрим [i]типы[/i] значений.
tr: Burada, [code]void[/code] terimiyle başlayan fonksiyonlar bir değer döndürmez. Başka herhangi bir terim, fonksiyonun bir değer döndürdüğü anlamına gelir. Diğer terimlerin ne anlama geldiği hakkında daha fazla bilgiyi birkaç ders sonra değer [i]tipleri[/i] incelerken öğreneceksiniz.
zh_hans: 在那里，以关键字 [code]void[/code] （空）开头的函数不返回值。任何其他关键字都意味着该函数确实返回一个值。当我们探索值 [i]各种类型[/i] 时，你会在几节课的时间中了解更多其他关键字的含义。

source: For now, let's practice returning values from functions!
da: Lad os nu øve os i at returnere værdier fra funktioner!
de: Lass uns zunächst üben, Werte aus Funktionen zurückzugeben!
es: Por ahora, ¡vamos a practicar la devolución de valores desde las funciones!
it: Per ora, esercitiamoci a restituire valori dalle funzioni!
ja: とりあえず、関数から値を返す演習をしましょう!
pt_br: Por enquanto, vamos praticar o retorno de valores de funções!
ru: А пока что давайте поупражняемся в возвращении значений из функций!
tr: Şimdilik, fonksiyonlardan değer döndürme alıştırması yapalım!
zh_hans: 现在，让我们练习从函数返回值！

source: Converting coordinates from the grid to the screen
cs: Převod souřadnic z mřížky na souřadnice obrazovky
da: Konvertering af koordinater fra gitteret til skærmen
de: Koordinaten aus dem Grid für den Bildschirm umwandeln
es: Convertir coordenadas de la cuadrícula a la pantalla
it: Convertendo coordinate della griglia a coordinate dello schermo
ja: グリッドから画面への座標の変換
pt: Converter coordenadas do grid para o ecrã
pt_br: Convertendo coordenadas do grid para a tela
ru: Конвертация координат сетки в координаты экрана
ta: ஒருங்கிணைப்புகளை கட்டத்திலிருந்து திரைக்கு மாற்றுகிறது
tr: Konumları ızgaradan alıp ekrana uygun dönüştürmek
uk: Перетворення координат із сітки на екран
zh_hans: 将坐标从网格转换到屏幕
zh_hant: 將座標從網格轉換到螢幕

source: Define a function that converts a position on a grid to the screen.
da: Definer en funktion, der konverterer en position på et gitter til skærmen.
de: Definiere eine Funktion, die eine Position auf einem Raster in einen Punkt auf dem Bildschirm umwandelt.
es: Define una función que convierta una posición de una cuadrícula a la pantalla.
it: Definisci una funzione che converte una posizione sulla griglia ad una posizione sullo schermo.
ja: グリッド上の位置を画面に変換する関数を定義します。
pt_br: Defina uma função que converta uma posição de um grid para a tela.
ru: Определите функцию для конвертации позиции на сетке в позицию на экране.
tr: Izgara üzerindeki bir konumu, ekrana uygun dönüştüren bir fonksiyon tanımlayın.
zh_hans: 定义一个将网格上的位置转换为屏幕位置的函数。

source: The function takes a [code]Vector2[/code] cell coordinate as an argument. It should return the corresponding [code]Vector2[/code] screen coordinates at the center of the cell.
da: Funktionen tager en [code]Vector2[/code] cellekoordinat som argument. Den skal returnere de tilsvarende [code]Vector2[/code] skærmkoordinater i midten af cellen.
de: Die Funktion verwendet die Zellenkoordinaten [code]Vector2[/code] als Argument. Es sollte die entsprechenden [code]Vector2[/code] Bildschirmkoordinaten in der Mitte der Zelle zurückgeben.
es: La función toma las coordenadas de una celda [code]Vector2[/code] como argumento. Esta debe devolver las coordenadas de pantalla [code]Vector2[/code] correspondientes en el centro de la celda.
it: La funzione accetta coordinate di cella del tipo [code]Vector2[/code] come argomento. Dovrebbe riportare le corrispondenti coordinate sullo schermo, del tipo [code]Vector2[/code], al centro della cella.
ja: この関数は、引数として [code]Vector2[/code] セル座標を取ります。セルの中央にある対応する [code]Vector2[/code] 画面座標を返す必要があります。
pt_br: A função recebe as coordenadas de uma célula do tipo [code]Vector2[/code] como argumento. Ela deve retornar as coordenadas de tela do tipo [code]Vector2[/code] no centro da célula.
ru: Эта функция принимает [code]Vector2[/code] — координату ячейки, в качестве аргумента. Она должна возвращать [code]Vector2[/code] — позицию центра ячейки на экране.
tr: Fonksiyon, girdi değişkeni olarak bir [code]Vector2[/code] hücre konumu alacak. Bu hücrenin ekrandaki merkezine karşılık gelen [code]Vector2[/code] konumları döndürmelidir.
zh_hans: 该函数将 [code]Vector2[/code] 单元格坐标作为参数。它应该返回单元格中心对应的 [code]Vector2[/code] 屏幕坐标。

source: We lost the function to convert grid coordinates, but we desperately need it for our game! Make the turtle move again by coding it.
cs: Ztratili jsme funkci pro převod souřadnic mřížky, ale pro naši hru ji nutně potřebujeme! Přinuťte želvu, aby se znovu pohybovala, a to tak, že funkci nakódujete.
da: Vi har mistet funktionen til at konvertere gitterkoordinater, men vi har desperat brug for den til vores spil! Få skildpadden til at bevæge sig igen ved at kode den.
de: Wir haben die Funktion zum Konvertieren von Gitterkoordinaten verloren, aber wir brauchen sie dringend für unser Spiel! Lass die Schildkröte sich wieder bewegen, indem du sie programmierst.
es: Hemos perdido la función para convertir las coordenadas de la cuadrícula, ¡pero la necesitamos desesperadamente para nuestro juego! Haz que la tortuga se mueva de nuevo codificándola.
it: Abbiamo perso la funzione che converte le coordinate nella griglia, ma ci serve assolutamente per il nostro gioco! Fai in modo che la tartaruga riprenda a muoversi scrivendo il codice necessario.
ja: グリッド座標を変換する機能を失いましたが、ゲームにはどうしても必要です!カメをコーディングして再び動かします。
pt: Perdemos a função de converter as coordenadas de grid, mas precisamos desesperadamente dela para o nosso jogo! Faça a tartaruga se mover novamente programando-a.
pt_br: Perdemos a função de converter as coordenadas de grid, mas precisamos desesperadamente dela para o nosso jogo! Faça a tartaruga se mover novamente programando ela.
ru: Мы потеряли функцию для конвертации координат сетки, но она черезвычайно важна для нашей игры! Заставьте черепаху двигаться при помощи программирования снова.
ta: கட்டம் ஆயங்களை மாற்றுவதற்கான செயல்பாட்டை நாங்கள் இழந்தோம், ஆனால் எங்கள் விளையாட்டுக்கு இது மிகவும் தேவை! ஆமை அதை குறியீடாக்குவதன் மூலம் மீண்டும் நகர்த்தவும்.
tr: Izgara konumlarını dönüştüren fonksiyonu kazara kaybettik, ancak oyunumuz için buna çok ihtiyacımız var! Kaplumbağayı kodlayarak tekrar hareket etmesini sağlayın.
uk: Ми втратили функцію перетворення координат сітки, але вона нам конче потрібна для нашої гри! Змусьте черепаху знову рухатися, закодувавши її.
zh_hans: 我们弄丢了转换网格坐标的函数，但我们的游戏没了它不行！写好它，使小海龟能再次移动。
zh_hant: 我們失去了將格子座標轉換的函式，但我們的遊戲迫切需要它！請透過程式碼讓海龜再次移動。

source: Functions that return a value
cs: Funkce, které vracejí hodnotu
da: Funktioner, der returnerer en værdi
de: Funktionen, die einen Wert zurückgeben
es: Funciones que devuelven un valor
it: Funzioni che ritornano valori
ja: 値を返す関数
pt: Funções que retornam um valor
pt_br: Funções que retornam um valor
ru: Функции, возвращающие значения
ta: ஒரு மதிப்பைத் தரும் செயல்பாடுகள்
tr: Değer döndüren fonksiyonlar
uk: Функції, що повертають значення
zh_hans: 返回值的函数
zh_hant: 回傳值的函式

source: Until now, you learned that functions are sequences of instructions you give a name and you can call any time. On top of that, functions can make calculations and [i]return[/i] new values. Let's look at some examples to see why it's useful.
cs: Doposud jste se naučili, že funkce jsou posloupnosti instrukcí, které pojmenujete a můžete je kdykoli zavolat. Kromě toho mohou funkce provádět výpočty a [i]vracet[/i] nové hodnoty. Podívejme se na několik příkladů, abychom viděli, proč je to užitečné.
pt: Até agora, aprendeu que funções são sequências de instruções que dá um nome e pode chamar a qualquer momento. Além disso, as funções podem fazer cálculos e [i]retornar[/i] novos valores. Vamos ver alguns exemplos para ver por que isso é útil.
ta: இப்போது வரை, செயல்பாடுகள் நீங்கள் ஒரு பெயரைக் கொடுக்கும் வழிமுறைகளின் வரிசைகள் என்பதை நீங்கள் கற்றுக்கொண்டீர்கள், எந்த நேரத்திலும் நீங்கள் அழைக்கலாம். அதற்கு மேல், செயல்பாடுகள் கணக்கீடுகளைச் செய்யலாம் மற்றும் [i] திரும்ப [/i] புதிய மதிப்புகள். இது ஏன் பயனுள்ளதாக இருக்கிறது என்பதைப் பார்க்க சில எடுத்துக்காட்டுகளைப் பார்ப்போம்.
uk: Дотепер ви знали, що функції — це послідовності інструкцій, яким ви даєте ім’я, яке ви можете викликати будь-коли. Крім того, функції можуть виконувати обчислення та [i]повертати[/i] нові значення. Давайте розглянемо кілька прикладів, щоб зрозуміти, чому це корисно.
zh_hant: 到目前為止，你已經學習到函式是一組指令的序列，你可以為它們命名，並在任何時候呼叫它們。 除此之外，函式還可以進行計算並[b]回傳(return)[/b]新的數值。 讓我們來看看一些例子，了解這樣做為何有用。

source: Many functions built into GDScript make calculations and return a new value. For example, the [code]round()[/code] function takes a decimal number as an argument and gives you back a new number rounded to the nearest digit.
cs: Mnoho funkcí integrovaných v jazyce GDScript provádí výpočty a vrací novou hodnotu. Například funkce [code]round()[/code] přijme jako argument desetinné číslo a vrátí nové číslo zaokrouhlené na nejbližší celé číslo.
pt: Muitas funções já incorporadas no GDScript fazem cálculos e retornam um novo valor. Por exemplo, a função [code]round()[/code] recebe um número decimal como argumento e retorna um novo número arredondado ao dígito mais próximo.
ta: GDSCRIPT இல் கட்டமைக்கப்பட்ட பல செயல்பாடுகள் கணக்கீடுகளை உருவாக்கி புதிய மதிப்பைத் தருகின்றன. எடுத்துக்காட்டாக, [குறியீடு] சுற்று () [/குறியீடு] செயல்பாடு ஒரு தசம எண்ணை ஒரு வாதமாக எடுத்து, அருகிலுள்ள இலக்கத்திற்கு வட்டமான புதிய எண்ணை மீண்டும் வழங்குகிறது.
uk: Багато функцій, вбудованих у GDScript, виконують обчислення та повертають нове значення. Наприклад, функція [code]round()[/code] приймає десяткове число як аргумент і повертає вам нове число, округлене до найближчої цифри.
zh_hant: 許多內建於 GDScript 的函式會執行計算並回傳新的數值。 例如 [code]round()[/code] 函式接受一個小數作為引數，並回傳四捨五入後的整數。

source: Imagine you have a game where you track the player's health as a percentage, a decimal number going from [code]0.0[/code] to [code]100.0[/code]. When displaying the health on the interface, you don't want to show the decimal part. In that case, you may use the [code]round()[/code] function, like so.
cs: Představte si, že máte hru, ve které sledujete zdraví hráče v procentech, jako desetinné číslo od [code]0.0[/code] do [code]100.0[/code]. Při zobrazování zdraví v grafickém rozhraní nechcete zobrazovat desetinnou část. V takovém případě můžete použít funkci [code]round()[/code], například takto.
ta: வீரரின் ஆரோக்கியத்தை ஒரு சதவீதமாகக் கண்காணிக்கும் ஒரு விளையாட்டு உங்களிடம் உள்ளது என்று கற்பனை செய்து பாருங்கள், [குறியீடு] 0.0 [/குறியீடு] இலிருந்து [குறியீடு] 100.0 [/குறியீடு] வரை செல்லும் தசம எண். இடைமுகத்தில் ஆரோக்கியத்தைக் காண்பிக்கும் போது, நீங்கள் தசம பகுதியைக் காட்ட விரும்பவில்லை. அவ்வாறான நிலையில், நீங்கள் [குறியீடு] சுற்று () [/குறியீடு] செயல்பாட்டைப் பயன்படுத்தலாம்.
uk: Уявіть, що у вас є гра, у якій ви відстежуєте здоров’я гравця у відсотках, десяткове число від [code]0.0[/code] до [code]100.0[/code]. Під час відображення здоров’я в інтерфейсі ви не хочете показувати десяткову частину. У такому випадку ви можете використати функцію [code]round()[/code], наприклад.
zh_hant: 想像你正在製作一款遊戲，玩家的血量以百分比表示，數值範圍從 [code]0.0[/code] 到 [code]100.0[/code]。 在介面上顯示血量時，你可能不希望顯示小數部分。在這種情況下，你可以使用 [code]round()[/code] 函式來進行四捨五入。

source: Notice how we assign the result of the function call to a variable. Because the [code]round()[/code] function returns a [i]new[/i] value, we need to either store the result or use the value immediately. Above, we assigned it to a variable, but you could also do the following.
cs: Všimněte si, jak výsledek volání funkce přiřazujeme do proměnné. Protože funkce [code]round()[/code] vrací [i]novou hodnotu[/i], musíme výsledek buď uložit, nebo hodnotu okamžitě použít. Výše jsme ji přiřadili do proměnné, ale mohli byste to udělat i takto.
pt: Observe como atribuímos o resultado da chamada de função a uma variável. Como a função [code]round()[/code] retorna um [i]novo[/i] valor, precisamos armazenar o resultado ou usar o valor imediatamente. Acima, atribuímos-o a uma variável, mas também pode fazer o seguinte.
ta: செயல்பாட்டு அழைப்பின் முடிவை ஒரு மாறிக்கு எவ்வாறு ஒதுக்குகிறோம் என்பதைக் கவனியுங்கள். [குறியீடு] சுற்று () [/குறியீடு] செயல்பாடு [i] புதிய [/i] மதிப்பை வழங்குவதால், நாம் முடிவை சேமிக்க வேண்டும் அல்லது உடனடியாக மதிப்பைப் பயன்படுத்த வேண்டும். மேலே, நாங்கள் அதை ஒரு மாறிக்கு ஒதுக்கினோம், ஆனால் நீங்கள் பின்வருவனவற்றையும் செய்யலாம்.
uk: Зверніть увагу, як ми присвоюємо результат виклику функції змінній. Оскільки функція [code]round()[/code] повертає [i]нове[/i] значення, нам потрібно або зберегти результат, або негайно використати значення. Вище ми призначили його змінній, але ви також можете зробити наступне.
zh_hant: 注意我們如何將函式呼叫的結果指定給變數。由於 [code]round()[/code] 函式會回傳一個[b]新的[/b]數值，因此我們需要將結果儲存起來，或者立即使用該數值。 在上面的例子中，我們將結果指定給變數，但你也可以這樣做。
