Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-1-what-code-*-like.po
Languages: cs, da, de, es, fr, it, ja, nl, ru, ta, tr, uk, zh_hant

source: Do not expect any single course or book to turn you into a professional. [b]Programming is something you learn through practice.[/b]
cs: Neočekávejte, že z vás jediný kurz nebo kniha udělá profesionála. [b]Programování se naučíte praxí [/b].
da: Forvent ikke noget enkelt kursus eller bog vil at forvandle dig til en professionel. [b]Programming er noget, du lærer gennem øvelse.
de: Erwarte nicht, dass ein einzelner Kurs oder ein Buch dich zu einem Profi macht. [b]Programmieren ist etwas, das man durch Übung lernt.[/b]
es: No esperes que un solo curso o libro te convierta en un profesional. [b]La programación es algo que se aprende con la práctica.[/b]
ja: 1つの講座や1冊の書籍だけでプロになれると期待するのはやめましょう。[b]プログラミングは練習を通じて学ぶものなのです。[/b]
ru: Не ждите, что какой-то один курс или книга сделают из вас профессионала. [b]Программирование — это то, чему вы учитесь на практике.[/b]
tr: Herhangi bir kurs veya kitabın tek başına sizi bir profesyonele dönüştürmesini beklemeyin. [b]Programlama, alıştırma yapılarak öğrenilen bir şeydir.[/b]
uk: Не очікуйте, що якийсь один курс чи книга зроблять із вас фахівця. [b]Програмування - це те, чого ви вчитеся на практиці.[/b]

source: If something doesn't make immediate sense, don't stress it too much! Keep learning and come back to it later.
cs: Pokud něco nedává okamžitý smysl, příliš se tím nestresujte! Učte se dál a vraťte se k tomu později.
da: Hvis noget ikke giver øjeblikkelig mening, skal du ikke stresse det for meget! Bliv ved med at lære og komme tilbage til det senere.
de: Wenn etwas nicht sofort Sinn ergibt, lass dich davon nicht verunsichern! Übe weiter und komme später darauf zurück.
es: Si algo no tiene sentido inmediatamente, ¡no te estreses demasiado! Sigue aprendiendo y vuelve a ello más tarde.
ja: すぐに理解できないことがあっても、あまり悩みすぎないでください！学び続けて、後でまた戻ってくればいいのです。
ru: Если что-то не получается понять сразу, не переживайте слишком сильно! Продолжайте учиться и возвращайтесь к этому позже.
tr: Eğer bir şeyi hemen anlamazsanız, canınızı çok sıkmayın! Öğrenmeye devam edin ve daha sonra dönüp tekrar bakın.
uk: Якщо щось не вдається зрозуміти одразу, не хвилюйтесь надто сильно! Продовжуйте вчитися і поверніться до цього пізніше.

source: Enjoy the process and celebrate every little success. You will never stop learning as a game developer.
cs: Užívejte si proces a oslavujte každý malý úspěch. Jako herní vývojář se nikdy nepřestanete učit.
da: Nyd processen og fejre hver lille succes. Du vil aldrig stoppe med at lære som spiludvikler.
de: Genieße den Lernprozess und feiere jeden kleinen Erfolg. In der Spielentwicklung wirst du nie aufhören zu lernen.
es: Disfruta del proceso y celebra cada pequeño éxito. Nunca dejarás de aprender como desarrollador(a) de juegos.
ja: その過程を楽しみ、どんな小さな成功でもお祝いしましょう。ゲーム開発者の学習が止まることは決してないのです。
ru: Наслаждайтесь процессом и радуйтесь каждому маленькому успеху. Как разработчик игр, вы никогда не перестанете учиться.
tr: Sürecin keyfini çıkarın ve her küçük başarıyı kutlayın. Bir oyun geliştiricisi olarak, bir şeyler öğrenmeniz hiç bitmeyecek.
uk: Насолоджуйтесь процесом і радійте кожному маленькому успіху. Як розробник ігор ви ніколи не перестанете вчитися.

source: What and how you'll learn
cs: Co a jak se naučíte
da: Hvad og hvordan du lærer
de: Was und wie Du lernen wirst
es: Qué y cómo aprenderás
fr: Ce que vous apprendrez et comment
it: Cosa imparerai e come
ja: 何をどうやって学ぶか
nl: Wat en hoe je zult leren
ru: Чему и как вы научитесь
ta: என்ன, எப்படி நீங்கள் கற்றுக்கொள்வீர்கள்
tr: Neyi ve nasıl öğreneceksiniz
uk: Чого і як ви навчитеся
zh_hant: 學習的內容與方法

source: In this free course, you will learn the foundations you need to start coding things like these:
cs: V tomto bezplatném kurzu se naučíte základy, které potřebujete k tomu, abyste mohli začít kódovat věci jako:
da: I dette gratis kursus, vil du lære de fundamenter, du skal bruge for at starte med at kode ting som disse:
de: In diesem kostenlosen Kurs wirst du die Grundlagen lernen, um Dinge wie das folgende Beispiel zu programmieren:
es: En este curso gratuito, aprenderás los fundamentos que necesitas para empezar a codificar cosas como esas.
fr: Dans ce cours gratuit, vous apprendrez les bases dont vous avez besoin pour commencer à coder des choses comme celles-ci :
it: In questo corso gratuito, imparerai le basi necessarie per iniziare a programmare cose come queste:
ja: この無料講座では、これらのものを作るためのプログラミングの基礎を学習します。
nl: In deze gratis cursus leer je de basisbeginselen die je nodig hebt om dit soort dingen te kunnen programmeren:
ru: В этом бесплатном курсе вы изучите основы, необходимые для того, чтобы начать программировать такие вещи как:
ta: இந்த இலவச பாடத்திட்டத்தில், இது போன்ற விசயங்களை குறியிடத் தொடங்க வேண்டிய அடித்தளங்களை நீங்கள் கற்றுக்கொள்வீர்கள்:
tr: Bu ücretiz kursta, kodlamaya başlamanız için gereken, aşağıdakiler gibi temelleri öğreneceksiniz:
uk: У цьому безплатному курсі ви вивчите основи, необхідні для того, щоб почати програмувати такі речі як:
zh_hant: 在這門免費課程中，你將學習到開始編寫像這些程式所需的基礎知識：

source: Along the way, we'll teach you:
cs: Ve cvičení vás naučíme:
da: Undervejs lærer vi dig:
de: Auf dem Weg dorthin bringen wir dir folgendes bei:
es: En el camino, te enseñaremos:
ja: その過程で、以下のことを学びます。
ru: Попутно мы научим вас:
tr: Kurs boyunca, size şunları öğreteceğiz:
uk: Попутно ми навчимо вас:

source: - Some of the mindset you need as a developer. Too many programming courses skip that essential part. - How to write GDScript code. - Essential programming foundations to get you started.
cs: - Některé myšlenkové postupy, které jako vývojář potřebujete. Příliš mnoho kurzů programování tuto podstatnou část vynechává. - Jak psát kód v jazyce GDScript. - Základy programování, které vám pomohou začít.
da: - Noget af den tankegang, du har brug for som udvikler. For mange programmeringskurser springer denne væsentlige del over. - Hvordan man skriver GDScript kode. - Væsentlig programmeringsgrundlag for at få dig i gang.
de: - Etwas über die der Denkweise, die Du als Entwickler brauchst. Zu viele Programmierkurse überspringen diesen wesentlichen Teil. - Wie man GDScript-Code schreibt. - Essenzielle Grundlagen der Programmierung, auf welchen du aufbauen kannst.
es: - Aspectos importantes de la mentalidad que necesitas como desarrollador(a). Demasiados cursos de programación se saltan esa parte esencial. - Cómo escribir código de GDScript. - Fundamentos de programación esenciales para empezar.
ja: - 開発者として必要な考え方。あまりにも多くのプログラミング講座が、この肝心な部分を飛ばしています。 - GDScriptのコードの書き方 - プログラミングを始めるために不可欠な基礎知識
ru: - Некоторым особенностям мышления, необходимым вам как разработчику. Слишком многие курсы программирования пропускают эту категорически важную часть. - Как писать код на языке GDScript. - Ключевым основам программирования, которые помогут вам начать работу.
tr: - Bir geliştirici olarak ihtiyacınız olan düşünme şeklinin bir kısmı. Birçok programlama kursu bu temel kısmı atlıyor. - GDScript kodunun nasıl yazıldığı. - Başlamak için en gerekli programlama temelleri.
uk: - Деяким особливостям мислення, необхідним вам як розробнику. Багато курсів програмування пропускають цю категорично важливу частину. - Як писати код мовою GDScript. - Ключовим основам програмування, які допоможуть вам розпочати роботу.

source: As you go through the course, you will have many questions. We will answer them the best we can as we go.
cs: Při procházení kurzu budete mít mnoho otázek. Odpovíme vám na ně, jak nejlépe budeme umět.
da: Som du kommer gennem kurset, vil du have mange spørgsmål. Vi vil besvare dem det bedste, vi kan, som vi kommer frem.
de: Während dem Kurs wirst du viele Fragen haben. Wir werden diese so gut wie möglich beantworten.
es: A medida que vayas avanzando en el curso, tendrás muchas preguntas. Las responderemos lo mejor que podamos sobre la marcha.
ja: 講座を進めるにつれて、たくさんの疑問が出てくるでしょう。できる限りお答えしていきます。
ru: По мере прохождения курса у вас возникнет много вопросов. Мы ответим на них как можно лучше по ходу дела.
tr: Kursta ilerledikçe, birçok sorularınız olacak. Onları, kurs boyunca elimizden geldiğince en iyi şekilde cevaplandıracağız.
uk: У міру проходження курсу у вас виникне багато питань. Ми відповімо на них якнайкраще по ходу справи.

source: But there is so much to cover that we have to take a few shortcuts. We don't want to [i]overwhelm[/i] you with information. We also want to respect the pace at which our brains memorize things.
cs: Je toho ale tolik, že se musíme trochu uskrovnit. Nechceme vás [i] zahltit[/i] informacemi. Chceme také respektovat tempo, jakým si náš mozek věci zapamatuje.
da: Men der er så meget at gennemgå, at vi bliver nød til at tage et par genveje. Vi ønsker ikke at [i]overvælde[/i] dig med oplysninger. Vi ønsker også at holde et tempo, hvor vores hjerner huske tingene.
de: Aber es gibt so viel zu behandeln, dass wir ein paar Abkürzungen nehmen müssen. Wir wollen Dich nicht mit Informationen [i]überfordern[/i]. Ausserdem wollen wir das Tempo, mit dem sich unser Gehirn Dinge merkt, respektieren.
es: Pero hay tanto que cubrir que tendremos que tomar algunos atajos. No queremos [i]abrumarte[i] con información. También queremos respetar el ritmo al que nuestros cerebros memorizan las cosas.
ja: しかし取り上げることが非常にたくさんあるので、少し簡略化しなければなりません。情報の多さに[i]打ちのめされてしまう[/i]のは望ましくありません。それに、脳が物事を記憶していくペースを尊重したいと思っています。
ru: Но в курсе так много всего нужно охватить, что нам пришлось сделать несколько сокращений. Мы не хотим [i]перегружать[/i] вас информацией. Также мы попытаемся придерживаться темпа, при котором ваш мозг лучше всего запомнит пройденный материал.
tr: Ancak öğretilmesi gereken o kadar çok şey var ki arada bazı kestirmelere başvurmamız gerekiyor. Sizi bilgilerle [i]bunaltmak[/i] istemiyoruz. Aynı zamanda, beyinlerimizin bir şeyleri ezberleme hızına da saygı duymak istiyoruz.
uk: Але в курсі потрібно охопити так багато, що нам довелося зробити кілька скорочень. Ми не хочемо [i]перевантажувати[/i] вас інформацією. Також ми спробуємо дотримуватися темпу, за якого ваш мозок найкраще запам'ятає пройдений матеріал.

source: We broke down the course into short lessons and practices. If we put too much into each part, you'd learn slower.
cs: Proto jsme kurz rozdělili do krátkých lekcí a cvičení. Kdybychom do každé části vložili příliš mnoho, učili byste se pomaleji.
da: Vi har delt kurset op i korte lektioner og øvelser. Hvis vi sætter for meget ind i hver del, vil du lære langsommere.
de: Wir haben den Kurs in kurze Lektionen mit passenden Übungen unterteilt. Wenn wir zu viel in jeden Teil stecken, würdest du langsamer lernen.
es: Hemos dividido el curso en lecciones y prácticas cortas. Si pusiéramos demasiado en cada parte, aprenderías más lento.
ja: 私たちはこの講座を短いレッスンと演習に分けました。それぞれの部分に情報を詰め込みすぎると、学習速度が遅くなってしまうためです。
ru: Для этого мы специально разбили курс на короткие уроки и практические задания. Если мы будем вкладывать слишком много информации в каждую часть, вы будете учиться медленнее.
tr: Kursu kısa derslere ve alıştırmalara böldük. Her bir kısma çok fazla şey koysaydık, daha yavaş öğrenirdiniz.
uk: Для цього ми спеціально розбили курс на короткі уроки та практичні завдання. Якщо ми вкладатимемо надто багато інформації в кожну частину, ви будете навчатися повільніше.

source: If at any time you're left with burning questions, you're more than welcome to join [url=https://discord.gg/87NNb3Z]our Discord community[/url].
cs: Pokud Vás budou trápit další otázky, jste vítáni připojit se k [url=https://discord.gg/87NNb3Z]naší komunitě na Discordu[/url].
da: Hvis du til enhver tid stadig har brændende spørgsmål, er du mere end velkommen til at tilmelde dig [url=https://discord.gg/87NNb3Z]our Discord community[/url].
de: Wenn du zu irgendeinem Zeitpunkt mit brennenden Fragen zurückbleibst, bist du herzlich eingeladen, [url=https://discord.gg/87NNb3Z]unserer Discord-Community beizutreten[/url].
es: Si en algún momento te quedas con dudas que no pueden esperar, te invitamos a unirte a [url=https://discord.gg/87NNb3Z]nuestra comunidad de Discord[/url].
ja: 質問したいことがある場合は、ぜひ[url=https://discord.gg/87NNb3Z]私たちのDiscordコミュニティ[/url]へ参加してみてください。私たちはいつでも心から歓迎します。
ru: Если в любой момент прохождения курса у вас возникнут горящие вопросы, мы с большой радостью на них ответим [url=https://discord.gg/87NNb3Z]в нашем сообществе Discord[/url].
tr: Eğer herhangi bir noktada cevabını öğrenmek zorunda hissettiğiniz sorularınız olursa, [url=https://discord.gg/87NNb3Z]Discord topluluğumuza (İngilizce)[/url] çekinmeden katılabilirsiniz.
uk: Якщо в будь-який момент проходження курсу у вас виникнуть невідкладні питання, ми з радістю на них відповімо [url=https://discord.gg/87NNb3Z]в нашій спільноті в Discord[/url].

source: Is this for Godot 4?
cs: Je tento kurz pro Godot 4?
da: Er dette til Godot 4?
de: Is dieser Kurs für Godot 4?
es: ¿Esto es para Godot 4?
ja: これはGodot 4用ですか?
nl: Is dit voor Godot 4?
ru: Актуален ли этот курс для Godot 4?
ta: இது கோடோட் 4 க்கானதா?
tr: Bu Godot 4 için de geçerli mi?
uk: Чи актуальний цей курс для Godot 4?
zh_hant: 這個教學適用於 Godot 4 嗎？

source: What you'll learn in this free course is fully compatible with Godot 4. While we initially designed this series for Godot 3, the foundations of GDScript are still the same in Godot 4.
cs: To, co se naučíte v tomto bezplatném kurzu, je plně kompatibilní s Godotem 4. Ačkoli jsme tuto sérii původně navrhli pro Godot 3, základy GDScriptu jsou stejné i v Godotu 4.
da: Hvad du lærer i dette gratis kursus er fuldt kompatibel med Godot 4. Mens vi oprindeligt designede denne serie til Godot 3, er grundlaget for GDScript stadig det samme i Godot 4.
de: Was du in diesem kostenlosen Kurs lernen wirst ist völlig kompatibel mit Godot 4. Der kurs ist mit Godot 3 designed worden, aber die Grundlagen von GDScript sind die gleichen.
es: Lo que aprenderás en este curso gratuito es totalmente compatible con Godot 4. Aunque inicialmente diseñamos esta serie para Godot 3, los fundamentos de GDScript siguen siendo los mismos en Godot 4.
ja: この無料コースで学ぶことは、Godot 4と完全に互換性があります。当初はこのシリーズをGodot 3用に設計しましたが、GDScriptの基礎はGodot 4でも同じです。
nl: Wat je leert in deze gratis cursus is volledig compatibel met Godot 4. Hoewel we deze reeks oorspronkelijk ontworpen hebben voor Godot 3, zijn de fundamenten van GDScript nog steeds hetzelfde in Godot 4.
ru: То, что вы изучите в этом бесплатном курсе, полностью совместимо с Godot 4. Несмотря на то, что изначально этот курс был создан для Godot 3, основы GDScript не поменялись в четвертой версии движка.
ta: இந்த இலவச பாடத்திட்டத்தில் நீங்கள் கற்றுக்கொள்வது கோடோட் 4 உடன் முழுமையாக ஒத்துப்போகும். ஆரம்பத்தில் இந்த தொடரை கோடோட் 3 க்காக வடிவமைத்தாலும், சி.டி.எச்ச்கிரிப்ட்டின் அச்திவாரங்கள் இன்னும் கோடோட் 4 இல் ஒரே மாதிரியாக இருக்கின்றன.
tr: Bu ücretsiz kursta öğrenecekleriniz Godot 4 ile tamamen uyumludur. Bu seriyi başlangıçta Godot 3 için tasarlamış olsak ta, GDScript'in temelleri Godot 4'te de hala aynıdır.
uk: Те, що ви вивчите в цьому безплатному курсі, повністю сумісне з Godot 4. Попри те, що спочатку цей курс створено для Godot 3, основи GDScript у четвертій версії рушія не змінились.
zh_hant: 在這個免費課程中，你學到的內容完全相容於 Godot 4。雖然這些課程最初是以 Godot 3 為基礎設計的，但 GDScript 的基礎功能同樣適用於 Godot 4。

source: Programming is a skill
cs: Programování je dovednost
da: Programmering er en færdighed
de: Programmieren ist eine Fähigkeit
es: Programar es una habilidad
fr: La programmation est une compétence
it: Programmare è un'abilità
ja: プログラミングは特殊技能
nl: Programmeren is een vak
ru: Программирование — это навык
ta: நிரலாக்கமானது ஒரு திறமை
tr: Programlama bir beceridir
uk: Програмування - це навичка
zh_hant: 程式是種技能

source: Programming is a skill, so to get good at it, you must practice. It is why we built this app.
cs: Programování je dovednost, a abyste se v něm zdokonalili, musíte trénovat. Proto jsme vytvořili tuto aplikaci.
da: Programmering er en færdighed, for at blive god til det, skal du øve. Det er derfor, vi designede denne app.
de: Programmieren ist eine Fähigkeit, also musst du üben, um gut darin zu werden. Deshalb haben wir diese App entwickelt.
es: Programar es una habilidad, así que para mejorar, debes practicar. Es por eso que hemos creado esta aplicación.
ja: プログラミングは特殊技能なので、上達するためには練習が必要です。それがこのアプリを作った理由です。
ru: Программирование — это навык, поэтому, чтобы овладеть им, вы должны практиковаться. Именно поэтому мы создали это приложение.
tr: Programlama bir beceridir, bu yüzden, iyi olmak için alıştırma yapmalısın. Bu uygulamayı bu nedenle inşa ettik.
uk: Програмування - це навичка, тому, щоб опанувати її, ви маєте практикуватися. Саме тому ми створили цю програму..

source: Each lesson is followed by an interactive practice to use what you learned.
cs: Po každé lekci následuje interaktivní cvičení, kde můžete použít to, co jste se naučili.
da: Hver lektion efterfølges af en interaktiv øvelse for at bruge, hvad du lærte.
de: Auf jede Lektion folgt sofort eine interaktive Übung, damit du das Gelernte direkt anwenden kannst.
es: Cada lección va seguida de una práctica interactiva para que puedas usar lo que aprendiste.
ja: 各レッスンの後にはインタラクティブな演習があり、学んだことを使うことができます。
ru: За каждым уроком следует интерактивная практика, позволяющая закрепить то, что вы выучили.
tr: Her bir dersi, öğrendiklerinizi kullanmanız için etkileşimli bir alıştırma takip ediyor.
uk: Кожен урок супроводжує інтерактивна практика, яка дає змогу закріпити вивчене.

source: Speaking of which, it's time to look at the practice screen!
cs: Když už jsme u toho, je čas podívat se na obrazovku s cvičeními!
da: Nu vi taler om det, det er tid til at se på øvelsesskærmen!
de: Apropos, es ist Zeit, auf den Übungsbildschirm zu schauen!
es: Hablando de eso, ¡es hora de ver la pantalla de práctica!
ja: そういえば、そろそろその演習画面を見に行く時間ですね！
ru: Пришло время взглянуть на экран практики!
tr: Lafı açılmışken, artık alıştırma ekranına bir göz atma vakti geldi!
uk: Настав час глянути на екран практики!

source: To continue, click the [i]Practice[/i] button below. It will give you a short run through how practices work.
cs: Chcete-li pokračovat, klikněte na tlačítko [i]Practice[/i] níže. V něm se krátce seznámíte s tím, jak praktiky fungují.
da: For at fortsætte, skal du klikke på knappen [i]Øvelse[/i] nedenfor. Den vil give dig en kort gennemgang af, hvordan øvelserne fungerer.
de: Um fortzufahren, klicke unten auf die Schaltfläche [i]Üben[/i]. Diese gibt dir einen kurzen Überblick darüber, wie die Übungen funktionieren.
es: Para continuar, haz clic en el botón [i]Práctica[/i] de abajo. Te dará una breve explicación de cómo funcionan las prácticas.
ja: 次に進むためには、下の[i]演習[/i]ボタンをクリックします。その中で演習がどのように行われるのか簡単に説明します。
ru: Чтобы продолжить, нажмите кнопку [i]Практика[/i] ниже. После нажатия вы получите краткое представление о том, как работают упражнения.
tr: Devam etmek için, aşağıdaki [i]Alıştırma[/i] düğmesine tıklayın. Size, alıştırmaların nasıl işlediğine dair kısa bir özet sunacak.
uk: Щоб продовжити, натисніть нижче кнопку [i]Практика[/i]. Після натискання ви коротко ознайомитеся з тим, як працюють вправи.

source: Try Your First Code
cs: Vyzkoušejte svůj první kód
da: Prøv din første kode
de: Teste deinen ersten Code
es: Prueba tu primer código
fr: Essayez votre premier code
it: Prova Il Tuo Primo Codice
ja: 最初のコードを実行してみよう
nl: Probeer je eerste code uit
ru: Первое Знакомство С Кодом
ta: உங்கள் முதல் குறியீட்டை முயற்சிக்கவும்
tr: İlk Kodunuzu Deneyin
uk: Випробуйте свій перший код
zh_hant: 試試你的第一個程式碼

source: We prepared a code sample for you. For this practice, you don't need to change anything.
cs: Připravili jsme pro vás ukázku kódu. Pro tento postup nemusíte nic měnit.
da: Vi har forberedte et kode eksempel til dig. I denne øvelse behøver du ikke at ændre noget.
de: Wir haben ein Codebeispiel für dich vorbereitet. Für diese Übung musst Du nichts ändern.
es: Hemos preparado un ejemplo de código para ti. Para esta práctica, no necesitas cambiar nada.
ja: サンプルコードを用意しました。この演習では、何も変更する必要はありません。
ru: Мы подготовили для вас образец кода. В этом практическом упражнении вам не нужно ничего менять.
tr: Sizin için bir kod örneği hazırladık. Bu alıştırma için, herhangi bir şeyi değiştirmeniz gerekmiyor.
uk: Ми підготували для вас зразок коду. У цій практичній вправі вам не потрібно нічого змінювати.

source: To test the code, click the [i]Run[/i] button below the code editor.
cs: Chcete-li kód vyzkoušet, klikněte na tlačítko [i]Run/Spustit[/i] pod editorem kódu.
da: Hvis du vil teste koden, skal du klikke på knappen [i]Kør[/i] under kodeeditoren.
de: Um den Code zu testen, klicke auf die Schaltfläche [i]Ausführen[/i] unter dem Code-Editor.
es: Para probar el código, haz clic en el botón [i]Ejecutar[/i] situado debajo del editor de código.
ja: コードをテストするために、コードエディタの下にある[i]実行[/i]ボタンをクリックしてください。
ru: Чтобы протестировать код, нажмите кнопку [i]Выполнить[/i] под редактором кода.
tr: Kodu denemek için, kod düzenleyicinin altındaki [i]Çalıştır[/i] düğmesine tıklayın.
uk: Щоб випробувати код, натисніть під редактором коду кнопку [i]Виконати[/i].

source: Run your first bit of code and see the result.
cs: Spusťte první část kódu a podívejte se na výsledek.
da: Kør din første kode og se resultatet.
de: Führe dein erstes Stück Code aus und sieh Dir das Ergebnis an.
es: Ejecuta tu primer pedacito de código y mira el resultado.
fr: Exécutez votre premier morceau de code et voyez le résultat.
it: Esegui il tuo primo pezzetto di codice e guarda il risultato.
ja: 最初のコードを実行して、その結果を確認する。
nl: Voer je eerste stukje code uit en bekijk het resultaat.
ru: Запустите свой первый кусочек кода и посмотрите на результат.
ta: உங்கள் முதல் பிட் குறியீட்டை இயக்கி முடிவைக் காண்க.
tr: İlk kod parçanızı çalıştırın ve sonucu görün.
uk: Запустіть свій перший шматочок коду та перегляньте результат.
zh_hant: 執行你的第一個程式碼並檢視結果。

source: What Code is Like
cs: Jak kód vypadá
da: Hvordan kode er
de: Wie Code aussieht
es: Cómo es el código
fr: À quoi ressemble le code
it: Come Funziona Il Codice
ja: コードとは
nl: Hoe code eruit ziet
ru: Как Выглядит Код
ta: என்ன குறியீடு போன்றது
tr: Kod Neye Benzer
uk: Як виглядає код
zh_hant: 程式碼是什麼

source: Learning to program can be daunting. Yet, you want to make video games, so [b]there is no way around learning to program[/b]. [i]Every[/i] video game is a computer program.
fr: Apprendre à programmer peut être décourageant. Cependant, vous voulez créer des jeux vidéo, et [b]il n'y a aucun moyen de contourner l'apprentissage de la programmation[/b]. [i]Chaque[/i] jeu vidéo est un programme informatique.
it: Imparare a programmare può essere estenuante. Ma, tu vuoi fare videogiochi, quindi [b]non c'è alcun modo di evitare di non imparare a programmare[/b]. [i]Ogni[/i] videogioco è un programma per computer.
nl: Leren programmeren kan ontmoedigend zijn. Toch wil je videogames maken, dus [b]kun je er niet omheen om te leren programmeren[/b]. [i]Elk[/i] videogame is een computerprogramma.
ta: நிரலுக்குக் கற்றுக்கொள்வது அச்சுறுத்தலாக இருக்கும். ஆயினும்கூட, நீங்கள் வீடியோ கேம்களை உருவாக்க விரும்புகிறீர்கள், எனவே [b] நிரல் செய்ய கற்றுக்கொள்வதில் எந்த வழியும் இல்லை [/b]. [i] ஒவ்வொரு [/i] வீடியோ கேம் ஒரு கணினி நிரல்.
zh_hant: 學習程式可能令人恐懼。 然而，你想要做遊戲，那就[b]不可能避開學習撰寫程式[/b]。[b]每個[/b]電玩遊戲都是電腦程式。
