Repository: GDQuest/learn-gdscript
Catalog: i18n/*/lesson-9-adding-and-subtracting.po
Languages: cs, da, de, es, fr, it, nl, pt, ru, ta, tr, uk, zh_hant

source: Our character in our game will have health by defining the [code]health[/code] variable. The higher the character's health, the further away the player is from losing the game.
da: Vores karakter i vores spil vil have liv ved at definere [code]health[/code] variabel. Jo højere karakterens liv, desto længere væk er spilleren fra at tabe spillet.
de: Der Charakter in unserem Spiel wird Leben haben, indem er die Variable [code]health[/code](Leben) definiert. Je höher das Leben des Charakters sind, desto weiter ist der Spieler davon entfernt, das Spiel zu verlieren.
es: Nuestro personaje en nuestro juego tendrá salud al definir la variable de salud: [code]health[/code]. Cuanto mayor sea la salud del personaje, más lejos estará el jugador de perder el juego.
fr: Notre personnage dans notre jeu aura de la santé en définissant la variable [code]health[/code]. Plus la santé du personnage est élevée, plus le joueur est loin de perdre la partie.
nl: Ons personage in ons spel zal gezondheid hebben als we de variabele [code]health[/code] definiëren. Hoe hoger de gezondheid van het personage, hoe verder de speler verwijderd is van het verliezen van het spel.
pt: A personagem do nosso jogo vai ter uma vida quando definirmos a variável [code]health[/code]. Quanto maior a vida da personagem, mais distante o jogador está de perder o jogo.
ru: Здоровье главного героя нашей игры будет определено переменной [code]health[/code]. Чем выше здоровье персонажа, тем дальше игрок от поражения.
tr: Oyunumuzdaki karakterimiz, [code]health[/code] (sağlık) değişkenini tanımladığınızda artık bir sağlığa sahip olacaktır. Karakterin canı ne kadar yüksek olursa, oyuncunun oyunu kaybetmesi de o kadar zor olur.
uk: Здоров'я головного героя нашої гри буде визначати змінна [code]health[/code]. Що більше здоров'я персонажа, то далі гравець від поразки.

source: Health that changes adds tension to the game, especially if the player is fighting with low health! It's a resource that the player should manage carefully.
da: Liv, der ændrer sig tilføjer spænding til spillet, især hvis spilleren kæmper med lavt liv! Det er en ressource, at spilleren skal styre omhyggeligt.
de: Leben, das sich ändert, erhöht die Spannung des Spiels, besonders wenn der Spieler mit niedrigem Leben kämpft! Es ist eine Ressource, die dieser Spieler sorgfältig verwalten sollte.
es: La salud que cambia le agrega tensión al juego, ¡especialmente si el jugador está luchando con poca salud! Es un recurso que el jugador debe manejar con cuidado.
fr: La santé qui change ajoute de la tension au jeu, surtout si le joueur se bat avec une santé faible ! C'est une ressource que le joueur doit gérer avec soin.
it: La vita che cambia aggiunge tensione al gioco, specialmente se il giocatore sta combattendo con poca vita! Questa è una risorsa che il giocatore dovrebbe maneggiare con cautela.
nl: Gezondheid die verandert voegt spanning toe aan het spel, vooral als de speler vecht met een lage gezondheid! Het is een middel dat de speler zorgvuldig moet beheren.
ru: Здоровье добавляет игре напряжения, особенно если игрок сражается на низком его уровне! Здоровье — это ресурс, которым игрок должен распоряжаться осторожно.
tr: Değişen sağlık, oyuna gerilim katar, özellikle de oyuncu düşük sağlıkla savaşıyorsa! Sağlık, oyuncuların dikkatle yönetmesi gereken bir kaynaktır.
uk: Здоров'я додає грі напруги, особливо якщо гравець бореться на низькому його рівні! Здоров'я – це ресурс, яким гравець має розпоряджатися обережно.

source: The character's health might get low if an enemy attacks them or they fall into a hole.
da: Karakterens liv kan blive lav, hvis en fjende angriber dem, eller de falder ned i et hul.
de: Das Leben des Charakters kann niedrig werden, wenn ein Feind ihn angreift oder er in ein Loch fällt.
es: La salud del personaje puede disminuir si un enemigo lo ataca o si cae en un agujero.
fr: La santé du personnage peut devenir faible si un ennemi l'attaque ou s'il tombe dans un trou.
it: La vita del personaggio potrebbe abbassarsi se un nemico lo attacca o se cade in un buco.
nl: De gezondheid van een personage kan laag worden als een vijand hem aanvalt of als hij in een gat valt.
pt: A vida da personagem pode ficar baixa se um inimigo o atacar ou cair num buraco.
ru: Здоровье персонажа уменьшается, если он падает в пропасть или его атакует противник.
tr: Bir düşman saldırırsa veya bir çukura düşerse, karakterin sağlığı azalabilir.
uk: Здоров'я персонажа зменшується, якщо він падає у прірву або його атакує супротивник.

source: We can create a function to represent damage in these cases.
da: Vi kan oprette en funktion til at repræsentere skade i disse tilfælde.
de: Wir können eine Funktion erstellen, um Schäden in diesen Fällen darzustellen.
es: Podemos crear una función para representar el daño en estos casos.
fr: Nous pouvons créer une fonction pour représenter les dégâts dans ces cas.
it: Possiamo creare una funzione che rappresenta il danno in questi casi.
nl: We kunnen een functie maken om schade in deze gevallen weer te geven.
pt: Podemos criar uma função para representar o dano nesses casos.
ru: Мы можем создать функцию, наносящую повреждения в этих случаях.
tr: Bu durumlar için hasarı temsil edecek bir fonksiyon oluşturabiliriz.
uk: Ми можемо створити функцію, яка завдає пошкоджень у цих випадках.

source: We pass the amount of damage the robot should take as a parameter.
da: Vi sender mængden af skader, robotten bør tage, som en parameter.
de: Wir übergeben die Höhe des Schadens, den der Roboter nehmen soll, als Parameter.
es: Pasamos la cantidad de daño que debe recibir el robot como parámetro.
fr: Nous passons le montant ([i]amount[/i]) des dégâts que le robot doit subir comme paramètre.
nl: We geven de hoeveelheid schade die de robot zou moeten oplopen mee als parameter.
pt: Passamos a quantidade de dano que o robô deve tomar como parâmetro.
ru: Мы передаём количество урона, которое робот должен получить, в виде параметра.
tr: Robotun alması gereken hasar miktarını, alınan değişken (parametre) olarak geçiyoruz.
uk: Ми передаємо рівень ушкоджень, які має отримати робот, як параметр.

source: Line 2 subtracts [code]amount[/code] from [code]health[/code].
da: Linje 2 trækker [code]amount[/code] fra [code]health[/code].
de: Zeile 2 subtrahiert [code]amount[/code](Menge) von [code]health[/code](Leben).
es: La línea 2 le resta la [code]amount[/code] (cantidad) a [code]health[/code].
fr: La ligne 2 soustrait [code]amount[/code] de [code]health[/code].
it: La linea 2 sottrae [code]amount[/code] da [code]health[/code].
nl: Regel 2 trekt [code]amount[/code] af van [code]health[/code].
pt: Na linha 2 subtraímos [code]amount[/code] de [code]health[/code].
ru: Строка 2 вычитает [code]amount[/code] из [code]health[/code].
tr: Satır 2, hasar miktarını, [code]amount[/code], sağlık toplamından, [code]health[/code], çıkarır.
uk: У рядку 2 від [code]health[/code] віднімається [code]amount[/code].

source: Note the [code]-=[/code] syntax which achieves this. It's a shorthand we often use.
da: Bemærk [code]-=[/code] syntaksen, som opnår dette. Det er en forkortelse vi ofte bruger.
de: Beachte die [code]-=[/code]-Syntax, die dies erreicht. Es ist eine Abkürzung, die wir oft verwenden.
es: Fíjate en la sintaxis [code]-=[/code] que logra esto. Es una forma abreviada que utilizamos a menudo.
fr: Remarquez la syntaxe [code]-=[/code] qui permet d'obtenir ce résultat. C'est un raccourci que nous utilisons souvent.
it: Nota che ciò è possibile grazie alla sintassi [code]-=[code]. Questa è una scorciatoia che usiamo spesso.
nl: Merk de vorm [code]-=[/code] op die dit bereikt. Het is een afkorting die we vaak gebruiken.
pt: Observe a sintaxe [code]-=[/code]. É uma abreviação que costumamos usar.
ru: Обратите внимание, что вычитание производится при помощи синтаксиса [code]-=[/code]. Это сокращение, которое мы часто используем.
tr: Bunu sağlayan [code]-=[/code] sözdizimine dikkat edin. Sıklıkla kullandığımız bir kısaltmadır.
uk: Зверніть увагу, що віднімання здійснюється за допомогою синтаксису [code]-=[/code]. Це скорочення, яке ми часто використовуємо.

source: You can also use a longer form. Both of these lines have the same effect. They both subtract the value of [code]amount[/code] from the [code]health[/code] variable:
da: Du kan også bruge en længere form. Begge disse linjer har samme effekt. De trækker begge værdien af [code]amount[/code] fra [code]health[/code] variabelen:
de: Du kannst auch eine ausgeschriebene Variante verwenden. Beide haben den gleichen Effekt. Beide subtrahieren den Wert von [code]amount[/code](Menge) von der Variablen [code]health[/code](Leben):
es: También puedes utilizar una forma más larga. Ambas líneas tienen el mismo efecto. Ambas restan el valor de [code]amount[/code] a la variable [code]health[/code]:
fr: Vous pouvez aussi utiliser une forme plus longue. Ces deux lignes ont le même effet. Elles soustraient toutes les deux la valeur d'[code]amount[/code] à la variable [code]health[/code] :
it: Puoi anche usare una forma più lunga. Entrambe queste righe hanno lo stesso effetto. Entrambe sottraggono il valore di [code]amount[/code] dalla variabile [code]health[/code]:
nl: Je kunt ook een langere vorm gebruiken. Beide regels hebben hetzelfde effect. Ze trekken allebei de waarde van [code]amount[/code] af van de variabele [code]health[/code]:
ru: Также вы можете использовать более длинную форму. Обе строки, приведённые ниже, имеют одинаковый эффект. Они обе вычитают [code]amount[/code] из переменной [code]health[/code]:
tr: Daha uzun bir şeklini de kullanabilirsiniz. Aşağıdaki satırların her ikisi de aynı etkiye sahiptir. Her ikisi de [code]amount[/code] değerini, [code]health[/code] değişkeninden çıkartır:
uk: Також ви можете використовувати довшу форму. Обидва рядки, наведені нижче, мають однаковий ефект. В них обох від змінної [code]health[/code] віднімається [code]amount[/code]:

source: You may notice that the health of the robot can go below [code]0[/code]. We'll see how to manage this in a future lesson using [i]conditions[/i].
da: Du lægger måske mærke til, at robottens liv kan gå under [code]0[/code]. Vi vil se, hvordan man håndterer dette i en fremtidig lektion ved hjælp af [i]betingelser[/i].
de: Möglicherweise stellst Du fest, dass der Zustand des Roboters unter [code]0[/code] liegen kann. Wir werden sehen, wie wir dies in einer zukünftigen Lektion mit [i]Bedingungen[/i] verwalten können.
es: Puede que notes que la salud del robot puede ir por debajo de [code]0[/code]. Veremos cómo manejar esto en una próxima lección utilizando [i]condiciones[/i].
fr: Vous remarquerez peut-être que la santé du robot peut descendre en dessous de [code]0[/code]. Nous verrons comment gérer cela dans une prochaine leçon en utilisant des [i]conditions[/i].
it: Potresti notare che la vita del robot può andare sotto [code]0[/code]. Vedremo come gestire questo in una lezione futura usando le [i]condizioni[/i].
nl: Je zou kunnen merken dat de gezondheid van de robot onder de [code]0[/code] kan komen. We zullen in een volgende les zien hoe we dit kunnen beheersen met behulp van [i]condities[/i].
pt: Pode notar que a vida do robô pode ficar abaixo de [code]0[/code]. Veremos como gerir isso numa lição futura usando [i]condições[/i].
ru: Вы можете заметить, что здоровье робота может упасть ниже [code]0[/code]. В следующих уроках мы разберём, как с этим справляться с помощью [i]условий[/i].
tr: Dikkat ederseniz, robotun sağlığının [code]0[/code]'dan aşağıya düşebileceğini görebilirsiniz. Bunu, [i]koşullar[/i] kullanarak nasıl yöneteceğimizi ileriki bir derste göreceğiz.
uk: Ви можете помітити, що здоров'я робота може впасти нижче [code]0[/code]. У наступних уроках ми розберемо, як із цим впоратися за допомогою [i]умов[/i].

source: The robot's health could increase instead if the player picks up an item that heals them, or if they use a healing item.
cs: Zdraví robota by se místo toho mohlo zvýšit, pokud hráč vezme předmět, který ho léčí, nebo pokud použije léčivý předmět.
da: Robottens liv kan øges i stedet, hvis spilleren samler en genstand op der helbreder dem, eller hvis de bruger en helbredende genstand.
de: Das Leben des Roboters könnte sich stattdessen erhöhen, wenn der Spieler einen Gegenstand aufnimmt, der ihn heilt, oder wenn er einen Heilgegenstand verwendet.
es: En cambio, la salud del robot podría aumentar si el jugador coge un objeto que lo cura o si utiliza un objeto curativo.
fr: La santé du robot pourrait augmenter à la place si le joueur ramasse un objet qui le soigne ou s'il utilise un objet de soin.
it: La vita del robot potrebbe aumentare de invece il giocatore prendesse o usasse un oggetto che lo guarisce.
nl: De gezondheid van de robot zou ook kunnen toenemen wanneer de speler een voorwerp pakt dat hem geneest, of wanneer hij een genezend voorwerp gebruikt.
pt: A vida do robô pode aumentar se o jogador levar um item que o cure imediatamente ou se usar um item de cura.
ru: Здоровье робота может увеличиться, если игрок подберёт или использует исцеляющий предмет.
ta: வீரர் அவர்களை குணப்படுத்தும் ஒரு பொருளை எடுத்தால் அல்லது அவர்கள் குணப்படுத்தும் பொருளைப் பயன்படுத்தினால் அதற்கு பதிலாக ரோபோவின் உடல்நிலை அதிகரிக்கும்.
tr: Bunun tersine, oyuncu, onları iyileştiren bir eşya toplayınca, veya iyileştirici bir eşya kullanırsa, robotun sağlığı artabilir.
uk: Здоров'я робота може зрости, якщо гравець підбере або використає цілющий предмет.
zh_hant: 如果玩家撿起一個治療物品，或者使用治療道具，機器人的生命值可能會增加。

source: Here again, the health can go beyond [code]100[/code].
da: Her kan livet igen gå over [code]100[/code].
de: Auch hier kann das Leben über [code]100[/code] hinausgehen.
es: También en este caso, la salud puede ir más allá de [code]100[/code].
fr: Là encore, la santé peut aller au-delà de [code]100[/code].
it: Qui di nuovo, la vita può andare oltre a [code]100[/code].
nl: Ook hier kan de gezondheid voorbij [code]100[/code] oplopen.
pt: Aqui também, a vida pode ir além de [code]100[/code].
ru: Также, здоровье может превысить [code]100[/code].
tr: Benzer şekilde, sağlık [code]100[/code] değerinin ötesine geçebilir.
uk: Також, здоров'я може перевищити [code]100[/code].

source: Also, once more, the short line [code]health += amount[/code] is equivalent to the longer form [code]health = health + amount[/code].
da: Endnu engang er den korte linje [code]health += amount[/code] lig med den længere form [code]health = health + amount[/code].
de: Außerdem entspricht die kurze Zeile [code]health += amount[/code] der längeren Form [code]health = health + amount[/code].
es: Además, una vez más, la línea corta [code]health += amount[/code] es equivalente a la forma más larga [code]health = health + amount[/code].
fr: Également, à nouveau, la ligne courte [code]health += amount[/code] est équivalente à la forme plus longue [code]health = health + amount[/code].
it: Inoltre, ancora una volta, la linea corta [code]health += amount[/code] è l'equivalente della sua forma più lunga [code]health = health + amount[/code].
nl: Nogmaals, de korte regel [code]health += amount[/code] is betekent hetzelfde als de langere vorm [code]health = health + amount[/code].
pt: Além disso, mais uma vez, a forma abreviada [code]health += amount[/code] é equivalente à forma mais longa [code]health = health + amount[/code].
ru: Здесь, как и в предыдущем примере, мы используем сокращение [code]health += amount[/code] эквивалентное длинной форме [code]health = health + amount[/code].
tr: Ayrıca, bir kez daha, [code]health += amount[/code] kısa satırı, [code]health = health + amount[/code] uzun yazım şekline eşdeğerdir.
uk: Тут, як і в попередньому прикладі, ми використовуємо скорочення [code]health += amount[/code] еквівалентне довгій формі [code]health = health + amount[/code].

source: Which of these would increase the health of the robot?
cs: Která z těchto možností by zvýšila zdraví robota?
da: Hvilken af disse ville øge robottens helbred?
de: Welche Antwort würden das Leben des Roboters erhöhen?
es: ¿Cuál(es) de estas opciones aumentaría(n) la salud del robot?
fr: Laquelle (ou lesquelles) de ces propositions augmenterait la santé du robot ?
it: Quale di queste aumenterebbe la vita del robot?
nl: Welke van deze zou de gezondheid van de robot verbeteren?
pt: Qual dessas opções aumentaria a vida do robô?
ru: Какое из этих выражений увеличит здоровье робота?
ta: இவற்றில் எது ரோபோவின் ஆரோக்கியத்தை அதிகரிக்கும்?
tr: Bunlardan hangisi, robotun sağlığını yükseltir?
uk: Який із цих виразів збільшить здоров'я робота?
zh_hant: 哪一個選項會增加機器人的生命值？

source: Both of these lines increase the [code]health[/code] of the robot by [code]amount[/code]. [code] health += amount health = health + amount [/code]
cs: Oba tyto řádky zvýší [code] health[/code] robota o [code] amount[/code]. [code] health += amount health = health + amount [/code]
da: Begge disse linjer øger robottens [code]health[/code] med [code]amount[/code]. [code] health += amount health = health + amount [/code]
de: Beide Zeilen erhöhen das Leben([code]health[/code]) um die Menge([code]amount[/code]). [code] health += amount health = health + amount [/code]
es: Estas dos líneas aumentan la [code]health[/code] del robot en [code]amount[/code]. [code] health += amount health = health + amount [/code]
fr: Ces deux lignes augmentent la [code]health[/code] du robot de [code]amount[/code]. [code] health += amount health = health + amount [/code]
it: Entrambe queste linee incrementa la [code]vita[/code] del robot di [code]amount[/code]. [code] health += amount health = health + amount [/code]
nl: Deze beide regels verhogen de [code]health[/code] van de robot met [code]amount[/code]. [code] health += amount health = health + amount [/code]
pt: Ambas as linhas aumentam a variável [code]health[/code] (vida) do robô por [code]amount[/code] (uma certa quantidade). [code] health+= amount health= health+ amount [/code]
ru: Оба выражения увеличат [code]health[/code] робота на [code]amount[/code]. [code] health += amount health = health + amount [/code]
ta: இந்த இரண்டு வரிகளும் ரோபோவின் [குறியீடு] ஆரோக்கியத்தை [குறியீடு] தொகை [/குறியீடு] மூலம் அதிகரிக்கின்றன. [குறியீடு] உடல்நலம் += தொகை உடல்நலம் = உடல்நலம் + தொகை [/குறியீடு]
tr: Bu satırların her ikisi de, robotun sağlığını, [code]health[/code], verilen miktarda, [code]amount[/code] artırır. [code] health += amount health = health + amount [/code]
uk: Обидва вирази збільшать [code]health[/code] робота на [code]amount[/code]. [code] health += amount health = health + amount [/code]
zh_hant: 這兩行程式碼都會將機器人的 [code]health[/code] 增加 [code]amount[/code]： [code] health += amount health = health + amount [/code]

source: In the following practices, you'll code the [code]take_damage()[/code] and [code]heal()[/code] functions so the robot's health can decrease and increase.
cs: V následujících postupech nakódujete funkce [code]take_damage()[/code] a [code]heal()[/code] ke snížení a zvýšení zdraví robota.
da: I de følgende øvelser skal du kode funktionerne [code]take_damage()[/code] og [code]heal()[/code], så robottens helbred kan falde og stige.
de: In den folgenden Übungen schreibest Du die Funktionen [code]take_damage()[/code] und [code]heal()[/code], damit die Gesundheit des Roboters abnehmen und sich erhöhen kann.
es: En las siguientes prácticas, codificarás las funciones [code]take_damage()[/code] y [code]heal()[/code] para que la salud del robot pueda disminuir y aumentar.
fr: Dans les exercices suivantes, vous allez coder les fonctions [code]take_damage()[/code] et [code]heal()[/code] pour que la santé du robot puisse diminuer et augmenter respectivement.
it: Nelle seguenti pratiche, scriverai le funzioni [code]take_damage()[/code] e [code]heal()[/code] cosicché la vita del robot possa diminuire e aumentare.
nl: In de volgende oefeningen schrijf je de functies [code]take_damage()[/code] en [code]heal()[/code] zodat de gezondheid van de robot kan afnemen en toenemen.
pt: Nas práticas a seguir, vai programar as funções [code]take_damage()[/code] e [code]heal()[/code] para que a vida do robô possa diminuir e aumentar.
ru: В следующих упражнениях вы создадите функции [code]take_damage()[/code] и [code]heal()[/code], позволяющие уменьшать и увеличивать здоровье робота.
ta: பின்வரும் நடைமுறைகளில், நீங்கள் [குறியீடு] டேக்_டேமேச் () [/குறியீடு] மற்றும் [குறியீடு] குணப்படுத்தும் () [/குறியீடு] செயல்பாடுகளை குறியிடுவீர்கள், எனவே ரோபோவின் உடல்நலம் குறைத்து அதிகரிக்கும்.
tr: Sıradaki uygulamada, [code]take_damage()[/code] (hasar al) ve [code]heal()[/code] (iyileş) fonksiyonlarını kodlayacaksınız, ve bu sayede robotun sağlığı azalabilir ve artabilir.
uk: У наступних вправах ви створите функції [code]take_damage()[/code] і [code]heal()[/code], що дозволяють зменшувати та збільшувати здоров'я робота.
zh_hant: 在接下來的練習中，你將編寫 [code]take_damage()[/code] 和 [code]heal()[/code] 函式，讓機器人的生命值能夠減少和增加。

source: Damaging the Robot
cs: Poškozování robota
da: Beskadigelse af Robotten
de: Dem Roboter schaden zufügen
es: Dañar el robot
fr: Endommager le robot
it: Danneggiando il Robot
nl: De robot beschadigen
pt: Fazendo o robô levar dano
ru: Нанесение урона роботу
ta: ரோபோவை சேதப்படுத்துகிறது
tr: Robota Hasar Vermek
uk: Пошкодження робота
zh_hant: 讓機器人受傷

source: In our game, the main character has a certain amount of [code]health[/code]. When it gets hit, the health should go down by a varying [code]amount[/code] of damage.
da: I vores spil har hovedpersonen en vis mængde [code]health[/code]. Når den bliver ramt, skal helbredet falde med en varierende [code]amount[/code] skade.
de: In unserem Spiel hat der Hauptcharakter eine gewisse Menge an Leben([code]health[/code]). Wenn es getroffen wird, sollte das Leben um eine variierende Menge([code]amount[/code]) des Schadens sinken.
es: En nuestro juego, el personaje principal tiene una determinada cantidad de [code]health[/code]. Cuando es golpeado, la salud debe bajar en una [code]amount[/code] de daño variable.
fr: Dans notre jeu, le personnage principal a une certaine quantité de [code]health[/code]. Lorsqu'il est touché, sa santé devrait diminuer d'un [code]amount[/code] de dégâts variable.
it: Nel nostro gioco, il protagonista ha una quantità specifica di [code]health[/code]. Quando viene colpito, la vita dovrebbe scendere di una [code]quantità[/code] variabile di danno.
nl: In ons spel heeft het hoofdpersonage een bepaalde hoeveelheid [code]health[/code]. Als het geraakt wordt, moet de gezondheid afnemen met een variërende [code]amount[/code] schade.
pt: No nosso jogo, a personagem principal tem uma certa quantidade de [code]health[/code]. Quando é atingido, a vida dele deve diminuir [code]amount[/code] (uma certa quantidade) de dano.
ru: В нашей игре у главного героя есть определённое количество здоровья ([code]health[/code]). Когда персонаж получает удар, его здоровье должно уменьшиться на определённое количество ([code]amount[/code]) очков.
tr: Oyunumuzda, ana karakterin belirli bir miktarda sağlığı var, [code]health[/code]. Hasar alırsa sağlığı, hasara bağlı değişen bir miktarda, [code]amount[/code], azalmalıdır.
uk: У нашій грі головний герой має певну кількість здоров'я ([code]health[/code]). Коли персонаж зазнає удару, його здоров'я має зменшитися на певну кількість ([code]amount[/code]) очок.
